{
    "title": "What should happen if a sitting President refuses to comply with a federal court order?",
    "author": "SomeFatNerdInSeattle",
    "subreddit": "AskTrumpSupporters",
    "rank": 123,
    "score": 61,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 124,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1imlyjn/what_should_happen_if_a_sitting_president_refuses/",
    "id": "1imlyjn",
    "selftext": "https://thehill.com/regulation/court-battles/5136255-trump-federal-funding-freeze-comply/",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "fullstep",
            "body": "Since it wasn't the Supreme Court, the dems can bring a lawsuit against him where, regardless of the outcome, it will be appealed to the Supreme Court who will then issue a final decision on the matter. If the President refuses to comply with the Supreme Court decision then it can be argued that he is breaking the law and he can be impeached. If impeachment fails, then it basically means he has consent of congress (i.e. the people) to break the law, in which case nothing happens. Though, I would expect congress to simply change the law before it came to that.",
            "score": -4,
            "replies": [
                {
                    "author": "modestburrito",
                    "body": "So any ruling from a court lower than the SCOTUS that is directed toward the executive branch can be ignored?",
                    "score": 25,
                    "replies": [
                        {
                            "author": "fullstep",
                            "body": "Not without incurring the risk of impeachment.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": "We are aware impeachment CAN happen.  I'm wondering if you think it SHOULD happen if a president blatantly ignores a legal federal court order?",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "Enlightened_Patriot",
                                            "body": "Not unless the Supreme Court says that that court’ order was legit.\n\nThere’s too many hack leftist judges in the country now. It’s not hard to imagine a situation where ignoring them is justified. The ultra-liberal 9th circuit is known as the “9th circus” because it’s overturned routinely and the judges make little effort to actually abide by the constitution. They’re low level judges going on anti-constitutional power trips, so regardless of whether their orders are temporarily “legal,” there is incentive to ignore what amounts to an obstruction tactic. \n\nThis is not Hitleresque btw. This is how the separation of powers is meant to function. If an executive ignores the judicial branch, it’s Congress’s job to impeach him if that action was unjustified. \n\nIgnoring the Supreme Court is another matter entirely. Although quite frankly, unless justices like Thomas and Alito voted against Trump, I wouldn’t care what they said anyway and would not vote to impeach Trump if I were in Congress. The liberal justices are all hacks. Roberts is a borderline hack. Barrett, Gorsuch, and Kavanaugh are all weak Mconnell-picks and I trust Trump/Alito/Thomas over whatever those guys say. Not to mention I have the knowledge to know whether or not any Trump action is justified or not without consulting Clarence Thomas.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "JackOLanternReindeer",
                                                    "body": "To clarify, does this mean the supreme court will have to hear every single ruling that the executive branch is ruled against in then if the judiciary can be ignored until the supreme court says no? \n\nWhat if a republican appointed or Trump appointed judge rules against the executive branch?",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Enlightened_Patriot",
                                                            "body": "Not every single one, just blatant obstruction attempts like this.\n\nIf it were a Republican judge then I suspect obstruction isn’t the motivation.\n\nIf Trump were to just start ignoring all judges as a matter of routine with zero justification I wouldn’t support him.\n\nBut that’s not what this is. And frankly the democrats should be ashamed for gaslighting us and pretending it is. They’re simply trying to limit the power of the executive branch and Congress with obstruction from some judicial hacks. Americans overwhelmingly rejected them at the ballot box and they’re bitterly resorting to underhanded obstruction tactics which would have been unthinkable not long ago. \n\nWe The People elected those executives and congressmen. The Democrats are therefore attacking our democracy — while having the nerve to pretend they’re protecting it.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "JackOLanternReindeer",
                                                                    "body": "Who gets to determine whats blatant obstruction vs not? And why should that be the people who don’t like the ruling? \n\nI never saw a single TS complain when judges obstructed Biden on his executive orders? Why is this different to you?",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enlightened_Patriot",
                                                                            "body": "I do. I am an expert. \n\nThe “people who don’t like the ruling” won elections and those elections have consequences.\n\nIf this behavior is so bad as democrats are implying they should have no trouble impeaching Trump and winning the next elections. \n\nAs I said, if a Republican rules against Trump then it’s more likely that the motivation is not obstruction. That hasn’t happened though.",
                                                                            "score": -5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "lunar_adjacent",
                                                                                    "body": "I haven’t looked at the other judges, but the 3rd judge to rule against the executive order is a republican judge. Does this change your views on this matter at all?\n\nEdit: Coughenor who was the first judge to rule against the executive order to abolish birthright citizenship is republican.\n\nNichols who ruled against shutting down USAID was appointed by Trump himself.",
                                                                                    "score": 9,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "It means something, but it’s not determinative.\n\nAs MAGA Republicans, we’ve seen all too often that some “Republicans” are RINOs. \n\nHowever if I were to look into these cases to see if the judge was being legit or not, I would definitely start with the republican who ruled against Trump. So it matters to that extent.\n\nI strongly believe birthright citizenship is a sham, a shameful one at that, which took an amendment meant to give citizenship to the children of slaves and applied it to children of people who illegally entered our country, who some call “invaders.” (Might be too harsh of language, but in a way they are invading our nation — democrats certainly wouldn’t like it if 5 million MAGA-type Russians moved here illegally and had dozens of children. It’s not a sustainable system).",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "lunar_adjacent",
                                                                                                    "body": "It’s clear that these are going to the Supreme Court. If the Supreme Court rules that the executive order to halt federal funding was unconstitutional, would you then support an impeachment?",
                                                                                                    "score": 4,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "If Clarence Thomas and Alito ruled against Trump, and Trump ignored them, I would likely support impeachment.\n\nIf Thomas and Alito ruled against Trump, and Trump abides by their ruling, I would certainly not support impeachment. \n\nIf Trump ignored a majority of the Supreme Court that had neither Thomas or Alito signing on with the majority, I would probably not vote to impeach, but would not find it surprising if he were in fact impeached for this. \n\nI would also like to say that I think the odds of Trump ignoring a ruling supported by Thomas and Alito is virtually 0. So is him\nIgnoring any majority of the Supreme Court. So this is entirely hypothetical. Trump isn’t a lawless executive, he’s trying to fight for what he believes is the correct interpretation of the law — without letting democrats obstruct him again like they did in his first term.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "lunar_adjacent",
                                                                                                                    "body": "What is your criteria is for supporting one conservative judge over another conservative judge?",
                                                                                                                    "score": 6,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                            "body": "Case by case analysis, whether they genuinely try to uphold the constitution or not.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "lunar_adjacent",
                                                                                                                                    "body": "Can I ask what examples you have of Neil Gorsuch, Brett Kavanaugh, John Robert’s, and Amy Coney Barrett not upholding the constitution?",
                                                                                                                                    "score": 5,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                            "body": "Gorsuch saying the civil rights act applied to transsexuals is one solid example.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "lunar_adjacent",
                                                                                                                                                    "body": "Is there a reason you believe that any citizens born to legal citizens here in the United States, should not be covered under the civil rights act?",
                                                                                                                                                    "score": 3,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                            "body": "Civil rights act specifies specific categories of “protected groups” (race, religion, sex) it doesn’t just apply to all citizens in all situations.\n\nGorsuch took language regarding sexual discrimination and pretended it applied to transsexuals. This was clearly not the intent of the authors of the civil rights act.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "lunar_adjacent",
                                                                                                                                                                    "body": "In your opinion does the language regarding sexual discrimination only apply to those who are the same sex at birth, or would include people who have physically changed their gender?\n\nIn other words, women, as you have mentioned, is a protected class under the civil rights act. So wouldn’t a person who was born a man, but physically changed their gender and is now a woman, be protected? \n\nAlternatively, if you do not agree with that, then would a person who was born a woman, but physically changed their gender and is now a man, still fall under the civil rights act as they were born a woman?\n\nBonus: There are some people who are born with the physical parts of male and female. How do we classify them?",
                                                                                                                                                                    "score": 5,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                            "body": "A man cannot change his gender to a woman. He’s just a man pretending to be a woman, the same way that if I started identifying as a 15 year old, I wouldn’t actually be a 15 year old, I’d be an adult pretending to be a 15 year old.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "lunar_adjacent",
                                                                                                                                                                                    "body": "Alright as I mentioned, if you do not agree with that, would a woman who transitioned to a man still be a protected class because they were initially born a woman!\n\nAnd how do we categorize intersex people, aka people born with both male and female parts?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                                            "body": "A woman pretending to be a man would still get protections as a woman.\n\nYou could not discriminate against the woman on the basis of sex.\n\nGorsuch went much farther and said that you cannot discriminate based on their status as a trans person, which is a ridiculous interpretation of the civil rights act.",
                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "JackOLanternReindeer",
                                                                                    "body": "And what makes you an expert?\n\nRepublican and Trump appointed judges have ruled against him plenty like when trump claimed the election was rigged, and stopped some of the other EO that trump has signed so far and Elon has railed agains them too- are you confident president trump/president musk wont call to impeach those judges too?",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "The election stuff is tricky because the judges were right in the narrow scope of what they were ruling on. Trump didn’t have the evidence required to overturn state elections in court — but that’s because getting such evidence is like finding a needle in a haystack, 100k times. \n\nBut Trump was also right that there was unprecedented abuse in the process that should have mandated a better audit. What should have happened is state congresses should have audited the election, noted the various abuses (lack of chain of custody for mail in ballots, lack of real signature verifications, etc) and held new elections with better security measures.\n\nOr course I don’t think any of this was likely to happen but that’s my opinion on what should have been done. I don’t think you can have a legitimate election by mail with no chain of custody and no real way to prove voters are who they say they are.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "If Trump ignores judges he can always be impeached. That’s the proper remedy for any abuse of power he might be doing.\n\nA Republican judge is less likely to obstruct Trump illegitimately, but I cannot say that I will endorse any Republican judge just because Trump appointed them. There’s many reasons they may “sell out” or not have been vetted sufficiently. I don’t think very highly of judges in general, they’re pretentious and few of them actually care about our nation and constitution.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "tuckman496",
                                                                                                    "body": "What makes you an expert?",
                                                                                                    "score": 5,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Bodydysmorphiaisreal",
                                                                                    "body": "So, you're saying it would be totally cool if a democratic president and Congress outright outlawed firearms while ignoring the supreme court because people elected them? Would you not view that as completely shredding the constitution and our country? I mean, I would and would be very upset just like I would be if trump does it (although I'm pretty confident Democrats wouldn't do this).",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "Yes because they would be impeached or the country would go to war over such an abuse. \n\nWhat Trump is doing is in no way analogous to this though. He will not be impeached because all he’s doing is arguing his reasonable side of a controversy.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "SomeFatNerdInSeattle",
                                                                                                    "body": ">Yes because they would be impeached\n\nWhy would they be impeached if congress passed it?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "This highlights the importance of the second amendment. If the nation ever got so corrupt that the President and Congress (1) passed a blatantly unconstitutional and extremely tyrannical law, and (2) ignored the Supreme Court — then the People would be armed and able to resist the tyrannical lawless gun confiscation.\n\nIn places like England there is no such threat. You can’t resist tyranny with butter knives, so tyrants can get away with almost anything there.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "coronathrowaway12345",
                                                                                                                    "body": "What is that line for you? What would cause *you* to do that?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SomeFatNerdInSeattle",
                                                    "body": ">Ignoring the Supreme Court is another matter entirely. Although quite frankly, unless justices like Thomas and Alito voted against Trump, I wouldn’t care what they said anyway and would not vote to impeach Trump if I were in Congress. The liberal justices are all hacks. Roberts is a borderline hack. Barrett, Gorsuch, and Kavanaugh are all weak Mconnell-picks and I trust Trump/Alito/Thomas over whatever those guys say. Not to mention I have the knowledge to know whether or not any Trump action is justified or not without consulting Clarence Thomas.\n\nSo you support ignoring the Supreme Court so long as a justice you like ruled the way you wanted?",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "Enlightened_Patriot",
                                                            "body": "Yes. That’s how the constitution was designed to work. Judicial review does not mean judicial supremacy.\n\nAnd you can impeach Trump if you don’t like it, but unfortunately for you We The People rejected Democrats last election and you won’t have the votes to do so. Better luck next election. If what Trump is doing is so evil I’m sure you’ll win in a landslide!\n\nRemember, nobody is above the law. Democrats are attacking our democracy by trying to limit the power of the executive branch and Congress which The People elected.\n\nPS the Supreme Court is going to side with Trump on this issue anyway.",
                                                            "score": -17,
                                                            "replies": [
                                                                {
                                                                    "author": "SomeFatNerdInSeattle",
                                                                    "body": ">Yes. That’s how the constitution was designed to work. Judicial review does not mean judicial supremacy.\n\nSo Biden and Obama and every state should be allowed to ignore any Supreme Court ruling they didn't like?",
                                                                    "score": 16,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enlightened_Patriot",
                                                                            "body": "Sure. That’s how it works. They have the power to ignore courts and the remedy is impeachment / future elections.\n\nThe problem is that republicans don’t use the courts just to obstruct “stuff we don’t like.” We use it to stop unconstitutional laws / executive actions.\n\nSo, if Obama or Biden ignored a Republican court, the likely result would be a successful impeachment and/or a devastating defeat in the next elections.\n\nHowever, if Trump ignores a Democrat “judge” (hack with no care of what is constitutional or not), the likely result will be voters and congressmen recognizing this isn’t a big deal, refusing to vote for impeachment, and refusing to cote Republicans out of office.\n\nNice username btw. Made me chuckle.",
                                                                            "score": -13,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "tuckman496",
                                                                                    "body": "What’s the point of courts if the president doesn’t have to listen to them? Why should Trump listen to congress if they impeach him? Anyone who disagrees with Trump is just a never-trumper TDS-afflicted hack anyway, right?",
                                                                                    "score": 14,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "1. If a court is ignored that lays the foundation for impeachment\n\n2. If a court is ignored that gives justification for armed rebellion against tyranny. For example of Congress and Biden passed a law confiscating all guns, the court would rule against it, and Biden would not simply be able to pretend he was doing something lawful. He would face armed rebellion which was essentially endorsed by the court.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "tuckman496",
                                                                                                    "body": "> If a court is ignored that gives justification for armed rebellion against tyranny\n\nBut only if it was a republican court, correct? Democratic judges are hacks that can be justifiably ignored?",
                                                                                                    "score": 13,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "Don’t know what this means.\n\nIf Trump were to ban all guns then impeachment or armed rebellion would be justified and probably endorsed by Democrat and Republican judges\n\nIf the Supreme Court ruled against Trump and he ignored it, on something like birthright citizenship, he’d likely be impeached. I can’t imagine him actually ignoring the Supreme Court though so this hypothetical is farfetched.",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "tuckman496",
                                                                                                                    "body": "> Don’t know what this means \n\nI’m going off of your previous statements:\n\n> republicans don’t use the courts just to obstruct “stuff we don’t like.” We use it to stop unconstitutional laws / executive actions.\n\nSo ignoring  Republican judge means continuing to do something unconstitutional\n\n> However, if Trump ignores a Democrat “judge” (hack with no care of what is constitutional or not), the likely result will be voters and congressmen recognizing this isn’t a big deal, refusing to vote for impeachment, and refusing to cote Republicans out of office.\n\nSo there is no need to listen to Democrat judges,  cause you’ve decided already that they have nefarious intent. No need to impeach because Democrat judges are hacks. As long as no republicans care about Trump’s actions — regardless of their legality — he has no check on his power, and the courts are absolutely powerless. Unless it’s about banning guns, the president has full authority to refuse to do anything a judge says. Is this an accurate statement of your views?",
                                                                                                                    "score": 11,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                            "body": "No",
                                                                                                                            "score": -2,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Popeholden",
                                                                                                    "body": "So in your view, considering our hyper-partisan environment, if a President is elected with a majority of Congress (or the other party holds less than a super-majority in the Senate), then there *are no Judicial or Legislative checks on his power*? \n\nIn your view the President is *normally* a dictator, and there are exceptions to his dictatorship in *exceedingly* rare circumstances (circumstances that have not occurred yet in our Republic, that is being impeached by your own party and removed by your own party)?",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "The check on his power is impeachment and judicial review. This is not my view, this is literally just how the constitution works and always has worked. \n\nA dictator? the American people elect congress, who can impeach the president. Dictators aren’t controlled by the will of the people.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Popeholden",
                                                                                                                    "body": "All due respect that doesn't really answer my question; Article II outlines very specific powers and duties of the President and Article I outlines the powers and duties of the Legislature...if the President starts exercising Article I powers, or ignoring court orders, whether or not the Legislature impeaches and removes him, has the Constitution not failed in any way? If the Legislature fails to impeach a President who has expanded their power in such a way, haven't they *both* failed their duties under the Constitution? \n\nAsking another way, what you're proposing is that the President can expand their Constitutional power *if the legislature allows it*...without going through the prescribed Constitutional amendment process they've changed the Constitution. You don't see that as a failure of the Legislature, the Executive, the Constitution, or all of them?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                            "body": "Trump is not exercising article 1 powers. Not sure what you’re referring to.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Popeholden",
                                                                                                                                    "body": "I'm just exploring your thoughts on separation of power generally, but do you think an argument could be made that shuttering federal agencies that are  Congressionally created and have appropriated funds could be a violation of separation of powers? \n\nWhat about freezing *all* federal grants loans and other spending, which 22 states argued exceeded his Presidential authority? he was ordered by a judge to halt the freeze pending further court proceedings and was found to have ignored the court. In this case do you think an argument could be made that he's exceeded his authority?\n\nand due respect i would love an answer to my previous question so I'm going to restate it: \n>Asking another way, what you're proposing is that the President can expand their Constitutional power if the legislature allows it...without going through the prescribed Constitutional amendment process they've changed the Constitution. You don't see that as a failure of the Legislature, the Executive, the Constitution, or all of them?",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                            "body": "No I don’t care if 22 blue states and a hack judge disingenuously said he’s exceeding his executive power. \n\nIf the Supreme Court says it’s a violation of separation of powers that may actually mean something. As of now, the district courts’ injunctions are less than meaningless.\n\nExecutive has the power to do a lot with congressionally appropriated spending. It’s a complicated issue.\n\nAfter Trump’s first term was entirely obstructed by hack judges, lawfare, and weasel lawyers there’s no reason for him to give so much credit to lowly district court judges, especially ones with clear conflicts of interest and ties to the Democrat machine. As a general rule, if Adam Schiff says something is illegal, it’s not.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Popeholden",
                                                                                                                                                    "body": "So in your view the Supreme Court is the Judicial branch and all 1500 of the other working Federal Judges are hacks? Like why is the Supreme Court important to you but the rulings of the other judges are not important?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                            "body": "No that’s not what I said at all. There’s many circuit court judges that are good. Many democrats tend to be hacks though, and these injunctions against Trump are blatantly political obstruction attempts.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Popeholden",
                                                                                                                                                                    "body": "So if a President views a judge as a hack, or overly political, he does not have to abide by their rulings, and they are effectively not a part of the Judicial branch. If the Legislature disagrees with the President ignoring the Judiciary, they can impeach him...but if they don't have the votes in either the Senate, or the House, the President basically gets to do whatever he wants. Is this a decent summary of your views here?\n\nLet's say Joe Biden disagrees with a court ruling, and ignores it. He's blatantly doing something illegal, so the House impeaches him. The Senate fails to convict. Here's my question...where does that leave the Constitution? In this scenario, what weight does it hold?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                            "body": "Presidents have never had to abide by judges rulings they just do so because if they don’t it’s likely they will be impeached or lose elections.",
                                                                                                                                                                            "score": 0,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Popeholden",
                                                                                                                                                                                    "body": "In the same way that I'm perfectly allowed to murder people, it's just that if I do I might have to go to prison or face the wrath of vengeful family and friends?\n\nI'm not being facetious, really. I don't murder people not just because it's illegal but because I don't want to hurt people. I think most Presidents abide by the rulings of the Judiciary because they believe in our system of government. All due respect, It doesn't sound like you do. Do you think Donald Trump does? \n\n  \nWhat do you think happens to Trump, and our country, if he blatantly ignores the courts and is not impeached? Is that a good outcome for the country? For the Constitution?",
                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                                            "body": "Actually you don’t believe in our system of government because nowhere in the constitution does it say “the executive branch must abide by the rulings of the judicial branch.”\n\nWhat will happen? Nothing. People will move on and presume the judge was full of shit — because he is. \n\nDemocrats constantly talk about “attacks on our democracy” but nobody sees it except them. They can’t even get one moderate or Republican to humor their delusions and vote to impeach Trump. They keep getting further and further out of touch and this is why they lost 2024 in a landslide.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                    "body": ">Democrats constantly talk about “attacks on our democracy” but nobody sees it except them. They can’t even get one moderate or Republican to humor their delusions and vote to impeach Trump\n\n17 Republicans voted to impeach Trump in 2021. \n\nWho told you 49.8% of the vote was a \"landslide\"?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                                                            "body": "Popular vote is meaningless. Kamala got blown the fuck out in every swing state and lost the electoral college in a major landslide.\n\nDemocrats pretending otherwise are just coping and trying to pretend Trump doesn’t have a mandate when all objective observers know he does.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                    "body": "Your claim was that dems keep getting further and further out of touch and this is why they lost 2024 in a landslide.\n\nIsn't how many actual people voted for you a more accurate indicator of a shift than the electoral college?",
                                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                                                                            "body": "No not at all. Nobody is trying to convince the Highly delusional people in CA, NY, etc\n\nIf Trump wanted to he would have won the popular vote by 10 points. That’s not the goal. He never really bothered campaigning in blue states for obvious reasons. Nobody cares about the popular vote, it’s entirely a Democrat cope.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                    "body": "How is the electoral college a indicator of the will of the people?",
                                                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                                                                                            "body": "America is a democracy. Democracy is government by the people. \n\nAmerican elections are decided by the electoral college. \n\nTrump is not trying to win the popular vote. It’s entirely irrelevant. Imagine that the popular vote is what’s important is like thinking you won a game of chess, because although you got checkmated, you had more pieces left on the board.\n\nDemocrats are coping hard. It’s like watching a basketball team that got blown out by 50 points consoling themselves because they made more free throws than their opponent.",
                                                                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                                    "body": "Lets say there was a group of 100 people and everyone voted on what pet to have. 49% voted dog , 48% voted cat, 3% voted hamster. You understand that's not a landslide right?",
                                                                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                                                                                                            "body": "I understand this analogy is completely irrelevant because it’s not even close to the system used to decide the US President.\n\nAgain, we use the electoral college. Nobody is *even trying to win* the popular vote. It’s entirely a cope for democrats.\n\nA better analogy would be 538 people voted on cats or dogs. Dogs won 312-226. That’s a landslide blowout. \n\nAn even better analogy would be to make an analogy using the swing states, as those are the only ones candidates really care about. Trump won 100% of the swing states, by a lot.\n\nKamala got humiliated. She was not even close to winning ONE swing state. She got spanked like a boxer who couldn’t even win ONE round. She did as bad as anyone could have possibly imagined. Most democrats are admitting this. Some Democrats simply cannot cope with how unpopular their radical views are and they’re pretending they won some moral victory because they got 55% of the vote in NY. lol",
                                                                                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                                                    "body": "I'm not talking about your ridiculous system. In this hypothetical group even if you decide to give everyone called dave 2 votes 49% of votes cast is still not a landslide. Any ration person can see that. Do you think party politics is breaking people's brains?",
                                                                                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                                                                                                                                            "body": "Winning 100% of swing states and 312 electoral votes is a landslide.\n\nKamala got blown out, in the actual real world. But I’ll concede that she did great in your hypothetical imaginary contest involving dogs/cats. Just not sure what that has to do with anything. I do find it funny after all the talk about how weak Trump is and how strong girl bosses like Hillary and Kamala are — they’re both left coping with imaginary contests about “if 100 people voted for a unicorn or an alligator then Hilary would have won 52 alligators!”\n\nIt’s like a chess player losing in 4 moves, throwing over the board and saying “yeah but I beat you at an imaginary unicorn-counting contest which I just made up!!” I just can’t understand the cope, but democrats are down so bad I don’t think I want to understand what’s going through their bitter minds. \n\nI think democrats brains would be broken regardless of party politics. They think men can be women, that countries don’t need borders, that we should defund police and pay people not to work. This is why they lost every swing state, bigly!",
                                                                                                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                                                                    "body": "As much as you want to push the \"cope\" idea, I'm English and the party I voted for got a huge majorty in Parliament but got less than 50% of the vote. That means they didn't get a landslide or a mandate from the people. It's just maths / logic. \n\nIs there anything about Trump that you are critical of?",
                                                                                                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Errlen",
                                                                    "body": "But you’re going to let us have free and fair elections next time? No calls to Georgia to find votes for you? No unconstitutional third term? Or are there circumstances you’re okay with those things?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enlightened_Patriot",
                                                                            "body": "The “finding votes” thing was a total hoax. Trump simply asked Georgia to find fraudulent votes. There’s nothing illegal or improper about that.\n\nTrump has never seriously considered a third term. All he’s done is trolled and joked about it to trigger democrats into melodramatic responses which he can then use against them. \n\nWith all due respect, and I really mean that, you appear to be stuck in a Redditor echo chamber. You believe in ridiculous hoaxes. But that can happen because the modern age is filled with information warfare and highly intelligent people can be brainwashed just as easily as anyone else.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Errlen",
                                                                                    "body": "I was on the ground in Wisconsin doing voter protection work in 2020 and I worked the recount in Madison. Trump supporters' evidence of fraud - and there are multiple affidavits that the on the ground Trump volunteers submitted as part of the litigation this effect, they are signed and notarized and part of the public record - was that too many people voted for Biden and they personally did not know anyone who voted for Biden and so they did not see how that was possible. Ergo, the votes must be fraudulent. Not sure who is in an echo chamber.\n\nBut in interests of civilized debate, let's talk voter protection in 2028. What are the measures that you believe to be necessary to prevent fraudulent voting in 2028?\n\nI think Trump is interesting bc the old stalwart ways Republicans used to use to suppress Democratic votes aren't as helpful, because he appeals to people with expired driver's licenses and unstable housing situations and he appeals across racial and age boundaries more than any Republican in recent memory. e.g., my green card holding Mexican house cleaner wants to get citizenship so he can vote for him lol.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "Being casually involved in one recount by itself isn’t much of a qualification to opine on the legally complex issue of voter fraud. \n\nNo more mail in ballots.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Errlen",
                                                                                                    "body": "I wasn’t casually involved. I can’t speak to other states, but I can speak to what I saw in Wisconsin and what I saw on right leaning social media about Wisconsin. every claim of fraud I saw was based on  a misunderstanding of Wisconsin election law. There was one case where they published an article that there was likely fraud bc the same person had put their initials on every ballot. I wrote them, citing the provision in WI election law that requires the municipal clerk to initial ballots before sent out, and the Republican legislature that wrote that law. RedState didn’t retract. In fact they doubled down and published another article on the same theory. It made me very skeptical of claims I saw in other states about voter fraud. \n\nI don’t love mail in voting but for different reasons than you. It’s because it’s too easy for your ballot to be invalidated even though you are a valid voter if you make a stupid mistake, like for example in Wisconsin if your witness doesn’t provide their full address. Would you support expanded early voting?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "What I meant is you’re a laymen and your analysis is myopic. \n\nNo I don’t support expanding early voting. There’s no reason we need to make it easier for causal voters to vote.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Errlen",
                                                                                                                    "body": "I’m not a layman. I am a professional. Attorney, at the time working in voting law, with many years of experience. I have been honest about the fact I don’t know the law in every state as well as I know it in say, Wisconsin - is that what you think means I’m myopic? Most voting professionals focus on a specific state as each state has very different voting law. If I told you I knew every state, you’d have pretty good evidence I was lying and was not a professional. I know every claim of voter fraud conspiracy I saw on right leaning media out of Wisconsin - and it was my job to watch them - was based on not understanding Wisconsin election law. I don’t know what happened in other states, but if right wing media was as sloppy at fact checking there as it was in Wisconsin, I’m deeply skeptical of their claims. I gave you one example, I have more. \n\nPersonally I think it should be easy for valid citizens to make their voices heard. I see no point to laws that effectively disenfranchise busy young parents with jobs and doctors scheduled to work 24 hour shifts on Election Day over the interests of retirees with nothing better to do. I would put early vote at the grocery store. But you are entitled to your opinion. \n\nAs I said previously, Trump shakes up the traditional efficacy of voter suppression laws, which works great when the Republican base is retirees and white suburban families and the Democratic base is poor people in cities. But he’s made big inroads on the working class and young people; which traditionally struggle the most to vote with laws like you suggest that make it less convenient to vote. It’s interesting you still support business as usual in that instance. Do you support, in addition to only voting on Election Day, early registration requirements (eg having to register a month before Election Day or being disenfranchised if you have moved since the last election), and voter ID laws, with no exceptions for say, expired driver’s licenses or licenses that don’t show your current address? Would you permit proof of residency to be shown electronically when registering to vote?",
                                                                                                                    "score": 3,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "Hardcorish",
                                                                                                                    "body": "In your opinion, what's wrong with expanding policy to ensure more voters can easily vote?  Wouldn't this give us an even clearer picture of who America wants as their next leader?\n\nWhat are the downsides to allowing easier access to what we'll call casual voters?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                            "body": "Why make it easier for idiots and/or casual voters to vote? Who cares what these people “think” their political opinions are overwhelmingly worthless and ignorant. \n\nThis isn’t voting for American Idol. This is voting for the most important position in the entire world. You should have a minimal amount of motivation to vote and do more than roll out of your bed once in two months and throw a ballot in your mailbox. If you aren’t motivated enough to spend one f’n hour to vote on Election Day you are not the type of person who will benefit the country by voting.\n\nBut if you really want to have 2 months of Election Day, you should at least disqualify people who are on welfare or add some other requirement to make it so we don’t just have ignorant, lazy leaches deciding every election based on how much government money they can steal for themselves.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Hardcorish",
                                                                                                                                    "body": "Would you prefer there to be restrictions set in place of some kind before someone becomes eligible to vote (beyond the obvious required age limit)?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                            "body": "Yes. Several.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Hardcorish",
                                                                                                                                                    "body": "What would be some examples of requirements before eligibility could be considered?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                                            "body": "Property ownership. Military service. Competency test.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "modestburrito",
                                                    "body": "Would you have supported the Biden admin DOJ ignoring Judge Cannon's rulings? Very much a lower court judge directing the executive branch on matters of national security, with a political bias as well.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Enlightened_Patriot",
                                                            "body": "No I would have supported impeaching Biden.\n\nBut I don’t think these situations are analogous.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "modestburrito",
                                                                    "body": "I would not have supported Biden making that decision.  The proper way would be to appeal those decisions up to the SCOTUS, then abide by that ruling.\n\nHowever, this was a lower court mandating to the executive branch.  The Biden admin followed Cannon's rulings and appealed where they chose.  Biden did not call for Cannon to be impeached, nor did he or his surrogates suggest that she did not have the authority to make a ruling involving executive branch activities at her level.  The Trump admin is doing those things, though.  It's a decent comparison.  \n\nSo if the Trump admin ignores McConnells ruling, Trump should be impeached?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enlightened_Patriot",
                                                                            "body": "Appealing to Supreme Court takes a lot of time. Relying on this as the way to always handle things makes you an easy victim to obstruction by disingenuous hack judges. \n\nI see your comparison as superficial. I see cannon’s judgement as legit and I see the democrat judges as non-legit. I see the entire effort to arrest Trump as non-legit.\n\nYou may disagree but that’s my honest opinion. I don’t see enough similarity to treat these two situations as the same.\n\nI would support impeaching Trump if he ignored a legit effort to uphold the constitution. That’s not what I see happening here. I think Vance does a great job of explaining the constitutionality of these things and agree with his analysis.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "modestburrito",
                                                                                    "body": "Do you an issue with leaving it up to the admin to decide what is legitimate and illegitimate?  Wouldn't the appeals process be the way to decide that?  And yes the court system takes time, but have we not agreed a country that this is the process we're using?  Why can Trump's efforts be delayed for a few weeks while the ruling is appealed?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "Congress can impeach the president if Trump is doing something terrible. It’s not “leaving it up to the admin.”",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "fullstep",
                                            "body": "Depends on the situation. I am not going to assume that lower court judges are infallible and could never abuse their power.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "lunar_adjacent",
                                                    "body": "But what is your definition of abuse of power? Is it just that they blocked Trump/Musk from abusing power?",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "muy_picante",
                    "body": "Do you think this congress would impeach if Trump ignored a Supreme Court ruling?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Impeachment is only a legal recourse for high crimes and misdemeanors, not “failing to duly execute the law” or “doing something that a lower court said no to”. That said, Congress needs 2/3 of the senate to convict on impeachment charges. In other words, only 1/3 of one house of Congress is really necessary to break the law.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "MomentOfXen",
                            "body": "Your TS respondent is right, the issue is people’s modern day understanding of those words versus what it meant when written. Neglecting the office was considered to qualify as a “high crime and misdemeanor.” A more modern look is to point out that Impeachment is a political process, not a legal process, as in anything that 2/3 of the senate thinks should bounce the President, does. \n\nBut really in actuality impeachment is just “does the President’s own party want to get rid of him” Isn’t it? The other party is always a yes vote.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "fullstep",
                            "body": ">Impeachment is only a legal recourse for high crimes and misdemeanors\n\nAssuming the court order was determined to be lawful, then defiance of the court order would be breaking the law, and hence an impeachable offense.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Hopeful_Net4607",
                                    "body": "To clarify, are you saying that the Supreme Court ruling that the court order was lawful wouldn't be sufficient determination that it was lawful? This was my first reading of your comment because this thread discussed what would happen once the Supreme Court makes a decision, but I realize you may mean generally. \n\nIf I understood you correctly the first time, who would determine whether the Supreme Court's decision was lawful? Otherwise, have a good night!",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Warm_Difficulty2698",
                    "body": "I think that was be the ultimate test of whether the court is corrupt or not. \n\nIt is literally an open and shut case. The judiciary can check the executive, that's it. \n\nIf they vote against it, we will know they are compromised. \n\nDon't you agree?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fullstep",
                            "body": ">Don't you agree?\n\nNo, with prejudice. You seem to think the judiciary has no limits to its powers with regard to checking the executive. This couldn't be further from the truth. The judiciary's powers are limited to interpreting laws passed by congress. If there is no law passed by congress preventing the executive from conducting internal audits, then the judiciary has no legal power to stop it, and the SC would be correct to unblock it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Warm_Difficulty2698",
                                    "body": "EOs are defacto legislation. Not to mention, every injunction so far has been temporary until the court case plays out. I don't see how you can argue against this, except being partisan. \n\nIsn't the SC the judiciary?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "fullstep",
                                            "body": ">EOs are defacto legislation. \n\nUh, no they are not. Only congress can pass legislation. The executive branch has no legislative powers. EOs are merely an exercise of powers granted to the executive by the legislative. EOs that do not exceed the power granted by the legislative cannot be stopped by the judiciary.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Warm_Difficulty2698",
                                                    "body": "de facto\n: actual\nespecially : being such in effect though not formally recognized \n\nSo, do you really believe the judiciary can't provide checks on the executive?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "fullstep",
                                                            "body": ">do you really believe the judiciary can't provide checks on the executive?\n\nYou don't seem to be interested in reading my answers to your questions so I won't bother responding anymore.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Warm_Difficulty2698",
                                                                    "body": "When exactly did the precedent change? Its been exactly like this for hundreds of years?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kuriyamikitty",
            "body": "I find the crowd wanting the Supreme Court ignored, removed or diluted anytime something remotely not going full bore in decisions against Trump suddenly caring if they are ignored hilarious. I will only care to respond to those who went, “Well that didn’t work, rules are rules.”\n\nRealistically many court orders are ignored by Congress and the President for decades. So unless something so wild comes out of this creates impeachment, well what is at stake while the courts work out an actual decision? Information gets out? Unless legally private info is published like THE J6 COMMITTEE did to Patel, then it’s less damage than the FBI did putting out staged photos illegally pre trial. So in this case possible harm is minimal as long as they follow rules anyone looking at privileged info needs to- remembering that Trump is the final say for Secrets, able to declassify in an instant on a whim.",
            "score": -11,
            "replies": [
                {
                    "author": "JackOLanternReindeer",
                    "body": "Which court orders were ignored by congress or the president in past decades?",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "What happened to Biden when he openly bragged about ignoring the Supreme Court? Nothing. Is that what should happen? Probably not but that is what happened.\n\nI'd care far more with Trump if it was a Supreme Court order, & if in a deadlock then Congress should be the tie breaker as the third branch of government theoretically though these tend to fall to whoever has the most soft influence at the time. \n\nAs it stands currently you have low federal courts mandating that government websites must display certain things, that legitimate officers of the Executive branch including confirmed cabinet members cannot access their own files, etc. Those are blatant violations & abuses of power that need to be completely obliterated as unacceptable & grounds to disbar those judges. It would be like a random FBI sargeant walking into the Supreme Court then making a ruling, preventing a Justice from accessing legal records, & telling the court how they must word a majority opinion or he'd arrest them. It is absurd, unacceptable, & grounds for immediate dismissal. The violation of the civic authority & representative of the people, even were it Biden or Harris, cannot stand over legitimate orders.\n\nThe funding freeze is less blatantly partisan than those instances & could be argued up the court line but my benefit of the doubt is running very dry on this. That should probably go up to the Supreme Court, but honestly I only see bad faith & active malice coming from those courts. \n\n\n*Typo",
            "score": -23,
            "replies": [
                {
                    "author": "georgecm12",
                    "body": ">What happened to Biden when he openly bragged about ignoring the Supreme Court? Nothing.\n\nIf you're referring to his student loan forgiveness, the Supreme Court found against the initial very broad student loan forgiveness. The Biden administration then crafted smaller, more targeted forgiveness plans to comply with the court's findings. \n\nWhen did he \"openly brag\" about ignoring the Supreme Court?\n\n>As it stands currently you have low federal courts mandating that government websites must display certain things, that legitimate officers of the Executive branch including confirmed cabinet members cannot access their own files, etc. Those are blatant violations & abuses of power that need to be completely obliterated as unacceptable & grounds to disbar those judges.\n\nDon't the vast majority of court cases make their way through the system, *starting* at district courts and only *eventually* making their way up to the Supreme Court? It sounds to me when you specifically say \"low federal courts\" like you assume that every court case has to start and end at the Supreme Court level, which is just not practical.\n\nAnd isn't it the judiciary's responsibility to ensure that both the administrative and legislative complies with the law? Thus far, it seems like there have been blatant violations of the law by the administration, most notably improperly dismissing multiple people immediately where there is a clear procedure set in law as to how (or IF) they can be dismissed.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": ">What happened to Biden when he openly bragged about ignoring the Supreme Court? \n\nWhat was this?",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "DoctorRyner",
            "body": "Biden ignored all the laws and pardoned his whole family, nothing happened. So, I guess it's the norm",
            "score": -6,
            "replies": [
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": ">Biden ignored all the laws and pardoned his whole family,\n\nWhat law did this break?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "DoctorRyner",
                            "body": "Ughhhhh, the laws his family broke? Basic logic",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": "So Biden didn't break the law?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lavaswimmer",
                    "body": "Is it against the law to issue pardons?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "DoctorRyner",
                            "body": "It's AT LEAST very corrupt to pardon your own family -\\_-",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Lavaswimmer",
                                    "body": "So we agree that Biden did not “ignore all the laws” when he issued pardons, like you said?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "DoctorRyner",
                                            "body": "Corruption is a crime, lol",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Lavaswimmer",
                                                    "body": "What law did he break when he pardoned his family?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "DoctorRyner",
                                                            "body": "Obstruction of Justice",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Lavaswimmer",
                                                                    "body": "Can you point to the specific law related to \"Obstruction of Justice\" that Biden broke by pardoning his family?\n\nhttps://uscode.house.gov/view.xhtml?path=/prelim@title18/part1/chapter73&edition=prelim\n\nDid Trump break similar laws when he pardoned J6 rioters who had assaulted police officers? Are you saying that \"obstruction of justice\" can only apply when one's family is involved?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DoctorRyner",
                                                                            "body": "Due to Reddit and its moderation team being a fascist/authoritarian platform that frequently censors free speech and any opinion that doesn’t align with their far-left extremist ideology, I’m unfortunately unable to express my views due to active censorship and pressure from losers who feel the need to assert their “confidence” by oppressing others online without mod powers. Feel free to reach out to me in DMs if you need your previous questions answered",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TopGrand9802",
            "body": "What do you think should happen to Joe Biden for ignoring the courts regarding student debt relief?",
            "score": -9,
            "replies": [
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": "What did he ignore? It's my understanding that the Supreme Court ruled that the mechanism by which he tried to forgive student loans was unconditional.  Not the entire concept of student loan forgiveness.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "CC_Man",
                    "body": "What part did he ignore--I thought he adjusted actions to fit the ruling?\nIf not, then the president should face whatever contempt charge you or I would face. What do you think should happen?",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}