{
    "title": "Why is USAID funding being framed as \"democrat fraud and waste\" when its been operating under republican administrations as well, including Trump?",
    "author": "thenewyorkgod",
    "subreddit": "AskTrumpSupporters",
    "rank": 101,
    "score": 247,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 296,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iq8mtn/why_is_usaid_funding_being_framed_as_democrat/",
    "id": "1iq8mtn",
    "selftext": "I genuinely dont understand this. Why is DOGE only releasing information about things aimed to get people emotional, like dance classes in nigera or condoms to gaza. Are you telling me during the 4 years of Trump 1, all US AID funding was fine and on the up and up? Because I can't find anything from DOGE highlighting waste fraud and abuse during Trump's term.\n\nWhy no uproar about $50 million in US AID funding to \"empower women worldwide\", which was a program heavily endorsed and promoted by Ivanka Trump? February 7, 2019. **Mr. Trump's** administration pledged $50 million to W-GDP — to be allocated by USAID.\n\nhttps://www.cbsnews.com/news/trump-usaid-cut-threat-ivanka-womens-development-program/\n\nAre we really supposed to believe DOGE is being non biased in what it reveals and promotes as \"waste, fraud and abuse\"?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gaxxz",
            "body": "It's not Democrat fraud and waste. It's just fraud and waste. If we make it less partisan, will you go along?",
            "score": 18,
            "replies": [
                {
                    "author": "misterasia555",
                    "body": "What is an example of fraud? My understanding is that all of these funds are appropriate by Congress, what would the fraud be?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Gaxxz",
                            "body": ">What is an example of fraud?\n\nThe suggestion is funneling money to politically friendly NGOs. I don't know if it's fraud, but it's worth looking into.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wheelsof_fortune",
                    "body": "I don’t see any fraud though. Wasteful, maybe. But weren’t all of these appropriations made by congress? I’m all for saving money and cutting waste. But I think there’s a better way to go about it. Why not have actual auditors with a security clearance comb through the works? To me, the way that it’s being handled, seems extremely reckless and it gives a ton of power to one man to  “delete” anything he disagrees with. I know this question keeps being asked but, how would you feel if George Soros or Bill Gates were doing this?",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Beffis777",
                            "body": "They did have auditors comb through things, and the Pentagon failed 7 times in a row. \n\nhttps://breakingdefense.com/2024/11/pentagon-fails-7th-audit-in-a-row-eyes-passing-grade-by-2028/\n\nAs for your last question, I don't care who is finding all the waste (which I strongly believe is money laundering). I just want it found and stopped.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "I_love_Hobbes",
                                    "body": "Then cut the Defense budget? Why keep funding the Petagon if they are the ones failing the audit?\n\nLet's see an actual audit, done by OIG, for USAID that shows they have failed an audit. Please show something for all this wreckage beside \"I heard.\"",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Beffis777",
                                            "body": "Actually, they are going to cut some of the budget to the Defense Department. \n\nhttps://defensescoop.com/2025/02/07/trump-directs-elon-musk-doge-review-pentagon-dod-spending/\n\nI'm not sure if the link below will work or not, but there was an actual audit done on USAID. I think page 11 is the important part.\n\nhttps://oig.usaid.gov/sites/default/files/2021-12/0-000-22-005-C.pdf",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "I_love_Hobbes",
                                                    "body": "That USAID report is from 2021. Where is the one that Musk says he is doing?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Beffis777",
                                                            "body": "\n... that is not the one requested by you.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "billstopay77",
                                    "body": "So, when is the pentagon getting audited by DOGE and why didnt they start there?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Beffis777",
                                            "body": "I will call Elon later today and ask him 🤷‍♀️",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ioinc",
                                    "body": "If it’s as bad as you think, why are so many bogus stories being used to illustrate the problem?  Why not use the real stories?\n\n\n59 million to stolen from hurricane relief to house illegals in luxury hotels?\n\n\n30 million to make shrimp run on treadmills?\n\n\n50 million in condoms to Hamas?",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "Beffis777",
                                            "body": "Money was giving to house illegals in a hotel, although he was wrong about it being taken from hurricane victims. I would argue that if money wasn't going to help the illegals, more could have been given to the victims of the hurricanes.\n\nhttps://www.factcheck.org/2025/02/musk-misleads-on-femas-migrant-related-payments-to-new-york-city/\n\nThis is the first I've heard of the shrimp one, so I had to look into it. It appears to be extremely old, and all I could find was the gentleman defending himself, which seemed legitimate to me.  Can you provide a link to where this is being brought up now by our current administration?  I am unable to find anything. \n\nThey were mistaken on the location, but the money was sent to the Gaza district of Mozambique in order to combat HIV\n\nhttps://www.ynetnews.com/article/rkm4s3yf1g",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "ioinc",
                                                    "body": "The 59 million was for legal migrants and was allocated by a bipartisan vote in congress for that purpose. It actually would have been illegal to use it for something else. \n\n\nShrimp thing I read on this sub (or a very similar on r/conservative?) a few days ago. \n\n\nUsing money to exert soft power was the purpose and is not waste, fraud or abuse. In fact it’s a lot cheaper than hard power. Condoms cost less than bullets. \n\n\nWhy all the misinformation if there is (supposedly) more legitimate examples than we know what to do with?\n\n2 edits. \n\nThank you for taking the time to do some research. It helps for a more interesting conversation. \n\nAnd, it’s interesting that you add “illegal” to migrants, when it’s not part of the source documents you linked to. \n\nIt’s like the right has been conditioned to believe that its impossible to be in this country legally if your not a citizen. (My family spent 5 years here legally before gaining citizenship)\n\nAnd, it was not a luxury hotel. It was a location designated for that purpose (although in a former life it was a hotel)",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "Beffis777",
                                                            "body": "I stand by calling them illegal immigrants. This article states that it was intended to help asylum seekers, which, for all appearances, makes it legal use of funds. However, the Democrats have a bad habit of labeling all of them migrants and ignoring how they crossed illegally.\n\nhttps://ny1.com/nyc/all-boroughs/news/2024/01/24/city-signs--77m-contract-with-hotels-to-house-migrant-families\n\nUnfortunately, situations like the one in the article below  affect the ones who come here with legitimate concerns. How does the saying go? One bad apple ruins  it for everyone?\n\nhttps://www.cbsnews.com/newyork/news/venezuelan-gangs-tren-de-aragua-new-york-city-migrants-asylum-seekers/\n\nAs for the shrimp thing? People overreact, and that is why we are in a situation where no one believes anything from the opposite side.\n\nI'm not against helping the innocent in every country, so I am for giving money to help with HIV. My concern is how much money is actually going to help others and how much is going into the people in the powers pocket. And I'm sorry, but after all the shade that went down with censorship and Fauci, I have a hard time trusting the Democrats anymore. \n\nAs for the \"misinformation,\" it is not misinformation. Just poorly worded for a dramatic effect.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "ioinc",
                                                                    "body": "Deliberately poorly worded to imply an inaccurate message right?\n\nAgain, if we’re inundated with examples that are legitimate why is this necessary ?\n\nAgreed, one bad apple does spoil the batch. \nNow that doge has come out of the gate with all these bogus examples, it’s easy to assume they have not found any real ones. \n\nThe problem is they can lie and mislead faster than fact checkers can correct. \n\nI’m not aware doge has done anything other than break stuff with no plan to fix.",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Beffis777",
                                                                            "body": "I don't believe these questions are asked in good faith, but I will try to answer them anyway. \n\nI don't believe his messages are innacurate. I believe he condensed the bigger picture into a couple of words when talking about an issue. \n\nIt's just the way he talks. As I said, he condensed legitimate concerns into one or two words.\n\nI don't believe that Doge has shown anything I would consider bogus.\n\nThe fact checkers are only one-sided.\n\nHave you looked at the Doge website?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ioinc",
                                                                                    "body": "I’ve looked at those claims. \n\nHow does adding luxury hotel to the narrative condense it?\n\nHow does adding illegal to the immigrants getting the benefit condense it?\n\nHow does incorrectly claiming it was stolen funds from other support condense it?\n\nYou’re being very generous.",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Beffis777",
                                                                                            "body": "?? He takes the bigger picture and puts it into a few words or less. \nYou are intentionally being obtuse, so I will no longer engage with you.",
                                                                                            "score": -3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "lukeman89",
                                                                                                    "body": "I think the point ioinc is making is-- how can the argument be made that he is 'condensing' it when he is adding superfluous stuff that is not true?  Do you accept lying/embellishing/obfuscating the truth from your own side and demonize the other side whenever they do it?",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Hardcorish",
                                                    "body": "Trump wants FEMA shut down so the states can finance their own disaster relief efforts.  Do you agree with this?  If so, do you believe this will make disaster relief harder to get for victims of natural disasters?",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DisorganizedSpaghett",
                                    "body": "You're changing the subject from USAID to the largest single entity on the entire planet. How can you assume that any random dude won't use the audit process to steal money, compared to a professional forensic accountant or auditor who would lose their personal career over mistakes in this project?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Real_Etto",
                            "body": "They have people that are supposed to be monitoring it. They are corrupt as well apparently. This isn't just a left fraud thing it's both sides. The swamp covers all parties. The Dems are just the loudest complainers. \nThey stated Soros got millions financing from USAID  to elect the DEI  AG races across the country that put the Marxist AG in place that don't prosecute crimes. Gates has been really quiet for several weeks.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Gaxxz",
                            "body": ">But weren’t all of these appropriations made by congress?\n\nCongress couldn't possibly waste money, could they?\n\n>I know this question keeps being asked but, how would you feel if George Soros or Bill Gates were doing this?\n\nIf I were a Republican member of Congress and Democrats were doing this and what they were doing was obviously popular, I would respond with suggesting my own cuts. I don't see Dems doing anything like that.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "wheelsof_fortune",
                                    "body": "Waste? yes. Commit fraud? I guess in theory yes, but they’d have to agree, as a whole, to keep quiet about it, and they never agree on anything, so it seems unlikely to me.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Gaxxz",
                                            "body": ">Commit fraud? I guess in theory yes, but they’d have to agree, as a whole, to keep quiet about it\n\nhttps://www.bbc.com/news/articles/clyekv226l2o",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "wheelsof_fortune",
                                                    "body": "He was bribed, caught, removed from office, and sentenced to prison. Seems to me like the system did it job in catching it, no?",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "Gaxxz",
                                                            "body": "You were suggesting it was somehow difficult for members of Congress to commit fraud.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "wheelsof_fortune",
                                                                    "body": "I wasn’t considering lone actors being bribed when I made that comment. Does it concern you that Pan Bondi has ended efforts to[stop foreign influence](https://www.nbcnews.com/news/amp/rcna191012) in American politics?",
                                                                    "score": 13,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "j_la",
                    "body": "What makes it fraud?\n\nWhy is it waste? Arguably, doesn’t USAID spending advance US interests by making the world a more stable place? When you’re at the top of the world, you have the most to lose from instability.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Gaxxz",
                            "body": ">What makes it fraud?\n\nSome programs seem to be structured as ways to funnel money to certain politically friendly NGOs. I don't know if it's fraud, but it's definitely worth looking into.\n\n>Why is it waste?\n\nThese are programs that maybe benefit Americans marginally. They're not worth going further into debt to pay for.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "j_la",
                                    "body": "How do you determine if the benefit is only marginal?\n\nTo take two examples: conservatives have been making hay over Sesame Street for Afghanistan and condoms in Gaza, which seems like useless spending at face value. But, arguably, teaching kids western values and helping families plan families (and thus reduce the strain of poverty) could improve American security down the road. If, hypothetically, that money helped prevent a terrorist attack down the road, wouldn’t it be money well spent?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Gaxxz",
                                            "body": ">How do you determine if the benefit is only marginal?\n\nMost people have never even heard of USAID and won't even notice when it's gone.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "j_la",
                                                    "body": "But does that mean its work doesn’t benefit us? My example showed how small investments in global stability could save lives down the line. Isn’t that of value to Americans?\n\nI think this is representative of a larger problem. People treat research as useless or pointless if it doesn’t yield immediate results, but basic research often takes time to yield fruit and it’s often in indirect ways. Are immediate results the only ones worth funding?",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "Gaxxz",
                                                            "body": "Immediate results? USAID has existed since the 60s.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "j_la",
                                                                    "body": "Is it possible that if that aid had not existed then the world would have been more unstable and dangerous for Americans today?",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Wolverine-75009",
                                    "body": "Would you consider the  $2 billion in agricultural products bought from U.S. farmers every year by USAID to be of marginal benefit to Americans?\n\nOn a more general note and in view of the fact that the Republican Party holds the White House, congress and a majority in scotus, why are they not legislating and implementing their agenda according to the rule of law?\n\nFinally, how is firing and defunding all the watchdogs promoting a less corrupt society?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Gaxxz",
                                            "body": ">Would you consider the  $2 billion in agricultural products bought from U.S. farmers every year by USAID to be of marginal benefit to Americans?\n\nHrmphh, now libs want to help farmers.\n\n>why are they not legislating and implementing their agenda according to the rule of law?\n\nCongress is working on it.\n\n>how is firing and defunding all the watchdogs promoting a less corrupt society?\n\nYou mean the IGs? I presume Trump is going to put his own people in those roles.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Wolverine-75009",
                                                    "body": ">Hrmphh, now libs want to help farmers.\n\nCould you explain how this answer my original question?\n\n\n>Congress is working on it.\n\nOn Friday the Republican-dominated House Budget Committee presented its budget proposal to the House. It calls for adding $4.5 trillion to the budget deficit in order to extend Trump’s 2017 tax cuts for the wealthy and corporations. It also calls for $1.5 trillion in spending cuts, including cuts to Medicare, Medicaid, and supplemental nutrition programs. Do you feel this is a popular agenda and will it improve Americans life’s?\n\n>You mean the IGs? I presume Trump is going to put his own people in those roles.\n\nI was referring to the dozen inspectors general, whose job it is to identify fraud and corruption who were fired as well as the chairs and members of the National Labor Relations Board, the Equal Opportunity Employment Commission, and the Federal Election Commission who were also fired and will not be replaced effectively shutting down those independent boards in violation of statute. My question remains the same, this is a clarification regarding who I was talking about and why I am curious to know how you think these actions will help de-rooting corruption.\n\nEdit:  I would like to add the shutting down and defunding of the Consumer Financial Protection Bureau to the list.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Dijitol",
                                                            "body": "Which libs are you talking about?  And what lead you to believe they did not want to help farmers?",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Gaxxz",
                                                            "body": ">Could you explain how this answer my original question?\n\nBecause a government program pays Americans to conduct its business is not justification for keeping it. If you think it's important for the government to send $2 billion per year to farmers, petition your member of Congress to enact a program. Don't hide it somewhere else.\n\n>It calls for adding $4.5 trillion to the budget deficit in order to extend Trump’s 2017 tax cuts for the wealthy and corporations\n\nIt balances the budget in 10 years.\n\n>It also calls for $1.5 trillion in spending cuts, including cuts to Medicare, Medicaid, and supplemental nutrition programs\n\nIt does not. It calls for $1.5 t in unspecified budget savings. Please stop spreading misinformation.\n\n>I was referring to the dozen inspectors general\n\nI'm sure Trump will replace them.\n\n>National Labor Relations Board, the Equal Opportunity Employment Commission, and the Federal Election Commission\n\nThat will get settled in court. Again, Trump will appoint people for those roles.\n\n>Consumer Financial Protection Bureau\n\nWe lived for 240 years without a CFPB. I don't think we'll miss it much. Before there was a CFPB, the Fed managed consumer banking regulation. They can have it back.\n\nAlso, the CFPB has been operating illegally for the last two years. They have a unique funding source, a cut of the \"profits\" earned by the Federal Reserve's investment portfolio. For the last two years, the Fed's portfolio has generated losses, but the Fed still transferred funds to the CFPB to keep it running. That was effectively an illegal appropriation.\n\nhttps://archive.is/2024.09.13-100745/https://www.americanbanker.com/opinion/the-cfpb-is-funded-by-the-feds-profits-trouble-is-there-are-none",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Wolverine-75009",
                                                                    "body": ">Because a government program pays Americans to conduct its business is not justification for keeping it. If you think it’s important for the government to send $2 billion per year to farmers, petition your member of Congress to enact a program. Don’t hide it somewhere else.\n\nThe U.S. Agency for International Development (USAID) budget is allocated by Congress through the State, Foreign Operations, and Related Programs (SFOPS) appropriations. How is that not enacted by congress? Isn’t it then “hiding” in plain sight? How is supporting our farmers simultaneously with strengthening the US’ soft power and feeding malnourished children not a win win situation?\n\n\n>It does not. It calls for $1.5 t in unspecified budget savings. Please stop spreading misinformation.\n\nIt calls for $1.5 trillion in spending cuts, with an additional caveat: The House package has to include $2 trillion in cuts to the “mandatory” part of federal spending, which covers programs like Medicare, Medicaid and food benefits known as SNAP, or $4.5 trillion amount in tax breaks must be reduced by a commensurate amount. The House Budget Committee instructs seven committees to come up with no less than $1.502 trillion in mandatory cuts over 10 years. Notably, for health care, the bill instructs the House Energy and Commerce Committee to cut mandatory spending by a minimum of $880 billion. The Energy and Commerce Committee has primary jurisdiction over numerous health care programs, including Medicaid, and some proposals have been circulating that would enact significant cuts to Medicaid. This is public information, how does communicating this information constitute spreading misinformation?\n\n\n>Also, the CFPB has been operating illegally for the last two years. They have a unique funding source, a cut of the “profits” earned by the Federal Reserve’s investment portfolio. For the last two years, the Fed’s portfolio has generated losses, but the Fed still transferred funds to the CFPB to keep it running. That was effectively an illegal appropriation \n\nThe Consumer Financial Protection Bureau has recovered more than $17 billion for consumers from fraudulent or predatory practices since it began in 2011, the projected budget estimate for its operations in FY2025 is $810.6 million. Isn’t protecting consumers from predatory practices worth an investment?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Gaxxz",
                                                                            "body": ">State, Foreign Operations, and Related Programs (SFOPS) appropriations\n\nWhat does that have to do with farmers?\n\n>This is public information, how does communicating this information constitute spreading misinformation?\n\nThat's not the same as \"It also calls for $1.5 trillion in spending cuts, including cuts to Medicare, Medicaid, and supplemental nutrition programs\". We both know that.\n\n>Isn’t protecting consumers from predatory practices worth an investment?\n\nI love how libs are so willing to break the law when it furthers their ends.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Wolverine-75009",
                                                                                    "body": ">What does that have to do with farmers?\n\nDoes buying 2 billion in agricultural products answer your question?\n\n>That’s not the same as “It also calls for $1.5 trillion in spending cuts, including cuts to Medicare, Medicaid, and supplemental nutrition programs”. We both know that.\n\nCan you explain how it is different?\n\n>I love how libs are so willing to break the law when it furthers their ends.\n\nWould me calling you a trumptard while moving the goalposts in my  replies be considered insightful?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Gaxxz",
                                                                                            "body": ">Can you explain how it is different?\n\nIt's accurate.\n\n>Would me calling you a trumptard while moving the goalposts in my  replies be considered insightful?\n\nWhy would you call me that?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Wolverine-75009",
                                                                                                    "body": "Why are you consistently referring to the libs in a derogatory way?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Gaxxz",
                                                                                                            "body": "I'm just saying that liberals seem fine with illegal appropriations for CFPB because it's perceived as a \"liberal\" agency.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "quikopoi",
                                    "body": "Re: \"These are programs that maybe benefit Americans marginally. They're not worth going further into debt to pay for.'\n\n\"I've seen a lot of people here saying this is about \"I'd rather see this money spent here instead of these foreign countries.\"\n\nDo you believe that money DOGE saves will go to reduce the deficit? What do you think the DOGE money savings is for? \n\nIs continuing the tax breaks for the richest 1% one of the things that you would expect and want this savings to address?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Gaxxz",
                                            "body": ">Do you believe that money DOGE saves will go to reduce the deficit?\n\nThat's my preference.\n\n>Is continuing the tax breaks for the richest 1% one of the things that you would expect and want this savings to address?\n\nWhat specific tax breaks for the richest 1% are you talking about?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "quikopoi",
                                                    "body": "Well, Trump's plan from his last attempt to run the country (the TCJA) lowered the highest individual tax rate from 39.6 to 37% (if you earned more than $500,000, you get a 2.6 tax decrease -- that's $26,000 tax savings per million over $500,000.  So just randomly, the CEO of Kroger made $15.5 million last year. This Trump45-era tax cut saved him $390,000 in 2023. I guarantee this saved you $0.\n\nHe also lowered the corporate tax rate from 35% to 21%. It was said that this tax rate lowering would \\*spur businesses to make more money and hire more people\\*. It did not. What it did do was increase profits for shareholders, and encourage stock buybacks. This increased stock prices and made each shareholder own a larger stake of the company. If a corporation's buyback raises the stock price from $35/share to $45/share, someone who owns 10,000 shares of the company will now be $100,000 richer. Add that to an increased \"earnings per share\" because the company pays less taxes and every owner benefits.\n\nThe TCJA also ushered in a brand new deduction for executives paid by S-Corporation, LLC, Sole Proprietorships, structured partnerships (collectively, \"pass through companies\"). These are the sorts of companies lawyers make for real-estate investors, among lots of other beneficiaries. For the past 6 years or so, if you owned one of these types of companies, you got 20% off your income IN ADDITION to any taxes you might pay. So, for every million you made from your pass-through corp, where you used to be taxed at corporate rates, you now get to pretend you only made $800,000 before you get taxed. 20% off the top.\n\nThese things (and others in the TCJA) are up for being changed or renewed in just a month or so -- and you can bet they will remain. Also, it's cost the federal government trillions each year to keep these taxes which only benefit the rich in place. It will continue to cost us....\n\nAre you ok with DOGE savings going to offset the continuation (and perhaps expansion) of these sorts of tax cuts for the wealthy?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Gaxxz",
                                                            "body": ">Trump's plan from his last attempt to run the country (the TCJA) lowered the highest individual tax rate\n\nAre you forgetting that it lowered all the other tax rates too?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "quikopoi",
                                                                    "body": "No - but you asked what specific tax breaks for the rich I was talking about. These are them. There may be more. Also, you might note that all of the rest of the tax rates (breaks as you say) for you and me are automatically rescinded this year. The congress will be voting to keep them in place or change them in the next few weeks. Since they expire automatically, I suppose the new tax law will allow them to expire. I'd be surprised if that wasn't the case.\n\nIn any event, now you know what tax breaks for the 1% I was talking about, so, do you think that DOGE savings should be used to pay for these tax breaks for the rich?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Gaxxz",
                                                                            "body": ">I'd be surprised if that wasn't the case.\n\nMe too. And the reason for that is Republicans are going to have to pass an extension of the tax rates with no Democrat support whatsoever. That means instead of using the standard legislative process for amending the tax code, which would require 60 votes in the Senate, they have to use budget reconciliation. That practically guarantees that the tax rates will have to sunset again.\n\n>do you think that DOGE savings should be used to pay for these tax breaks for the rich?\n\nThey won't.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "quikopoi",
                                                                                    "body": "re: \"They won't\"\n\nAnd, if they do? If they sunset the tax rates, reverting back to 2019 rates and keep in place (or expand) the tax breaks for the richest 1%, how will they pay for that? The DOGE savings isn't going to offset that. Certainly, they will get some income from those with $0-$500,000/year incomes since their taxes will go up to what they were in 2019. But they will not be relying on taxes on income from corporations or executive taxes for pass-throughs. \n\nYou said that you'd like the DOGE savings to go to paying down the deficit; but we are incurring deficit at such a high rate, no amount of DOGE savings will effectively pay it down. It will simply slow the bleeding. So, if they leave the tax breaks for the rich in place and pay the deficit down using DOGE-saved funds, we will STILL have a growing deficit.\n\nHowever, if we reversed the tax breaks for the rich (like they will most certainly reverse the tax breaks for the $0-$500,000 earners), we would be able to use the DOGE savings AND the additional tax income to pay the deficit.\n\nIs that the best situation we can hope for?? Would you support that?",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Hardcorish",
                                    "body": "Is that your opinion that they benefit Americans marginally, or do you have data to back up that assertion?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Gaxxz",
                                            "body": "Most people haven't even heard of USAID.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hardcorish",
                                                    "body": "What does that have to do with anything though?  The average American doesn't have a clue about the work that most agencies do on a daily basis.  Should their ignorance of said agencies be sufficient cause for them to be shut down?\n\nMost Americans weren't aware of the NNSA until Trump fired and subsequently attempted to rehire them after realizing he made a massive blunder.  Should that agency also be shut down since the average person hasn't heard of it?\n\nBy your own logic, it should.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thenewyorkgod",
                    "body": "Why did trump pledge $50million for the empowerment of women around the globe through US AID in 2019?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Gaxxz",
                            "body": "I don't know anything about that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "billstopay77",
                    "body": "If it is fraud and waste than it needs to go but both parties are equally responsible. Both parties are the opposite side of the same coin. The swamp is all the elected officials, past and present. They are currently doing a bait and switch to rank and file employees but more of the same will continue until the true swamp is removed. We need Term limits, no stocks purchases for elected officials, all the money out of politics, no lobbying and corporations are not people. Until real change happens we will continue to see more of the same from each side of the aisle, while the masses cheer. \n\nLove Music/Hate Politics\n\n[https://www.youtube.com/watch?v=Q3P4bQldq8M&ab\\_channel=Swingin%27Utters-Topic](https://www.youtube.com/watch?v=Q3P4bQldq8M&ab_channel=Swingin%27Utters-Topic)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Gaxxz",
                            "body": ">both parties are equally responsible\n\nOk, settled. Both parties suck.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cwood1973",
                    "body": "Why didn't you make it less partisan to begin with?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "heroicslug",
            "body": "What \"Republican ends\" were served by the US Agency for International Development under Republican administrations?",
            "score": 1,
            "replies": []
        },
        {
            "author": "I-want-to-learn-it",
            "body": "You are 100% correct. The funding is a front for fraud, waste, and abuse from both sides of the aisle. There’s no way one party alone could pull this off for the past 63 years without the other side being complicit.",
            "score": 1,
            "replies": [
                {
                    "author": "DisorganizedSpaghett",
                    "body": "How much of a program that spends money on medicine and health in the poorest countries to keep people alive, do you think is fraud percent wise?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "partypat_bear",
            "body": "USAID is being framed as deep state fraud and waste in my circles, not just democrat. And I too would like to know what they were up to during Trumps last term. I'm guessing the explanation would be that Trump was focused on a million other things and overlooked a lot. And if it wasn't for Elon spearheading the hunt for government inefficiency it wouldn't have been looked at as hard this time around",
            "score": -31,
            "replies": [
                {
                    "author": "Ilosesoothersmaywin",
                    "body": "> USAID is being framed as deep state fraud and waste in my circles, not just democrat.\n\nThe richest man in the world who owns the largest social media company in the world and has dozens of contracts with the United States Government has been put in charge of finding fraud.\n\nAt face value... does it look like Elon is part of the deep state to you?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "partypat_bear",
                            "body": "lol no not at all. The other person asked how I defined deep state, reading that might help you understand my perspective",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Ilosesoothersmaywin",
                                    "body": "Not at all?\n\nIf a rich oligarch wanted to take over the government or at the very least use the government to enrich themselves in what way would it differ from what Musk is literally doing right now?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "LuolDeng4MVP",
                                            "body": "Wouldn't they do what every rich person has been doing for 50 years? You cut backroom deals and make dark donations - publicly outing yourself and making half the country hate you might be the worst possible strategy if your goal was enrich yourself.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Ilosesoothersmaywin",
                                                    "body": ">Wouldn't they do what every rich person has been doing for 50 years? You cut backroom deals and make dark donations\n\nWhat rule says that 100% of all elites must constrain themselves to the norm of \"backroom deals\" and \"dark donations\"?  I'd argue that while this may be the norm and easier way to achieve financial success for elites, making more money than your contemporaries demands that you push the limits and find new vectors of exploitation.  And there is nothing that says being out in the open in the eye of the public is a non-starter.\n\n>making half the country hate you might be the worst possible strategy if your goal was enrich yourself.\n\nFirst off I'd say that if we are going to agree that half the country hates Elon we must also agree that half the country loves Elon.  If people's opinions are to sway the scales, for every ounce of public opinion you put on one side of the scale there is a second ounce on the other side.  And if you put perspective and lenses in which Elon could be interacting with the world you may find that public opinion means very little.  If 99% of the world hates him yet he only interacts with the 1% that loves him, his world view is going to be drastically askew.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "LuolDeng4MVP",
                                                            "body": "When did I say it was a rule? The point I was clearly making was facing massive public scrutiny is the worst possible way to enrich yourself. If you want to enrich yourself you donate to some random senator and they pork up the next omnibus for you and nobody knows about it. The entire world media is looking at everything Musk is doing, that's obviously a terrible way to enrich himself.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dijitol",
                    "body": "Do you trust Elon to not use his position of power to enrich himself?",
                    "score": 54,
                    "replies": [
                        {
                            "author": "AlsoARobot",
                            "body": "Considering Elon is dirt poor and desperate for money, this is highly likely…\n\n/s",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Why do you feel rich people don’t want more riches?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AlsoARobot",
                                            "body": "If you just ate your fill at a buffet, would you be food motivated? \n\nEveryone is motivated by money to some extent, but Elon doesn’t really need additional revenue streams to maintain his wealth. \n\nWhat confuses me is this… \n\nI would honestly think the democrats would be the **first** in line to cut wasteful spending… If I am a liberal who believes the government can and should play a bigger role and do more for its people, then I would want that government to be run as efficiently as possible so that; more resources are available; those resources get to who needs them; the government is seen more favorably in the eyes of the public… and so on.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": ">If you just ate your full at a buffet, would you be food motivated?\n\nI don’t see how this analogy is even close because you’re saying Elon has a finite space to store his wealth. \n\nI believe the reason you’re confused is because you made a bad assumption. Democrats did and do, want to get rid of wasteful spending. Why do you feel they haven’t tried?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AlsoARobot",
                                                            "body": "I suppose he doesn’t have a finite space to store his wealth, but do you honestly think he is that desperate for opportunities to make money?\n\nThe fact that many of the programs being found in USAID exist/were funded is an excellent example that they haven’t tried to cut wasteful spending.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AlsoARobot",
                                                                            "body": "Wealthy people donate to political campaigns all the time, and in staggering amounts. They do so for a wide variety of reasons. \n\nElon isn’t getting paid a salary for what he is doing with DOGE…",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dijitol",
                                                                                    "body": "I deleted my comment because it might’ve violated the rules. \n\nElon’s position and department was specifically made for him. Do you think he would’ve got that power if he didn’t donate that money?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "AlsoARobot",
                                                                                            "body": "Extraordinarily common for people to donate money and/or endorse/campaign for a candidate to get positions in the government (ambassadorships,  cabinet positions, etc) under republicans and democrats… That’s like saying water is wet. \n\nMoney makes the political world go round, not saying that’s great, but it is certainly not exclusive to one party (and if you think it is, I have a bridge to sell you). \n\nGenuinely don’t understand the obsession with Elon, but I will offer some free advice, the democrat party should focus on learning lessons from 2024 (which they currently have not) if they want to win in 2026. Just my $.02",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Dijitol",
                                                                                                    "body": "Oh my question was about a whole department created by/for  Elon. Which now he’s not in charge of, I guess? But how often do a department created for a donor? \n\nI don’t see myself as obsessed with Elon because I don’t meet that criteria of obsession. I am a concerned citizen and this post is about Elon.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "itsmediodio",
                            "body": "If he wanted to enrich himself (beyond being the richest man in the world already) making himself the target of half the country and basically every government bureaucracy is the dumbest way to do it.\n\nThe truth is if Elon wanted to game the system and gain access to sensitive info needed to enrich himself he'd just call up a few favors and send out some \"donations\" (bribes) to the politicians and bureaucrats who run these departments....like every other ultra wealthy person has done since the beginning of government.\n\nLeftists used to understand this, but now that it's trump they're pretending that rich people were completely unable to manipulate and influence government and that corruption and waste is basically unheard of.\n\nNo, its the people LOOKING for corruption we need to worry about. Don't you know that they're YOUNG? I know we've been complaining about geriatrics running government for years but forget all that, these teeny boppers are gonna play minecraft with the nuclear codes! Nevermind that 20 somethings at basically every bank or financial institution with KYC has had access to your social, ID, and financial information for years without anyone giving a fuck.\n\nAlso did you know that Elon has CONTRACTS with the government? I mean he's had them for years along with security clearance with deep relations to the US government through Space X, with the ability to launch literal missiles over the USA, but to trust him with looking at receipts? OH MY GOD, THE COUNTRY HAS BEEN TAKEN OVER.\n\nAnd did you know NO ONE VOTED FOR ELON?!?!?! I mean nobody voted for the heads of any of the government bureaucracies either, and they've been without oversight for years which is sort of why we're doing this. Forget that Trump was elected with the popular vote in an election where basically every part of the country had a right wing shift and he specifically campaigned on doing exactly this with Elon, no THE AMERICAN PEOPLE WERE FOOLED. \n\nPeople are seeing through this transparent faux outrage bullshit so easily this time. Nobody is buying it and everyone knows democrats are full of shit on this and are just pretending to be upset because the orange man is behind it. If they cared about government security they'd have given a fuck about Hunter selling state access to the Big Guy through his shit paintings or Biden leaving boxes full of state secrets he was illegally keeping scattered across the floor of his garage.\n\nJust partisan bullshit. Nobody honestly believes Elon is stealing money or information. No matter how they try to spin it, nobody believes them, nobody cares but the most deluded fanatic.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "When Elon paid $180 million to Trump’s campaign and was then given power and access to our system, isn’t this gaming the system?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "If he really wanted to game the system he'd be working safely behind the scenes like most rich people. Being the public face of government efficiency only pisses off half the country and every single bureaucrat.\n\nBesides if the narrative is that Trump is so corrupt and Elon bribed him then obviously Elon wouldn't need DOGE, Trump would just discreetly give him whatever information without causing a fuss. Elon already has high level security clearance through Space X, it would be easy.\n\nAll these conspiracy theories are so far fetched under the slightest critique.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "j_la",
                                    "body": "Regarding young DOGE employees: didn’t someone at DOGE cut hundreds of jobs related to nuclear security only to hastily reinstate them? Could this be chalked up to youth and inexperience?",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "It's possible. \n\nSince the USAID doesn't have an age limit barring young adults from working there, like the DOE and all manner of other government bureaucracies, they could also have youthful mistakes as well, which would be a great argument for looking into them more.\n\nAs a side note, when I was 24 I managed the financial portfolio of a sixty million dollar government water trust. I had the ability move millions of dollars in and out of accounts on a whim, with my eyes on all the financials and personal information of various investors and government employees. It was a mid level position as part of a large financial firm, I had only maybe a year of work experience. \n\nNobody gave a shit. This scenario happens literally everyday, in every financial institution.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "j_la",
                                                    "body": "Wait, I’m confused: what does USAID have to do with nuclear security? That was within the department of energy. \n\nCertainly, young people sometimes hold important positions, but being able to cut jobs related to national security is a step beyond just “important”. Shouldn’t there be higher standards for experience and knowledge in such positions?",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "itsmediodio",
                                                            "body": ">what does USAID have to do with nuclear security? \n\nClearly we're talking about DOGE and their auditing of various government agencies. The USAID is a prominent one in the news right now, but I also said \"the DOE and all manner of other government bureaucracies\" if that helps.\n\nI highly doubt it was all done in a vacuum with one person just casually making the choice. I'd rather wait a few days to learn more, a lot of what's happening now is the left producing the most alarmist, absurd headlines like \"DOGE JUST RELEASED CLASSIFIED INFO\" only for it to then be revealed that the info was actually  released before multiple times on social media and wasn't actually pertinent to national security, except by then the alarm has already been rung and nobody cares about the truth.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "j_la",
                                                                    "body": "If the positions weren’t related to national security, why were they rehired?",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "itsmediodio",
                                                                            "body": "Wait sorry, I didn't realize you were referring to my earlier comment.\n\nI think you're combining two stories here. One is the firing and rehiring of nuclear staffers by DOGE. The other is DOGE supposedly releasing classified material on a different non-nuclear agency. I'm talking about the latter case where it was shown that the material that was classified was already public and wasn't actually related to national security.\n\nI want more time to learn more about the first story.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dijitol",
                                    "body": "Who is making sure Elon isn’t doing anything he isn’t supposed to be doing? Where is all this trust in him, coming from?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "JugdishSteinfeld",
                                    "body": "Should the voice of a man with more money than you be louder than yours?",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "author": "Independent-Fly-7229",
                                            "body": "At least we know he’s there and approve… we knew voting for Trump would hold a place in this administration for Elon we were told and they were HONEST! Who was running our government for the last four years? Do you even know?  It certainly was not Biden and you guys all admitted that he was loosing it and pulled him from running for another four years.  I don’t understand why you as an American are ok with BOTH sides of our government taking our hard earned tax money and pissing it away. It tells me one of two things … either you have a useless job or contract and are benefiting personally buy all this scam or you are 150 years old and are receiving a government check for nothing.   The place where all you guys go wrong is that we know that some of crazy stuff going on has also been republicans but we have spines and we have put them in check and through the strength of our vote are bringing them to task to clean it up.  Where are the democrats on any of it.  That’s why you’re disingenuous and have become irrelevant.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "fridgidfiduciary",
                                    "body": "Do you think he could be motivated by gaining power, not just money?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "Again, objectively this is the worst way for him to gain power.\n\nNo. If anything he has made certain that half of the country and likely the majority of the western world (or at least the people who control the western world) hates him.\n\nBeing a quiet democrat centrist made him the richest man in the world with the keys to space. He's only LOST going down this route.",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Born-Sun-2502",
                                    "body": "If Trump and Musk are altruistically looking for corruption, and no political gain,  why are they firing all the people in charge of overseeing... AG's, the Consumer Financial Protection Bureau, etc. This doesn't look the least bit suspicious to you?",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Amishmercenary",
                                    "body": "Preach!",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Present-Yard-7514",
                                    "body": "I mean Donald Trump had classified files at Mar a Lago so you can’t really use the “Biden had classified documents” without saying “Donald Trump had classified documents” also every leftist person I know dislikes Hunter Biden and that whole exchange. He should never have been given immunity. Just like Jan 6th people should have not been given immunity. I think the real question we should all look for is what did  USAID do that didn’t profit Elon Musk? He’s rich and trust me no rich person whether right or left has your or anyone’s best interest at heart. I will make a wager that after USAID is dismantled he is going to try to start some mismanaged AI aid system when people  start to see the repercussions from dismantling USAID and it will purely be to profit himself.  Regular run of the mill government employee’s atleast are like us. Normal people with normal amounts of money. USAID is 1% of the the budget that was started in 1961 to help the poorest of the poor including starving children and provide healthcare to prevent mass migration. Of those able to vote 28% of the country voted for Donald Trump. 60% of the country believes we should help those in need. Why not focus on another dept that uses more of the US budget like military??",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "Rule 1 and Rule 3. Don't ask leading questions and don't assume bad faith. It someone reported this comment it would be a ban.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "partypat_bear",
                            "body": "Yes I do but define enrich himself, obviously to the poor folk like us it means to literally become richer but this is a man that might as well have all the money in the world, what does he gain by using this position for self serving purposes? There is nothing to get but hate. He could do anything he wants in the world but he chose to put time and effort on the gov because he sees a broken system and thinks he can improve it. He also knows if he’s does he’ll go down in the history books as a positive influence along with whatever he achieves with space X and Tesla",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "j_la",
                                    "body": "I’ve always found this line of reasoning a bit odd (and it was used a lot in 2016 to brush off accusations of Trump corruption). At what point do the rich stop caring about acquiring wealth? Isn’t a hallmark of their personality type that the like gaining more? If Musk truly didn’t care about earning more money, why wouldn’t he give his companies away? Or do what Gates and Buffet are doing and donate it away?",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "partypat_bear",
                                            "body": "Not everyone starts a business with the sole purpose of making money, obviously Trumps businesses were but Elons companies are more so passion projects. He really thinks he’s going to advance humanity by getting us to Mars. You don’t sleep on the floor of your office for years just to donate it away because of questionable optics. Does that make sense to you?",
                                            "score": -3,
                                            "replies": []
                                        },
                                        {
                                            "author": "joey_diaz_wings",
                                            "body": "It's well known that if you pay politicians a great deal of money, for example equivalent to private industry executives, taking a bribe is not remotely worth the risk.\n\nWhen you pay modest salaries, you'll end up with career politicians who have never worked a real job or created anything, but mysteriously have millions made from shady deals.\n\nMusk likes creating. Buffet likes investing. Gates like control. When wealthy enough to pay for everything they need, each continues with their interests.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "j_la",
                                                    "body": "So when Trump gave away his presidential salary, was that a signal that he intended to be corrupt?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "joey_diaz_wings",
                                                            "body": "Do you think he's likely to become a career politician?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "j_la",
                                                                    "body": "Do shady deals only matter if the person isn’t intending to go back to another job?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "joey_diaz_wings",
                                                                            "body": "Career politicians in democracy earn millions selling access to power. They're not remotely interested in representing the interests of citizens.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "j_la",
                                                                                    "body": "And if Trump ends up selling access to power for millions, will that matter?\n\nEdit: has he not already done so by giving Elon unfettered access in exchange for a massive campaign contribution?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "joey_diaz_wings",
                                                                                            "body": "It appears Elon's role is to help cut waste and fraud so there is still a nation left in a few years.\n\nIf deficit spending continues at the pace of the last decade, there will be no nation left after debt servicing eclipses all else. This is the last chance to save the country from drowning in debt.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "j_la",
                                                                                                    "body": "If the GOP was serious about saving the nation from debt, why would they be proposing tax cuts? Low spending and high taxes would be the fastest way, wouldn’t it?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "joey_diaz_wings",
                                                                                                            "body": "Perhaps the plan is to cut so much waste and fraud while restoring healthy tariffs so the IRS can be eliminated and we can return to pre-IRS prosperity.\n\nPaying taxes just to waste them, have the funds stolen, and fund programs not in the public interest isn't a good use of money. Just stop spending and return to the basics instead of spending that doesn't serve the public good.",
                                                                                                            "score": 0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dijitol",
                                    "body": "It’s well known that politicians are corrupt. Especially when it comes to dealing with money. Since we don’t have oversight on what Elon is doing, how would we know if he’s corrupt or not?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "partypat_bear",
                                            "body": "What type of corruption are you worried about? Elon bribing NASA to continue his contract with space X? Getting the gov to buy more Teslas? I’m really curious what you have in mind that Elon would even want",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "More power and money. Do you believe he doesn’t want more of that? How do we know what he’s doing if he’s not beholden to the people? Who watches the watchmen if not the people?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "partypat_bear",
                                                            "body": "No I don’t think more money is enough of a motivator to put his other extremely lucrative businesses on the back burner to focus on the gov. Power yeah sure but more specifically I believe he wants success and the prestige it brings. What would being beholden to the people look like to you?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "Transparency and accountability to the government. What makes you think he has to put his businesses on the back burner if he wants to get more money? He’s gotten billions from government contracts. If he wanted to truly save money, why not donate his services to the people?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "partypat_bear",
                                                                            "body": "Aside from making a twitter page specifically for Doge that outlines everything they’re looking at hourly and holding press conferences every week, how could he be more transparent? and your right he has gotten some massive gov contracts in the last few years, so why would he need to do sneaky shit going forward, he’s already getting everything he wants",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dijitol",
                                                                                    "body": "Are you ok with just tweets and no actual official reports? \n\nI expect the wealthy to want to get more wealthy.He is the richest man in the world. \n\nDid being wealthy ever stop someone from committing fraud, insider trading, corruption, collusion, nepotism, theft, etc etc …?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "partypat_bear",
                                                                                            "body": "I am okay with tweets and screenshots, there’s enough eyes on him that if something shady comes up it’s going to get noticed. Ik it’s a common belief that every rich person is inherently greedy, sure many are but there are plenty of exceptions and I do think Musk is one of them",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Dijitol",
                                                                                                    "body": "What “eyes” are you talking about? A third party overwatch government entity? If Musk isn’t greedy, why doesn’t he just donate his services to the government instead of accepting millions of tax payer dollars? He is the richest man in the world. He’s halfway to becoming the first trillionaire in history of the world.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "partypat_bear",
                                                                                                            "body": "These are real programs he’s cutting with real people involved, anyone affiliated with something that shouldn’t be cut can speak out. I’m sorry but that’s absurd to suggest he should provided starlink/ space X services and R&D for free to the gov, there’s a difference between being greedy and having sane business practices. I don’t care how rich he is Space X wouldn’t last 5 years without the gov supporting it, they have no revenue stream besides merch lol but the value they are providing to the US is immeasurable. We don’t talk about the space race the same way we did during the Cold War but it’s bigger than ever now",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Dijitol",
                                                                                                                    "body": "Do you have a response to my first question about accountability and transparency?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "partypat_bear",
                                                                                                                            "body": "My humble opinion is that he is being transparent and he will be accountable to the public, not just the government.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Dijitol",
                                                                                                                                    "body": "So we have checks and balances to keep the government on the up and up. It’s not bulletproof but at least they are beholden to the people. What do we have to keep Elon in check?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dijitol",
                                    "body": "How long do you think before he becomes the world’s first trillionaire?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "partypat_bear",
                                            "body": "Idk Chinese EVs are gaining popularity and Tesla is his main source of wealth I believe. He’s a bit under 400 billion right now so maybe never? It’ll be awhile if at all",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "What about his plans to colonize mars? Seems like space X could get more government contracts more. What do you think?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "partypat_bear",
                                                            "body": "That’s a huge investment that he’s not going to see a return on in his lifetime, but that is something very important to him and I’m supportive of it, I just can’t predict a timeline on something so big. Space X is already more active than NASA and he already has contracts and close collaboration between them, besides I don’t think he’s ready to make any significant moves towards that goal in the next 4 years. I don’t think him and trump in the White House changes anything for that project imo",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Apex-_-demon",
                            "body": "That’s just fear monitoring. It’s already confirmed that the employees have read access only.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Why does that mean Elon is trustworthy?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Apex-_-demon",
                                            "body": "I think you’re failing to see the point you don’t have to trust him, but it’s already proven that employees have Read access only and in my opinion they’ve been pretty transparent on their showings and trusting the government with your money is actually kinda of a bootlicker take",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "All I’ve seen are tweets and headlines. Did they put out an actual report? \nHow did confirm that they only had read-only access? \n\nWhy did you make the boot licker comment? Do you think I am bootlicker?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Apex-_-demon",
                                                            "body": "Yes, the White House has confirmed that they only have read-only access. I’m sure that once everything is compiled, there will be an official report. This is nothing but an audit—that’s it. My question to you is, why are you so against an audit? Until there is actual evidence of Elon “enriching” himself, I believe your criticism is misplaced, especially when there is already evidence of wasteful government spending. As for the “bootlicker” comment, it’s simply a statement of fact about what a bootlicker is. Why? Are you afraid you might fit that definition?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "time-to-bounce",
                                                                    "body": "Aren’t audits usually purely focused on discovery, assessing the current state, coming up with the ideal future state, and then taking action from there? Seems to me that this ‘audit’ has a lot of actions being taken before it’s fully understood where the fat is that needs to be cut",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "I’ve never said I was against an audit. Why did you think that? How do expect to get evidence of corruption when the people aren’t auditing the auditors. \n\nNo. I consider a bootlicker as someone who doesn’t mind being in the dark when it comes to oligarchs taking over the government.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cjbronx225",
                            "body": "This is the kind of thinking that kills me. Do people not realize how much he is already worth? Like a half trillion dollars. Enrich himself? That’s like saying the water is gonna get wet.\nThis guy can lose 400 million dollars everyday this month and that’s still not even 5% of his worth",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Why do you feel that rich people don’t want more riches? If Elon doesnt need the money, why Doesnt he just donate his service to the government instead of taking precious tax payer dollars?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Ronzonius",
                                    "body": "Why do people think that being the wealthiest person on the planet makes you unable to be greedy, self-serving, or interested in power and money?\n\nWouldn't you expect someone to have all these characteristics to BECOME that rich in the first place?  When did being rich and powerful ever stop him before?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "riskyrainbow",
                    "body": "What evidence is there exactly that any of this was caused by an alleged deep state? Everything under USAID's operations is authorized by congress and, aside from programs related to national security, public record.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "thenewyorkgod",
                    "body": "how deep can the deep state be if a simple scan of computers and documents that anyone in the agency can view, and definitely trump,  can fully reveal their evil plot?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "partypat_bear",
                            "body": "I would refer to the Mike Benz Joe Rogan podcast from last week, I know it’s long but I’d say it’s worth while. It’s really not that deep and I didn’t say it was evil, but it is wild and it is wrong what they’re doing",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zanabanana19",
                    "body": "How do you define or understand \"the deep state\"?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "The deep state is the network of unelected bureaucrats who have substantial power to alter, affect or block policy decisions from elected leaders.\n\nFor example, the FEMA officials who paid $59 million to house migrants in hotel in defiance of Trump's executive orders, the FBI staff who leaked information on ICE raids, the Treasury dept staff who were instructed to approve all payments even those to known fraud or terrorist groups, or the 51 current and former intelligence agency officials who signed a letter calling the Hunter Biden laptop story Russian disinformation in an election year, or the individuals who were admitting to \"throwing gold bars off the Titanic\" in the final days of the Biden administration knowing Trump would have prevented that funding. \n\nMore nefariously, USAID money has gone to organizations and programs that simply had nothing to do with good public policy or public interest but benefitted people and agendas that would have not gotten taxpayer money otherwise.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zanabanana19",
                                    "body": ">unelected bureaucrats who have substantial power to alter, affect or block policy decisions from elected leaders.\n\nSo like, Elon Musk?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "Elon campaigned with, for and on behalf of Donald Trump to do exactly what he's doing, is being extremely transparent in what DOGE is doing, and the polling data indicates DOGE is popular. People voted for Trump on the promise he'd appoint Elon to recommend massive spending cuts.\n\nSo, exactly the opposite of Elon Musk is what you meant.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "zanabanana19",
                                                    "body": "Was Elon musk elected?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "Let me preempt the point you're trying to make here with bad faith questioning:\n\nElon Musk is not in an elected position. He was appointed by Trump to his job. There's nothing wrong with political appointments; the government has to get staffed *somehow*.\n\nThe deep state is not political appointees per se. The deep state is the network of unelected bureaucrats who have inordinate, unaccountable power in the government. I gave specific examples. The FEMA staff who pushed funding to hotels for housing migrants in spite of the president's agenda are the deep state. The staff who pushed billions of dollars to a bank in order to disburse it to other programs and agencies to counter Trump policies are the deep state. The FBI staff that leaked ICE raid information to help criminal migrants avoid law enforcement are the deep state.\n\nMusk ran with Donald Trump to do what he is currently doing. People voted on that. DOGE activities and findings are posted daily on X. Musk has more right to claim that he was elected or has popular support for his tasks than, say, Miles Taylor who wrote a NY Times op Ed in 2018 wherein he claimed he and his colleagues were resisting Trump policies from inside the administration.\n\nEdit: to be double clear, so you cannot feign ignorance.\n\nPolitical appointments are not bad. That is not what the deep state is. The deep state is people positioned in the administrative aspects of the government who use their positioning to influence or resist policy or push their own policy regardless of what the American people voted in. It's the office manager inside some personnel department who still practices DEI policies in their hiring. It's the office drone who sees paperwork cross their desk and anonymously leaks it to the press to stir controversy. It's the people like Miles Taylor who have a job they are hired to do and use it as a springboard to run their own agenda and impact US politics from behind the scene with no accountability.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "Who specifically has been part of the deep state?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "proquo",
                                                                            "body": "I gave a specific example in Miles Taylor, who was a chief of staff for DHS under Trump. He wrote an op ed in which he claimed to be resisting the Trump administration from within, and later formed a group of ex administration officials who essentially campaigned against Trump in 2020.\n\nAnother example would be the 51 intelligence officials who signed a letter avowing the Hunter Biden laptop story as Russian disinformation. \n\nAnother example is the FEMA staff who authorized $59 million dollars to hotels for housing migrants in violation of Trump executive orders.\n\nLindy Li has also openly named several Biden administration officials were responsible for everything from hiding Biden's cognitive decline to writing policy to creating guest lists. She specifically stated that these staffers were quietly running the country during periods of time.\n\nJames Comey is another example, having kept notes on his meetings with Trump and releasing them to the press through proxies.\n\nReality Winner is another example, having used her position as an NSA contractor to leak intelligence information to the press.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dijitol",
                                                                                    "body": "How is your definition of deep state, any different from an appointed official fulfilling an agenda for the administration?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "proquo",
                                                                                            "body": "Because these are individuals *not* fulfilling the agenda of the administration, and I don't think that was ambiguous in my prior statements.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Dijitol",
                                                                                                    "body": "I just seen what you wrote. I misunderstood.  \nHow does any of those people have unaccountable power?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "proquo",
                                                                                                            "body": "Because a mid or low level federal employee cannot be voted out or be subject to public oversight. If someone in a bureaucratic post decides to slow walk a policy, or flags something for additional review to slow its progress, or leaks information to the press in order to generate public outcry they aren't in a position to be held accountable to the American people.\n\nMiles Taylor was purposefully working to resist Trump policies from his position within the Trump administration. No voter got a say as to whether or not they wanted that, no one had any oversight over his actions and he was abusing his official capacity to oppose the elected government and hasn't seen a day inside a jail cell.\n\nNot only is it unethical but it's downright authoritarian for these people to undermine an elected government.\n\nOn the flipside you have the administration staff was quietly running the country while Joe Biden was not cognitively able to do so, including his son Hunter and his wife Jill who were sitting in on everything from cabinet meetings to national security briefs. No one voted for the appointees in the white house to be running the country and there are mechanisms for the president to be removed from office if he is incapable that were not exercised. There is no way for voters to hold those people accountable, and none of those people has faced any consequences for essentially deceiving the American people. \n\nIn some cases the power of these bureaucrats is quite literally unable to be accounted. The CFPB doesn't have its funding authorized by Congress nor does it have Congressional oversight. The CFPB requests funding directly from the Federal Reserve and the Federal Reserve authorizes it. Trump's acting CFPB director canceled a request for nearly a billion dollars in funding from the Fed to the CFPB. That level of unaccountability essentially allows the agency to operate in any manner it pleases with no need to justify or report on its doings.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Dijitol",
                                                                                                                    "body": "You consider Miles Taylor to be mid or low level federal employee? \n\nAnd if any of those employees decide to go against the agenda, they would be subject to consequence from their government, which the government is beholden to the people. \nWhich by proxy, those employees are beholden to the people.\nIs that not accurate?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "proquo",
                                                                                                                            "body": "> You consider Miles Taylor to be mid or low level federal employee?\n\nYes. Why wouldn't he be? A high level federal employee would be a congressman or arguably a cabinet member. \n\n> Is that not accurate?\n\nNo, obviously not. I'm not sure how you can think it would be given the examples shared. Miles Taylor faced no consequences for actively opposing the government he was appointed to support. He used his position that gave him access to high level discussions and information to undermine the president that was elected to execute a policy agenda. He kept himself anonymous until after he'd left the administration and never faced any professional backlash.\n\nOther rogue members of the Trump administration also escaped any consequences for actions ranging from FISA court abuses to leaking sensitive or classified information to the press.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Dijitol",
                                                                                                                                    "body": "Specifically, How did he actively undermine the administration? What kind of consequence should he face? How is anyone of that government position supposed to accountable to the people when they’re already accountable to the government?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "proquo",
                                                                                                                                            "body": "> How did he actively undermine the administration?\n\nHe used his position in DHS to slow the implementation or block the execution of immigration policies, and he has stated in interviews he and his fellow subversives leaked information to the media. He stated there were discussions amongst certain Trump administration officials about invoking the 25th amendment to remove Trump from office. While still part of the Trump administration he anonymously penned an article where he claimed there were multiple officials in the Trump administration working behind the scenes to resist his policies, and also anonymously wrote a book where he divulged information about the Trump administration and disparaged Trump's leadership and decision-making.\n\n> What kind of consequence should he face?\n\nHe should have been fired, and potentially sued or prosecuted for violating non-disclosure agreements. In my ideal world there would be criminal liability for undermining the agenda of the elected leadership through subversion. If he truly felt that strongly about it he should have done the honorable thing and resigned and raised his concerns publicly and transparently.\n\n> How is anyone of that government position supposed to accountable to the people when they’re already accountable to the government?\n\nI don't think you understand what I am saying.\n\nI'm not saying that these positions *should* be accountable to the electorate. I'm saying they are not, as a matter of course. Miles Taylor specifically was appointed to his position but the deep state is primarily the career bureaucrats who sometimes serve for multiple presidential administrations, ostensibly to do a job in a government department but have the ability to influence policy by using the available systems to slow walk, block or resist policies. A government employee who marks paperwork for increased review, knowing that it will slow the implementation of the process, is an example.\n\nThese people should be fired from government and in the most egregious cases be criminally prosecuted. The problem is they often are never even identified. Miles Taylor didn't even reveal his malfeasance until 2020. There are numerous other such subversive actors in government, many of them occupying bureaucratic \"office jobs\" that use their positions and the normal systems of government processes to resist policy.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Dijitol",
                                                                                                                                                    "body": "Ok. So what I’m hearing is that a deepstate person/agent(?) is generally anyone (except an elected official) working against the current administration at that time. Right?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "proquo",
                                                                                                                                                            "body": "I would point back to the definition I gave originally:\n\n> The deep state is the network of unelected bureaucrats who have substantial power to alter, affect or block policy decisions from elected leaders.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                    "body": ">The deep state is the network of unelected bureaucrats who have substantial power to alter, affect or block policy decisions from elected leaders.\n\nLike Musk the unelected bureaucrat with substantial power who is actively altering, affecting, and blocking elected Congress?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                            "body": "Musk isn't a bureaucrat. He's also not unelected. He campaigned with, for and on behalf of Trump with the promise of doing exactly what he's doing. Trump ran on a promise of downsizing government and using DOGE to do it. He won the popular vote and is maintaining his highest approval rating yet, even going positive for the first time by some polls.",
                                                                                                                                                                            "score": 0,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                    "body": "Uhm, you know there's a difference between elected and appointed right?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                            "body": "Well firstly Musk is a \"special government employee\". That's an unpaid status on a temporary basis. Not a bureaucrat. \n\n2nd, you and your ilk are spinning this leftist false narrative that Musk is an unelected bureaucrat. The Trump platform was to put Musk in charge of DOGE and for DOGE to make massive cuts. Elon Musk campaigned for Trump on the basis he would be willing to make massive spending cuts for Trump. People voted for the Trump agenda which included DOGE. People voted for RFK Jr, too, who was running on the Trump agenda. Crying \"unelected, unelected!\" Is grasping at straws to justify your absolutely atrocious stance.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                                    "body": "You didn't answer my question so I'll ask again. Do you know the difference between elected and appointed?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                                            "body": "I answered your question, you just didn't like it.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                    "body": "[removed]",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "AskTrumpSupporters-ModTeam",
                                                                                                                                                                                                                            "body": "your comment was removed for violating Rule 1. Be civil and sincere in your interactions. \nAddress the point, not the person. The subject of your sentence should be a noun directly related to the conversation topic. \"You\" statements are suspect.\nConverse in good faith with a focus on the issues being discussed, not the individual(s) discussing them. Assume the other person is doing the same, or walk away.\n\nPlease take a moment to review the [detailed rules description](https://www.reddit.com/r/AskTrumpSupporters/about/rules/) and [message the mods](http://www.reddit.com/message/compose/?to=r/AskTrumpSupporters&subject=Comment+Removal) with any questions you may have. Future comment removals may result in a ban.\n\nThis prewritten note was sent manually by one of the moderators.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                        },
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                                                            "body": "It's funny how the fascists go around pointing the finger at others calling them fascists.",
                                                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                                                                    "body": "I'm fascist because I want freedom and democracy and adherence to the constitution and no kings in America? You know my values are literally the definition of anti-fascism right? \n\n[Fascism is a far-right, authoritarian, and ultranationalist political ideology and movement, characterized by a dictatorial leader, centralized autocracy, militarism, forcible suppression of opposition, belief in a natural social hierarchy, subordination of individual interests for the perceived good of the nation or race, and strong regimentation of society and the economy. Fascism is opposed to anarchism, democracy, pluralism, egalitarianism, liberalism, socialism, and Marxism, fascism is at the far right of the traditional left–right spectrum.](https://en.m.wikipedia.org/wiki/Fascism)",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                },
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                    "body": "You know it's a lie that Trump has high approval in the polls, right? \nAccording to a recent Gallup poll, Trump's approval rating on the economy stands at 42 percent. This is lower than any president's first-term February reading in recent history, Gallup notes, including those for Joe Biden (54 percent), Barack Obama (59 percent), George W. Bush (53 percent) and Bill Clinton (45 percent).\n\n[worst polling in recent history](https://www.newsweek.com/donald-trump-economy-polling-vs-recent-presidents-2033865)\n\nYou know that 83% of Americans disapprove of Trump's pardon of the Jan 6 rioters right?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                            "body": "Lol no.\n\nTrump has positive approval in several polls and his avg is the highest he's ever had, even positive depending on what polls you look at. Funny you don't mention that Biden's economic approval was 38% last year...",
                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                                    "body": "Why are you not looking at the actual polling instead of parroting whatever trump says about himself? You know we're not talking about Biden, right?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                                            "body": "I am talking about polling.\n\nRealClear is +1.3, FiveThirtyEight is also +1.3. He's positive for the first time.\n\nI brought up Biden because you're whining like an infant about Trump's economic approval. Biden ended his term with historically low approval on the economy. Trump inherited a bad economy. The media is already starting its multi-billion dollar slander campaign against the Trump administration when he's only been in for a month. I'm not surprised some polls show him with low approval, especially with a significantly divided electorate.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                                                    "body": "Share your sources?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                                                            "body": "I literally did.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                                                                    "body": "Link. Url. To. Sources?",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                                                                            "body": "Because you aren't smart enough or don't pay enough attention to the news to know CNN and others have been talking about Trump's high approval ratings, or you weren't paying attention to the news before the election talking about Biden's approval rating being so low no president ever won reelection at that level?\n\nOr just because you're lazy?",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                                                                                                                    "body": "Because you don't have a source to link to that supports your lies because, well, you're lying? Can you share links to prove your claims?",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "zanabanana19",
                                                                                                                    "body": ">Not only is it unethical but it's downright authoritarian for these people to undermine an elected government.\n\nYou mean like how Trump/Musk are downright authoritarian and undermining our elected Congress?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "proquo",
                                                                                                                            "body": "Are you able to reply in any way that isn't downright classic Trump Derangement Syndrome?\n\nTrump is not undermining Congress.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "zanabanana19",
                                                                                                                                    "body": "You know you're lying because Congress has the power of the purse, not trump or musk, right?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "proquo",
                                                                                                                                            "body": "And the OMB is in the Executive Branch and the Constitution gives ALL executive power to who?",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "zanabanana19",
                                                                                                                                                    "body": "Why do you hate facts and real American history?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "proquo",
                                                                                                                                                            "body": "So you don't know?",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Dijitol",
                                                                                    "body": "This miles Taylor? \n\n >In the administration of the latter, he was an appointee who served in the United States Department of Homeland Security (DHS) from 2017 to 2019, including as chief of staff of the DHS.\n\nHow does this position not have accountability to the people?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "proquo",
                                                                                            "body": "Because it is A) an appointed position as opposed to an elected one, B) not directly answerable to elected government, and C) positioned to enable the person occupying the role to do things like organize a ring of anonymous staff to resist the elected government. \n\nI'm not sure how this is even a question.\n\nWhen an elected figure like AOC or Chuck Schumer does something they are ultimately answerable to the people, and their actions are a matter of public record.\n\nWhen an unknown bureaucrat does something they are essentially anonymous and unable to be accounted for if their leadership doesn't want to hold them accountable. The job of someone in a position like DHS chief of staff is to execute the president's agenda, not oppose it quietly behind the scenes. Miles Taylor hasn't had to answer for, in his own words, deliberately undermining the Trump administration along with other administration officials. I'm not sure how you can see what he did and come to any conclusion that doesn't see it as a problem.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "zanabanana19",
                                                                                                    "body": ">A) an appointed position as opposed to an elected one,\n\nYou mean like Elon Musk? \n\n>C) positioned to enable the person occupying the role to do things like organize a ring of anonymous staff to resist the elected government. \n\nYou mean like DOGE, right? \n\nYou're SO close to comprehending what's going on, aren't you?",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "zanabanana19",
                                                                    "body": "You realize that Trump ran with JD Vance and not Elon Musk, right?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "partypat_bear",
                            "body": " its a loose term usually referring to unelected bureaucrats who's goals/motives are not in line with the publics",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "j_la",
                                    "body": "Who determines what is in line with the public’s goals or motives?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "joey_diaz_wings",
                                            "body": "Accumulating worthless debt is not in the public interest. A few more years of increasingly runaway debt and the nation is over. But overspending public money is in the interest of politicians who get immediately elected and try to sell their power or transition to a better personal job after office.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "j_la",
                                                    "body": "I’m sorry, but this didn’t answer my question. Who determines what is in the national/public interest?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "joey_diaz_wings",
                                                            "body": "Politicians work on behalf of their own interests. They get to make the determinations of what happens, so they do not typically pick what the people want.\n\nWith public polls and policy analysis it's easy to see what the public wants and whether policies will help them or have some other effect. Politicians give fake motives to help themselves, without concern for the costs incurred that the public has to accept.\n\nFor example, in every nation, the people do not want third world immigration. Yet politicians insist on importing millions of random, unwanted, costly people. It's hilarious chaos.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "OkNobody8896",
                                    "body": "Who’s goals/motives are they “in line with”?\n\nCan you provide any evidence for your claim?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "partypat_bear",
                                            "body": "Their own.\nEvidence of what claim?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "OkNobody8896",
                                                    "body": "What’s “their own” motives?\n\nWhat evidence can you produce besides your own suspicions that they’re following a set of monolithic goals/motives?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "OkNobody8896",
                                                                    "body": "All of these individuals are members of congress, no?\n\nIs that who you believe constitutes the “deep state”?",
                                                                    "score": 4,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "flowerzzz1",
                                                                    "body": "Where do you get these figures? \n\nhttps://wisconsinwatch.org/2024/02/elizabeth-warren-senator-massachusetts-net-worth-fact-brief/",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Born-Sun-2502",
                                    "body": "When you write that description, I can't help but think you're describing Elon Musk. Where did the idea that the \"deep state\" only operates on the left side of the aisle come from?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "partypat_bear",
                                            "body": "But hes not a bureaucrat, he was at the forefront of Trumps campaign so in a way, he was voted for, and majority of the country approves of what hes doing right now. On your 2nd point, I specified it was bipartisan deep state not just democrat so idk what your talking about",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "rthorndy",
                                                    "body": "Can you provide a source backing up \"the majority of the country approved of what he's doing\"? \n\nI suspect it is the exact opposite: the majority of the country absolutely *does not* support his actions. This seems intuitive to me, since only roughly 32% of eligible voters voted for Trump. I'm sure *some* people who didn't vote are currently supportive of Elon's actions, but not enough to make it the majority. Not even close. Why do you see it differently? What data are you basing your opinion on?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "partypat_bear",
                                                            "body": "My bad I meant majority of voters not majority of the country",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "rthorndy",
                                                                    "body": "So, isn't that somewhat irrelevant? If you agree that the majority of the country is against his actions, it's not something that should be supported, right? \n\nThere's no way to *know* what the majority think right now, but if we both *suspect* the majority wants something different, shouldn't we both be advocating for change?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "partypat_bear",
                                                                            "body": "Whoa you made a leap assuming majority of the country is against his actions. We don’t know that. BUT, if anything’s irrelevant, it’s the opinion of people that didn’t care enough to vote in the first place",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Born-Sun-2502",
                                                    "body": "If he's not a \"bureaucrat\" as the head of a *supposed* governmental agency (made up though it may be) how would you describe his current role? I'm SO confused.\n\n\nNo, he was clearly NOT voted for and I would beg to differ that the majority of the country approves. Perhaps according to the Fox News polls.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "partypat_bear",
                                                            "body": "Maybe I should have said career bureaucrat but that seemed redundant, he’s an independent CEO 5 times over that just so happens to be overseeing a short term gov project. They couldn’t be further apart.\nTo your second part, idk what else to say except to reiterate he was a huge part of the campaign, same with RFK and Tusli, we voted for all of them at once by voting for Trump. I didn’t mean to say majority of America though, I meant to say majority of voters.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Born-Sun-2502",
                                                                    "body": "So... by that logic if Kamala had been elected we would have defacto been voting in her largest single donors? So... Bill Gates for example. It'd be cool with you if he was then given a \"short-term oversight role\", came in and froze a bunch of congressionally approved federal funds, fired hundreds of thousands of employees, etc? Because he had a mandate? Because Harris GAVE him permission to do so. But ONLY came in and cut say defense spending, business subsidies, and anything considered \"conservative\" (including tax shelters for religious institutions which imho should be cut anyhow). That'd be cool. Oh and let's not forget that he's specifically cutting agencies that are investigating government contracts he has for violations. Private business violations. Still good?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "partypat_bear",
                                                                            "body": "...if Bill Gates campaigned with her, advertising himself for that position, and the public voted for her/it, I wouldn't think any more or less of it than if Kamala did it herself, after all, they have the same position; she's just delegating that oversight to him in her stead. I would LOVE for them to cut tax shelters for religious institutions btw. so yeah still good :)",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Born-Sun-2502",
                                                                                    "body": "Wait, Musk advertised himself for a position? And I just want to be clear, a vote for Trump was a vote for Musk to have absolute power. This is your assertion?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "partypat_bear",
                                                                                            "body": "why does that sound weird to you? of course he did, he came up with the concept of DOGE (or at least ran with it) and said he'd head it, Trump supported him the whole time. seems *really* clear to me. I mean we can joke about Musk being the Prez all day but in reality, Trump has the final say so I find it absurd to suggest he's been given absolute power.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Born-Sun-2502",
                                                                                                    "body": "I'm curious why it *doesn't* seem weird to you? Yeah we've had private donors influencing policy behind the scenes for years in return for donations, but giving credit where credit is due no politician has ever been this up front and blatant that they were bought and paid for and directly ceded power and control to said person.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "partypat_bear",
                                                                                                            "body": "edited to make it clearer- I thought you were hung up on the term advertised but ok I mean yeah its not the norm for a huge donor to get a big position like this but it would be a lot more weird if he didn't campaign with him. If he was doing all of this behind the scenes, that would be outrageous, If he came out of the blue and got a position after, that would be outrageous, if Musk wasn't uniquely qualified through his own business experience, it would be outrageous, if Trump ACTUALLY ceded power to him, that would be outrageous. But none of that is the case.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "iamjohnhenry",
                    "body": "What was Trump focused on during his first administration?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "partypat_bear",
                            "body": "not USAID",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Interestofconflict",
                                    "body": "I think you misread the question?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "partypat_bear",
                                            "body": "It’s a lame question",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "iamjohnhenry",
                                                    "body": "Is it possible that the question isn’t lame; but rather that the person who answered is fearful that actually engaging with legitimate questions would expose their ignorance?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "partypat_bear",
                                                            "body": "Anyone can look up Trumps accomplishments from his first term, why would I reiterate something that is common knowledge and not even my opinion",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "iamjohnhenry",
                                                                    "body": "Are you not familiar with how discussions work? Sure, we can look at failed attempts to ban Muslims, failed attempts to strips Americans to of healthcare, successful attempts to implement tax policies that screw over the majority of Americans, and his desperate attempt to dismiss a pandemic as an attack on him personally, but I wanted to hear your perspective. The fact that you’ve responded multiple times and failed to suggest a single thing supporting your argument is telling. Again, what was Trump focused on in his first term?",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "proquo",
                    "body": ">  I'm guessing the explanation would be that Trump was focused on a million other things and overlooked a lot.\n\nAccording to insiders like Tulsi, and alluded to by Trump himself in his Rogan interview, he didn't understand Washington and had to rely on a lot of advisors who were themselves part of the DC machine and recommended a lot of people who were in turn very much establishment figures.\n\nOne former Trump admin staffer has said outright Trump planned to target USAID in his 2nd term and they were ready to go before the Biden Administration stopped them.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jankdangus",
            "body": "Because it wasn’t being operated under Trump himself, but rather the deep state or the fourth branch of government. Btw Trump did actually try to cut foreign aid in his first term, but congress blocked it. \n\nIf DOGE wants to stay in the legal realm of cutting waste, fraud, and abuse then they should only be listing it and then get the cuts pass during budget reconciliation. \n\nIt seems like the media is saying that they are trying to undermine Congress, which if they truly are then I don’t like it at all.",
            "score": -24,
            "replies": [
                {
                    "author": "tetrisan",
                    "body": "Why hasn’t Trump found this “deep state” he has been railing about for years? Where is this 4th branch? Why hasn’t DOGE found them yet? They seem to be finding all sorts of insignificant things, but can’t find the thing Trump has been big on.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "He did. That’s why Trump has declassified documents like JFK. The fourth branch of government is the bureaucracy. They are going after them with the mass firing.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Do you want or expect Trump to declassify the Epstein files?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "I do want and expect him to do so. Anna Paulina has already confirmed they will be declassified along with other classified documents that people want such as UFOs and COVID.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "tetrisan",
                                    "body": "What do you expect will really come out when they release the files?  Trump would know the specifics from his first term and he is not good at keeping things to himself so if it was really something big he would have blabbed by now. Did you know that Biden released a majority of those records in his term and still a nothing burger, so yet again no deep state, just crazy conspiracy wackos.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "The remaining files still has a chance to reveal that the deep state was behind JFK assassination given that it’s not heavily redacted. Crazy conspiracy wackos? Doesn’t polling show that most people believe the government has some role in his assassination? I think they did and the motive was because JFK wanted Israel to be classified as a foreign agent and he called out corruption in the MIC.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "tetrisan",
                                                    "body": "Do you think he was just a crazy Marine who was a good shot?  It almost happened recently by a kid with no training with all the tech and intel we have he still made contact.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "Nope, I saw Johnny Harris video of it and I’m convinced that there was more going on.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "colcatsup",
                    "body": "Why frame it as “the media” saying something?  Doge.gov has their own postings of all the stuff they’re canceling.   This would seem to be going against the spirit of congressional approval for spending at the very least.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Yeah, I haven’t been really paying attention of whether they are simply being listed to be cut or it has already been cut. I framed it as the media because they tend to misrepresent the truth or they tell it at a certain slant. Why do you think trust in MSM is so low now?",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "YoBoyDooby",
                                    "body": "But don’t you feel like - given how vocal this administration is - if the entire media were collectively lying about DOGE cancelling programs - that Trump / Elon and his team would be calling it a lie?\n\nThat was an awful sentence, and I apologize for it. Point being, wouldn’t Trump be calling BS of the liberal media was completely fabricating DOGE news?",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "driver1676",
                    "body": "If Trump can unilaterally decide to gut it, why didn’t he do that in his first term?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "He doesn’t have that power and I don’t support him circumventing congress. I believe in the constitution and the check and balances.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "driver1676",
                                    "body": "Could you clarify - do you mean he isn’t currently able to do it unilaterally, or that he is able to but only because there is a lack of an appropriate level of accountability that would otherwise prevent him?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "He isn’t currently able to do it unilaterally. I think there would be a constitutional crisis if he isn’t simply listing the items to be cut.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sophophilic",
                                                    "body": "So if cuts already happened it's unconstitutional?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "I guess that would be the case. Congress has the power of the purse after all.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nearlynorth",
                            "body": "In Trump's first term, he didn't know what he didn't know and has four years to reflect. Imagine if you could go back to high school with all your current knowledge.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "prompt_flickering",
                    "body": "Can you provide concrete factual basis of this \"deep state\" that has said to exist?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "JFK assassination was likely killed by the intelligence community, 9/11 was a set-up by the military industrial complex and in the behalf of Israel, 2020 election Hunter Biden laptop + mass censorship, and Trump assassination. \n\nThe deep-state is not based on concrete facts per say, but rather conspiracy theories. The ones I listed are the most compelling to me. I’m not a hardcore conspiracy theorist, so there are many that I don’t believe in.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "prompt_flickering",
                                    "body": "So the deep state can't be proven to exist, but there should be work to stop it from doing something that we can't prove is actually due to it? I'm not trying to be a smartass, I'm just trying to look at this objectively and logically.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Yeah, because the concept of the deep-state itself is secretive. It’s like Schrödinger cat, it exists, but at the same time it could not thus making it unfalsifiable claim.\n\nBut if you want a more objective and logical view of the deep-state then I guess it would be amorphous group that run the government. I includes the MIC, Big Pharma, Wall Street, the corporatist donor class, the intelligence community, the bureaucracy, and foreign governments like Israel.\n\nSo the second interpretation is literally just another word for the corruption in our government.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DanfromCalgary",
                    "body": "If you were to see government contracts to Tesla competitors cut and his own contracts expanded . Would you sleep soundly knowing that is the man in charge of corruption lol?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "No, but I think it would be a net win if defense spending overall goes down even if Elon own contracts isn’t touched.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "plastic_Man_75",
            "body": "You folks act like the gop party is a hive mind. It isn't",
            "score": -1,
            "replies": []
        },
        {
            "author": "JoeCensored",
            "body": "It's deep state fraud and waste.  To the extent its being linked to Democrats specifically is the woke spending, such as promoting DEI and trans issues in foreign countries.   You don't see any similar conservative issues being promoted.",
            "score": -14,
            "replies": [
                {
                    "author": "hadawayandshite",
                    "body": "What would be conservative issues you think USAid could/should be supporting?\n\nIn trumps first term they focused on prolife advocacy through the Mexico City rule and tried to focus on pro fossil fuel energy programmes",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "almosdef33",
                    "body": "Do you not think that they're not \"promoting conservative issues\" specifically bc they, the republican party, are doing the audit? For over a decade, the republican playbook/messaging has been \"democrats are evil\" and this is a great opportunity for them to add to that narrative. \n\nAlso, are you familiar at all with govt contracting? I've worked in govt contracting my entire adult career, and 99% of govt contract awards are published for the public to see. If DOGE was really finding corruption AND being transparent as they claim, they would release the contract numbers of the contracts they've terminated, instead of just providing tweets and screenshots. The information they're selectively releasing is such a red flag. They're telling you verbally - through Twitter, the WH press sec, and right wing media - when they could provide verifiable information such as contract numbers, which when looked up on SAM or FPDS, will have statements of work that show you the workload, fixed prices for government furnished property, what materials/software/etc. the contractor will need to furnish, basically everything the contract/program is doing and will do. \n\nThe framing of \"taxpayer money was stolen!\" gets people's attention and they did the same with inflation leading up to the election. They said they couldn't do anything about inflation right after trump won, and I wouldn't be surprised if they pull the same thing with the money they've found/saved/whatever they're saying in these audits.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "tiensss",
                    "body": "Can you give an example of this fraud? Especially since it was all approved by Congress.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "jdtiger",
            "body": "DOGE posted [this update](https://x.com/DOGE/status/1890849405932077378) yesterday, which includes the thing you're questioning why they won't post about",
            "score": 0,
            "replies": []
        },
        {
            "author": "-goneballistic-",
            "body": "Democrats seem to be the main beneficiaries. \n\nBut I don't care who is taking the money, it has to stop. \n\nAnd prosecutions for the theft needs to happen",
            "score": 0,
            "replies": []
        },
        {
            "author": "notapersonaltrainer",
            "body": "It's funny because as you say the findings aren't inherently partisan. It's the Democrats who are telling on themselves with their unhinged reactions about them being unearthed rather than what's in them. \n\n>which was a program heavily endorsed and promoted by Ivanka Trump\n\n>Are we really supposed to believe DOGE is being non biased\n\nYes, you literally just gave a great reason why. \n\n>Why no uproar about\n\nWe should be asking you guys this, lol. An Ivanka USAID deal would normally be red fucking meat for Democrats & MSM...unless they know they're *waaaay* guiltier. \n\nMy observation is many NS:\n\n1. Seem more obsessed about *who* found the waste than *what* was actually found. \n\n2. Further cocooned themselves since the election (banning links to X, flocking to safe spaces like BlueSky, etc). You guys can't mount an outrage cycle about things you haven't heard about. \n\nBut that's my guess. TS are probably glad to see this program go. We should be asking you why there's no uproar from NS.\n\nThe other notably quiet group is the foreign leaders of countries who supposedly \"benefit\" from these \"AID\" programs.",
            "score": 0,
            "replies": []
        },
        {
            "author": "WulfTheSaxon",
            "body": "Because Trump never succeeded in taking full charge of it in his first term. Now he has.",
            "score": 0,
            "replies": []
        },
        {
            "author": "DidiGreglorius",
            "body": "Republicans Presidents — including Trump in his first term — presided over a lot of wasteful spending, and were content to sit atop a largely Democrat-aligned bureaucracy and make changes at the margins. The current Trump administration is conducting the first meaningful, critical look at the crushing bloat of federal spending in a long time.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "What year is it? Slash and burn, cut that program as well.",
            "score": -2,
            "replies": []
        },
        {
            "author": "ZarBandit",
            "body": "The fact that all the right people are very angry, but have a hard time articulating the specifics of why it’s a travesty, is very telling.  Looks to me like all the gravy train recipients have been shut off.\n\nI’d go so far as to say all those complaining need to be investigated for how they benefitted and enriched themselves.  All of that needs to be exposed and highlighted.  Because I’d bet there’s a high correlation between the complainers and grift.",
            "score": -3,
            "replies": [
                {
                    "author": "DisorganizedSpaghett",
                    "body": "I don't think anyone has a hard time articulating why it's a travesty. And most of the people complaining have nothing to gain from the shutdown of the program, directly or indirectly, other than through a more likely chance of peace in each of those countries.\n\nDo you have any idea what the term \"soft power\" is or what the long history of using soft power to gain the upper hand in international politics is?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ZarBandit",
                            "body": ">I don't think anyone has a hard time articulating why it's a travesty\n\nAnd yet I'm still waiting to hear all the extremely worthwhile things our billions have bought.  So far I've only heard of waste and corruption.\n\n>most of the people complaining have nothing to gain from the shutdown of the program\n\nA good number of the people complaining are on the payroll.  And those are the ones we know about.  There will be more than those and further more those who get payment via a circuitous route.\n\nWhat soft power did Obama get for air dropping a cargo plane load of cash?\n\nNope.  The cacophony of screeching confirms we hit the bullseye.  If the Left isn't screaming and crying about it being the end of the world, Trump isn't being effective.  This is what I voted for: a painful adjustment for the swamp and the establishment.\n\nI read a news story today that DC home prices are falling because there's a sudden glut of homes for sale.  Now that's great news.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DisorganizedSpaghett",
                                    "body": "Couldn't I technically say the same thing any time Democrats decide to push doctor-led advice like gender and LGBT type shit? Like \"oh the Republicans are screeching clearly we're doing something right\"? Wouldn't that mean that everyone is right as long as someone is mad?\n\nAnd how is turning Detroit (good) into Detroit (bad) a good thing, with respect to suddenly nobody working on DC? Doesn't that just mean that Trump and his super wealthy allies are just going to buy up all the property, to own DC financially after any number of political changes, like they did during COVID many many times over, screwing over individual homeowners by the thousands?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}