{
    "title": "What do you want from budget negotiations?",
    "author": "Agentbasedmodel",
    "subreddit": "AskTrumpSupporters",
    "rank": 90,
    "score": 13,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1isi9t7/what_do_you_want_from_budget_negotiations/",
    "id": "1isi9t7",
    "selftext": "At the moment, Congress is being Congress and failing to agree on a budget. \n\nAny budget that can pass the senate, can't get a majority in the house without democratic votes. \n\nMembers of the freedom caucus want large budget cuts, but this can't pass the senate. \n\nWhat outcome would you like? Pursuing the freedom caucus route will lead to a shutdown. Would you welcome this? \n\nOr would you like a deal with the dems? If so, what are your red lines, what would you be willing to work on? Do you think the dems should work with Mike johnson to get a budget passed?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sshlinux",
            "body": "No foreign aid to Israel or Ukraine",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gaxxz",
            "body": "The key to winning over the Freedom Caucus is to demonstrate to them that the DOGE cuts, while they don't show up in the legislative spreadsheets, represent real budget cuts and justify voting for a less aggressive bill. That's what House Republican leadership should do.",
            "score": 1,
            "replies": [
                {
                    "author": "Agentbasedmodel",
                    "body": "This is an interesting plan. Do you want more aggressive cuts? Is your pitch to the freedom caucus pragmatic (politics being the art of the possible), or because you don't like their demands?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gaxxz",
                            "body": ">Do you want more aggressive cuts?\n\nWant? No, I'd prefer that the government do everything everybody wants. But we don't have the resources for that. And with 36 trillion of debt, I recognize that austerity is necessary.\n\n>Is your pitch to the freedom caucus pragmatic (politics being the art of the possible), or because you don't like their demands?\n\nWe need a negotiated budget deal. What passes in the Senate wouldn't necessarily pass in the House. Whatever rhetoric gets us to the end.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mrhymer",
            "body": "The last time that congress passed a full budget was 1996. The budget as means of funding government is over. Congress is a failure.\n\nShutting down the government will make DOGE's work that much easier.",
            "score": 1,
            "replies": [
                {
                    "author": "Agentbasedmodel",
                    "body": "What do you like about DOGE?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "I like that they are exposing what the left thought they would not find or would not touch. We need congress to back up DOGE with legislation to end corruption. Sadly that is extremely unlikely because congress cannot do a single good thing.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Agentbasedmodel",
                                    "body": "If its about ending corruption, why has he removed enforcement of several anti corruption laws? Including anti bribery legislation? Why has he disbanded the board in charge of enforcing Labour laws?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "> If its about ending corruption, why has he removed enforcement of several anti corruption laws?\n\nBecause deregulation is also a promise and going back to 2010 levels of bureaucracy is not going to hurt anyone.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "neovulcan",
            "body": "Maintain SS, Medicare, and the military. Audit everything, ensuring the dollars actually reach the recipients. Slash the rest.",
            "score": 1,
            "replies": [
                {
                    "author": "Agentbasedmodel",
                    "body": "So, along with debt interest, those account for >90% of the budget. The remaining ~10% includes stuff like farm subsidies (which I'm happy to cut) and scientific research (including medical, energy etc). A nation's long term prosperity is quite closely linked to r and d spend.\n\nDoesn't seem a whole lot to slash?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "neovulcan",
                            "body": "Based [on this](https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/2022_Total_US_Government_Spending_Breakdown.png/1280px-2022_Total_US_Government_Spending_Breakdown.png), education, welfare and other are 42%. Fully believe there's overspending and underspending in the military, based on experience. More of the former probably, but my experience is with the latter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Agentbasedmodel",
                                    "body": "Okay. European definition of social security is different. I guess I thought education spending (particularly maintenance grants etc) and welfare, and stuff like the VA which comes under 'other' counted broadly as social security. Do you just literally mean pensions for SS? \n\nIf education and unemployment benefits are what you want to cut, then fair enough. We can agree to disagree on that?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "neovulcan",
                                            "body": "I haven't seen anything wrong with social security as is.  Curious if any of DOGEs leads will actually be significant, but I like the system. It might not be my best retirement plan, but it keeps my parents out of my house in their old age, and I've seen it keep people from homelessness. \n\nWhile education is extremely important and something I wouldn't cut if it were being used right, the department of education needs to go. Teachers and students aren't feeling 90 billion reach their level. It divides out to $1700 or so per k-12, and the teachers in my family could spend that so much better than the government. Somehow it all gets lost in admin fees and probably corruption. DoE would've been my first target for DOGE.\n\nWhile I wouldn't cut capabilities from the military, those contracts need serious review. Billions to contractors that overcharge and under-deliver, if they deliver at all. Keep the people, guns, and maintenance. Scrap bogus \"development\".",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Agentbasedmodel",
                                                    "body": "Seems fair enough. I have to ask a question. I wonder if you knew that a large proportion of the education budget goes on things like pell grants to support poorer people going to college?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "neovulcan",
                                                            "body": "Wouldn't kill that entirely, but we have too many going to college in general. A degree doesn't mean anything anymore. All for some deserving people chasing a dream, especially if it promotes the family's status.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "A balanced budget period. nothing else matters to me, slash Medicaid, Medicare, SS, the military and EVERYTHING. Anything short of this is a massive failure. No I don't care about the negative effects this has on individuals. This massive cost cut will happen eventually and it's best to do it sooner than later.",
            "score": -2,
            "replies": [
                {
                    "author": "riskyrainbow",
                    "body": "What is the end goal of even having a budget other than the wellbeing of individuals? Why are you so concerned about some hypothetical debt crisis which we've been told is just around the corner for decades?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "That is 100% incorrect. Budgets have no feelings, budgets are simple math. If you go below zero, you have failed. Period.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "riskyrainbow",
                                    "body": "Why did you impose this non-mathematical restriction then? I agree, budgets have no feelings. Therefore, if it best serves the humans who do have feelings to have a deficit, we should have one. How did you come to the conclusion that deficit = failure? This is a moral value statement not a mathematical one.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Lucky-Hunter-Dude",
                                            "body": "That is incorrect. Having a deficit does not best serve humans.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "riskyrainbow",
                                                    "body": "Can you show me where I asserted that it did? I'm saying the budget is a tool, a means to an end rather than an end in its own right. IF it were the case that having a deficit increased wellbeing, would you agree it should be done?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Horror_Insect_4099",
                            "body": "That sounds eerily what some say about global warming - \"it's just a hypothetical crisis which we've been told is just around the corner for decades.\"  So let's do nothing, because our standard of living might suffer if we  start distancing our country from reliance on fossil fuels.\n\nI'm not saying I subscribe to above POV, but it sounds like a similar argument.\n\nBack on topic, even if most people don't yet feel the pain from huge deficits, our debt is growing exponentially and I don't see how it ends well.  We can worry about the \"wellbeing of individuals\" in the short term or long term.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "riskyrainbow",
                                    "body": "I wasn't asserting that it's ok to run major, long-term deficits by any means, I was just trying to demonstrate that the budget is an indicator of success not success itself. For example, I wouldn't be willing to cut the entire military for example just to balance the budget because a good ledger doesn't mean anything if you're undefended. Does that make sense?\n\nAdditionally, I would say this argument is different than the one described inasmuch as Climate scientists have already been validated in many major predictions, and the dates predicted for catastrophic change are in the future. The Reagan admin's economists predicted the entire nation would collapse by 2000 due to debt.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thechasepack",
                    "body": "They could just eliminate SS and Medicare payments but keep the FICA tax forever and that would balance the budget. Even closer if they got rid of the maximum tax on SS. How would you feel about this solution?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "paired with a balanced budget constitutional amendment that sounds fantastic.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Glad-Ad-4390",
                                    "body": "Do you have living parents? \nUnless you or they have massive savings or massive income, you’ll be paying all their bills and they’ll have to move in with you.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Lucky-Hunter-Dude",
                                            "body": "I do and no they won't. They retired in their 50's comfortably and planned on zero SS or Medicare. So if either of those are still around it's just a bonus.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Glad-Ad-4390",
                    "body": "It sounds like you are not in any of those groups so you don’t care. Would you feel differently if you instantly lost your source of income, and had to pay large additional costs for medical care, etc?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "Oh yeah it will suck. It is absolutely going to happen one way or another, it's better to at least be aware of it coming first.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fligglymcgee",
                    "body": "How are you feeling about the proposed budget increasing the deficit by 100 billion dollars for military spending over the next 10 years?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "See previous comment.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Agentbasedmodel",
                    "body": "Do you think that is the trump admins priority?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "Eliminating waste is a start but no I don't think they will take it far enough.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TooWorried10",
            "body": "More money to ICE is all I care about",
            "score": 0,
            "replies": []
        }
    ]
}