{
    "title": "How do you view Europe in terms of politics, economy and its relation with the USA?",
    "author": "Springstof",
    "subreddit": "AskTrumpSupporters",
    "rank": 81,
    "score": 16,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 63,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iubbup/how_do_you_view_europe_in_terms_of_politics/",
    "id": "1iubbup",
    "selftext": "As a European I am wondering what the image is that Trump supporters have of Europe. Obviously, Europe is not a monolithic entity and even with the European Union there is not nearly as much unity between countries as for example between the states in the USA, but broadly speaking, I have noticed a lot of negative opinions either directly from Trump, or from supporters of his. Now I know that the most extreme viewpoints are often amplified, so I don't actually believe that every Trump supporter thinks that Europe is a 'socialist hell-hole', but I have not seen a lot of nice things being said about Europe. I know this question is quite vague and not very specific, but I am looking for any and all opinions regarding politics, economy, foreign policy, our culture(s), etc.\n\nFor context, I am asking this because Trump has recently spoken out about the war in Ukraine, he has also made many remarks about the funding of shared endeavours and how Europe is not paying enough of a share compared to the USA, and while not Trump himself, Elon Musk has also made many comments about the politics/elections in the UK and Germany for example.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "This is a good question, albeit things are going to get nuanced here.  I'll probably veer a little off-topic, but that's to be expected.  I apologize in advance for the wall of text.\n\nAs you've mentioned, Europe is very diverse culturally.  As such, it's hard to judge it as a whole, which is also something I try to bring up about the USA.  The food is largely fantastic, although I admit I'm a bit biased against snooty French dishes that rely too much on presentation.  Nearly every European I've met has been friendly and pretty wonderful people.\n\nPolitically, Europe is fractured, so I'll have to look at the EU in particular.  I have my issues with them--for one, it seems like much of the EU's military defense plan is \"get the US to bail us out,\" and that isn't really working for me.  I think they should commit to a strong united defense force and work towards that.\n\nEconomically, well, it depends.  I haven't read much lately about Greece's economic woes--have they been handled?  But much of Europe seems to have a strong economy, albeit admittedly smaller.  The continent seems to have a higher \"uniform\" standard of living than America does, at least, so that's good.\n\nIt just seems like a lot of people who are very loud online are raising their distaste for the President, and that's okay, but the doomsaying is getting a bit old.",
            "score": 6,
            "replies": [
                {
                    "author": "Final_Reserve_5048",
                    "body": "Why do you think the continent has a higher uniform standard of living than the US?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "JustGoingOutforMilk",
                            "body": "Various metrics I looked up, admittedly several years ago.  Now, do you mean *why* I think they have achieved those metrics?  I could go into a few things.\n\n* In general, the population is more homogenous than America.\n* Cultural identity also seems a lot more prevalent.\n* Many European cities were designed around foot traffic, leading to a more active population in general.\n* Better access to healthcare.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Springstof",
                                    "body": "Regarding the first point - In what regard do you mean 'homogenous'? Culturally, ideologically, economically, or? Because I would personally argue the opposite in most regards, but obviously there are probably some parameters where this argument could be true, hence my question.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "JustGoingOutforMilk",
                                            "body": "This, admittedly, has to be broken down more on a country level, but unless we are splitting Nords from Swedes from Danes, things get a little...  less diverse in European countries.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Final_Reserve_5048",
                                    "body": "> In general, the population is more homogenous than America\n\nWhat makes you think that? I would make sense that Europe is significantly ***more*** diverse than America? \n\n> Many European cities were designed around foot traffic, leading to a more active population in general.\n\nDo you support measures to improve public transport services in American cities and make them more walkable?\n\n> Better access to healthcare\n\nWould you support a European attitude towards healthcare? This seems to go against republican views on healthcare completely.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "JustGoingOutforMilk",
                                            "body": ">What makes you think that? I would make sense that Europe is significantly ***more*** diverse than America?\n\nObservation, put simply.  Last I checked, Europe, as a whole, was roughly 95% of the same overall ethnicity, although I'm sure an Italian and a Spaniard might view one another as \"different.\"\n\n>Do you support measures to improve public transport services in American cities and make them more walkable?\n\nPublic transportation, absolutely.  Trust me, it's horrible down here.  Making them more walkable, I don't really know, because it's extremely difficult to accomplish with how big and sprawling many American cities are.\n\n>Would you support a European attitude towards healthcare? This seems to go against republican views on healthcare completely.\n\nDepending on the European country in question, sure.  Also, I'm not a Republican.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Final_Reserve_5048",
                                                    "body": "> Observation, put simply. Last I checked, Europe, as a whole, was roughly 95% of the same overall ethnicity, although I’m sure an Italian and a Spaniard might view one another as “different.”\n\nI think to say they might see each other as different is a slight understatement no? These are completely different countries with different languages and cultures. From Poland to the UK to Italy and Germany for example. I think to suggest the US is more diverse is pretty wrong? \n\n> Public transportation, absolutely. Trust me, it’s horrible down here. Making them more walkable, I don’t really know, because it’s extremely difficult to accomplish with how big and sprawling many American cities are.\n\nWhat about places like NYC and the congestion charge? Should that remain or do you support Trump’s attempts to remove it? Seems like it promotes public transport use and walking!\n\n> Depending on the European country in question, sure. Also, l’m not a Republican.\n\nOk, but you voted for Trump so you’ve supported his healthcare goals. Which are not even remotely close to European systems",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "JustGoingOutforMilk",
                                                            "body": ">I think to say they might see each other as different is a slight understatement no? These are completely different countries with different languages and cultures. From Poland to the UK to Italy and Germany for example. I think to suggest the US is more diverse is pretty wrong?\n\nAnd I would disagree with you pretty intensely on that one.\n\n>What about places like NYC and the congestion charge? Should that remain or do you support Trump’s attempts to remove it? Seems like it promotes public transport use and walking!\n\nI know absolutely nothing about the congestion charge.  I've only been to NYC twice, so I don't exactly keep up on the subject of the city, to be honest.\n\nHere, the problem is that PT is really only available downtown and the few stops elsewhere require at least a fifteen minute drive to access a park and ride.  So the system doesn't get used unless you live downtown.  Furthermore, last time I checked, 45 minutes was the average commute time here.  Trying to walk that distance would be...  well, I'd have to leave tonight to get to work in the morning, you know?\n\n>Ok, but you voted for Trump so you’ve supported his healthcare goals. Which are not even remotely close to European systems\n\nTo begin with, who I voted for is between myself, my wife, and the ballot box.  You're making an assumption there.  I'll also point out that voting for a candidate does not mean I support every policy they may bring to the table.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Final_Reserve_5048",
                                                                    "body": "> And I would disagree with you pretty intensely on that one.\n\nBased on what?\n\n> To begin with, who I voted for is between myself, my wife, and the ballot box. You’re making an assumption there. I’ll also point out that voting for a candidate does not mean I support every policy they may bring to the table.\n\nYou are flaired as a Trump supporter in here and responded as one. Why are you shocked that I assumed you voted for him? If you didn’t, should you even be responding here?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JustGoingOutforMilk",
                                                                            "body": "I am flaired as a Trump Supporter.  That does not mean that I voted for him, or that I am  even American.  Believe it or not, there are TSes here who are foreign nationals and, as such, cannot vote.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Final_Reserve_5048",
                                                                                    "body": "Why would a foreign national support Trump? He is ferociously about America first above any other country.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "JustGoingOutforMilk",
                                                                                            "body": "You would have to ask them that.",
                                                                                            "score": -2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Final_Reserve_5048",
                                                                                                    "body": "I believe I just did? \n\nOr are you being mysterious for no reason…",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "JustGoingOutforMilk",
                                                                                                            "body": "I did not say I was a foreign national.  I said that my flair neither means that I, necessarily voted for President Trump or that I am a citizen of the United States of America.",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Final_Reserve_5048",
                                                                                                                    "body": "I don’t understand the sowing of confusion here. Are you afraid to admit you voted for him?",
                                                                                                                    "score": 6,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "JustGoingOutforMilk",
                                                                                                                            "body": "It is my opinion that it is none of your business whatsoever.  Therefore, I will wish you a good day.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Abridged6251",
                                                                                    "body": "Why would you identify as a TS if you didn't vote for him? That would be like a Canadian being a TS even though he's being hostile towards Canada.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "JustGoingOutforMilk",
                                                                                            "body": "This has been gone over.  Extensively.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Abridged6251",
                                                                                                    "body": "Going over the thread I didn't see any answer so I'll try a different question. What are a couple reasons in your mind that someone would support Trump, even when they didn't or couldn't vote for him?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "JustGoingOutforMilk",
                                                                                                            "body": "There are a number of TS in various threads who did not vote for Trump.  They are the best resource to ask.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Abridged6251",
                                                                                                                    "body": "\n\n>There are a number of TS in various threads who did not vote for Trump.  They are the best resource to ask.\n\n\nMy mistake, from your response to others in the thread I thought you either could not or did not vote for him and wanted to explore your support for him despite that. Have a nice day?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sshlinux",
                            "body": "Because it's homogenous and White",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Final_Reserve_5048",
                                    "body": "What do you mean by that?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "sshlinux",
                                            "body": "I was pretty clear. But I'll repeat myself. The continent has a higher standard of living because it's homogenous and White.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Final_Reserve_5048",
                                                    "body": "Can high standards of living only be achieved in white countries?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "sshlinux",
                                                            "body": "No but will be the highest. Japan for example is another one. Some cultures are just better than others.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Final_Reserve_5048",
                                                                    "body": "So by deduction I’m assuming you think US standard of living is lower because it isn’t homogeneously white?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sshlinux",
                                                                            "body": "Yes. Standard of living is lower now than what it was back when it was homogenous. Back then we were on par with Europe and even better in many. As you see, the standard of living is worse every year the more diverse it gets. When you replace the majority population in any nation, everything about that nation will change and will no longer hold the power or standard it once did for the better or for the worse.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Springstof",
                    "body": "That sounds balanced and agreeable. Thank you for the reply!  \n  \nAmongst Europeans there are obviously a lot of internal opinions about other nations within Europe as well, and making (harmless) fun of things like the cuisine of each country is pretty commonplace.   \n  \nI do think, personally, that it is fair to say that European nations should reinforce their own defenses, but I think that the notion that the plan is to rely on the USA is somewhat influenced by the voluntary and unilateral decision by the USA to build the most well-funded, well-equipped and sizable defense force in the world. In my view, the lack of adequate defense formations in Europe is a separate issue from the USA. Nonetheless, I very much see that as a valid point of discussion regarding the international interplay of defending democracy as an ideology in and of itself.\n\nThe economy within Europe is indeed a difficult topic, even for Europeans, and many countries are doing much worse economically speaking than others. Greece has not recovered from their problems completely, but is indeed heading in an upwards direction.\n\nMaybe a more specific question, if you care to answer: what do you think of how Europe is dealing with the situation in Ukraine, versus how Trump is envisioning to solve the issue at the moment. Does it seem to you like he is blaming Ukraine, or is there another play there? And if the former is true, do you agree? And if you agree, do you think the plans by Trump to for example demand reimbursement of the investments of the USA in the form of rare earth minerals are fair?\n\nAnd what do you think of how J.D. Vance has spoken about the lack of freedom within Germany for example? Do you agree, and if so, which arguments do you think would support that notion?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "JustGoingOutforMilk",
                            "body": ">Maybe a more specific question, if you care to answer: what do you think of how Europe is dealing with the situation in Ukraine, versus how Trump is envisioning to solve the issue at the moment. Does it seem to you like he is blaming Ukraine, or is there another play there? And if the former is true, do you agree? And if you agree, do you think the plans by Trump to for example demand reimbursement of the investments of the USA in the form of rare earth minerals are fair?\n\nIn a truly ideal world, this should be considered an European issue and they should be leading the way in whatever fashion they see fit.  I do not mean this to sound glib at all, but while Russia and America might trade barbs, we all know that a war against Russia will be fought on European soil predominantly.  Dissuading that from happening would, logically, be more of a pressing issue for those living in Europe than those separated by oceans.\n\n>And what do you think of how J.D. Vance has spoken about the lack of freedom within Germany for example? Do you agree, and if so, which arguments do you think would support that notion?\n\nI think Germany has some laws that I disagree with in principle if not in execution..  I'm no expert on German law, by any stretch, but some of what is illegal in Germany is something that I feel infringes upon freedom of speech (which, I know, is an American thing).  Would I want to go around waving a flag from the people who killed my ancestors?  Heck no.  But I want people who support that sort of stuff to be able to do it.  It's a lot easier to see them coming that way.\n\n\\[EDIT:  A word!\\]",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "notapersonaltrainer",
            "body": ">I have noticed a lot of negative opinions either directly from Trump, or from supporters of his.\n\nPart of being an adult is to handle being treated how you treat others. Americans are starting to act *reciprocal* towards Europe. When you are accustomed to being coddled reciprocity feels like you're being attacked. \n\n* You've had tariffs on us for decades, yet when Trump’s trade policy mirrors yours, you cry foul.\n\n* You've consistently underspent on NATO commitments—even after a decade that saw two Russian invasions. Yet when we ask you to simply meet your agreed-upon obligations, you act as if we’re traitors. \n\n* We've disproportionately funded the defense of Europe, while you put it in peril as you weakened your own military, gorged on cheap Russian gas, and gutted your energy security (which NATO itself flagged as Russian [subversion](https://foreignpolicy.com/2014/06/20/russias-quiet-war-against-european-fracking/)). \n\n* And when we repeatedly [pointed out](https://www.youtube.com/watch?v=M5MJEMHZZsI) the absurdity of this you [laughed](https://www.youtube.com/watch?v=FfJv9QYrlwg) at us and [played dumb](https://www.youtube.com/watch?v=0CvQmWoog18). And you still call *us* \"compromised by Russia\", lol.\n\n* You strangle your tech sector while you place enormous fines on ours and [threaten](https://www.politico.eu/article/eu-elon-musk-donald-trump-interview-thierry-breton-letter-social-media/) our CEO's.\n \n* We uphold free speech as a fundamental right while you increasingly embrace speech [authoritarianism](https://www.cbsnews.com/news/policing-speech-online-germany-60-minutes-transcript/) and demand our companies to [comply](https://www.reuters.com/technology/apple-removing-end-to-end-cloud-encryption-feature-uk-bloomberg-news-reports-2025-02-21/). \n\n* A majority of Germans said they [wouldn’t support defending NATO allies in a Russian conflict](https://www.euractiv.com/section/politics/news/majority-of-germans-wouldnt-support-defending-nato-allies-in-russia-conflict/). After a century of American-led reconstruction, defense, and goodwill, you don’t even pretend you would reciprocate.\n\n* You push green policies that cripple industries and raise energy costs, then turn around and buy energy from the very nations you claim to oppose. Meanwhile, you lecture us about climate while relying on our exports to keep your lights on.\n\n* Economically, you're stagnant—zero growth, aging populations, and industries that can’t compete without protectionism, even from [each other](https://www.ft.com/content/13a830ce-071a-477f-864c-e499ce9e6065). Yet you scoff at the American economy while relying on our innovation, our financial markets, and our consumer base to keep you afloat.\n\n* Culturally, you sneer at Americans while your own societies become lifeless, self-loathing, and demoralized. You mock American patriotism but have no pride in your own nations. You openly despise Christianity, while mass-importing Islam and bending over backward to accommodate it. \n\nSo what exactly are we defending? Why should we continue to coddle you while you treat us with condescension and disdain? At some point, the one-sided relationship has to end. Reciprocity isn't an attack—it’s just long overdue.",
            "score": 8,
            "replies": [
                {
                    "author": "Difficult_Farm_201",
                    "body": "I have a few questions: You mention decades of tariffs and then criticize Europe for reacting to similar U.S. policies. How do you reconcile longstanding practices with recent shifts in approach? And while it's true that many European NATO members have historically fallen short of the 2% GDP defense spending target, several have recently increased their budgets in response to heightened security concerns, doesn’t that complicate the narrative of persistent underfunding?\n\nFurthermore, you argue that European tech regulations and green policies are damaging, yet many of these measures are designed to promote fair competition and long-term energy independence. Can you provide specific examples where these policies have demonstrably harmed free speech or economic stability? Finally, your cultural critique seems to reduce Europe’s diverse and evolving societies to a single negative stereotype, how do you account for the rich national pride and complex identities that many Europeans clearly express?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "AccomplishedCarob307",
                    "body": "This is excellently stated, and it’s on the key point that bothers me: when we are actively partners we get labeled the world police. When we want to empower European nations to take their seat at the table more seriously, we’re traitors.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "populares420",
            "body": "Europe is the bedrock of western civilization so in terms of history and legacy I have a tremendous amount of respect for our cultural ancestors.\n\nWhich is why I think their current situation is so pathetic. They are abandoning their own values and europe just seems intent on cultural suicide. I think the way germans go around arresting people for memes is authoritarian and even worse - pathetic and weak. In general, I view europe as fading into irrelevance. They don't have the cultural swagger to move the needle anymore. Both their hard and soft power has dwindled. Europe seems to be the last ones to have gotten the message though. They keep thinking they are more relevant than they actually are. In terms of power and status I consider europe second tier at best these days.\n\nIn short, europe needs to get their shit together and stop cucking themselves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnderProtest2020",
            "body": "No problem with the people generally, but their governments have been mostly derelict in their NATO dues while demanding a seat at the table equal to the US. I don't like it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cchris_39",
            "body": "Their allegiance is based solely on us defending them militarily and shoveling money to them as fast as we can.\n\nWhen Trump does something they don’t like it’s usually in one of those categories and it makes me happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrhymer",
            "body": "Europe started two world wars. After the second one the US stepped in as the adult in the room and took over the bulk of Europe's defense to keep them from starting the next world war. This continued through the very expensive cold war.\n\nBecause the US paid for the bulk of Europe's defense they were able to institute National Healthcare and free college and other stuff they could not afford if the US was not covering for them. \n\nThe latest European fiasco is still happening. US warmongers and Europe nearly started a world war with Russia. Thankfully the American people did not fall for it and put common sense back in the White House.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "Considering the US political spectrum is \"normal\" for me, politics in other places is always funny, like you'd take the US left and right, chop up all single issues they care about into individual chips, mix them up, and randomly draw a handful out of a bag and that's a party in the UK. \n\nTrump is right on the Ukraine war issue though. Europe has more GDP and much more population than the US but hasn't even come close to matching aid to Ukraine. In my opinion Europe combined should be giving more than double the US.",
            "score": -4,
            "replies": [
                {
                    "author": "mitoma333",
                    "body": "Europe is not a single nation like the US. Not even all European countries are part of the European Union, a union which is predominantly a economic union.  \nFurthermore, the EU does not have a larger GDP than the US by about 9 trillion, 4 trillion if you take non-EU members into account and exclude Russia. But even if that were to be the case the fact that the EU is split into 27 nations makes it far less efficient when it comes to spending.\n\nHaving said all that, not taking into account the cost of housing over 6 million Ukrainian refugees, the EU has currently outspent the US and if you take committed money into account it will outspend it 2 to 1. \n\nHow does that affect your view?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Springstof",
                    "body": "I have given much thought to that difference myself as well. I think it is unavoidable at this point for the USA that there is just going to be a two-party system until, hopefully not anytime soon, the system has to be rebuilt. But I also think that in some European countries the amount of single-issue parties is getting way out of hand, and it is actually hindering the efficiency of the government. I definitely see how to an outsider, it would seem even more chaotic. In fact, my own government only makes sense because it's the one I know, but even neighbouring countries seem enigmatic to me when it comes to which parties are saying what.\n\nRegarding Ukraine, do you also think that Trump was correct to say that Ukraine started the war, and that Zelenskyy is a dictator?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fignons_missing_8sec",
            "body": "Europe is a regulate first innovate later, or never, society. The first thing I think of when I think of Europe is Thierry Breton bragging about how Europe is the only place with comprehensive AI regulation at the same time when AI has been a multiple trillion dollar boom in the US and comparably non existent in Europe, congrats you are costing your continent billions or trillions, do you want a cookie? If you don't count ASML's lithography monopoly the biggest technological innovation coming out of Europe in the past couple decades is probably great innovation in making up new dumb ways to fine American tech companies billions.",
            "score": -1,
            "replies": [
                {
                    "author": "Springstof",
                    "body": "European nations, as well as the European Union, is big on regulating things, certainly, but is that inherently an issue? Aren't regulations, when based on the legislations that are voted into existence by democratically elected government representatives the will of the people? For the sake of the argument, because I know that there is nuance, and that neither Europe as a whole nor any individual countries contain only people with the same opinions and interests, let's assume that a decent majority of Europeans is generally happy with the way the law works in Europe - Would that not make it a self-sustaining and functioning system? Now, I concede that this line of reasoning is based on the assumption that indeed, Europeans are happy with the way things are going, which in my experience is more often true than not, but I might be biased. Thus, I wonder then, would you argue that Europeans are in fact not as happy with this as I might think, based on your experience/view/knowledge, and are European governments failing us, or, instead, would you agree that perhaps Europe as a whole might be happy with themselves, and is the issue not within Europe, but with how Europe relates to the rest of the world; say for example, in how they fine American companies - which I guess would indeed make a good case for saying that Europe is exploiting other continents/countries? Or of course, am I missing a third option?\n\nLong story short, do you think that Europe is bad for Europeans primarily, or might Europe be doing well for themselves, but not so much for their global allies?\n\nAnd regarding the innovation that comes out of Europe, I think that it is difficult to compare Europe to the USA, especially regarding stuff like information technology, space exploration, the film industry and defense technology, as there is absolutely no doubt that those markets are dominated by American companies. But automotive engineering in Germany is without a doubt some of the most advanced. Many of the most promiment luxury car brands are also European. Personally, as a Dutchy, I can without a shred of doubt say that the Dutch are the absolute best of the best when it comes to hydraulic engineering. Building defences against rivers and oceans, or reclaiming land, is something that is rarely done on a large scale without consulting the Dutch. Infrastructure, urban planning, medical research, civil engineering, and even more culturally oriented markets such as architecture and fashion are all thriving markets in Europe with a lot of internationally acknowledge success to show for them. Regulation might mean that there will be fewer tech-cowboys emerging here who shoot cars into space for fun, but especially in markets where regulations are valuable to the public interest, for example the safety of people in their cars, homes, offices and on the street, European countries have some of the best industries in the world. Would you say that regulations are still hindering progress to such a degree that, perhaps in the same way as I described earlier, even while we might be content with ourselves, we are falling short of our potential, or perhaps causing more harm than good in regard to the international markets?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "mitoma333",
                    "body": "What is your view towards consumer protections?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SincereDiscussion",
            "body": "There is an anti-European segment of the American right. I think it is quite misguided (or is just ethnic/racial hatred pretending to be a policy dispute). Europe is nice, and we should have a built-in affection for them due to our history. It's sad when you see a headline about the most common boys name in a European city being Muhammad or how people are being jailed for saying things that would be unambiguously legal in the U.S. I don't have any resentment towards Europeans though; I want them to take their countries back just as we need to take ours back. (And our success will make it easier for them, due to our influence).",
            "score": -3,
            "replies": [
                {
                    "author": "Suspicious_Bowler653",
                    "body": "Could you give a concrete example of people in Europe being jailed for saying things that would be unambiguously legal in the U.S?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "AccomplishedCarob307",
                            "body": "I could spend weeks citing instances of it. [This](https://www.cps.gov.uk/cps/news/updated-sentence-far-right-organiser-found-guilty-intent-stir-racial-hatred-through) particular incident stands out in my mind. \n\nA man was sentenced to two years in prison for distributing stickers that said things like “it’s okay to be white” and “expressing views of a nationalist nature”. This is unambiguously protected speech in the United States.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SincereDiscussion",
                            "body": "nah, complete waste of time. unless you think hate speech laws are literally never enforced, there's no point. it obviously happens and just as obviously couldn't happen here.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Springstof",
                                    "body": "For the sake of the argument, let's say that people are being jailed in Europe to a significant degree for hate speech which could be argued to not fall within the category of inciting violence or demonstrably harmful to the health, safety or wellbeing of others - Your argument is that Europeans are less free in what they are allowed to say in public. That, I agree, would be a valid reason to argue that Europe is more restrictive on the topic of personal freedom in that regard. But then I wonder, if freedom of speech, which then includes the freedom to be hateful towards others, is the only metric to consider here. In the USA, people are still being jailed or are already serving sentences of sometimes decades for the posession of weed, which in Europe will land you a fine or a few weeks of detention in most countries, not to mention the ones where there isn't even a penalty for it. Within Europe we also have the right to move goods freely across borders, live, study and work across borders (without visa) - Europeans have the right to choose their healthcare provider, regardless of their insurance - We can jaywalk - We can have dual citizenship, etc. Surely, some of these things might be legal in some states, and if you think about it, there will likely be several things banned in Europe that Americans can enjoy freely. But I think the question is not who has the most freedom, but who has the most reasonable freedoms and restrictions, if you are even going to make the comparison in the first place. In general, people who are not doing harmful stuff, are not being actively restricted in their freedom in Europe. In the USA, maybe a little bit more is technically allowed, but on the other hand, breaking the law can land you in far more trouble for far less as well. People serving 10+ year sentences for things that European countries would consider lesser crimes are not uncommon, which is also pretty evident when you compare prison population statistics between Europe and the USA, and it's not the case that Europe is less safe for your average Joe to reside in because of lighter punishments causing more criminals to potentially be free. In fact, I think the USA was ranked 131st in the Global Peace Ranking in 2023, whereas half of the top 20 countries are European ones.\n\nHow would you argue that having stricter laws on what you are allowed to say constitute enough of a impedement to freedom to outweigh other freedoms that Europeans enjoy and/or the relative safety that exists within many European countries compared to the USA?\n\nIf you disagree with or can dispute any of my arugments/reasoning, please do so, because I recognize that my question is loaded with some assumptions and opinions, but considering my point of view, I would be interested in learning how you would place it within your ideas about the topic.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "Your comment has a list that instead appears as a giant block of text so it is somewhat tedious to read. Skimming through though, yeah I think as Americans we treat free speech as special because it is one of our founding values. Weed is not one, so we don't care as much (and for what it's worth, it is legal in most or at least large parts of the country anyway -- as you acknowledge, to be fair). \n\nAmericans can be dual citizens by the way, not that I consider that a positive. (\"We make it easy to have dual loyalties\" wow, great).\n\nYes, Europe is safer, primarily because the high-crime groups that commit most of the crime in America are not present (at least in the same quantities). It's not because of more lenient sentencing policies or the fact that prisoners sit around playing video games.\n\n> How would you argue that having stricter laws on what you are allowed to say constitute enough of a impedement to freedom to outweigh other freedoms that Europeans enjoy and/or the relative safety that exists within many European countries compared to the USA?\n\nI can say some things are better in America and some things are better in Europe. My argument wasn't \"America is the best at everything, they must copy us 1:1 in order to be good\". I gave examples of things that I consider big problems (immigration being one of them, and it's worse here, so that definitely wasn't the point of my comment).",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jaded_Jerry",
            "body": "In Germany a man was recently had his home raided and is facing legal problems for calling a government official 'imbecile.'  Many other European countries are doing similar.\n\nI do not envy Europe right now.  Anyone who calls the US terrible and yet thinks this is acceptable is either an idiot or knows they're awful and just think they're smarter than everyone else.",
            "score": -3,
            "replies": [
                {
                    "author": "NoBuddyIsPerfect",
                    "body": "This is not how it happened?\n\n>In Germany a man was recently had his home raided and is facing legal problems for calling a government official 'imbecile.'\n\nThe man in question got is home raided and faced legal issues for posting illegal nazi-imagery and nazi rhetoric. Weeks **after** the raid, a German politician opened a \"Strafantrag\" that forced the police to investigate the man for insulting the politician.\n\nThe man would have been raided without insulting the politician.\n\nAnd the man would not have been raided if he only insulted the politician.\n\nWhy do you believe otherwise?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "SincereDiscussion",
                    "body": "I've noticed that libs who defend censorship in Europe always act as if the only thing being censored is speech that directly advocates genocide. But then anyone who pays attention to European politics will see the insane things people get punished for (meanwhile, our journalists laugh and grin as this is discussed!).",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ivan_Botsky_Trollov",
            "body": "\n\n\"socialist hellhole\"\n\nthats NOT how I'd describe it\n\nHowever, the governing elites of western europe have held for too long (since the 60s- perhaps earlier) curious , or frankly BAD policies that have done not much for the countries , and in many cases, even affected negatively their countries in the mid and long run.\n\nLets see:\n\n**politics -** sharing those from USA and taking cues from the USA, as it was a king-vassal relationship.\n\nWhatever the liberals in USA come up with, Europe eagerly copies \n\nexample: the trans stuff. Starts in the USA and the euro govts eagerly adopt it\n\n**economy -** too many  bureaucracy and regulations and overall, not much innovation and the future looks schlerotic for the continent. It seems that many countries havent recvovered from 2008, and when even the UK is projected to fall behind Poland by 2030:\n\n[https://news.sky.com/story/britains-economic-trajectory-will-soon-see-it-overtaken-by-poland-labour-to-warn-12821152](https://news.sky.com/story/britains-economic-trajectory-will-soon-see-it-overtaken-by-poland-labour-to-warn-12821152)\n\nabout the yuge welfare state many euro govts have, I guess its  OK....but as it is the case with socialist ideas, only as long as they have the $$$ to fund it.\n\n  **foreign policy -** like politics, a copycat of the USA. Or at least when Democrats are in charge.\n\nThast why Trump and Vance are turning many euro govts in disarray\n\nFor the first time in decades - with the honorable exception of France and Germany refusing to support the Iraq war in 2003- euros will need to think for themselves and not follow whatever the USA tells them to do.\n\nYes, NATO is NOT a partnership among equals, however the previous USA govts want to sell it to us. \n\n\n\n **our culture**  Lovely, but in sad decline\n\nVisited Vienna and Paris time ago and wondered how the courage and strength to hold empires and be internationally relevant disappeared almost overnight, to be replaced by weak countries that follow with weird religious zeal one of the worst treaties ever signed, that 1951 refugee one, who has allowed western european cities to become what are today, allowing the flourishing of problems they seldom had before (terror and migrant attacks).\n\nOverall, a once lovely place slowly but surely sliding into irrelevance. most of the damage beign self inflicted or done by stubbornly following whatever the liberal USA did.",
            "score": -2,
            "replies": []
        }
    ]
}