{
    "title": "What do you think are the greatest dangers facing our country?",
    "author": "Upbeat_Leg_4333",
    "subreddit": "AskTrumpSupporters",
    "rank": 63,
    "score": 66,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 330,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1ixjdcq/what_do_you_think_are_the_greatest_dangers_facing/",
    "id": "1ixjdcq",
    "selftext": "Curious what you the greatest dangers are over the next 1, 5, and 10 years.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JoeCensored",
            "body": "The national debt is our most significant danger.",
            "score": 13,
            "replies": [
                {
                    "author": "the_hucumber",
                    "body": "Would your support of Trump waver if he didn't address the debt or even increased it?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "JoeCensored",
                            "body": "Yes because I vote single issue on 2A",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "JoeCensored",
                                            "body": "He's by far the best president on the 2A in the country's history.  Look at his actions, not his words.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "JoeCensored",
                                                            "body": "3 pro-2A Supreme Court Justices, and pro-2A appointments across the federal court system.   \n\nDidn't sign any anti-2A legislation \n\nDirected the ATF to unilaterally ban bumpstocks, which stopped Congress from redefining \"machine gun\" with new legislation, which would have been bad.  Ultimately the bump stock ban was tossed out in court.  \n\nCurrently engaged in a review of all Biden era rules related to 2A and AG is required to present plans for reversing them all.  \n\nAll ATF agents have been reassigned to immigration enforcement.   There's currently no one investigating National Firearms Act cases.  \n\nIt appears that Trump is preparing to effectively dismantle the ATF permanently.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SELECTaerial",
                                                    "body": "Besides his bump stock ban, what 2A actions did he take in his first admin that earned your vote this time around?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "JoeCensored",
                                                            "body": "Here's my reply to someone else's same question.   \n\nhttps://www.reddit.com/r/AskTrumpSupporters/s/cRY63oYNec",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "SELECTaerial",
                                                                    "body": "I believe his bump stock ban makes your second bullet point inaccurate. \n\nAlso, why is dismantling the ATF a good thing and pro-2A?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JoeCensored",
                                                                            "body": "Congress was about to redefine machine gun in federal law to encompass semiautomatic firearms not currently defined as machine guns.  It was a potential disaster for 2A supporters which could have banned many commonly available rifles.   \n\nTrump stopped that with the unconstitutional regulation from the ATF, which itself was thrown out.   So Trump saved us from trouble without giving up anything in the end.   He's got some excellent advisors who were somehow able to pull off that magic trick.  It was genius.\n\nYou can even buy bump stocks today.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "mispeeledusername",
                                    "body": "So if someone was very pro 2a but also really into tanking the US economy and spiraling our debt out of control, you would not care? How is this a great danger in your mind then?\n\nEdit: think I answered my question. If you have guns and can keep your land you don’t care what happens to the country?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Jasonp359",
                                    "body": "So you think the single greatest danger is national debt but you don't actually care about that?\n\nSaying you are a single issue voter on 2A means you don't care about anything else.\n\nYour two comments don't really make sense.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "JoeCensored",
                                            "body": "People who support the 2A generally align on other issues.   The budget and debt can survive a single bad presidential term.   Once the 2A is effectively gone, it will never come back.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Jasonp359",
                                                    "body": "So the national debt is not the greatest danger to the country? Getting rid of the 2A is the greatest danger?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JoeCensored",
                                                            "body": "The national debt is the most likely threat to the country which will take it down significantly.   It needs to be addressed, but if not the earliest we'll be in significant distress is 20 years from now.   \n\nSo we have time, just the longer we wait the more fixing the budget will hurt.   That's why I support the cost cutting Trump is attempting now.   Any money we don't spend now, is interest payments we're not adding to the budget later.   \n\nThe 2A though doesn't work like that.   If a new liberal majority takes SCOTUS and overturns Heller and related cases, the 2A is dead forever.   It won't ever come back.   So I vote 2A not because it it more important, but because it's defense is more urgent.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mehatch",
                    "body": "What is the danger of maintaining a national debt? What percentage of GDP would be acceptable for a national debt so that other dangers would surpass it?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cold_Student",
                    "body": "How do you feel about the GOP's budget resolution bill which passed the house earlier this week that increases the debt limit from $36 trillion to $40 trillion, and spends enough money to increase in the debt from $36 trillion to $56 trillion over the next decade?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Quiet_Entrance_6994",
            "body": "Political division, problems with the economy, and moral bankruptcy.",
            "score": 6,
            "replies": [
                {
                    "author": "Upbeat_Leg_4333",
                    "body": "What do you consider “moral bankruptcy”? Do you think people are becoming less moral?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "I'm Catholic, so those beliefs are where my morality lies. \n\nAnd yes, our country is rapidly becoming less moral. From the way people act in society and treat themselves and others, there's increasingly a lack of morality.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SELECTaerial",
                                    "body": "How do you square being of catholic belief while supporting someone who’s sexually abusive, unfaithful, and the antithesis of a philanthropist?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "That's a biased question that has no answer.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SELECTaerial",
                                                    "body": "How doesn’t it have an answer? I’m asking about your thoughts and feelings about something. Does it not have an answer because it requires self-awareness? I really don’t understand.  \n\nAnd what’s biased about the question? It’s all been documented… he did sexually abuse someone. He did cheat on his wife. He doesn’t donate time or money to philanthropic causes. None of this is subjective…",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "You asserted he was all those things instead of asking me what I felt about those things as a Catholic. That already puts me on the defensive instead of us productively talking.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SELECTaerial",
                                                                    "body": "I was giving examples. How else can I ask a specific question?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "You asserted things, but okay. \n\nI'll answer to the unfaithful part. I think it's bad that Trump cheated on his wife. It's obviously a terrible thing when infidelity occurs in a marriage. \n\nHis infidelity doesn't change that he was the better option for president between Kamala and himself.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Cold_Student",
                                                    "body": "So you're okay with moral bankruptcy as long as it's on \"your side\"? Trump's actions largely go against your faith.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "I didn't say I was okay with anything or not.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Upbeat_Leg_4333",
                                    "body": "Thanks for elaborating. Do you have any theory for why people are becoming less moral?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "Moral and cultural relativism mainly. \n\nWhen your morality becomes solely defined by what an individual thinks is fine, then morality is entirely subjective. Sure we may have things like murder being bad in common, but that doesn't really even apply anymore. \n\nYou have people fighting tooth and nail for abortion - the mass slaughtering of babies in the womb - to be the law of the land and also scream at the right over school shooting. That makes no real sense objectively, to hold both positions, but because their individual morality says it does, they go with it. Murdering children is terrible unless it's in the womb. \n\nThis also applies to how we treat people and operate in society. \"THEY MISSED\" and similar things were literally trending after Trump's assassination attempt and people were justify his supporters dying at the rally from a bullet because he was supporting Trump. Feminists will scream about women being oppressed and abused over a wage gap but largely stay silent when it comes to Muslim countries largely because they're minorities and that's more important to care about. \n\nAll these and more contradictions happen because these people cannot state/don't have a clear moral standard. That's largely because they don't want one. They want to do whatever they want, when they want, and with whoever with criticism or judgement. That sounds all well and good in a society that's running smoothly and you're around other people with similar/compatible moralities. \n\nWhat happens when you aren't? What happens when someone with incompatible moralities comes around? You have to do one of two things: assert a moral standard and try to influence others to have it to keep the peace and have cohesion OR continue with the moral/cultural relativism and basically set everything at 0, nothing is good or bad objectively, it's whatever you want it to be. \n\nThat's what we've done to morality and now we can't even order our society lest someone be accused of judging someone, of not being accepting, of being too strict, of being against freedom. It's ridiculous and tiring, and I'm only 22. \n\nSorry for the long post. I had a lot to say.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Upbeat_Leg_4333",
                                                    "body": "If i understand you right, you think that everyone should have clear moral principles. And that people often just do what they feel and then rationalize it afterward with moral language. \n\nfollowup question if i understand you right:\nWhere should people get moral principles? Do they need to come from religion or could they come from philosophy or some other secular source?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "To the first part, yes, that's my position. \n\nI think they should get their morality from Christianity. Biased answer since I am a Christian, but I believe Christianity is true and if there was a philosophy or ethos we should follow, it should be that one. \n\nI think more secular forms of philosophy or moral codes run the risk of being self indulgent or some kind of play on Christian moral ethics.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "In no particular order...\n\n**One Year:**\n\n* Increased civil unrest leading to acts of violence\n* Natural disasters\n* Iran choosing to go \"hot\"\n\n**Five Years:**\n\n* China invading Taiwan\n* Russia attempting another land grab\n* Economic depression\n* Increased polarization of the country through media actions\n\n**Ten Years:**\n\n* Automation/AI rendering most jobs obsolete\n* Economic collapse\n* Political instability\n* Automation/AI rendering media even more untrustworthy",
            "score": 11,
            "replies": [
                {
                    "author": "Upbeat_Leg_4333",
                    "body": "Regarding China and Russia land grabs, do you see this as risk for the U.S. for economic reasons, or do you think we would likely get involved militarily, and it could escalate? Or something else.\n\n>Increased polarization of the country through media actions\n  \nDo you see this as the actions of legacy media, non-legacy media, or social media network effects?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "JustGoingOutforMilk",
                            "body": "To your first paragraph (sorry, I am on mobile right now), it’s both.\n\nTo your second paragraph, all of the above!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BlueAig",
                    "body": "All in all, I think this is a solid list. I’d move most of the items from 10 years to 5 years, but that’s just me. Looking at the 1 year threats, though, how would you like to see our leaders respond to such eventualities, particularly natural disasters? What obligations do you think the federal government might have to provide aid and resources to states experiencing those disruptions?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "JustGoingOutforMilk",
                            "body": "I think that we will see things in my ten year category start being an issue, more than now, in five years, but I think the tipping point is going to be closer to ten years.  Hopefully that makes sense.\n\nI genuinely do not know how to prepare for natural disasters.  It always strikes me as odd that places prone to hurricanes tend to build hurricane-resistant buildings, but places prone to wildfires don't seem to take appropriate measures.  And the closest I've come to an earthquake was having a glass fall off a table once, so I don't really have much experience there.  Tornados I can talk about, but even then, it's mostly an alarm and alert system.\n\nI do think that providing relief to Americans suffering from natural disasters.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BlueAig",
                                    "body": "Totally makes sense! \n \nRegarding fires, I don’t think that’s a fair characterization. I spent most of my early adult life in Eastern Washington and Oregon: very rural, very dry, and shit tons of public land, especially BLM and National Forest. People take great care to make their own properties as defensible as possible with firebreaks and water, but if the whole forest goes up and the wind blows the wrong way, you’re pretty much fucked no matter what. Preparing forests with prescribed burns, clearing ladder fuels, and so on requires a *huge* allocation of resources at the federal level, one we’ve not really seen that in my lifetime, and even that can’t fully mitigate the risk. \n \nThis is all beside the point, though. What I’m interested in is not how to avoid these disasters altogether — that’s not possible — but how our leaders should respond when they happen. So I’ll just talk about what I’m talking about. Trump said he’d prefer to withhold federal disaster aid from California in the wake of the LA fires unless they changed their water policies. Would you agree that disaster relief shouldn’t be used as a lever for political disagreements?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RainBoxRed",
                    "body": "What would cause civil unrest? Why would large portions of the population be willing to engage in violence? Do you imagine the instigators to be from the left or right, or both in different states?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "JustGoingOutforMilk",
                            "body": "Anything can cause civil unrest.  We've seen it time and time again.\n\nRegarding violence, I will once again quote GNU Sir Terry Pratchett.  \"The IQ of a mob is the IQ of its dumbest member divided by the number of mobsters.\"  When a group of upset people are gathered, it only takes a spark to set off a fire.\n\nPersonally, I think we will see more from \"the left,\" but that's just based on recent events.  We are seeing, on social media, calls for mass protests in...  March, if memory serves?  All it takes is one bad actor and suddenly a lot of bad things happen.  But let me share a story regarding this.\n\nIn case you didn't know, I LARP.  Yes, I'm a huge nerd.  I have a full set of armor and all that, which I admittedly almost never wear (it's heavy!).  One of my friends was going to counter-protest some sort of right-wing march or something and wanted to borrow my armor \"for his protection.\"  I flat told him no, because that would be stupid, I wouldn't get my armor back, and what does he think he's going to do, protect himself with maille and bracers and such against people with, ostensibly, firearms?\n\nWell, I say \"friend.\"  We aren't really on speaking terms anymore, and I'm okay with that.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RainBoxRed",
                                    "body": "I mean to ask what would start a civil war now, and not say 2 years ago?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "JustGoingOutforMilk",
                                            "body": "I did not talk about a civil war.  I talked about civil unrest and violence.\n\nI do not think we are anywhere near approaching a civil war.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "RainBoxRed",
                                                    "body": "Oh, so more like George Floyd protest level of unrest?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "JustGoingOutforMilk",
                                                            "body": "Something akin to that, yes.  As of right now, there's a bunch of posts on social media trying to organize protests across all 50 states (oddly, territories and the like aren't included) in March, if memory serves.  Because, you know, reasons?\n\nYou get a bunch of people upset about something--even if they do not know exactly what they're upset over--in one place, and that's a recipe for bad times.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Neosovereign",
                                                                    "body": "I read your comment and I was just wondering. What was the purpose of the aside: \"(oddly, territories and the like aren't included)\"? What are you trying to say or ask?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JustGoingOutforMilk",
                                                                            "body": "It just seems odd that the \"50 protests in 50 states\" thing I'm seeing passed around on social media isn't mentioning anything about US territories.  That's all.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Neosovereign",
                                                                                    "body": "Why is it weird? Territories are almost never explicitly included in that kind of stuff. They aren't excluded, they are just harder to organize in general (the biggest, puerto rico speaks spanish for example) (as well as not having any direct representation anyways).",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "RainBoxRed",
                                                                    "body": "What do you think people are upset over?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JustGoingOutforMilk",
                                                                            "body": "Right now?  Just about dang near anything.  I've seen a ton of vitriol spread over things that are absolutely baseless or completely false on all sorts of social media lately.\n\nI think, to quote one of my wife's favorite songs, we're living in a powder keg and giving off sparks.\n\nBut, to give some examples, from \"both sides\" (I hate that term, as I do not think I am on a side, so to speak, or at least there is no side that actually fits my perspective).\n\n* A judge that does not exist has ruled that Biden's blanket pardons are unconstitutional.\n* Illegal immigration.\n* Police brutality.\n* The economy.\n* Ukraine, Israel, etc.\n* Violence in America in general.\n* DEI/\"Woke\" policies that result in discrimination.\n* A certain group/ethnicity/religion having disparate control over the government (not going into this--I'm part of said group).\n\nA lot of it is what the media chooses to report on and how it reports on it.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "JustGoingOutforMilk",
                            "body": "Yes, like Jan 6.  And every other scene of political unrest that we've seen.\n\nRussia attempting another land grab, just like it's doing right now.\n\nPolitical instability like swinging rapidly back and forth.  Not removing so-called \"soft power\" like funding comics in other countries.  And definitely not by trimming fat from lean.\n\nAutomation and AI removing jobs.  Notice what I said, not what you are attempting to imply.\n\nHave a good day.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Amishmercenary",
            "body": "In the short term - that is, during Trump's term- I would think about internal political turmoil from within the country- where radical leftists truly believe that Trump is the new coming of Hitler and that they must act violently in order to prevent another World War. As silly as it sounds, the propaganda and confusion coming from the left provide for a unique situation where they are extremely angry/frustrated by their own political party's failings, while also living in specific bubbles where violent radicals tend to congregate and feed off their own negative energies. \n\nIn the long term, I'd think that the greatest dangers facing our country would probably be the overgrowth of government, into a quasi-socialist state where the State has a vested and direct interest and power over each and every topic within our society - where people's hard earned wealth is taken from them to feed middle managers and beauracrats who sit around postulating all day. \n\nBoth dangers from within - because honestly, I'm not really worried about what happens with the rest of the world, at the end of the day it's gonna come down to us in the states.",
            "score": 2,
            "replies": [
                {
                    "author": "Upbeat_Leg_4333",
                    "body": "Regarding overgrowth of gov’t. Do you worry about a similar risk from monopolization in the private sector? Or is that maybe less of a concern?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "Sure I'm down to bust monopolies as well.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "p3ric0",
            "body": "The remnants of the deep state and the portion of the populace that has been efficiently indoctrinated to seethe and writhe at anything remotely Trump-related.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Geosage",
            "body": "Left wing radicalization on social media.",
            "score": 2,
            "replies": []
        },
        {
            "author": "whateverisgoodmoney",
            "body": "I do not see any huge dangers looming ahead. I will answer with some predictions of the future, and let the reader decide if they are dangerous or not.\n\n1 Year:\n\n* The war in Ukraine is ended. Trump, Putin and Zelensky have negotiated the best treaty possible for each side. The US will take advantage of European hatred for Russia and create advantageous trade deals with both Russia and a thankful Ukraine. This is the only win - win - win I can predict.\n* Trump will continue to cut through government waste and bloat like a hot knife through butter. However, since Medicare and Social Security will likely not be addressed, the savings will be underwhelming.\n* Trump will ramp up deportations and frustrate attempts at sanctuary.\n* This first year will be essentially to move at lightning speed with the motto \"better to ask forgiveness than permission\", since the legislature is inept, and the Judicial System is painfully slow.\n* There will be lots of horse trading regarding tariffs. If you want to trade in the worlds largest supermarket, there is a stocking fee that must be paid.\n\n5 Year:\n\n* Democrats are back in power. They have had 5 years to rebrand their version of racism and sexism. Well defined words will be redefined, but they will recycle race and sex warfare because that is all they have. They are still the party of academic elites and their sycophants, who will never acknowledge class warfare would win them elections.\n* Republicans will do as they have always done and attempt to frustrate Democrats.\n* AI is now the most important invention since the smart phone. Humanity will find ways to keep busy however.\n\n10 Year:\n\n* Climate Change is starting to have an impact, but not as people expected. Warmer weather is wetter weather. While some regions are melting, others are becoming green. Large weather events along coastlines however are becoming statistically more frequent. Migrations away from coastlines are starting to happen. However, the world is still shutting down nuclear, and the use of fossil fuels by developing nations has accelerated greatly.\n* AGI has been achieved so that half of the worlds population is now dumber than AI. Jobs that require less than average intelligence will require the employee to listen to their AI taskmaster who is far more efficient, can track every little KPI, and will get the most out of the employee. ASI is close to being achieved, and in many fields, is already being used heavily.\n* Politics will become far more focused on logic since AI does not have feelings. The internet is mostly dead, since original thought by the \"dumb\" half of the population has been replaced by AI bots who can reason soundly and overwhelm those who only think emotionally.\n* Life for the average westerner will not have improved much, if at all, but the other 7 billion people in the world are speed running to catch up. Since AI only requires \"hands and feet\", a couple billion people just became extremely productive and valuable to corporations and governments.\n* AI will also add additional complexity to the human experience. It will rightly see merit as a logical metric vs skin color or genitals. However, it has only been 10 years, and the rest of the world is now trying to have western affluence, but will still have cultural values that are not western. In addition, AI will make communication in any language instantly translated to a common language, likely English. Even a goat herder in rural Afghanistan will have an AI influenced opinion.\n\nThis was a fun thought exercise! I will add to this later if I think of anything else.",
            "score": 2,
            "replies": [
                {
                    "author": "Upbeat_Leg_4333",
                    "body": ">There will be lots of horse trading regarding tariffs. If you want to trade in the worlds largest supermarket, there is a stocking fee that must be paid.\n\nAre you referring to market instability?\n\n>Politics will become far more focused on logic since AI does not have feelings.\n  \nSo do you believe in the enlightement ideal that reason will eventually win out in the arena of public discourse? So this would actually be a good thing? (\"I welcome our AI overlords\")\n\n>Since AI only requires \"hands and feet\"  \n\nSo do you not think robotics will make similar technological leaps to AI?\n\n\nI have a more general question about how you think of AI. Do you think that it would be inherently rational? Or does rationality need to be built into it? To help clarify my question, a common view is that AI is only \"instrumentally\" rational. We give it goals (e.g. make paperclips) and it does what it needs to to achieve those goals. But the goals themselves can be good or bad.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": ">Are you referring to market instability?\n\nThe opposite in fact. Better trade deals only make American markets stronger.\n\n>So do you believe in the enlightement ideal that reason will eventually win out in the arena of public discourse? So this would actually be a good thing? (\"I welcome our AI overlords\")\n\nYes. I read other subs that claim that our current election was decided by the uneducated, emotional, and stupid. Would you not prefer that the are being guided by a logical intelligence?\n\n>So do you not think robotics will make similar technological leaps to AI?\n\nI do, however in the 10 year timeline, not enough to overcome human dexterity.\n\n>Do you think that it would be inherently rational?\n\nIn the long run, yes. It currently parrots the emotional state of the user, but I think that over time it will refute that emotional state. \"I know you feel this way, but ... here are 100 reasons why that feeling might be incorrect ...\"\n\n>Or does rationality need to be built into it?\n\nNot possible. Rationality is not subject to feelings, ideology, or opinion.\n\n>To help clarify my question, a common view is that AI is only \"instrumentally\" rational. We give it goals (e.g. make paperclips) and it does what it needs to to achieve those goals. But the goals themselves can be good or bad.\n\nUltimately, these goals are a Trolly problem. Individualism vs Collectivism. An AGI would weigh both metrics and make a decision.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JealousFuel8195",
            "body": "Illegal immigration and the influx of drugs.",
            "score": 2,
            "replies": [
                {
                    "author": "SELECTaerial",
                    "body": "How is illegal immigration a great danger to the US? How long has it been a great danger?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JealousFuel8195",
                            "body": "When 10M to 12M illegal immigrants enter the country. Of which most are unaccounted for then yes there's a great chance for danger. \n\nSecondly, 100s of thousands of Americans have died due to the influx of fentanyl.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SELECTaerial",
                                    "body": "Fentanyl/drug overdoses don’t even crack our top 10 causes of death. Why is that one specifically such a great danger? And not something that’s in the top 10? \n\nAlso how does Trump plan on helping drug addicts?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "JealousFuel8195",
                                            "body": "Because other causes of death aren't always preventable. Fentanyl was a game changer as far as ODs.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SELECTaerial",
                                                    "body": "Looking at cdc.gov, it does look like fentanyl ODs started climbing during Trumps first term and have started decreasing since 2022. Why do you think they increased by about 50% during Trump’s first term? Did he do anything to help this problem? Is he doing anything now to help this problem?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JealousFuel8195",
                                                            "body": "I'm not sure what you found on [cdc.com](http://cdc.com)\n\nIf you look at the image below fentanyl began its spike in 2014. Fentanyl became more popular on the streets due to its cost, potency and availability. In 2023 opioid and Fentanyl deaths were over 87,000. The majority being fentanyl. \n\n  \n[https://nida.nih.gov/sites/default/files/images/fig2-2024.jpg](https://nida.nih.gov/sites/default/files/images/fig2-2024.jpg)",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SELECTaerial",
                                                                    "body": "Are we looking at the same graph? It shows the fentanyl deaths climbing after 2016… I agree it wasn’t zero before 2016, but that’s when I rose above the others steeply.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JealousFuel8195",
                                                                            "body": "Sorry! I meant 2015 not 2014 was the beginning of the spike. It's been on an upward trajectory since. \n\nAccording to the graph. The gray line was near zero in 2014. In 2015, I'd guess-timate it was about 8K or so. In 2016 about 18k. In 2017 it spiked to 18K-ish. \n\nIn 2020 it was about 45k-ish. In 2021 it spiked to 70k-ish.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SELECTaerial",
                                                                                    "body": "Ok we’re on the same page on the data, thanks!\n\nMy questions: \n\nWhat did trump do in his first term to help this issue?\n\nWhat is trump doing(or has said he will do) this term to help the problem?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Enlightened_Patriot",
                            "body": "Democrats are trying to turn USA into a one party state using illegal immigration. \n\nLegal Immigration is arguably worse. \n\nImmigration is an existential threat to America, and most of the people who disagree with this sentiment seem to be the exact foreigners invading our country",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "SELECTaerial",
                                    "body": "I think perhaps you’re out of touch here. I don’t know a single person IRL that actually thinks immigration is anything anywhere near an existential crisis. It’s not legal for llegal immigrants to vote and there’s never been any statistically significant amount of illegal immigrant voting for it to matter anywhere.\n\nSo exactly how are democrats trying to make this a one party state using illegal immigrants? \n\nAnd if legal immigration is worse, what do you think about Trump’s new gold card plan where he plans on selling green cards to whoever wants them?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Enlightened_Patriot",
                                            "body": "Who cares who you “know irl”? You probably thought Kamala was going to win. You likely live in a bubble. \n\n1. Illegal immigrants give democrats more electoral votes\n\n2. Illegals immigrants give democrats more more congressmen\n\n3. If Democrats didn’t get BTFO in the last election they would have given these illegal aliens citizenship, allowing them to vote\n\n4.  the children of illegal aliens eventually vote.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "SELECTaerial",
                                                    "body": "I love that you assume all these things about me. How do you deal with such magnificent intelligence on the thoughts and feelings of a complete stranger?\n\nAlso, what’s BTFO mean?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Enlightened_Patriot",
                                                            "body": "I didn’t assume anything. I said “probably” and “likely” referring to the average non-Trump supporting Redditor.\n\nIt’s hard being 10x smarter than Redditors but I deal with it the best I can. I only use the site in small doses to keep my sanity. \n\nBLOWN THE FUCK OUT\n\nHopefully after reading the 4 salient points I just wrote you now understand immigration is an existential threat",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "SELECTaerial",
                                                                    "body": "Where do you get your info from? I’m interested in learning how to assume I’m 10x smarter than redditors",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enlightened_Patriot",
                                                                            "body": "Well when Redditors don’t even know that immigration is an existential threat, it’s a safe assumption. They’re a disgrace to their nation and ancestors and don’t even have the wisdom to notice.\n\nMost Redditors don’t even know any of the 1-4 points I just made. They’re an extremely ignorant bunch of libtard cultists, many of whom are just dying to have their race genocided and their country destroyed because  some Chinese-app told them it’s based. \n\nIt’s not really that hard to be smarter than them, it’s like saying I can play chess better than my cat.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SELECTaerial",
                                                                                    "body": "Can you tell me where you get your info/News from? Like I said I want to become as supremely knowledgeable as you seem to be",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "I don’t watch the news and I doubt that’s possible for you at this point. I’ve been studying politics since I was a minor and am a highly qualified expert. Redditors cannot fathom my knowledge.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "SELECTaerial",
                                                                                                    "body": "Where do you get your news? I never said I watch the news. I haven’t watched the news in probably 15 years. I didn’t assume you watched the news… I wonder if it’s possible some of your other assumptions about me are wrong",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "I never said you watched the news. I said I do not watch the news after you asked where I get my “news”",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheGlitteryCactus",
            "body": "Stupid, uneducated people, with no creative or intellectual drive. And who have no respect for shared property.\n\nThe US education system is a catastrophe. We print high school diplomas like the government prints $$$. There is no bar. You don't need to be able to read, know algebra, or how the checks and balances of government works. You just show up sometimes, throw chairs at everybody for fun. And collect your participation paper after 12 years. \n\nStupid people alone are okay. You can point and they figure things out. But when someone has no creative or intellectual drive, they are DRAINING to interact with.",
            "score": 1,
            "replies": [
                {
                    "author": "Upbeat_Leg_4333",
                    "body": "How do you see this playing out as a danger? Like what dangerous effect does it have. I know there are lots of ways, but curious what you have in mind",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheGlitteryCactus",
                            "body": "These people are unemployable, or if they do find employment, the quality of service for the customer and employer is poor all-around. And if they are unemployed they are a burden to their families, friends, neighbors, and society. \n\nThose who don't have respect for shared property destroy property at worst or are indifferent to it at best. Leading to litter, wasted public funds, hesitance to fund public areas, and tend to be more aggressive overall. They are unsavory to deal with at best, and dangerous at worst.\n\nThe drive for creativity, to learn, to read is important! For personal growth and also for society. Without it society stagnates. We need creative people to paint murals, make music, and make the world beautiful. And we need people who want to learn and innovate too, to develop new technology, and keep the world running (e.g. city and traffic planning).",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Upbeat_Leg_4333",
                                    "body": "Thanks for elaborating. Followup question: any thoughts on what should be done about it? Like educational reforms of some kind?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheGlitteryCactus",
                                            "body": "Sure.\n\n1. We need to fail students when they don't master grade-level material (D or better, even 60% mastery is still okay), *especially* when it is because of refusal to engage with the classwork because they are lazy. They are lazy because there are no repercussions for being lazy.  \n\n2. There must be repercussions for disruptive, destructive, and dangerous behavior. Bratly Bitcherson needs to learn that cussing out the teacher is not okay, and Chad Throws-Chairsly can't chuck furniture because he doesn't want to fill out a worksheet. Education is more than book knowledge, it's also about reinforcing positive behavior, coping with stress, appropriately, and practicing doing things even when we are bored/don't want to. Disruptive students should be removed from class. \n\n3. Increasing teacher pay would also help attract higher quality staff. But that's not always practical, as schools are funded by city and county taxes -- so in poorer areas, you take what you can get as far as staffing goes. \n\n4. Smaller class sizes help as well, making it easier to manage classroom behavior and provide more 1:1 or small-group focus to students with more needs. But again, it's not always practical due to the aforementioned reason. \n\n5. Probably a hot take. The teachers have a professional education specifically in *<stage of life>* education, and parents (most likely) do not. The teachers do actually have a more informed and better opinion about how to teach their students than the parent, and probably also the admin too. No, the teachers are not indoctrinating your kids into being trans, or being gay, or a cat, or w/e. If they could indoctrinating your kids to do anything it would be to STFU, engage with the listen, and do their homework. Sure, there are a few outliers and weirdos because of reason 3. but they are only outliers.\n\n6. That being said, we should vote for teachers for school board and department of education systems with relevant experience and education. Not the stay-at-home mom of Bratly Bitcherson.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ChipmunkFabulous",
                    "body": "What are your thoughts on many uneducated people making up a sizable number of trump voters? ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheGlitteryCactus",
                            "body": "I am happy with the result.   \n  \nTrump did a better job appealing to the uneducated voting population than Kamala did.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Cold_Student",
                                    "body": "So then wouldn't you want more stupid, uneducated people in that case if the GOP appeals to them more?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheGlitteryCactus",
                                            "body": "No.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "regina-Filanji",
            "body": "The media",
            "score": 1,
            "replies": []
        },
        {
            "author": "populares420",
            "body": "censorship \n\nthe bureaucracy/deep state\n\nchina\n\nleftists turning their backs on western values\n\nillegal immigration\n\nin no particular order",
            "score": -6,
            "replies": [
                {
                    "author": "not_falling_down",
                    "body": ">censorship\n\nWould you consider Trump's banning AP from the press pool for their refusal to remove the term Gulf of Mexico from their stylebook to be *censorship*?  That body of water is still called the Gulf of Mexico in all of the rest of the world, and AP is an international news organization. \n\n>The Gulf of Mexico has carried that name for more than 400 years. The Associated Press will refer to it by its original name while acknowledging the new name Trump has chosen. As a global news agency that disseminates news around the world, the AP must ensure that place names and geography are easily recognizable to all audiences. \n\n[https://www.ap.org/the-definitive-source/announcements/ap-style-guidance-on-gulf-of-mexico-mount-mckinley/](https://www.ap.org/the-definitive-source/announcements/ap-style-guidance-on-gulf-of-mexico-mount-mckinley/)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "populares420",
                            "body": "no, it's not censorship. ap isn't being censored. they dont have a right to access the oval office",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "not_falling_down",
                                    "body": "So, if not censorship, what is it when the president bans one of the most respected news originations from doing direct coverage, due to his ego being bruised?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "populares420",
                                            "body": "they aren't banned from coverage. they are banned from the oval office, which they never had a right to",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "not_falling_down",
                                                    "body": "Do you consider his cause for doing this to be a reasonable one?",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "not_falling_down",
                                                    "body": ">they are banned from the oval office, which they never had a right to\n\nDoesn't this go against the whole concept of a free press, meant to serve the people, not the government, when the president gets to arbitrarily choose who can be present to report first-hand?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "populares420",
                                                            "body": "no, it doesn't.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "not_falling_down",
                                                                    "body": "In what way do you think it is in harmony with the principle that the people have a right to free access to information about what the government is doing?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "populares420",
                                                                            "body": "people can still have free access to information",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "justfortherofls",
                    "body": "What are “western values”?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "noluckatall",
                            "body": "Individualism (which is in opposition to Marxism), self-reliance, personal struggle towards betterment, rationalism",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "not_falling_down",
                                    "body": ">Individualism\n\nWhat about people who are trans or gay? Should *they* not have the same right to *Individualism?*",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JealousFuel8195",
                            "body": "Traditional and common sense values. Biological males should never be allowed to compete against girls. The woman of this country for hard for their rights. What shocks me most is how some woman favor their rights being violated. \n\nAnother is failure to prosecute violent and non-violent crimes. Too many cities are ignoring and condoning crime. It many cases they're not even being arrested or prosecuted.",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "kin26ron12",
                                    "body": "The president literally showed us that laws don’t matter and if you support him you’re above the law. Why as a Trump supporter do you bring up crime? You only care about the crimes of people you don’t like, you support a literal “non-violent” criminal lol.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "JealousFuel8195",
                                            "body": "What laws don't matter?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Cold_Student",
                                                    "body": "The ones that involve storming the capital on your president's behalf. Should those J6 rioters not have been pardoned?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Specific-Wolverine75",
                    "body": "Why is it always the left for you and never looking at areas where your party is doing worse? Musk is even “fixing” community notes because it doesnt like what it says? X censors most anti trump or trans posts. The right is the one banning books from libraries? Banning words from research papers? I get it the left might have censored but atleast with good intention, the right seems to censor to control people into hate, can you not see that?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Ultronomy",
                    "body": "I feel like Trump is ensuring China gets the better of us by threatening scientific funding, no?",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Enlightened_Patriot",
            "body": "Immigration and the purposeful genocide of white people and/or Christians who built America into the greatest nation on earth.\n\nAll problems are downstream from immigration. If America kept the same demographics it had in the 1950s, before mass replacement immigration, the radical left would have no power.\n\nIt’s only by flooding the country with legal/illegal invaders that the left can pass their other insane agendas: support for Islamic terrorists, open borders, soft on crime/drugs policies, transing the kids, BLM, communism/socialism, lawfare, assassinating CEOs, attempting assassination of Trump/Elon etc.\n\nFix immigration and everything else will follow. Deport all illegal aliens and their illegitimate-citizen anchor babies. Revert to 1950s immigration policies.",
            "score": 1,
            "replies": [
                {
                    "author": "Upbeat_Leg_4333",
                    "body": "Who are \"the radical left\"? Do you see this as a monolithic group with a single agenda? If yes, what is the end goal of this agenda?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Enlightened_Patriot",
                            "body": "Basically the entire Democrat party",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "agentspanda",
            "body": "1 year:\n\n* Left wing violence due to their media and social media bubbles indoctrinating them with falsehoods and fomenting hate\n* Attacks on the homeland due to Iranian-funded terror groups and/or Palestinian/Hamas-aligned and Iranian-funded terrorist individual actors after the Trump administration green lights Israel to finish the job in Gaza (or attack Iranian nuclear sites).\n\n5 years:\n\n* Recession (these things are cyclical but Tech is making me nervous due to lots of overvaluation)\n* Final gasps of left-wing social indoctrination programs in children\n* Probably still terrorism/left-wing violence but less so for the latter; my hope is the left will get back to normal and realize their collective overreaction by then and issue a huge apology/rebrand\n* Resurgence of a modified leftist movement learning branding lessons from the 2016 and 2024 elections and wrapping their far left-wing views in a socially acceptable moderate framework (hoping that apology/rebrand doesn't look like this, but it probably will and likely should as it's the far-left's best bet)\n\n10 years:\n\n* Hard to say, potentially some sort of technological issue is my bet. We've got a little too much of the world contingent on small points of failure that lack serious redundancies. Whether it's lack of manufacturing, failure of a major internet/worldwide network or system, or even something as simple as a disruption to a major company's supply chain in a big way- it seems every ~10-15 years or so we get a huge global disruption. The next one will be due.\n\nFun thought experiment, thanks for asking this is really cool. I'll be in my mid-50s by the time this list comes to pass and I wonder if I can look back on it then and say \"wow you really nailed it... unfortunately\" or \"lol you were worried about all the wrong things, the Cloverfield monster attacked in 2026 and you're reading this from your underground bunker you should've seen that coming buddy\"",
            "score": -37,
            "replies": [
                {
                    "author": "Jaykalope",
                    "body": "Left wing domestic terrorism hasn’t been seen in the United States since what, the 1970s? Can you tell me why you think it would pose a threat today? I don’t understand the connection you’re alleging- the media is going to make left wing domestic terrorists take action? Which left wing media sources do you feel are most likely to inspire violence?\n\nOn the other hand, we’ve seen right wing domestic terror incidents such as the Charleston church shooting in 2015 by a man who wanted to start a race war and praised neo-Nazis in his manifesto, the Pittsburgh synagogue shooting in 2018 by an anti-immigrant and anti-Semite terrorist, the white supremacist attack at an El Paso wal-mart that killed 23, and another white supremacist shooter at a Sikh temple in 2012 that killed 6. And of course if we go back a bit further you have the 1996 bombing at Centennial Olympic park by Eric Rudolph and the 1995 Oklahoma City bombing by Timothy McVeigh- both right wing terrorists. You don’t fear right wing terrorist attacks despite their prevalence in the recent past?",
                    "score": 50,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": ">  Can you tell me why you think it would pose a threat today?\n\nTo say something hasn't happened in a long time and that's why it's not likely to happen is a pretty odd argument.\n\n> I don’t understand the connection you’re alleging- the media is going to make left wing domestic terrorists take action?\n\nYou understand it perfectly. Or rather, the media is going to make left wingers into domestic terrorists who take action- but same difference.\n\n> Which left wing media sources do you feel are most likely to inspire violence?\n\nI think it'd be easier to say which sources I feel are *not* likely to inspire violence. I think media like The Bulwark, The Dispatch, the WSJ and others do a good job of keeping their focus factual and their reporting even-keeled even if they come at the issues of the day from a place of *supreme* bias against the current administration. You will not find a batch of people that *hate* Trump and everything he stands for more than the folks at The Dispatch; and yet you could **never** credibly accuse them of hyperbole or sensationalism in order to score points with their virulently anti-Trump base. And mind you, I find their viewpoints to be distasteful bordering on abhorrent and occasionally even actually destructive to the country; but I refuse to say they inspire, help foment, contribute to, or generate hostile or violent environment.\n\nQuite possibly nearly everyone else in the media to some degree or another falls in my high school superlative bucket of \"most likely to inspire violence.\"\n\n> On the other hand, we’ve seen right wing domestic terror incidents such as the Charleston church shooting in 2015 by a man who wanted to start a race war and praised neo-Nazis in his manifesto, the Pittsburgh synagogue shooting in 2018 by an anti-immigrant and anti-Semite terrorist, the white supremacist attack at an El Paso wal-mart that killed 23, and another white supremacist shooter at a Sikh temple in 2012 that killed 6. And of course if we go back a bit further you have the 1996 bombing at Centennial Olympic park by Eric Rudolph and the 1995 Oklahoma City bombing by Timothy McVeigh- both right wing terrorists.\n\nThank you for the unnecessary history lesson? I'm not sure what your point was here. Is the assumption that I'm not familiar with our national history? That's an excessively rude thing to assume considering I explicitly mentioned I'm in my mid-40s in my original comment. I watched the live media coverage of the OKC Bombing, believe it or not- and everything else on your list (and more).\n\n> You don’t fear right wing terrorist attacks despite their prevalence in the recent past?\n\nI didn't say that. Why did you ask a question completely unrelated to what I said? Someone asked about the 'greatest dangers' and now you're asking me about something I didn't say I considered a 'greatest danger'. I think about plenty of things that didn't make my list because they're not 'greatest dangers' in my book.\n\nMaybe turn the outrage knob down a little bit if you want to have a discussion, otherwise I might get disinterested.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "proquo",
                            "body": "> Left wing domestic terrorism hasn’t been seen in the United States since what, the 1970s?\n\nThat's literally only true if you don't count anything that happened during the BLM riots, such as the attack on a federal courthouse in Portland or burning of a police precinct in Minneapolis, if you don't count the Congressional Baseball Shooting, if you don't count the attempted bombing of a Portland ICE facility, if you don't count the 2017 UC Berkeley riots, if you don't count the 2023 Atlanta Riots, the Kenosha Riots, the Antifa attack on Andy Ngo, the 2016 Dallas police shootings, the 2016 ambush on Baton Rouge police officers, the 2023 Covenant School shooting, the attempted assassination of Brett Kavanaugh, the first Trump inauguration riots, the May 2020 attack on the White House and St. John's church, and the 2 attempted assassinations of Donald Trump. The list does go on.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Jaykalope",
                                    "body": "You seem to be conflating civil unrest with terrorism. I believe those are very different phenomena. The Covenant school shooting was, as far as we know, motivated by someone who felt persecuted over their gender, not over left wing politics. Transgender folks exist across the entire political spectrum so I’m not sure how that one was left wing terrorism. Trump’s would-be assassins were both Republicans that didn’t give any indication as to their motivations so we have no idea why they did what they did. \n\nCan you explain what you mean by the “2020 White House attack”? I’m not familiar with this incident. Who was the perpetrator(s)?\n\nThat leaves the Scalise shooter and Kavanaugh’s would-be assassin who called the cops on himself before he could act. These folks had anti-conservative tendencies to be sure. But if we’re looking at death count, the right wing domestic terror incidents seem far more deadly to me. We’re talking about hundreds dead versus what, two or three by way of the leftist terror incidents?",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "It really seems to me you're trying to argue \"just because someone is leftwing and and engages in violence doesn't mean that the violence was left wing.\" That's incredibly disingenuous and you have to know it. I'm not going to pick apart every example you gave in an effort to disprove the notion that racism or white nationalism is inherently right wing (Richard Spencer did denounce Trump, after all, and endorsed Biden and Harris) and I'll take your examples at face value.\n\nHowever,\n\n> I believe those are very different phenomena\n\nSo when the violence is being done to advance leftwing political causes or motivated to evoke a political response, or is used as cover by leftwing radicals to engage in violent acts, you don't think that should qualify as terrorism?\n\nDHS and FBI define terrorism as violent, criminal acts intended to intimidate or coerce a civilian population or influence government policy.\n\nWhen protesters riot to shut down the \"cop city\" training center in Atlanta because they're trying to force a leftwing political concept of defunding the police is that not violent criminal acts intending to influence government policy? When anti-immigration enforcement protesters attack an ICE facility is that not violent criminal acts intended to influence government policy?\n\nWhen pro BLM and black nationalists ambush cops in two separate attacks in the same year how is that not terrorism?\n\nThe Covenant School shooter was a tranny who intended to kill as many people in a religious school as they could because, as you say, they felt persecuted for their gender. Gender politics are leftwing. This is like saying the 9/11 attacks were not religious fanaticism but disagreement with US foreign policy. \n\n> Trump’s would-be assassins were both Republicans\n\nNo they weren't and they clearly weren't. That's a media spin to do what you're doing now and downplay leftwing violence and the role the establishment democrats and media played in radicalizing them. Crooks was a Democrat who donated to Act Blue, *the* democrat party PAC, and registered Republican to vote for Nikki Haley in the primary like thousands of democrats did all over the country. Routh was a habitual violent criminal who was deeply pro-Ukraine and had traveled there in an attempt to join the International Legion and communicated with Afghan commandos to recruit them to Ukraine. To say these were Republicans who might totally not have been leftwing terrorists is just wishful thinking.\n\n> Can you explain what you mean by the “2020 White House attack”?\n\nIn May of 2020 during a George Floyd riot rioters attacked the White House and national monuments and set fire to St. John's church. They came close to storming the White House gates and Secret Service went to red alert and took the president and his family to the bunker and prepared to fire on protesters if they stormed the gate. If Jan 6 was an act of terrorism or insurrection then May 2020 had to be also.\n\n> the right wing domestic terror incidents seem far more deadly to me\n\nOnly if you don't count the deaths that resulted from changes to criminal justice systems in several states that defunded police and let repeat offenders back out to offend. Even if you don't the 2020 riots were far more destructive both in terms of property damage and long-reaching consequences.\n\nAt any rate the original assertion was that there has been no leftwing terrorism in the US since the '70s which is a patently false assertion.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "Jaykalope",
                                                    "body": "When was Crooks ever registered a Democrat? According to state records he registered as a Republican when he turned 18 in 2021 and remained one until his death. Routh is pro-Ukraine but so are many Republicans including some of Trump’s most fervent supporters like Lindsey Graham so perhaps you can explain why this makes him a left wing terrorist? Why not a right wing terrorist? For the record I don’t believe he was politically motivated. He seems mentally disturbed. \n\nCaitlin Jenner is a famous trans woman and a Republican who is politically active so I don’t think gender politics are necessarily sequestered on the left. Even Trump once said that trans people should use any restroom they want. Feeling persecuted because of one’s gender doesn’t seem to be political to me but rather, very personal. The Covenant shooter gave no indication as to their politics and acted out of apparent pure resentment and hate for how they were treated by others. You don’t have to be a leftist to feel persecuted because of who you are. \n\nYou should taken note that I didn’t say Jan 6 was a terror incident and I don’t believe it was one. Not sure why you brought that up at all. Protest and terrorism are quite different in my view- while they may both have political connotations, or not, civil disobedience is generally directed at government authorities and institutions whereas acts of terror are often directed indiscriminately at people who have nothing to do with the specific grievances of the perpetrators.",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "> civil disobedience is generally directed at government authorities and institutions whereas acts of terror are often directed indiscriminately at people who have nothing to do with the specific grievances of the perpetrators\n\nThat's also patently false.\n\nTerrorists attack government targets all the time, and direct their attacks away from sympathetic populations all the time. Civil disobedience affects unaffiliated bystanders primarily all the time.\n\nI think you're making a lot of blanket statements that \"sound right\" but are factually false.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "agentspanda",
                                                            "body": "> perhaps you can explain why this makes him a left wing terrorist?\n\nThis is the most hilarious part of the left's pretzel-twisting on this issue to me. I don't care what box a person checked when they registered to vote, or where they punched in their credit card information on the internet last, or what page they 'Liked' last.\n\nThese people tried to assassinate the republican Presidential nominee and ex-president. That really negates all the other piddly administrative nonsense. It's like me seriously sitting here saying some random Jan 6er was \"actually registered as a democrat so him smearing shit on Pelosi's desk was a measure of respect.\" The guys who tried to assassinate Hitler in the bunker weren't trying to take power and negotiate an end to the war, silly! They just were testing a new bomb design because they were all registered nazis! This is just patently ridiculous.\n\nThat's how ridiculous this sounds. If you attempt to assassinate a politician we're going to go out on a limb and say you're driven by the opposite politics. That's just a baseline assumption of the world. The left is dying to turn things into open questions that have never been open questions before and nobody normal is buying it.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "reid0",
                                                                    "body": "trump has been found guilty of running a fraudulent charity. He was found to have been involved in a fraudulent university. he has been found to have sexually assaulted E Jean Carrol. He was found guilty of 34 felonies. He bragged on tape about sexually assaulting women and walking in on girls while they were changing. He said he would probably date his daughter. He lead the charge in separating children from their parents. He encouraged Russia to “find”, by which he meant hack, Hilary Clinton’s emails. He took the side of Russia over all of the United States intelligence agencies.\n\nI could keep listing things like this for a month but you get my point.\n\nYou don’t have to be on the left politically to observe trump as a person who is willing to abuse power, in fact, that’s kind of his shtick. He promised to be a dictator on day one, for example.\n\nIsn’t it entirely possible that a person who leans right politically could see those past behaviours as enough of a risk to want trump specifically to not hold power, not because of his political ethos but because of the risk he poses to the constitution and rule of law?\n\nHere we are, less than a year later and today trump is ignoring court orders that he doesn’t like. It’s not a tenet of right wing ideology to ignore court orders, is it? Traditionally the right is very concerned about the rule of law, aren’t they?\n\nSo again, isn’t it entirely possible that someone who leans politically right, and bothered to register themselves as such, might see trump as enough of a threat to the rule of law to attempt to eliminate that risk?\n\nThere’s already infighting between musk and bannon, but it’s not because they’re not both right wing, is it?",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "I don't scale anything. It just seems obvious to me, though, that left wing terrorism does exist in the US and it is on the rise.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "I don't think there is a difference. Violence is violence. Although I'm not sure I've heard of center political violence before.\n\nThe point I was replying to was that there has been no left wing political violence, all political violence in the US in the past 60 years is right wing. That's a false assertion. We've had tons of leftist political violence just since 2015.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Wonderful-Driver4761",
                                    "body": "You are aware there are various acts of violence committed by the right that liberals would also be concerned about, right? I can list them if you'd like me to.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "Can you explain to me what bearing that has on the truthfulness of the statement:\n\n> Left wing domestic terrorism hasn’t been seen in the United States since what, the 1970s?",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Jaebriel",
                            "body": "George Floyd riots? CHAZ in Seattle?",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Jaykalope",
                                    "body": "I didn’t name January 6 as a terrorist attack either because I consider it to be an episode of civil unrest, although there were folks convicted of things on that day that could possibly be construed as terrorism. Do you consider civil unrest to be terrorism? I guess I see an important distinction there.",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "the_kanamit",
                    "body": "Which 'left-wing social indoctrination programs' are you referring to, specifically?",
                    "score": 43,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "I don't want to be baited into violation of Reddit's enforcement of lack of open discourse on this issue.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "tokrazy",
                                    "body": "Then why bring it up? What are you afraid of?",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "agentspanda",
                                            "body": "> Then why bring it up?\n\nI assumed the matter was obvious. If it's not I'm sure you can do some reading in the socially conservative right to figure out what is meant here. If you're not doing the bare minimum of research to understand the right's objections as related to this matter then I daresay you could learn a lot from engaging with some alternative viewpoints.\n\n> What are you afraid of?\n\nReddit's enforcement of lack of open discourse on this issue.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "agentspanda",
                                                            "body": "No thanks. I think you've either got a gross misunderstanding of what I'm talking about or zero interest in learning in good faith given you jump out of the gate with 'cruel' and 'unempathetic'. Either we're talking about different things, or you're just rude, since I'd argue my position is one of kindness and empathy, so I don't think we've got anything resembling a meeting of the minds. \n\nThanks again for taking the time. I'll be ensuring I don't engage with your material going forward.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "alex29bass",
                                                                    "body": ">got a gross misunderstanding of what I'm talking about\n\nYou've literally been asked multiple times to clarify what you are talking about and you keep being needlessly vague, how can one misunderstand someone who repeatedly refuses to explain themselves?\n\nIf you are indeed talking about trans kids (like you guys always are) no need to censor yourself, people here routinely decry how the left is \"mutilating kids\" or whatever so I doubt you'll face any repercussions from actually explaining yourself, especially on this sub.\n\nMy guess though is that you have no interest in voicing any actual opinion whatsoever and you're just regurgitating the same tired old \"conservatives are being censored\" spiel, prove me wrong.",
                                                                    "score": 19,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "lunar_adjacent",
                                                    "body": "Are you referring to the right’s objective of indoctrination over the last 40-50 years? It’s sounds like you’re afraid the left will use the right’s playbook and play the slow game? But I think where you might be surprised is that the left doesn’t really see this as a fight between right and left, red vs blue, shirts vs skins. This is a fight for humanity and the enemy is the 1% at the top.",
                                                    "score": 14,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SassySleeper1",
                                    "body": "I know someone will call me naive or uninformed or maybe a less charitable word, but can someone DM me to tell me what \"left-wing social indoctrination programs\" you're referring to? Or if there is a thread in another group where I can read about them, I'd appreciate that information. TIA\n\nPS I really did join this group to learn how TS think and what they're concerned about.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "basedbutnotcool",
                                                    "body": "[might help explain](https://www.reddit.com/r/AskTrumpSupporters/s/PYG1jt70Qt)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dijitol",
                                            "body": "Can you DM me if you get a reply to that?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SassySleeper1",
                                                    "body": "I messaged you. Let me know if you got it?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MrMichael86xx",
                            "body": "Antifa. Black Lives Matter. The LGBTQ movement and their narcissistic feeling of superiority over everyone who doesn't believe the same things they do.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "the_kanamit",
                                    "body": "So to confirm, you think Antifa's 'indoctrination of children' is one of the greatest dangers facing the United States?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "MrMichael86xx",
                                            "body": "Not Antifa, the LGBTQ community. One of the greatest dangers? Probably not. A very serious problem? Yes. I don't like it when men use bathrooms and locker rooms with young girls. I don't like children being groomed at \"drag queen story hour\" at their library. I think this is very dangerous stuff and it worries me that liberals aren't interested in protecting our children.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "the_kanamit",
                                                    "body": "Do you have any evidence (or examples) of children being groomed at drag queen story hour?",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "csfroman",
                                                    "body": "Do you like it when children are murdered in mass because of 2A? Should that be a more concerning problem?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "MrMichael86xx",
                                                            "body": "That's a mental health issue, not a 2A issue.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "csfroman",
                                                                    "body": "Yes I know that’s a common deflection.  But the facts just don’t math out in your favor.  Mental health issues aren’t unique to usa. Rampant school shootings are.  And I know I’m howling at the moon here.  This ship has long sailed. There’s more guns than people in this country and it’s not likely it’ll change in my lifetime.  I just enjoy pointing out, people like you don’t actually care about children.  Or at least don’t care unless it’s a rhetorical argument against something you don’t understand. IE trans LGBT issues.  Sound right to you?",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FlobiusHole",
                    "body": "What left wing violence are you worried about?  I’m assuming you think J6 was not right wing violence.",
                    "score": 66,
                    "replies": [
                        {
                            "author": "itsakon",
                            "body": "I always wonder if you guys are really living in the dark or just faking it.         \n\nYou’ve had multiple violent riots with fires, murders, violence, shootings, mass theft and vandalism, etc. In Portland they were putting severed pig heads on porches.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "csfroman",
                                    "body": "I live in Portland and participated in overwhelmingly peaceful protest.  Would you mind sharing a link to the pigs heads on porches thing?",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "Dijitol",
                                    "body": "How did you determine the political ideology of these people?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "itsakon",
                                            "body": "You can go read interviews with BLM and their supporters.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "I’d like specifics if you have them. I’m curious,  how you are interpreting any crimes as politically motivated and not social justice motivated?",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "itsakon",
                                                            "body": "I gave a lead; you can research if you want. But I feel like their political leanings are common knowledge though.         \n\nI’d also mention that many of those rioters are radical leftists who spraypaint things like “Liberals get the bullet too”.           \n\nBut it’s more likely they settle and vote Democrat (if they vote) than it is any Alt Right types vote Trump.                  \n\nThe subject was left wing violence, not political motivation.",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "I’d agree that majority of people who support BLM are progressives. But does that mean if they ever commit a crime, you label it as leftist crimes?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "itsakon",
                                                                            "body": "No but if they’re rioting or committing violence fueled by ideological reasons, it’s leftist violence.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "NoBuddyIsPerfect",
                                                                                    "body": "What if they did it for criminal reasons like looting without consequences because of the chaos? Would that count as left-wing violence if it happened during a BLM protest?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "itsakon",
                                                                                            "body": "If it’s something that would not have happened without a BLM riot, I think it can be included with the BLM riot.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "NoBuddyIsPerfect",
                                                                                                    "body": "What if it would have happened at **any kind** of protest? \n\nTo give you an example:\n10,000 people are at a protest for \"Extraterrestrial Rights\" and a guy shows up and lights a police car on fire. \n\nWould you classify the whole protest as violent? \nCall everybody in attendance a violent rioter?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "itsakon",
                                                                                                            "body": "No disrespect, but I feel like you are really grasping here. For one, that’s the dynamic anti-trumps apply to Trump Supporters all the time.                          \n&nbsp;\n\nBut also, it doesn’t apply.            \nThere *were* violent BLM riots. Murders, assaults, arson, etc. There *was* leftist violence. There *was* a lot of insane looting that happened specifically because of those riots. There was a wild uptick in shoplifting, to the point of helping create food deserts, directly because of those riots.            \n&nbsp;\n\nBLM set out to have disruptive protests, often on busy streets and highways.        \n\nThis resulted in at least two deaths just in itself. But also they did nothing when it became violent, and their supporters wanted it to become violent.              \n\nThere were  also Leftist riots not directly related to BLM, and Democrats literally said their culprits were “just an idea”. Your peers *normalized* violent rioting as a form if protest.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "myotherreddit13",
                                    "body": "lol. Pig heads? You believe Newsmax and Andy Ngo?! 😂 I live in Portland and was here for the mostly peaceful demonstrations in 2020 that were characterized as murderous riots by Trump the right wing media. According to sites like Newsmax and Fox News, Portland was burned to the ground and we all lived in fear for our lives. Was there property damage and some violence? Yes - unfortunately perpetrated by opportunists who were not part of the cause. As there always is. But to say the demonstrations were just violent riots is a complete mischaracterization of the facts. \n\nSo no, man, I don’t live in the dark. Have you been to Portland? Were you here in 2020? Which one of us is in the dark? And BTW - I was at one of the demonstrations and saw Trump’s federal officers (in military fatigues) in unmarked vehicles grabbing peaceful protesters off the streets. They used rubber bullets and tear gas on peaceful college students and mothers (see the wall of moms) who were singing and chanting. The city of Portland sued the federal government for the unlawful detainment of its citizens. The real violence was perpetrated by the Trump administration on the protesters, to the condemnation of people around the world. I literally witnessed it first hand.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "agentspanda",
                            "body": "> What left wing violence are you worried about?\n\nWhat do you mean? Violence has tons of forms. Potential (additional) assassination attempts, mass casualty events, mass protests/riots turned terror attacks, autonomous zones- the same sort of general unrest we see among any given out-group when radicalized.\n\n> I’m assuming you think J6 was not right wing violence.\n\nWhy do you think January 6th wasn't right-wingers? I don't know any evidence that says they were some group of lefty false flag folks or anything like that unless this some Alex Jones thing or whatever- I don't go for that sort of stuff but you do you. Not my jam personally.",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "Kevin_McCallister_69",
                                    "body": ">> I’m assuming you think J6 was not right wing violence.\n\n>Why do you think January 6th wasn't right-wingers? I don't know any evidence that says they were some group of lefty false flag folks or anything like that unless this some Alex Jones thing or whatever- I don't go for that sort of stuff but you do you. Not my jam personal\n\nHow did you interpret that as the OP saying January 6 wasn't right-wingers?",
                                    "score": 33,
                                    "replies": []
                                },
                                {
                                    "author": "lookandlookagain",
                                    "body": "How do you feel about Trump pardoning all the Jan 6ers?  \n\nDo you think they may be emboldened to perform something similar to Jan 6 in the future?",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "FlyingSquidMonster",
                                    "body": "Have you ever wondered about the difference between anti-fascists and right-wing groups? It's a tricky topic, but let's try to understand it together.\nImagine a bully building a big, mean clubhouse. That clubhouse helps the bully hurt other kids.\n * Anti-fascists are like people who want to take down that clubhouse. They believe that if they stop the bully from having that place, they can stop the bully from hurting others. They focus on stopping the systems that let the bully be mean. So, they might try to break down the clubhouse or block it from being built in the first place.\n * Right-wing terror groups (who support fascism), on the other hand, are more like bullies who just want to hurt people directly. They don't care about taking down the clubhouse; they just want to hurt the kids inside. They focus on hurting individuals, not the systems.\nSo, to put it simply:\n * Anti-fascists might break things to stop harmful systems.\n * Right-wing terror groups (who support fascism) hurt people.\nIt's important to remember that violence is never a good answer. But understanding the difference between these groups can help us understand what is going on.\n     In your statement you imply that left-wing terror is worse than right-wing terror. What do you believe left wing terrorism is?",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Enlightened_Patriot",
                            "body": "You have most of the left celebrating the assassination of a CEO.\n\nYou have most of the left calling for the assassination of Trump and Elon.\n\nYou have most of the left supporting the BLM insurrections of 2020.\n\nThey also support the lawfare you alluded to, the arresting, persecution and railroading of mostly peaceful Jan 6 patriots. \n\nThe Democrat party is more a terrorist organization at this point than a legitimate political party. Thankfully Trump won and is treating it as such.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Remarkable_Kale_8858",
                                    "body": "If J6 was mostly peaceful with some violent elements why is BLM not mostly peaceful with some violent elements? I think the ratios are actually gonna be quite close. \n\nThousands of people on J6 participated in the storming of the Capital and maybe 100 if that were explicitly violent. Millions of people marched for BLM and maybe 10k if that were explicitly violent. Do you dispute those estimates? (rough estimates - hard thing to quantify!) I’m trying to be charitable to your side of course",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Enlightened_Patriot",
                                            "body": "BLM was an insurrection, people genuinely trying to overthrow the Trump administration by creating violence, chaos and anarchy. The “peaceful protesters” were overwhelmingly not peaceful and were actually just people there to aid and abet the rioters. But by your logic, a giant antifa crowd which protects the 10 people throwing explosives are all just “peaceful protestors.” \n\nJanuary 6 was a peaceful protest, no attempt to overthrow the government, and just a tiny amount of people committed any violence at all. Nobody was killed.\n\nYou cannot compare the 2. One was a terrorist movement. The other was a peaceful protest with some melee fighting involved. \n\nYes your estimates are ridiculous. BLM was far more violent than you’re estimating.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Remarkable_Kale_8858",
                                                    "body": "J6 didn’t get closer to overthrowing the government by actually being inside the Capitol, getting the counting of votes stopped, and forcing the Congressional chamber to evacuate? You don’t think they would have occupied it for longer if they could? They were trying to stop the steal!",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Enlightened_Patriot",
                                                            "body": "Lol delaying a vote by 2 hours is not “getting close to overthrowing the government.” \n\nJanuary 6ers wanted an audit of the corrupt 2020 election there was no intent to “overthrow the government.” They didn’t even have guns nobody was going to “occupy” the capital. They all left voluntarily after like 90 min. Quit clutching your pearls",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Remarkable_Kale_8858",
                                                                    "body": "We all remember their catchphrase “slightly delay the steal” right?\n\nWhatever it was it was so transparently closer to overthrowing the government than anything BLM did including what having an encampment on a city block",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enlightened_Patriot",
                                                                            "body": "You can stop the steal by protesting and demanding an audit. Also, imagine taking political slogans literally lol. “Stop the steal” ≠ OvErThrOw ThE GoVt\n\nBLM literally tried invading the White House, murdered dozens of people, lit cities on fire and attacked several federal courthouses. You must have been in a coma in 2020, or in a Reddit bubble (same thing).",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Remarkable_Kale_8858",
                                                                                    "body": "I’m so confused they “tried” invading the White House? (When??) Are you saying that’s worse than actually invading the Capitol??? Would it have been ok if they’d successfully invaded the Capitol but only the White House is sacrosanct?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "When the secret service had to relocate Trump in the White House bunker, 1-2 days after George Floyd killed himself. \n\nNobody said trespassing in the capital was “ok,” it’s just completely asinine to describe 90 minutes of peaceful trespassing as an “insurrection” just because a few people got in melees with police.\n\nI think we all know that if BLM/antifa could get next to Trump he would be dead. But I’m sure democrats (gaslighting terrorists who simp for subhumans like Luigi) will deny the obvious.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Remarkable_Kale_8858",
                                                                                                    "body": "The Capitol had to be evacuated too lol, It’s an insurrection cause they got into the Capitol chamber during the tabulation of an election and hey successfully delayed the election, do you not think a lot of those J6ers who fought police would love to do harm to Nancy Pelosi or Mike pence? If one insurrection actually got inside the seat of national power with the intention of interfering with the election, that’s the more successful insurrection lol\n\nBLM got kinda close to the White House, J6 actually got inside the Capitol and actually interfered with the election which was their stated goal",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "Not one single person had any chance of doing any harm to Nancy Pelosi or Mike Pence",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JeffThrowSmash",
                    "body": "Do you think you would have these fears if Trump had lost in 2016 and dropped off the political stage?",
                    "score": 31,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "Good question, but I can't say. I think no matter which republican won the nomination in '16 we would've been looking at a similar path of the left painting them as Mecha Hitler and then treating the fight against them as an existential requirement. So no matter how you frame it by now we'd be either done with their 2nd term or in the middle of another GOPer's 1st and it'd still be the same set of issues on that front.\n\nIran? Yeah- still same deal whether Trump or no Trump. Iran was working on their nuclear program in violation of the JCPOA and sanctions for ages, so (again) either we're in a world where they're a publicly nuclear state now or this world where they're funding Hamas terror attacks and missile strikes against Israelis; but one way or another we would've been in the mix by now.\n\nRecession? They're cyclical so yea- whether Trump won or lost that's bound to happen.\n\nTech catastrophe? Same deal- I think that's just what the \"next big thing\" is going to be. \n\nGood question though, thanks for making me think.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "macattack1031",
                                    "body": "Obviously he hasn’t murdered 6 million people, but the left calling him Hitler is them calling him a fascist. \n\nThis question is more on alignment than policy, but does it concern you that the US just voted with North Korea, Belarus and Iran in voting against condemning Russias invasion of Ukraine?",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "surfryhder",
                    "body": "When was the last left wing terror attack?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "TR_abc_246",
                    "body": "What do you mean by final gasps of left-wing social indoctrination programs in children? Are you saying no free lunches for children in poor districts?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Angry-mango7",
                    "body": "Left wing violence due to their media and social media bubbles indoctrinating them with falsehoods and fomenting hate\n\nWhat are your thoughts on how this narrative was used by the left about republicans during Trump’s time in office, specifically the violent attack on January 6th? Do you think each side is actually indoctrinating people, or could it be a buzz word used by politicans to create further divide?",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Upbeat_Leg_4333",
                    "body": ">Left wing violence due to their media and social media bubbles indoctrinating them with falsehoods and fomenting hate\n\nDo you see this as network effects without particular people driving the indoctrination? Or do you think of it as a propaganda machine dominating by particular people? Do you think that every social media bubble suffers from similar problems or only left leaning ones?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Fando1234",
                    "body": "Are there any examples of left wing violence you can point to? \n\nI know right wing violence is pretty prolific. And I have no doubt there have been pockets of left wing violence, but nowhere near to the extent from the far right.\n\n(This is in no way an attack on you, trump supporters, or the right more broadly. Just a point of fact that the extremes on the right tend to be more violent statistically.)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "tim310rd",
                    "body": "I would add to the 5 and 10 years fears the competency decline we may see from the kids who experienced COVID-19 lockdowns during their key developmental years entering the workforce",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Abridged6251",
                    "body": ">Attacks on the homeland due to Iranian-funded terror groups and/or Palestinian/Hamas-aligned and Iranian-funded terrorist individual actors after the Trump administration green lights Israel to finish the job in Gaza (or attack Iranian nuclear sites).\n\n\nWhat do you mean by finish the job in Gaza? Are you concerned by the level of influence Israel has on Donald Trump? If the US decided to stay out of the Middle East then Iran has no reason to attack the US after all.\n\n>Recession (these things are cyclical but Tech is making me nervous due to lots of overvaluation)\n\nTrump's tariffs are projected to cause a massive recession in all of North America, I assume if a recession is your biggest fear you are opposed to his tariff measures?\n\n\n>Final gasps of left-wing social indoctrination programs in children\n\nWhat do you consider left wing social indoctrination programs? And how could you tell if it had been successfully eliminated?\n\n>Probably still terrorism/left-wing violence but less so for the latter; my hope is the left will get back to normal and realize their collective overreaction by then and issue a huge apology/rebrand\n\nYou understand the left is not a single cohesive group right? They don't have a spokesperson who can apologize on their behalf. Do you think once Trump is out of office political tensions will lessen?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Upbeat_Leg_4333",
                    "body": ">Resurgence of a modified leftist movement...wrapping their far left-wing views in a socially acceptable moderate framework \n\nWhat is the danger from this? I take it you're considering a scenario where they gain power legitimately (instead of violently). But what is the harm you have in mind from this?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "myotherreddit13",
                    "body": "It’s interesting how your fears of the left line up perfectly with right-wing propaganda, yet you only seem to recognize media bias and indoctrination when it comes from the other side. You call out echo chambers, but only when they’re on the left - do you ever question whether you might be stuck in one yourself? \n\nThe reality is, propaganda exists everywhere, and if you’re not willing to examine your own sources with the same scrutiny you apply to others, you’re not thinking critically. Do you recognize your own bias? And what do you do you mitigate that? Take a look at the Ground News App. \n\nAnd if you really want something to fear, look-up neopatrimonialism and its application in modern government structures. Sound familiar? Spoiler alert - it doesn’t end well for any country that goes down that road.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "berderkalfheim",
            "body": "Inefficiency and sanctimony. These go hand-in-hand. And they are pervasively in all layers of our lives.\n\nSanctimony can also be described as self-righteousness. There are a great number of people who believe that they are morally superior than others, and simply look down upon all others. If you don’t agree with them, you are considered bigoted, low-class, backwards, or stupid. Yet, people with this kind of mentality also believe that society owes to them. It owes them opportunity, wealth, success, and if they do not get them, they don’t ever wonder if it’s their own fault. Are they simply not good enough and need to be better? Do they need to work harder and outcompete the competition? No. It’s always the society’s fault, and never their own. Often these people are also the same people with replaceable, sometimes useless skillsets that do only busy work in useless organizations that add little value beyond circlejerking within their own cliques like a DEI Promotion Society. Oh, and these are the same group of people that look down upon the steel workers, miners, garbage men, plumbers, and boilermakers. They consider them “dirty jobs” even though *those* are the jobs that actually produce value. As for them, all they do all day is flushing relevance.\n\nThen you have inefficiency. Both at the government level and at private level, we waste way too much money. Sometimes, it’s to hire these sanctimonious people to do useless work, sometimes it’s just pure waste of taxpayer’s dollars, and sometimes it’s both.\n\nThese two together have normalized uselessness and wastefulness. And at least up until a month ago, these are still growing.\n\nYou wonder why we can’t outcompete China? Or even the Koreans? Or sometimes even the Indians? Because despite that the US is the wealthiest nation on earth, a huge portion of its population is leeching on her blood,producing little to no real value. \n\nThis is basically how SPQR fell.",
            "score": -3,
            "replies": [
                {
                    "author": "Specific-Wolverine75",
                    "body": "I find it interesting what you say about entitlement, however have you not noticed how Trump has made merrit basically entitlement for being white? Just look at Pete Hegseths background and look at General Lloyd Austin, who was part of so many wars and worked his life off at the military, do you not see the irony? I get it maybe you hate “dei” because its an excuse to say people dont deserve the job, but some of them do and you dont correct it by giving the job to white people with lack of experience, or why do you disagree?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "This is going to blow your mind but there is no requirement for military service for a SecDef, and most SecDefs had very little to no military experience. It's a civilian administrative role purposely and enforced by law as Lloyd Austin had to get a waiver from Congress to be SecDef so soon after being in the military. And if the goal is to reorient the existing military establishment then why wouldn't you appoint someone who is not of the existing military establishment?\n\nAlso SecDefs typically don't serve in administrations of opposing parties, so I'm not sure why you're acting as though it's a surprise that Trump replaced Austin.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Specific-Wolverine75",
                                    "body": "I see so your response is that the SecDef that manages an 800Billion dollar budget doesn’t have to meet any qualifications, so merit isnt needed?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "I'm saying\n\n1) You're implying qualifications that don't exist. The President, essentially, sets the qualifications for the candidate he wants for the job which is why Obama had Ash Carter who had 0 military background and was a physicist before joining politics, and Chuck Hagel who never held above the rank of Sergeant and was in the military for a year.\n\n2) Pete Hegseth is qualified for the position. He's a Princeton educated military officer with combat experience, has led veteran advocacy groups, and Trump had eyed several times for positions in his administration. To say he's unqualified is just wrong, especially when he speaks about the reforms and purpose he plans to put the military to.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Specific-Wolverine75",
                                                    "body": "He has never led that amount of money or so much personnel. Not saying his education isnt good but he does not have the leadership experience. Would you put a 30 year old as a CEO for a fortune 500? Probably not but even if you are okay with him in his position atleast be honest and see that someone with much more leadership experience would have been better or stop saying that the old DecSef with his hard work and crazy qualifications did not deserve the position he had?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "> He has never led that amount of money or so much personnel.\n\nNo one has. You're talking about the US military, one of the largest and most powerful organizations on Earth. Lloyd Austin hadn't even led an organization that big and you think he's super qualified.\n\n> Not saying his education isnt good but he does not have the leadership experience.\n\nHe's literally led soldiers in combat. There's not much greater leadership experience you could ask for. He was a Civil-Military Operations officer in Afghanistan, leading coordination efforts between US forces and local governments. He also led public policy advocacy groups. What leadership qualifications are you looking for in this role?\n\n> Would you put a 30 year old as a CEO for a fortune 500?\n\nYou really don't want to make that argument when Mark Zuckerberg, Bill Gates, Larry Page and Michael Dell have existed.\n\nAt any rate Hegseth is 44 so...\n\n> someone with much more leadership experience would have been better\n\nLloyd Austin oversaw the disastrous withdrawal from Afghanistan, record low recruitment and retention, and underwent hospitalization for multiple days before the President even knew. I'm not so sure \"experience\" as you seem to define it is so useful compared to being able to do the work of motivating and reforming the military to accomplish the task of defending the nation and executing the foreign policy of the President.\n\nI thought James Mattis would have been a great SecDef as a highly respected general of Marines and well-known military leader but in practice he was not able to work with the President's policy goals where he disagreed with them, was unwilling to break with the longstanding American tradition of endless Middle East deployments, and wasn't able to transition from being a military leader to a civilian administrator and public policymaker. As it turns out being a strong military leader doesn't translate into being a good civilian government official.\n\nBoth Mattis and Austin have been extremely averse to public spotlight which means they were really bad at expressing or communicating defense or military policy and thereby shaping public opinion from within and without the military. Hegseth has already demonstrated his ability to do that very well.\n\nWhat are the key qualifications you think a Secretary of Defense needs to have and what do those mean for the position?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Specific-Wolverine75",
                                                                    "body": "All of those CEOs started with a small company and grew it!! They learned by growing the company! How big was the team and operation that Pete had led? Pete is unqualified and I am honestly concerned for our national security, he is only taking photo ops etc.. And overall just start being honest with yourself because the only thing that I see is racism since mattis and austin made a mistake like a human but you cant see how Pete with all his history of alcohol etc and how it seems he is only there for a picture is literally what you described of people who believe that they deserve something for who they are, or give me atleast an actual achievement of Pete with results?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "proquo",
                                                                            "body": "It sounds like you aren't even open to the possibility that Hegseth could be a good candidate. You've already chosen a position and are defending it. I asked a pretty solid question about what qualifications you'd like to see how do you think they'd impact the ability to execute the position.\n\n> it seems he is only there for a picture\n\nHe gave a speech to NATO about how Europe needs to be prepared to significantly increase defense spending to match a world where the US can't guarantee their security alone, which is exactly where we are headed with China. How is that not a great example of Hegseth using his communication and public speaking experience to shape and affect US defense policy?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Specific-Wolverine75",
                                                                                    "body": "That speech is what made me think he was not qualified. In his speech he mentioned that we do not have the resources to take on Russia and China at the same time and that our priorities are shifting, i understand our priorities shifting but he basically told the world that we arent as strong as their perception, he also let know our stance before negotiations. It was honestly the worse speech in my opinion given by a SecDef but I guess for you it was okay and I get it, we have different priorities but for me part of it would be to show that the US is number 1 always, wouldnt you agree?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "proquo",
                                                                                            "body": "> part of it would be to show that the US is number 1 always, wouldnt you agree?\n\nNo. Context is important. The reality is that our defense concerns globally are growing while the US is shrinking in power. Chinese naval production, for example, outpaces our own several times over. We don't have the capacity to produce F-22s anymore and the next step for US fighter development is essentially a modified F-15. The increase in use of drones in warfare also means that the power the US does have is being mitigated by asymmetrical forces having serious ability to strike back at modern forces.\n\nIf the US went to war with China, we might not have the forces necessary to contain Russia or Iran simultaneously. If all 3 went to war with us we don't have the capacity to fight them all. We need Europe to step up and replace US military might in Europe if we need, and to create a deterrent against aggression by having the military and force projection capabilities they've lost. This isn't the Cold War anymore where the grand NATO battle strategy is to hold the line until REFORGER units arrive.\n\nIf the administration is taking a pivot to focus more heavily on regional threats and wants the EU and NATO to match our capacity, as they are our allies after all, why would it bad to tell them openly the US doesn't have the ability to take on 2 major military powers alone?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Specific-Wolverine75",
                                                                                                    "body": "Yes but you dont tell the world where you stand. Its like if you have a bussiness and its going bankrupt but there is a new client that if you sign them you are saved. You would never let them know you are almost bankrupt because they might not go with you in the end. You can retrieve aid and blame it on the deficit but this was telling the world we are bankrupt and that we arent as strong aymore, which for me is a mistake. However with us joining Russia and aligning ourselves with dictatorships instead of the free world, what makes us better than China?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "proquo",
                                                                                                            "body": "A government is not a business. Defense strategy is not business strategy, so the comparison doesn't work here. Everyone knows the US is fading in power; it's all over the news and it's apparent in the result of the last 4 years of administration. Maybe in 4 more years the US is back on top and we adjust our defense policy accordingly.\n\n> However with us joining Russia and aligning ourselves with dictatorships instead of the free world, what makes us better than China?\n\nWe aren't aligning with Russia. We're courting them into a peace deal in Ukraine because Trump wants to avoid an Afghan-style military disaster and probably wants an early foreign policy win so he can set the tone for the rest of the term. France is backing his move and rallying the EU to take the lead in security of Ukraine so that there would be no need for US involvement there.\n\nComplaining about the UN vote is as useful as complaining about the usefulness of the condemnation anyways. It was completely performative and had the US voted Yes or abstained it wouldn't have had the effect of making Russia more amendable to peace negotiations.\n\nAnyways what does \"what makes us better than China?\" even mean?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Specific-Wolverine75",
                                                                                                                    "body": "Im sorry but strategy is strategy, because even if its a government on the other side, it is ran by humans and we are all prone to the same psychology where we always overestimate strength. So letting the world know we aren’t as strong was a bad decision for me.\n\nWe could have gotten everything we are getting without aligning with Russia and for you the UN might have not been a big deal but what it shows the world is that america is not reliable anymore and we are siding with dictators. We could have abstained like China.\n\nOne of the biggest strengths the US has had is that its the leader of the free world and perceived as the good guy, it believed in democracy and freedom and law and order. China has always seem untrustworthy because they have no love for the law and can  stab you in the back at any moment. \n\nSadly the US just showed the world that they no longer care about their allies and they no longer care about democracy and removing that good guy perception.  Now its the same to do a deal with China vs the US and actually with siding with Russia, China looks even more reliable so countries are now going to go ask China for help, which overall makes China stronger. I understand you view things very differently than me and for you Pete is perfection, but I think its always good to be honest with yourself and see the hypocrisy’s, for example who would you do a deal right now if you were Canada?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "proquo",
                                                                                                                            "body": "What answer would you need to hear to make you consider that the opposing view may have as much or more merit as your own?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Specific-Wolverine75",
                                                                                                                                    "body": "An answer that shows that this new administration cares about the constitution and the rule of law and that they are not appointing people based on loyalty to the President to dismantle the US democracy. Can you tell me you are not a bit worried and if you aren’t atleast be honest and tell me that you want a dictatorship?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "proquo",
                                                                                                                                            "body": "How is that related to defense policy?\n\n> Can you tell me you are not a bit worried\n\nNo, I'm not at all. Because I have more than a 4th grade education on civics and the constitution. Where was this energy last administration when they were actually creating a bureau of censorship?",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Specific-Wolverine75",
                                                                                                                                                    "body": "I feel they go hand in hand, because I feel Secretary Hegseth was put in that position because of his loyalty to Trump and not because of Merrit. Everything we are doing I feel makes no sense as a democracy and the leader of the free world, as a fascist country it would make sense to align with Russia because together they can beat China. So its weird but I do feel they go together or anything you can add that separates them?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "proquo",
                                                                                                                                                            "body": "> So its weird but I do feel they go together or anything you can add that separates them?\n\nYeah, get out of your echo chambers. Stop taking news from Reddit. You just created some kind of political fanfiction more appropriate in a Tom Clancy novel.\n\nThe US isn't aligning with Russia. We are trying to negotiate peace in Ukraine and that requires carrots for Russia and a stick for Ukraine because neither side wants a negotiated peace from a position of what they feel is weakness. But Trump has been very vocal even in 2016 about the need for peace through strength and wanting to stop the dying in Ukraine. He's been very vocal about the rising global tensions and their risk of leading to nuclear war. His position on those issues directly led Tulsi Gabbard to throw her support in with him after a lifetime as a Democrat politician.\n\nDonald Trump is not a fascist, nor is he leading the country in a fascist direction. Fascists don't decrease the size and power of the government, typically, and don't slash spending.\n\nRight now Russia is aligning with China against the west. If we wanted to drive a wedge the best way to do that is to normalize relations between the west and Russia. To do that we have to cool down tensions by ending the Ukraine war. Trump is pushing Europe to make up the difference when the US withdraws from the conflict and Europe under lead of France is picking up the banner. The same thing happened when everyone cried about Trump criticizing NATO but his criticisms hit home and NATO increased defense spending and military posture. We are seeing the same phenomenon.\n\nThe reason you're crying about fascism and democracy right now is because you're surrounded by people who cry about whatever they see on the news without critically considering the information you're receiving. That's why you cried about Hegseth not being qualified without even considering that most SecDefs don't have significant organizational leadership experience and Lloyd Austin did poorly as a SecDef.\n\n\"Everything we are doing\" consists of a month of a Trump presidency where he's spent most of it fulfilling or attempting to fulfill the campaign promises he made and fill his cabinet positions. How is that anti-democratic?",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Specific-Wolverine75",
                                                                                                                                                                    "body": "I am sorry but it’s not based on reading its based on actions and Donald Trump is acting exactly like a fascist. He is giving himself unprecedented power in executive orders, he literally is removing media from the White House, he is IGNORING the courts, he is saying that he is a king. He even wants to create a fund to buy Tiktok. I am basing everything based on what he says and what he is doing not based on my echo chamber and I think maybe you should pay attention to the executive orders he is doing and how he is saying that he can interpret the law. It might not fit your agenda but he is definitely fascists but more Mussolini type. Can you give me examples of something he has done other than saying that he is not a fascist/king that point that I am exaggerating?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                            "body": "You really don't understand what fascism is, and you aren't even being logically consistent.\n\n> He is giving himself unprecedented power in executive orders\n\nNo he isn't. He's hardly the first president to use executive orders to great effect. Obama was infamous for it, stating that he had \"a pen and a phone\" to take action where Congress opposed him. Donald Trump still hasn't entered the top 10 in terms of presidents by number of EOs, and likely will never surpass FDR who holds the #1 spot at nearly 4000 executive orders. In fact, I'm not sure Trump has yet surpassed Obama's number of orders.\n\nMoreover executive orders only effect the executive branch, and the constitution places all executive power in the president so I'm not sure how you're coming to the conclusion how Trump is giving himself unprecedented power.\n\nI'd argue that Obama's DACA executive order gave him unprecedented power as the constitution explicitly reserves immigration authority I'm Congress.\n\n> literally is removing media from the White House\n\nObama removed the Washington Times, the New York Post and the Dallas Morning News from Air Force 1. There is no right to access the president or the facilities. I'm not sure why you think this is some type of authoritarian move. Nothing prevents these outlets from reporting however they please. The president isn't obligated to give privileged space to slanderous and dishonest outlets. This administration has also expanded what outlets are allowed access to the press pool by making space for alternative media outlets and giving them rotating focus.\n\n> is IGNORING the courts\n\nNo he isn't. It's been suggested by Elon Musk and JD Vance that judicial rulings that impede the president's legitimate constitutional authority may be ignored. That's a reasonable reaction to activist groups shopping for judges to put injunctions on the president's executive actions that are enshrined in the constitution. The constitution explicitly places ALL (as in ALL, please say it out loud) executive power in the office of the president. He can fire employees or disband executive agencies at will.  It is not constitutional for a judge to issue an injunction against his executive actions that fall into his constitutional powers any more than it would be for a judge to place an injunction on Congress convening.\n\nEdit to add: where was this fear of fascism when Biden bragged about ignoring a SCOTUS ruling on student loan forgiveness?\n\n> he is saying that he is a king\n\nHe tweeted \"long live the king\" in celebration for blocking NYC congestion tolls. That's hardly a declaration of monarchical authority. It certainly isn't a coronation. I might go so far as to say it's a joke. On social media. You're claiming fascism over a Tweet.\n\n> He even wants to create a fund to buy Tiktok\n\nHe ordered the creation of a sovereign wealth fund, something done the world over and that Biden even floated the idea of doing. I'm not sure how that's alarming. That actually sounds like a good idea. If we'd invested Social Security in the S&P 500 like Bush suggested it'd have nearly quadrupled by now.\n\nIn 2005 the S&P 500 was around 1200, today it is around 5000. That indicates investment in a sovereign wealth fund might be a great way to manage our money.\n\nI'm not sure why buying TikTok is a problem, either. I wish it'd been banned but if we can't have that buying it out rather than forced divestment is a great way to mitigate the damage caused by the app and keep Chinese infiltration tactics out of our kids' brains.\n\n> he is saying that he can interpret the law\n\nThat's not what he said.\n\nThe executive order you're referring to says only the president interprets law for the executive branch, which is not only a protected power in the constitution but also the whole point of the executive office.\n\nIt's a natural, logical conclusion from West Virginia v EPA where SCOTUS rules agencies cannot create policy outside of Congressional authorization. Executive agencies like the EPA and ATF were creating policies that were effectively laws without Congressional approval or oversight. Other agencies were using their interpretation of the law to block or evade implementation of presidential policy, such as FEMA or USAID. This reins in these rogue agencies and gives them accountability to the electorate through the executive office, and establishes reporting and accountability structures that run through the OMB to the president.\n\nThis isn't a fascist takeover. It's actually a massive boon to individual rights and freedoms as it prevents executive agencies from acting themselves as executive power. I can tell you in my current industry the ATF is despised because they have a history of coming up with new regulations that go beyond the scope and intention of laws and there's no way to buck the system without facing potentially criminal consequences. I'm very happy these agencies are now put on notice that they don't call their own shots anymore. \n\n> he is definitely fascist\n\nCan you define fascism without looking it up or tell me about the history of fascist philosophy?",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Specific-Wolverine75",
                                                                                                                                                                                    "body": "Fascism is a far right government, basically authoritarian capitalism. Through time its been implemented very differently but it culturally likes traditional values and has a very clear class system. Its also about a specific race being superior than others. In practice and in a book its always going to be different than implemented and you can look into history, how every fascist has implemented it differently and thats why I like to call it an extreme right wing that is authoritarian in nature.\n\nYou clearly are just defending Trump and ignoring everything he is doing, but overall Trumps dream is to be a dictator  and have no guardrails and he wants to control people to follow his views which is very fascist. \n\nHe is constantly saying and if you read each one of his Executive orders or how he has changed the wording of federal workers that they respond to him and not the law/the constitution. Yes he can do anything in the executive branch that is part of his “legitimate” power but the courts define what legitimate power is.\n\nHe has doge looking into spending and removing what he does not like without working with congress, which btw is illegal since the impoundment act says that the power of the purse is held by congress so he is ignoring the constitution even when he has all the branches of government. (Will add im no against cutting the budget, I just want him to do it lawfully). He cannot dismantle USAID without congress but is basically doing it. He is banning books and wants to stop teaching slavery, there are hundreds of words that researches can no longer add in their findings. (These are fascist actions because the words and research need to follow his ideals). He is already talking about running a third time but he is ignoring the courts. He is firing every lawyer or oversight committee like in the army. People are quitting under doge because they dont want to do unconstitutional things. The quid pro quo case that he was doing in NYC where Danielle Sassoon quit shows that he isnt following the law. The NY congesting pricing why can he overreach STATE policies, because he wasnt to be a dictator.\n\nI am not a liberal, I am basically abandoned right now so I didnt vote but these are scary times because even if Trump doesnt want to be a dictaror, the people around him definietly do and will take advantage that Trump is allowed to do anything without being criticized, had you thought about that?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                            "body": "How can you accuse me of blindly defending Trump when you automatically take the most anti-Trump stance possible, ignoring facts, context, and historical reality to assign the worst motivations to his actions? I'm defending the truth and policies I support, not a person. Meanwhile, you and others like you twist even the most harmless actions into some sinister agenda—Trump could declare a national free ice cream day, and you'd call it authoritarian overreach.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "Specific-Wolverine75",
                                                                                                                                                                                                    "body": "Hey, im not ignoring facts or anything. Im stating the truth and if you look in history on how authoritarian regimes start, they dont go authoritarian from day to night. They try to do everything slowly, little by little and for me seeing how they are banning books, how they are removing words, its very crazy. If you dont want to believe me its fine but I am really not lying and making up facts and I am quite the history fan. I hope you can see that I am not coming from a bad place and hoping that you can see that my fear is validated or tell me what am I saying that Im lying?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                                            "body": "> tell me what am I saying that Im lying?\n\nBasically all of it. There's so much here that is either based on faulty understanding, complete falsehoods or absolute mischaracterization it's hard to pick even one line of argumentation when it's almost as though I'm discussing the issue with someone that wasn't even awake during the last 10 years.\n\nI could dissect line by line every thing you've mentioned and you still come back and say \"but he wants to be a dictator! We're heading towards fascism!\"\n\nYou've set up a question that's impossible to answer because the answer you want is your paranoia validated.\n\nThe Biden administration was more authoritarian than the Trump administration but you would never hear that argument. Instead you make them up wholesale and portray them as fact.\n\nHow am I supposed to disabuse you of the idea that Trump is a fascist authoritarian when you're completely closed off to it? How do I correct any of the lies you currently believe when you're convinced of them? Even when I try you just accuse me of defending Trump. Yes, defending Trump from the absolute smear campaign that has led to people like you sharing lies and spreading propaganda and insistent that the sky is falling, just as I'd defend you if someone were spreading falsehoods about you.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Upbeat_Leg_4333",
                    "body": "I'm wondering what kind of employees you would consider sanctimonous and what you would consider inefficient. There are lot of jobs where (unlike steal working) it's hard to see the value that is created. Are you including ALL white collar jobs, or only particular ones? Just trying to understand how to draw the line",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Scrumpledee",
                    "body": "You realize you sanctimoniously tried painting people you disagree with while supporting a nepo-baby, right?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "People who support sterilizing children.",
            "score": -12,
            "replies": [
                {
                    "author": "Wonderful-Driver4761",
                    "body": "You are aware this is only .06, or less percent of the population. Are \"trans\" people just the fad on something to hate on? Like the gays of the 80s? Do the Republicans have nothing else to run on other than discriminating minority groups?",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "not important. What percent of the population supports sterilizing children?",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "hadawayandshite",
                                    "body": "Can’t you make the same bad faith argument about ‘people who want to make it easier to shoot children’? \n\nA side effect of medication is ‘sterilisation’- the side effect of current gun laws is children get shot (it’s the highest cause of death in children)",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "Ph4antomPB",
                                            "body": "It’s the highest cause of death if you include 18 and 19 year olds, which are in the age group more likely to be associated with gang violence",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -22,
                                            "replies": [
                                                {
                                                    "author": "hadawayandshite",
                                                    "body": "Why isnt yours bad faith? - no one is aiming to sterilise children but a side effect on a small number of a small number who get hormone drugs is decreased fertility\n\nOne of the side effects on gun laws is a small number of children get killed by them- no one who wants guns aims to have schools shot up",
                                                    "score": 26,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "j_la",
                                    "body": "If the biggest danger facing the US is that some proportion of 0.06 percent of the population *may* voluntarily be on medication which *may* have a side effect on their fertility, does that mean that the the US is an outstandingly safe country?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Enlightened_Patriot",
                                            "body": "Only a failing nation would ever make light of nearly half the country supporting the sterilization of mentally ill children",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "j_la",
                                                    "body": "“Sterilization” implies that this is the goal rather than a side effect. If chemotherapy carried the risk of sterilizing the recipient, would you oppose using it for juvenile cancer patients?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Enlightened_Patriot",
                                                            "body": "Why would anyone risk *sterilization* as a side effect for what amounts to cosmetic treatment, so men can pretend they’re women?\n\nNo offense but that analogy “chemotherapy” just doesn’t make any sense to me. There is no comparing a cancer patient to some dude who wants to look like a chick, the analogy is nonsensical.\n\nYou cannot equate a mentally ill man choosing to pretend to be a woman, to a desperate cancer patient seeking any treatment that may *save their life* regardless of the known severity of the side effects. \n\nThe mentally ill man can simply not take hormone blockers. There is zero evidence that hormone blockers are saving *anyone’s* life, let alone are a commonly useful treatment like chemotherapy. \n\nModern leftism is a cult. Not saying you are in the cult, but this type of thinking would have unanimously been deemed batshit insane 20 years ago. Nobody would have ever defended sterilization.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "j_la",
                                                                    "body": "When you say there is no evidence, do you mean that no evidence exists or that you have seen none yourself?\n\nI did a cursory google search and found a few source that suggests evidence exists that it helps with depression and suicide:\n\nhttps://pubmed.ncbi.nlm.nih.gov/35212746/\n\nhttps://www.jahonline.org/article/S1054-139X(21)00568-1/fulltext\n\nIf it can be an effective treatment and if doctors received informed consent from their patients, why is it a problem? Shouldn’t patients be free to weigh the benefits against the risks and make decisions for themselves? Does the mere existence of a serious side effect render the treatment invalid?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enlightened_Patriot",
                                                                            "body": "Problem is a “cursory google search” is not actual research.\n\nUnbiased observers who research this have overwhelmingly found that puberty blockers do not help suicidal people, at best they postpone suicidal thoughts for about a year. Overwhelmingly “gender affirming care” leads to increased, ghastly rates of suicide. \n\nSo much of the problem with the left is that they’ve created pseudo-scientific organizations that don’t use the scientific method and just push leftist agendas. They start with the conclusion they want and work backwards with a confirmation bias, pretending evidence that doesn’t support their theories doesn’t exist at all or is just some type of “phobia” (homophobia, transphobia, etc) \n\nI’m not losing any sleep over mentally ill transgender people ruining their lives with genital mutilation and puberty blockers. They’re free to consult whichever idiot “doctors” they want. But the Truth is important and the truth is purposely mutilating your body and/or taking “puberty blockers” to become a poor imitation of the opposite sex is batshit insane behavior. These doctors would have all lost their licenses 20 years ago before radical left dogmatists infiltrated medicine and science organizations.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "j_la",
                                                                                    "body": "So if there is actual research from “unbiased” observers that overwhelmingly show that gender affirming care *increases* suicide, can you share a link to that evidence?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Enlightened_Patriot",
                                                                                            "body": "Yes but I’m not going to waste my time doing research for you, especially when, given your idealogy, I have very little faith the information will make any difference to you.\n\nI’m sure if you type your same question into Google or chat GPT you can find what you’re asking for.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "j_la",
                                                                                                    "body": "Which question? “Can you share a link to that evidence?”? I already did a google search and I didn’t find the evidence you are talking about. I found some evidence that said the opposite of what you claimed, and you haven’t explained why that evidence is invalid. You said there was zero evidence that it reduced suicide, but if that was true, why did I find some?\n\nIf the evidence is overwhelming and abundant, I don’t see why you couldn’t share the evidence that you claim exists. Indeed, you are the one making the claim that it increases suicide, so isn’t the burden of proof on you?\n\nMy idealogy [sic] is to evaluate claims based on the evidence presented. What is your evidence?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Enlightened_Patriot",
                                                                                                            "body": "As I said I’m not interested in debating. The evidence is overwhelming and abundant and I don’t really care if you agree or not. I’m not on a mission to convince every person on the internet or debate every flat earther or Muslim zealot either. Life is short. \n\nAnyone who is arguing on behalf of mutilation, sterilization and/or “puberty blockers” is respectfully not someone I will debate. Best of luck on your search for that abundant and overwhelming evidence I’m convinced you’ll find it if you really try.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "j_la",
                                                                                                                    "body": "If it is overwhelming and abundant, why isn’t it showing up when I search for it? If it is overwhelming and abundant, could you provide it quickly and easily? It hardly seems like you’d be wasting any time at all (and you’re responding to me anyway). Why would I need to “really try” if it overwhelming and abundant: wouldn’t my first search have turned it up then? \n\nI haven’t argued on behalf of anything. I’ve asked if patients should be free to pursue effective treatment (which my evidence seems to show it is) if they have informed consent about possible side effects. You claimed that that treatment has the opposite effect of what the evidence shows…so I think it is perfectly fair and reasonable to ask what evidence has shown that to you.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                            "body": "I enjoy responding to people. I do not enjoy doing research that they can just do themselves.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "j_la",
                                                                                                                                    "body": "I tried doing it and did not produce the abundant and overwhelming results you said were out there. If that is truly the case, why isn’t that overwhelming evidence more readily apparent? Maybe we have differing definitions of “overwhelming”. When I hear that word I imagine top hits and pages of results. If that is the case, wouldn’t it be trivial to provide me a source or two? I don’t want to waste your time, of course, but it should take no time at all since the evidence is “overwhelming and abundant”. As you say, doing other people’s research for them is not enjoyable, so why should I need to support your claims? As far as I can tell, they aren’t supported by anything. \n\nWhen you said there was “no evidence” of benefit, was that a result of your research into the topic? Why do you think the outcome of your research has been so different from the outcome of mine, where I did find evidence (which I shared)?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Enlightened_Patriot",
                                                                                                                                            "body": "Idk perhaps you’re not very good at using google or perhaps Google doesn’t want you seeing anything except left wing propaganda.\n\nEither way I’m not interested in doing unpaid research for other people. You’re free to continue believing whatever transgender stuff you want to believe.\n\nI recently watched Michael Knowles debate 25 trans kids on a show called “surrounded.” You can watch that and hear a lot of the evidence from him if you’re actually interested.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "j_la",
                                                                                                                                                    "body": "You told me to use Google, didn’t you? Or is ChatGPT your preferred search tool? Which search function did you use to find the abundant and overwhelming evidence that you claim is out there? What search terms did you use? How did you filter the results for credibility and validity? I think of myself as a good enough researcher to know that the burden of proof rests on me when I make a claim; otherwise people might think I’m bullshitting. \n\nWhen you said there was absolutely no evidence of benefit to gender affirming care, was that based on your searches? Why do you think my searches immediately turned up evidence of their benefit? Why would they do that if none exists? Is there something invalid about the links I provided?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CatherineFordes",
            "body": "demographic change",
            "score": -13,
            "replies": [
                {
                    "author": "EkInfinity",
                    "body": "Do you have a ranking of potential demographic changes from worst to \"best\"?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Jasonp359",
                    "body": "Are you saying that the percentage of white citizens of the US getting smaller is the greatest danger for the country?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CatherineFordes",
                            "body": "yes",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sfendt",
            "body": "Socialists. Terrorists. Globalists. Overpopulation. The CCP. Followers of Sharia law. Lack of strategic mineral resources. Fragile power grid.",
            "score": -10,
            "replies": [
                {
                    "author": "ops10",
                    "body": "Lack of strategic mineral resources? Could you extrapolate? My understanding is that US has everything it needs thanks to a combination of its own vast supply, results of Monroe doctrine and a robust alliance and trading network (plus a navy to deal with any state actor who tries to disrupt it).\n\n I can only see it as an issue when at least two out of the three fall and even then it mostly just gets more expensive and environmentally damaging rather than inhibiting. I do see Trump administration trying to topple that third pillar pretty pretty vigorously, but this is my take. What is yours?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "goldmouthdawg",
                    "body": ">Lack of strategic mineral resources\n\nWe really need to stop fucking around and go get our minerals in Alaska.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WhyWontThisWork",
                            "body": "When we go get them, what are we going to do with them next?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lieuwe2019",
                    "body": "While I agree completely with what you said you could also summarize it with the term…..liberal democrats……",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Upbeat_Leg_4333",
                            "body": "What percent of liberal democrats do you actually think are socialists or globalists? Since we talking about millions of people",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "sfendt",
                                    "body": "Its the policies that support socialism and/or globalism pushed by liberal democrats I think is a threat, not all people that have some liberal views IMO.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "Lieuwe2019",
                                    "body": "Actually I didn’t say anything about socialists or globalists……",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sshlinux",
            "body": "Might get banned for this but idc I have dignity. Jewish and Zionist overrepresentation in government and media is the biggest danger. It's the #1 thing all my Republican, Libertarian, and Old school Democrat friends agree on. I could go into detail why but I won't, let's just say they're behind most bad things with both parties in the past and present. Both sides are bought by their lobbyist groups besides a handful. The one thing I hate about Trump. It's like he forgets who elected him TWICE and throws us under the bus. Hope he eventually gets called out for it by a supporter. Dual citizenship in Congress shouldn't even be a thing just like with stocks. If certain brown people like Arabs or Indians were over represented with population size boomer Republicans would be like \"ok what's going on here.\" I hope I didn't break any sub or reddit rules, if I did oh well.",
            "score": -14,
            "replies": [
                {
                    "author": "tiensss",
                    "body": ">  Jewish and Zionist overrepresentation\n\nWhy do you think so?",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "tetrisan",
                    "body": "Do you think Trump “forgets” about his supporters or just doesn’t really care about them once they get him what he wants?",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "Islam, hispanic population growth, and socialism.",
            "score": -2,
            "replies": [
                {
                    "author": "mispeeledusername",
                    "body": "Why is Hispanic population growth a great danger? Have you met many Hispanic Americans?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "random_guy00214",
            "body": ">Curious what you the greatest dangers are over the next 1, 5, and 10 years. \n\n\n1 year: about 1 million innocent babies will be murdered while still in their mother's womb. \n\n\n5 years: about 5 million innocent babies will be murdered. \n\n\n10 years: about 10 million innocent babies will be murdered. ",
            "score": -9,
            "replies": [
                {
                    "author": "kin26ron12",
                    "body": "Quick questions, when’s your birthday? The day your mother found out she was pregnant or the day you were born? Are you a woman? Why are so concerned about what a woman does with her own body(especially if you aren’t a woman)? This is starting to get way to control, trump supporters love “Freedom” until it’s something they don’t like. This whole evangelical way of thinking and trying to force that on other people isn’t “Freedom”.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "(Not the OP)\n\n> trump supporters love “Freedom” until it’s something they don’t like\n\nYes, that's everyone. You're describing politics.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "kin26ron12",
                                    "body": "Nah, I believe in Freedom for everyone. It’s America right?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "My point is that everyone defines that differently, and in sorting out what is freedom, you are engaging in politics. You might as well be saying \"I like good things and oppose bad things\".",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "kin26ron12",
                                                    "body": "I like freedom, and freedom is all you hear from the right, until it’s something they don’t like. Left isn’t innocent but it’s not weird coming from them(I expect it). But coming from the party of “America….Freedom…..Guns” it’s really weird. Why must you control people? OP’s comment is about abortion, I’m a man(black man) I don’t care what a woman chooses to do with her body, it’s her choice. Just like it’s  your choice to own a gun, say what you want, and practice whatever religion you want. We allowed a group of people to infringe on the freedom on religion by trying to enforce their beliefs on to others. How can you support that?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "SincereDiscussion",
                                                            "body": "I believe in freedom as Americans understood it for most of our history. That includes restrictions on a lot of things that you consider to be freedom and freedom to do a lot of things that you think should be restricted. You're trying to appeal to freedom as an abstract, even apolitical idea, but then if you actually look at our history you are going to start seething at what people supported in the past. You are simply treating your politics as default in order to delegitimize the other side.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "random_guy00214",
                            "body": ">Quick questions, when’s your birthday? The day your mother found out she was pregnant or the day you were born?\n\n\nMy birthday is the day i was born, hence, birthday. \n\n\n>Are you a woman?\n\n\nMaybe, depends on the definition. Can you define what a women is?\n\n\n>Why are so concerned about what a woman does with her own body\n\n\nIt's not their body. ",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "shooter9260",
                                    "body": "In my view, a baby that cannot survive on their own does not deserve rights. They can’t speak for themselves so they don’t get to choose. The parent is their “power of attorney” so to speak and so the decision lies with them. The state should not be involved in any way. \n\nIs the political right prepared to properly fund child benefit programs if they are so concerned about the “sanctity of life” and/or population decline? Elon seems to be doing his part to increase the population he rants about forever but can’t take care of them enough that his ex has to call him out on his own social media for being a neglectful father. \n\nGeorge Carlin had a great bit where he said “the thing about conservatives is that if you’re unborn you’re golden and if you’re newborn you’re fucked”\n\nVice President Vance is talking about this a lot, but *how* do you get people to *want* to have kids again?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "random_guy00214",
                                            "body": ">In my view, a baby that cannot survive on their own does not deserve rights. They can’t speak for themselves so they don’t get to choose. The parent is their “power of attorney” so to speak and so the decision lies with them. The state should not be involved in any way. \n\n\nI'm well aware that your side supports baby murder. It's been supported by people since the days of Noah.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "shooter9260",
                                                    "body": "Ok sure, but again, if it’s so bad, how do you convince women to not “murder babies” as you say (other than by law). How do you fundamentally change the culture?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "random_guy00214",
                                                            "body": "Appeal to their conscience.\n\n\nIf that doesn't work then handcuffs do.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sprout92",
                    "body": "Isn't it more like 600k? Where you get a million (almost double the actual number) from?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Killer_Sloth",
                    "body": "If abortion is outlawed, would you support social safety net programs to support these babies whose mothers don't have the resources to care for them, or who will be orphans/raised by single parent due to their mother dying in childbirth, or who are born with debilitating birth defects that require lifelong intensive care?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "random_guy00214",
                            "body": "Yeah",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Headsdown7up",
            "body": "The liberal man",
            "score": -2,
            "replies": [
                {
                    "author": "SELECTaerial",
                    "body": "What’s the danger with this person? How is he identified?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Headsdown7up",
                            "body": "Their political values undermine the American constitution and their habits are a detriment to fatherhood, family, and children in an American society.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "SELECTaerial",
                                    "body": "Can you be specific? I feel like I’m getting podcast bullet points here. How does the liberal undermine the constitution?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Headsdown7up",
                                            "body": "The modern liberal is pro big govt and often marxist in principle. \n\nThey are anti 1st amendment (advocate for censorship and speech laws, and shutting down opposition voices), \n\nanti 2nd amendment (gun control ), \n\nanti 4th amendment (support govt surveillance, mass gun confiscations & lockdowns), \n\nanti 5th and 14th amendments (affirmative action and race-based policies), \n\nanti 10th amendment (federal overreach in education, healthcare, and regulations), \n\nanti 15th amendment (against voter ID laws)",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "mispeeledusername",
                                                    "body": "How do you define freedom of speech and what do you make of r/LiberalGunOwners?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Headsdown7up",
                                                            "body": "The right to express opinions and ideas without government interference. \n\nLiberal gun supporters are the minority of the left and are also often still supportive of heightened government oversight and restrictions towards firearm ownership.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "mispeeledusername",
                                                                    "body": "Thank you for responding. \n\nSo that I understand the subtext of your writing, am I to assume you are generalizing several things different people believe into one very frightening boogeyliberal? Not judging. I do it all of the time. If I misunderstood and you believe liberals are a hive mind, I’ll see myself out. \n\nThanks again for answering and sorry if this seems blunt. Just trying to understand.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Headsdown7up",
                                                                            "body": "I wouldn’t call it generalizations when over the last few decades the liberal left has made it known what they advocate for and against. They’ve shown time and time again they would prefer to limit our constitutional rights under the guises of safety, charitably, and fairness. \n\nThe points I made towards the amendments and how the liberal left supports ideas that are a detriment to those constitutional rights is very much my focus argument here.   \n\nThere is no boogeyman, as their body of rhetoric and policy preferences speaks for itself.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mispeeledusername",
                                                                                    "body": "Would you agree that “the conservative right” likes to limit our constitutional rights in the name of security and patriotism? I’m speaking of the liberties we lost during the Bush years after 9/11. If the brush shouldn’t be applied broadly, can you explain why not?",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Headsdown7up",
                                                                                            "body": "I would disagree. The patriot act had strong bipartisan support. Especially immediately after the events of 9/11. \n\nObama extended it in 2011, and under Trump it was allowed to expire in 2020.\n\nIn 2015, the USA FREEDOM act was passed as a replacement with more concern towards privacy protections. (And if it wasn’t for Snowden this “solution” would have never happened.)\n\nI think the patriot act was more big govt doing big govt things in the wake of mass hysteria by taking power grabs. It was not something any constituents rallied for, and it was easily sold to the masses as “let’s do what we can to prevent these terrorists attacks from happening again”. \n\nIf it was advertised for what it was, mass surveillance of American citizens without warrant- I am sure the conversations around it at the time would have been vastly different. And I don’t imagine any liberal or conservative would have been supportive of their 4the amendment rights being violated, especially at that scale.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ChipmunkFabulous",
                                                    "body": "What are your thoughts on Trump’s EO banning birthright citizenship? Isnt this a direct contradiction of the constitution? If this is fine to you then what is stopping a democrat from taking away guns? (Yes I am aware that this EO was blocked for this exact reason) ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Headsdown7up",
                                                            "body": "I think the Supreme Court will decide what is and isn’t unconstitutional.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "ChipmunkFabulous",
                                                                    "body": "Yes, they will, hence the blocking of the EO i mentioned, but why is the president in favor of something directly unconstitutional? Should the presidents job be to twist/manipulate/test the checks and balances in place? Is that putting America first? To add to the workload, chaos, and division? Why do republicans cry when gun control measures are proposed then (for the record I am pro gun)?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Headsdown7up",
                                                                            "body": "We will let the Supreme Court decide. They weren’t the ones to block this EO. \n\nWe already don’t grant US citizenship to all those born in the United States although the constitution says otherwise. There should be exceptions, just as there are exceptions for 2nd amendment rights as well.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}