{
    "title": "Today, 21 civil service employees resigned from DOGE, saying they refuse to \"dismantle critical public services.\" How do you feel about this?",
    "author": "Lavaswimmer",
    "subreddit": "AskTrumpSupporters",
    "rank": 58,
    "score": 138,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 120,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1ixzpqb/today_21_civil_service_employees_resigned_from/",
    "id": "1ixzpqb",
    "selftext": "Source: https://apnews.com/article/doge-elon-musk-federal-government-resignations-usds-6b7e9b7022e6d89d69305e9510f2a43c\n\nDo you agree or disagree with the decision these employees made? Should Elon change his DOGE strategy at all?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "fullstep",
            "body": "Obama-era employees had political differences with the direction of DOGE and resigned. That is all this story is. I fail to see the controversy.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Ivan_Botsky_Trollov",
            "body": "**Do you agree or disagree with the decision these employees made?** \n\nhave no idea about the work enviroment there, maybe they culd have banded together and convinced Muskrat to change course\n\n**Should Elon change his DOGE strategy at all?**\n\nyes, it shuld be like a scalpel to remove fat\n\nNot an axe",
            "score": 2,
            "replies": []
        },
        {
            "author": "cchris_39",
            "body": "Good for them.  If you disagree with the boss and feel that strongly about it, you should resign.",
            "score": 3,
            "replies": []
        },
        {
            "author": "sfendt",
            "body": "Employees that don't want to do their job, object to their job, etc should be free to resign, that's their choice, they have to do what's right for them.  There are plenty that of people availale to get the job done - and it does not in any way change my opinion of the good work DOGE is doing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrhymer",
            "body": "I support this 100%. I think we should follow these civil servants to see what they do next.",
            "score": 1,
            "replies": []
        },
        {
            "author": "beyron",
            "body": "Did these employees explain specifically what is being dismantled what the outcome or damage is? Do these employees also realize that if mistakes are made they can be corrected? Do they understand that this is a process and is just beginning?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TMist94",
            "body": "Good for them, you shouldn't remain in a position that doesn't align with you. From my understanding, these workers were Obama-era workers who were shifted into DOGE rather than the people that DOGE specifically hired.",
            "score": -11,
            "replies": [
                {
                    "author": "Orion032",
                    "body": "Though I’m glad to hear your support for free political expression, what are your thoughts on the fact that people within the system felt the need to willingly resign? Do you now feel this may say something about the department itself?",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Innoova",
                            "body": ">Though I’m glad to hear your support for free political expression, what are your thoughts on the fact that people within the system felt the need to willingly resign? \n\nThat is the correct action in the federal government. It's been twisted for years by a beaurocracy that believes they have decision making authority. They do not.\n\nThe leadership gives directions and makes decisions. You have 3 choices:\n\nAgree and execute.\nDisagree, try to convince them otherwise, execute.\nDisagree, resign. \n\nAll the #resistance porn (anonymous interviews, leaking, malicious compliance, obstruction, media mudslinging) is tiresome and symbolic of a broken system. I'm glad it's working correctly now.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Remarkable_Kale_8858",
                                    "body": "Do you think there is any benefit to having staff in the government that remain across multiple administrations, and to have positions insulated from admin changes and from political issues? Who just execute the rote functions of government? (Even assuming there are too many of these people do you think it’s important the government have *some*)",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Innoova",
                                            "body": "Absolutely. But they must be focused on their core function, not their political preferences.\n\nInstitutional knowledge is relevant, but only if applied to accomplish the vision of the administration.\n\nA counterproductive \"legacy\" is more detrimental than committed novices.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Orion032",
                                    "body": "Is DOGE not a bureaucracy? In the most recent press conference it was confirmed that Musk oversees the department and he was not elected nor approved by senate, and they have yet to identify the actual head of the department so we cannot say they were elected or approved either. Along with this, has this department with the power they’ve been given by Trump not qualify as a bureaucracy with decision making authority?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Innoova",
                                            "body": ">Is DOGE not a bureaucracy?\n\nIt is. And Elon is making decisions as the appointed head of that bureaucracy. As directors make decisions for their departments. Note I said leaders make decisions.  Musk is the leader of that group. He is performing according to the directions and decisions of the executive branch. No issue.\n\n>the most recent press conference it was confirmed that Musk oversees the department and he was not elected nor approved by senate, and they have yet to identify the actual head of the department so we cannot say they were elected or approved either.\n\nYou'll have to go back to 2014 to complain about that. USDS is not a cabinet level post. Does not require Senate Advice and consent. This is an odd leftwing talking point.\n\n>Along with this, has this department with the power they’ve been given by Trump not qualify as a bureaucracy with decision making authority?\n\nYou're mistaking appropriate decisions authority and not.\n\nEmpowered person (director, secretary, etc.) Has such decision authority (in the executive branch) as the president gives them.\n\nRandom staffer on the third floor by the water cooler has none.\n\nYou can see this play out in cabinet secretaries and SecDef's and AG's, and etc all resigning if they disagreed with the president, as it's a subordinate role and the executive's will is all that ultimately matters for decision making in the executive branch. (Though can be delegated, ie Musk).\n\nThis is presuming following constitution and all appropriate laws. Which, to date, has not been proven a problem at DOGE.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Orion032",
                                                    "body": "Would you not agree that the scope of operations and authority that DOGE has now is vastly greater than the previous USDS that is used to be? People would say the scope of the USDS was small enough they didn’t care the head wasn’t approved by senate, but DOGE by comparison is involved with so many organizations and is making decisions (such as determining what positions/people are fit to be kept or fired, and having the final say on who can be hired for the federal government) that the head should now be approved because it is basically a completely new department. It has even been renamed",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Innoova",
                                                            "body": ">Would you not agree that the scope of operations and authority that DOGE has now is vastly greater than the previous USDS that is used to be? \n\nSure. Still confined to within the executive branch and executive power structure. \n\n>People would say the scope of the USDS was small enough they didn’t care the head wasn’t approved by senate, \n\nWho are people?\n\n>but DOGE by comparison is involved with so many organizations and is making decisions (such as determining what positions/people are fit to be kept or fired, and having the final say on who can be hired for the federal government) that the head should now be approved because it is basically a completely new department. It has even been renamed\n\nHas it been created by Congress? I believe they have exclusive power to form new cabinet positions.\n\nIf your assertion is correct, Congress would need to create a new Cabinet level position. Until then, Trump is utilizing what Obama put in place. \n\n\"People\" can \"believe\" things if they'd like. \"Should now be\" is an opinion.\n\nWhat is your criteria for a cabinet level position? Since this is a \"Should now be\". What makes a position require congressional approval, specifically? Or is this a \"Stop Trump; We Hate Musk\" thing?\n\n^ Remember for this that it can be equally applied to democrats....\n\nExecutive using executive resources to achieve executive objectives using systems put in place (and uncontested) by the Executive (controlled by the other party) over a decade ago.\n\nThat sounds efficient.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "heroicslug",
                                            "body": "Could certainly say that it is, but I believe it has an 18-month self-termination clause. Don't quote me on the exact time frame, but Doge has finite lifespan.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TMist94",
                            "body": "All it really tells me is that these 21 individuals do not align with what DOGE wants to do. There are plenty of people who would agree with them, and people with these inclinations are free to find employment elsewhere if they'd prefer. People join and leave positions of employment all the time for various reasons. There are more than enough people who do support what DOGE is doing and will work the job happily. \n\nPersonally, I have a general distaste for big government and love the idea of massively downsizing. We'll see in a couple of years after they've had time to work how it all plays out.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Orion032",
                                    "body": "Though it may be the topic of a future post I make, and might be a bit off topic, would you be able to briefly give the reasoning for your distaste of a big government? I imagine a big government is necessary to help a big nation function, especially when you need government intervention to regulate social programs, healthcare, and business regulations?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Enlightened_Patriot",
                            "body": "It says that DOGE is a useful department and the Obama hacks who resigned are Obama hacks",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Orion032",
                                    "body": "Why do you call them Obama hacks? What constitutes a “hack?” Simply being employed under Obama?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Enlightened_Patriot",
                                            "body": "Yeah basically, Obama didn’t really hire anyone who wasn’t a sycophant and hack. He was a Marxist/globalist infiltrator that basically destroyed America by filling our bureaucracy and society with radical, immoral degenerates",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dijitol",
                    "body": "Why do you think Elon/Trump didnt vet these people before keeping them? Seems like it should’ve been the first cut before any other federal employees.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "XelaNiba",
                    "body": "Are you concerned that attorney's for the DOJ don't know who the administrator of DOGE is and the the WH Press Secretary said they will not name that person? \n\n\nAren't Americans entitled to know who is exercising Executive power? Are you okay with a single unnamed bureaucrat vetoing the orders of Senate-confirmed Cabinet Secretaries? How about an unnamed bureaucrat (who may or may not be an employee of the US Govt) single-handedly reapproriating funds? Do you want to see an accounting of where those billions are going? \n\n\nEdit: corrected an auto corrected, added court transcripts for source\n\n\nhttps://www.lawfaremedia.org/article/who-is-running-the-u.s.-doge-service",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "rhm54",
                    "body": "When you say “from my understanding” one what are you basing that understanding?  I assume you’re referring to Musk’s tweet. Which leads to the obvious question, why do you trust him without proof?  Do you typically believe information you’re provided without proof?\n\nConsidering no evidence to back up this claim have been provided and that Musk and DOGE as a whole stand to lose credibility if these were individuals hired by Musk it gives him a motive to lie about it. And given Musk has been known to lie in the past (recently his claims he was a world class gamer) then an individual interested in truth would not take his statement at face value.  Are you an individual interested in the truth?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "thirdlost",
                            "body": "> “The staffers who resigned had worked for the United States Digital Service, but said their duties were being integrated into DOGE. Their former office, the USDS, was established under President Barack Obama after the botched rollout of Healthcare.gov, the web portal that millions of Americans use to sign up for insurance plans through the Democrat’s signature health care law.”\n\nSo not just his understanding, but actual fact",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "TMist94",
                            "body": "I say \"from my understanding\" because I am always open to new information and shifting opinions based on that if and when new information arises. I thought it was pretty implicit in what I said that I don't just \"believe information I'm provided without proof\", but if and until there is new information, I work with what we have to form my opinion. I didn't even read Musk's tweet actually, I rarely use X or Twitter or whatever you want to call it. But it is stated directly in the linked article, quote: \n\n\"The staffers who resigned had worked for the [United States Digital Service](https://apnews.com/article/doge-government-trump-executive-order-1a2fb7235b9d6f178c764cf6c78d3317), but said their duties were being integrated into DOGE. Their former office, the USDS, was established under President Barack Obama after the botched rollout of [Healthcare.gov](http://Healthcare.gov), the web portal that millions of Americans use to sign up for insurance plans through the Democrat’s signature health care law.\"\n\n  \nAs well as in this separate article from CBS, quote:\n\n\"Twenty-one staffers of the [Elon Musk](https://www.cbsnews.com/news/what-is-doge-elon-musk-findings-trump/)\\-helmed [Department of Government Efficiency,](https://www.cbsnews.com/news/what-is-doge-elon-musk-findings-trump/) or DOGE, have resigned, saying in a letter sent Tuesday to White House chief of staff Susie Wiles that they \"will not lend our expertise to carry out or legitimize DOGE's actions.\" \n\nThe staffers said they were part of the U.S. Digital Service, the unit of the White House created in 2014 by former President Barack Obama. The office was renamed the United States DOGE Service by President Trump via an [executive order](https://www.whitehouse.gov/presidential-actions/2025/01/establishing-and-implementing-the-presidents-department-of-government-efficiency/) on Inauguration Day.\"\n\nLink for reference: [https://www.cbsnews.com/news/doge-staffers-resign-us-digital-service/](https://www.cbsnews.com/news/doge-staffers-resign-us-digital-service/)\n\n  \nThe letters seem to be from the staffers who resigned themselves, which I would argue is pretty good evidence. Do you have any evidence to the contrary?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "heroicslug",
            "body": "I think it's wonderful. It's good that they're standing up for what they believe in. If they can't work for this Administration and its goals, it's best that they leave in peace rather than remain behind and sabotage things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amishmercenary",
            "body": "\"The staffers who resigned had worked for the [United States Digital Service](https://apnews.com/article/doge-government-trump-executive-order-1a2fb7235b9d6f178c764cf6c78d3317), but said their duties were being integrated into DOGE. Their former office, the USDS, was established under President Barack Obama after the botched rollout of [Healthcare.gov](http://Healthcare.gov), the web portal that millions of Americans use to sign up for insurance plans through the Democrat’s signature health care law.\"\n\nHonestly I'm genuinely surprised news outlets would print this LMAO.\n\nAlso - if you told me 10 years ago that a president was working with a Tech CEO to use modern technology in order to trim wasteful government spending, I would definitely have assumed it was a Democrat - just goes to show that Republicans are moving in the right direction, using technology for old school ideas!",
            "score": -8,
            "replies": [
                {
                    "author": "3xploringforever",
                    "body": "Do you not know that \"DOGE\" is the former U.S. Digital Service?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "I was more talking about the criticism of Obama and acknowledgement of the healthcare.gov failure lmao",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "p739397",
                                    "body": "It pretty widely accepted that the initial rollout for healthcare.gov didn't go well. That's why Obama created USDS, which then led to a large improvement. Acknowledgement of missteps, while correcting them and iterating for improvement seems like a huge positive. \n\nDo you agree with that? If not, can you speak to why? If you do, does it give you any pause about dismantling USDS (a group that has made many such improvements now to government tech)?\n\nEdit: Guess I got blocked for this line of questioning. Didn't mean to be a nuisance, honestly just curious about what things we might agree or disagree about.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "I definitely agree that the rollout was a failure haha.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "p739397",
                                                    "body": "Does that imply you disagree with the rest of what I said and don't think it's good to acknowledge issues and improve?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": ">Does that imply you disagree with the rest of what I said and don't think it's good to acknowledge issues and improve?\n\n? I mean I'm glad we can publicly acknowledge fuckups, I don't know why that seems like such a lofty goal here- that's kinda my point though, I'm surprised AP would print a criticism of Obama, it seems pretty risque. \n\nAnd I would definitely say that DOGE seems like an improvement over USDS from a cost-saving standpoint.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Ihavemagaquestions",
                                                                    "body": ">I’m surprised AP would print a criticism of Obama, it seems pretty risque.\n\nAre you surprised AP printed it because you’re saying Obama is above criticism by the press or are you suggesting AP would never criticize O due to some bias at play?",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "p739397",
                                                                    "body": "I'm missing what you are saying is a criticism of Obama. USDS was Obama's creation that helped lead to a successful improvement after an initially bad rollout. What exactly is the criticism?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Amishmercenary",
                                                                            "body": "I’m just saying that DOGE seems like it will be saving a lot more money than USDS",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kwahn",
                    "body": ">I would definitely have assumed it was a Democrat - just goes to show that Republicans are moving in the right direction\n\nRepublicans doing something you would have assumed Democrats would do is moving in the correct direction to you?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "Yes I'm critical of the old boomer republicans, and and am much more in favor of the new age MAGA reublican vision. Crazy to me how the left has regressed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DidiGreglorius",
            "body": "This title is really poorly worded — makes it sound like people hired by DOGE resigned from it. They did not. \n\nDOGE is a temporary contracted organization operating out of the USDS. People resigned from the USDS, the office DOGE operates from.\n\nAnd bring on the resignations! Job protections for tenured employees can be unduly strong and present barriers to reducing the federal payroll. \n\nResignations help mitigate that — ending “work from home” is a start but I’d like to see the Administration do even more to spur large scale resignations. Personal cell phones at the office, for example, should be banned.",
            "score": -2,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Does this seem like an oversight to not start with yourself when your main goal is auditing the government for budget strains?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DidiGreglorius",
                            "body": "No, I don’t see this as any kind of oversight at all. It’s been a few weeks.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Why do you think they couldn’t have vetted everyone beforehand? \n\nDoes it seem like if you’re gonna have a team dealing with trillions of tax payers dollars and millions of Americans lives, you’d want to be damn sure who is on that team?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DidiGreglorius",
                                            "body": "You’re just not following. These people weren’t hired by DOGE. They weren’t *in* DOGE. \n\nDOGE is a temporary contracted organization within the USDS. The USDS already had employees.\n\nI’m not going to keep responding if I don’t feel confident you understand that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "So you’re saying Elon couldn’t have fired any of them if he wanted to, like he’s fired every other federal employee?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Quiet_Entrance_6994",
            "body": "That's fine. They didn't approve of the mission, so they left.",
            "score": -13,
            "replies": [
                {
                    "author": "tetrisan",
                    "body": "Do you think it’s concerning that people are leaving so soon when they should have been vetted and clearly knew what the “mission” is?  Maybe they are now realizing how bad this is and don’t want to be associated with destroying our country?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Innoova",
                            "body": "They weren't vetted new hires. They were Obama-era holdovers.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Holly_Goloudly",
                                    "body": "Why do you think DOGE didn’t fire them sooner, such as in the first round of cuts?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Innoova",
                                            "body": "Personally?\n\nWhy would they? Perhaps they hadn't expressed their views. Perhaps they hadn't been integrated yet. There are too many possibilities to accuracy guess.\n\nPerhaps there wasn't sufficient cost-saving from firing them initially. Additionally, doubtful they were probationary, so would take more time.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Holly_Goloudly",
                                                    "body": "Thanks for replying! Musk cited on X that these employees were “Dem political holdovers“, which I interpreted to mean that he & DOGE were aware they had been active employees during the previous administration(s). \n\nAdmittedly, I’m not good at interpreting what Trump and Musk really intend to say because Republicans always correct me on the true meaning. Would you mind letting me know what you think Musk meant by that?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Innoova",
                                                            "body": "I'm presuming he said that AFTER they had their tantrum?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Holly_Goloudly",
                                                                    "body": "Yes, this was after Musk’s tantrum on stage with the chainsaw. \n\nWhat do you think Musk meant by “Dem political holdovers” in reference to the DOGE (formerly USDS) employees who resigned today?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Innoova",
                                                                            "body": ">Yes, this was after Musk’s tantrum on stage with the chainsaw. \n\nTantrum on stage? Celebrating and having fun?\n\n>What do you think Musk meant by “Dem political holdovers” in reference to the DOGE (formerly USDS) employees who resigned today?\n\nThat they showed their politics were more important to them than their job.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "tetrisan",
                                    "body": "Did I say they were new hires?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Innoova",
                                            "body": "Nope. But you strongly implied it via the \"vetted and knew what the mission is\".\n\nAnd \"left so soon\". Also implies new hire.\n\nSo I answered your implication.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "> Maybe they are now realizing how bad this is and don’t want to be associated with destroying our country?\n\nThat's confirmation bias, dear. \n\nAnd no, I don't think it's concerning. They're probably like a good chunk of Republicans who love the idea of government efficiency and cutting spending till they hear about foreign aid or the DOE getting targeted.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "tetrisan",
                                    "body": "So you agree that these cuts are short sighted?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "I didn't indicate that in my comment at all.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "swantonist",
                                    "body": "That isn’t confirmation bias it’s what the staffers who resigned said: \n\n>“We swore to serve the American people and uphold our oath to the Constitution across presidential administrations,” the 21 staffers wrote in a joint resignation letter, a copy of which was obtained by The Associated Press. “However, it has become clear that we can no longer honor those commitments.”\n\nIt’s not concerning to you that staffers are being told to undermine the constitution?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "basilone",
                                            "body": "Not happening",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "How are they being instructed to do that?",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Innoova",
                                            "body": "In their opinion.*\n\nThat's a pretty critical distinction here.\n\nYou stated it as objective fact, whereas it is absolutely their subjective opinion.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "knuckle_muffins",
                                                    "body": "Where in that paragraph does it ever say “in their opinion”?",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Innoova",
                                                            "body": "It doesn't. That's another misleading thing.\n\nThose people feel, in their opinion, that it's violating the constitution. They are not the arbiter of that. \n\nIt's being presented as though that is a fact. It is not.\n\nIt is only those people's opinion, and they resigned due to it. The correct action if they felt so strongly.\n\nNow they will be replaced with people who do not feel it violates the constitution, in their opinion.\n\nYou're treating 21 random people saying \"I took an oath!\" As gospel truth because it feeds your confirmation bias. Especially as all 21 formerly worked in silicon Valley. Notoriously left wing. Perhaps their opinion may be slightly biased.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Holly_Goloudly",
                    "body": "How concerning is it to you on a scale of 1 - 10 (1 not concerned at all or 10 alarmed) that these employees - who were just yesterday technically “the government” - warned that DOGE is making American’s critical IT systems and sensitive data less safe? Why?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "5, cause I don't know what's going on there.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "It's always better to have employees quit than having to deal with the paper work of firing them.",
            "score": -4,
            "replies": [
                {
                    "author": "Holly_Goloudly",
                    "body": "Why didn’t DOGE just fire them to begin with?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "Ask Elon I guess.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JoeCensored",
            "body": "The story is intentionally misleading.   These are not people hired by DOGE.   These are employees of the US Digital Service.   DOGE is run out of a sub agency called the US DOGE Service Temporary Organization.  \n\nThe US Digital Service provides the funding and infrastructure, but otherwise doesn't appear to have much other involvement.",
            "score": -6,
            "replies": [
                {
                    "author": "holeycheezuscrust",
                    "body": "Doesn’t the EO that created DOGE do it by just renaming the USDS to DOGE? How is it misleading?",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Motor_3069",
            "body": "The more resignations happen, the fewer firings are needed. Sounds like a win.",
            "score": -5,
            "replies": [
                {
                    "author": "Holly_Goloudly",
                    "body": "Why didn’t DOGE just fire them in the first round of cuts?",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "sielingfan",
            "body": "OK.",
            "score": -8,
            "replies": []
        },
        {
            "author": "RavenMarvel",
            "body": "I believe they're partisan and don't like President Trump's administration so they left because they don't trust D.O.G.E.\nAmerica is very polarized right now so that doesn't surprise me at all.",
            "score": -7,
            "replies": [
                {
                    "author": "Holly_Goloudly",
                    "body": "Why do you believe that they are partisan?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RavenMarvel",
                            "body": "I believe they're partisan because so far no critical public services have been dismantled so for people to leave their jobs claiming that is absurd at this point in the process imo.\nUnless I missed something, no specifics or examples are even given in the article. What I have seen is people claiming things that haven't happened will happen, such as saying we will cut VA benefits or get rid of student loan IDR plans entirely etc. I have yet to hear of a critical public service for Americans that's being cut. If anyone knows something I don't I'm all ears or eyes lol but so far nothing. Also, as I said before as polarized as the country is I think this is expected. No matter who won I think some people working in the government would quit. Lol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Scynexity",
            "body": "Good riddance.",
            "score": -11,
            "replies": [
                {
                    "author": "Holly_Goloudly",
                    "body": "Do you think the DOGE team going from 65 employees down to 44 employees overnight will negatively impact the DOGE team’s ability to implement plans and achieve their goals efficiently? Why or why not?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "I do not think there will be negative impact, as it sounds like these people were not part of the new DOGE team, but rather holdovers from before when the mission was different.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "populares420",
            "body": "fake news, these were holdovers from the previous DOGE before it was reformed. They aren't new hires. So it's just random butthurt deepstaters resigning. As usual. OUT THE DOOR",
            "score": -18,
            "replies": [
                {
                    "author": "tetrisan",
                    "body": "How is this fake news when the article clearly stated their background and where they came from?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "populares420",
                            "body": "it's misleading because it's just old fed holdovers",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "tetrisan",
                                    "body": "What is misleading about this in the article which clearly states their background and how they became employees of DOGE?\n\n“The staffers who resigned had worked for the United States Digital Service, but said their duties were being integrated into DOGE. Their former office, the USDS, was established under President Barack Obama after the botched rollout of Healthcare.gov, the web portal that millions of Americans use to sign up for insurance plans through the Democrat’s signature health care law.”",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Innoova",
                                            "body": "The implying that DOGE is turning on Elon is misleading.\n\nReal headline \"21 holdovers in Government Agency do not like new direction of Agency, resign\".",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CptGoodMorning",
            "body": "It's good. \n\nIf they cannot support The People's will and the elected President's agenda then they should show themselves to the door. So I applaud them for doing the right thing and exiting stage left.   \n  \nThere are lots of industries where they could be of more use (eg mining, energy, the trades, healthcare, etc.). Hopefully they find a way forward that's more fulfilling for them and useful to society.",
            "score": -11,
            "replies": [
                {
                    "author": "swantonist",
                    "body": "They are maintaining their oath to the constitution. If their duties come into conflict with that, who should they capitulate to? Elon Musk, the unelected bureaucrat, or the constitution?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "CptGoodMorning",
                            "body": ">They are maintaining their oath to the constitution.\n\nWel it looks to me like they knew they were being called to fulfill their oath and it was too much for them to do what the Consitution required. So they left.\n\nThey could not put Country over Party is how it looks to many.\n\n> If their duties come into conflict with that, who should they capitulate to? Elon Musk, the unelected bureaucrat, or the constitution?\n\nSeems like a false dichotomy since they have shown no evidence or proof that Musk has required them to do anything unconstitutional.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "Good, it means that DOGE is working and liberals are being rooted out like the 21 losers who quit.",
            "score": -5,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Should doge have started with themselves before putting the down the hammer on everyone else?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Trumpdrainstheswamp",
                            "body": "No.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Why not?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Trumpdrainstheswamp",
                                            "body": "Because DOGE isn't corrupt and wasteful like all the fraud they are exposing.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "How do we know that when there’s never been an official audit? Who watches the watchmen?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Trumpdrainstheswamp",
                                                            "body": "Because we already know they have uncovered  fraud, not sure what you mean? \n\nWho watches the watchmen? DOGE... that is exactly who watches the watchmen. Again, not sure what you think is going on?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "How do we know they aren’t wasting tax payer money if no one has audited them? Why do you hold blind trust? Or do you know of an official audit of DOGE you can share? \n\nPlus, DOGE *are* the watchmen. Who watches them?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Trumpdrainstheswamp",
                                                                            "body": "\"ow do we know they aren’t wasting tax payer money if no one has audited them?\"\n\nWell, think about what you're asking. How could they be wasting tax dollars by discovering wasted tax dollars? Do you see how that makes no sense?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dijitol",
                                                                                    "body": "You’re coming from the wrong direction. Sure Doge can find waste but how do we know that they’re not being wasteful themselves, that they are doing things lawfully and ethically? \nWhy do you blindly trust doge, unless you have some kind of audit to share?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Trumpdrainstheswamp",
                                                                                            "body": "\"Sure Doge can find waste but how do we know that they’re not being wasteful themselves, \"\n\n\nDo you have any evidence of this at all?  No, so it sounds more like you're being desperate and coming up with red herrings instead of focusing on the facts. \n\n\"Why do you blindly trust doge\"\n\nbecause they are exposing fraud and wasted tax dollars. Not a complicated thing to understand. Why does exposing fraud bother you? Because CNN told you to feel this way, think about it.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Dijitol",
                                                                                                    "body": "\n>Do you have any evidence of this at all? \n\nDo I have evidence of no one auditing them to make sure they are not being wasteful themselves? Or that they are doing everything lawfully and ethically? No. How could I when no one is able to audit them. \n\nCan you please share your evidence of DoGE not being wasteful and that they’re doing everything lawfully and ethically? \n\n>because they are exposing fraud and wasted tax dollars. \n\nAnd? There are corrupt cops who still might uphold the law but will also commit crimes themselves. \n\nWhy do you believe media is dictating what I think but not dictating what you think?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Trumpdrainstheswamp",
                                                                                                            "body": "No, do you have any evidence at all to suggest what you're claiming? No you do not. \n\nBy your logic I can say you're a rapist. I don't need evidence; I can just make the claim.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Dijitol",
                                                                                                                    "body": "Im claiming we don’t know what they’re doing. I think you’re very mistaken. You believe I accused them of something. Please show me what made you feel this way. \n\nI still don’t understand your logic. You believe that if they find waste, that makes it ok for them to not be totally transparent and accountable? \n\nOr do you not care what they’re doing or how they’re doing it, just as long as they find waste in the government?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Trumpdrainstheswamp",
                                                                                                                            "body": "And we know your claim is wrong. We do know what they're doing, they are uncovering fraud as they've done. You're not making any sense here.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Dijitol",
                                                                                                                                    "body": "How do you know they’re not being wasteful themselves? How do you know for a fact that they are doing things lawfully and ethically? Can you please share your sources? \n\nSo back to that example I gave earlier. I think you missed it. \nOne more time just in case. \n\nA corrupt cop can uphold the law and yet break it themselves. That’s why they have Internal affairs to watch the cops. \n\n1. Do you feel transparency and accountability are unnecessary for DOGE? \n\n2. Has there been a court date or official forensic investigations to determine actual fraud was committed? \n\n3. Or is it just his Twitter account that claims he found fraud? \n\n4. Or are you not using the legal definition of fraud? \n\n(Sorry for so many questions but you put me in a weird spot)",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DamnDams",
            "body": "Elon won big time he wanted them to quit.",
            "score": -18,
            "replies": [
                {
                    "author": "tetrisan",
                    "body": "How did he win? Why didn’t he fire them right away?  He says he can fire millions of workers that don’t respond to the OPM email, so why is it so hard to fire 20 people in his staff?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "DamnDams",
                            "body": "How did Elon win?\n\nDid you watch the State of the Union last night?\n\nWere you recognized by the POTUS?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}