{
    "title": "What foods do you consider American?",
    "author": "JustGoingOutforMilk",
    "subreddit": "AskTrumpSupporters",
    "rank": 36,
    "score": 8,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 64,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1j0h2y4/what_foods_do_you_consider_american/",
    "id": "1j0h2y4",
    "selftext": "So, this is a bit of a funny question, I admit, but when you think of American food, what do you think of?\n\nI understand that America is a very big place and that cuisine can vary a lot from location to location, so if you want to suggest some regional foods from your area, go for it.  I also know that, due to the \"melting pot\" of America (at least in the past), a lot of things take inspiration from a lot of non-American cuisines.  After all, we would not have the hamburger without Hamburg steak.\n\nSo what do you think is American food?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "notapersonaltrainer",
            "body": "General Tso's Chicken",
            "score": 12,
            "replies": [
                {
                    "author": "RainbowTeachercorn",
                    "body": "As a non-American, I have never had this (though we have other \"Chinese\" foods that are not truly Chinese), can you describe the dish? A lot of the westernised Chinese foods in Australia include battered meats (eg Honey Chicken or Sweet and Sour Pork/Pork in Plum Sauce). Is General Tso's similar?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Owbutter",
                            "body": "Yeah, it's a battered and deep fried dish with a sweet and spicy sauce.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "So, I'm going to answer my own question, because hey, foodie.\n\nI think hamburgers are uniquely American, and it's one of the things that I've put a lot of study into.  George Motz has a hamburger museum (and he's somewhat entertaining on YouTube), and just how regional things are regarding BORGOR is really interesting.\n\nBarbecue, I would say, is an American food.  It has a ton of influences from enslaved people, natives, etc., but I have written a treatise on barbecue in America.  Quite literally, if you drive a few hours from where I live, you will find distinctly different styles of barbecue, with different meats and rubs and sauces and all that.  Alabama, what are you doing with chicken?  Also, my wife's buddies are begging me to make them another brisket, so I guess I gotta do what I do best.\n\nBut American food, to me, is very regional.  Most people don't know what hotdish is, but if you were a \"country boy\" living in the Midwest, you'd be freaking happy to get what is basically a casserole that is sort of a shephard's pie and it would fill you up.  When I lived in California for a summer, I was foraging uni as much as I could, because why not?\n\nI think, if I have to choose, the most American food I can think of is turkey, because it is indigenous to America and is kind of a family portrait kind of thing.  Also, I love a good turkey.  Hmm.  Might have to get one and smoke it this week.",
            "score": 5,
            "replies": []
        },
        {
            "author": "tinycerveza",
            "body": "Cheeseburgers and Budweiser",
            "score": 2,
            "replies": []
        },
        {
            "author": "MakeGardens",
            "body": "Burgers, Fried Chicken, Chicken Parmesan, Fettuccine Alfredo, Soup, Bagels, Pizza, whole roasted chicken, angus beef steak, Idaho potatoes, cheese, beer, corn.",
            "score": 2,
            "replies": [
                {
                    "author": "iceroadfuckers",
                    "body": "I'm intrigued. How is beer American? I'm not having a go at you I'm just genuinely confused as to why you say that?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MakeGardens",
                            "body": "Well, not all beer is American, just the brands and styles that have developed in America over the years. Nearly every country has their own styles of alcohol.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "iceroadfuckers",
                                    "body": "I read the question as asking what are uniquely American foods and obviously beer was being brewed 100s of years before modern America even existed but I take your point! Can you stop exporting Budweiser, Coors and Miller though please lol?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "agentspanda",
            "body": "Smoked meats (barbecue), most things served during a typical thanksgiving (turkey, stuffing, mashed potatoes, green bean casserole, etc), tacos (fight me, they’re ours now), pizza (NY style- everything else is a lie), chicken wings, fries, takeaway Chinese food, most sandwiches, anything you can get at Waffle House. \n\nI think that covers most bases.",
            "score": 5,
            "replies": [
                {
                    "author": "ConceptualisticLamna",
                    "body": "Can you elaborate on how tacos have become American?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "PlethoraOfPinyatas",
                            "body": "While tacos are Mexican, they are also from the various cuisine from the southwest USA that shares history, culture, and food with Mexico.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ConceptualisticLamna",
                                    "body": "Those places, up to Utah were Mexico, so wouldn’t it just mean tacos are Mexican and with the melting pot of history they have become cuisine the US likes? The Americas is all of Canada down. So, sure tacos are American in that way but how can a cuisine be from the US if the people that invented have been kicked out over and over and over again (both legal citizens and not)? Maybe a diverse US food, but do you feel the US, inthe vision of this administration, wants association with anything culturally related to Mexico?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "PlethoraOfPinyatas",
                                            "body": "Southwest cuisine is its own distinct tradition, not simply a trickle-down of “Mexico.” The Southwest has had a continuous cultural identity shaped by its Indigenous peoples (Pueblo, Apache, Navajo, etc.), Spanish colonization, Mexican governance, and later, American expansion. The foods, ingredients, and techniques have evolved within that blend, making it unique rather than just an offshoot of one country’s cuisine. Even “Mexico” itself, as a nation, was shaped by multiple influences—Spain, Nueva España, France, and long before that, the Aztec, Maya, and many other Indigenous civilizations. Southwest food developed independently while sharing similarities across the region, including parts of Mexico. It’s a little cultural insensitive and ignorant of you to just call it all “Mexican”. Even the cuisine across Mexico varies widely in different regions. \n\nAs for your last point, what do you mean by this administration not wanting an association with anything culturally related to Mexico or the Southwest? Being tough on illegal immigration is a legal issue, not a cultural one. There’s a long history of cross-border cultural exchange, and enforcement of immigration law doesn’t erase or diminish that shared heritage. Are you suggesting that current policies are targeting the culture itself rather than addressing border security? If so, I’d be interested to hear specific examples.\n\nI’ve spent extended periods of time in Mexico, over a year in total. Absolutely love Mexico! If I was traveling there illegally, not on a proper visa, I expect the Mexican authorities to arrest me.. and I wouldn’t blame this on Mexicans having something against my American Culture, but that I broke the law.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "ChallengeRationality",
                                            "body": "Those areas were mexican for less than ten years",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SpicyBanana42069",
                            "body": "Crunchy tacos are 100% American according to my Mexican buddy who hates that I prefer them.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Owbutter",
                            "body": "We culturally appropriated them, unapologetically.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ChallengeRationality",
                            "body": "Soft tacos come from mexico but hard tacos actually originate in the American southwest",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Final_Reserve_5048",
                    "body": "> Pizza\n\nIsn’t this Italian? \n\n> Fries \n\nAren’t these Belgian? \n\n> Takeaway Chinese food\n\nUhh… ok need your help on this one!\n\n> Most sandwiches\n\nYeah sandwiches originate from the UK.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ops10",
                            "body": "And? Why does that matter where a food originates from? As if most of the Western foods aren't based on potatoes and tomatoes, originating from Americas.\n\nWould you disparage European foods as well, given how much there is sharing dishes?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BaronSamedys",
                    "body": "Are you willing to concede that everything you listed has its origins in another country?\n\nAmerica is a baby country. It's only a couple of centuries old. America has no culture.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "What a joke. We got democracy from Italy. Does that mean everything in America is European?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "Pizza and BBQ.",
            "score": 4,
            "replies": [
                {
                    "author": "FrankenPinky",
                    "body": "Isn't pizza from Naples, Italy?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "ops10",
                            "body": "And why does that matter? Foods get imported to and shared with other cultures all the time, do they not?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "FrankenPinky",
                                    "body": "I guess I'm just a stickler for accuracy.  You aren't?",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "Pizza is from New York or Chicago. Italian \"pizza\" is depression on bread.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "verbosehuman",
                                    "body": "I've tried 'em all. Best pizza I ever had was in Borgo San Dalmazzo, Italy (9 hour drive from Naples), and I'm from America.\n\nMy second favorite isn't in America, either. Have you tried the pizza in any other country?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "sielingfan",
                                            "body": "Margarita Pizza in France was amazing. If you ever wanna get wild, order pizza in Japan. I got one that was two feet tall, which is not a typo. \n\nBut my #1 overall pizza is still from some dude named Johnny who bought a shack behind the grocery store in Syracuse and put a brick oven in it",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Enlightened_Patriot",
                                                    "body": "Dominos Pizza > all pizza in Europe",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "sielingfan",
                                                            "body": "Who hurt you",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FrankenPinky",
                                    "body": "And the hamburger isn't German, I suppose?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "quendrien",
                                            "body": "Correct. Literally the intro blurb on Wikipedia will tell you it originated in America",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Wootai",
                                    "body": "Isn’t pizza from New Haven?",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "Hamburgers are American. BBQ is American. Fried chicken is American. Even Chicken Parmigiana is American. The dish used to be made with eggplant only, it wasn't until Italian immigrants came to America that they were able to make it with Chicken.",
            "score": 3,
            "replies": [
                {
                    "author": "sshlinux",
                    "body": "Hamburger came from Germany, hence the name. BBQ came from the Caribbean. Fried Chicken came from Scotland. None of these are inherently American we just Americanized them.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "p739397",
                            "body": "I think the foods as they are today, while they have roots from other places, are American. In the same way, Italian pasta dishes can be considered Italian, even though pasta isn't originally from Italy. Does that seem fair?\n\nOther places may cook food over fire, but the BBQ we talk about today (Texas, Carolina, etc) is an American food. The origin for hamburger isn't even super clear, but the food as we know it today is an American food.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "sshlinux",
                                    "body": "America just Americanized and added on to those foods. But I wouldn't call them American they're just part of our culture. The origin for hamburgers is clear, it originated in Hamburg Germany. And the hamburger we know today from minced meat machines was from Germany. Americans added cheese, the cheeseburger.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "JustGoingOutforMilk",
                                            "body": "Hamburgers originated in America.  Hamburg steak did not.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Enlightened_Patriot",
                                            "body": "Nobody would recognize the nasty crap they served in Hamburg Germany as a modern day hamburger.\n\nEveryone would recognize a McDonald’s hamburger as a “hamburger”  \n\nShitty bread, tomato sauce and cheese may have first been put together in Italy — but America made these 3 components into truly Great Pizza by improving all 3 components and combining them in an ideal way. \n\nYou’re basically saying that America didn’t invent modern airplanes because some dork invented a hang glider in another country. It’s a weak trick that seeks to downplay American innovation and exaggerate foreign inventions.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AccomplishedCarob307",
            "body": "Soul food, cobbler/pies, BBQ, American-styled versions of other food (which natives are very quick to point out are different from their nation’s versions) like TexMex, American Chinese, American sushi, American Italian food (pizza and calzones particularly), the traditional Thanksgiving spread (turkey, stuffing, green bean casserole, Mac and cheese, sweet tea, etc)\n\nI always cringe a little when people try to say that hamburgers, as they exist today in America, are the responsibility of Hamburg (Tom Holland’s condescending quips come to mind). Hamburg didn’t invent ground beef, and there is no consensus that the American burger (as understood today) is the result of anything coming out of Hamburg, Germany.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sshlinux",
            "body": "I can't think of any \"American\" foods. Hamburger, pizza, fried chicken, etc all came from Europe as did the people. We just Americanized them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jackneefus",
            "body": "Many American foods are now global.  \n\nThanksgiving dinner is not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "halkilmer95",
            "body": "Philly Cheesesteaks.\n\nAnything made with corn, potatoes, tomatoes or chocolate. Those literally came from America and the rest of the world did not have them until the age of exploration.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sielingfan",
            "body": "Barbecue for sure. Fast food in general, most fried things (with a few exceptions). Bagels, and all the things we do to bagels. 'Trendy' food stuff, like basically everything you see in a Starbucks or anything that has \"gluten-free\" on the label. Food trucks and street food fare (food becomes American when served from a truck or cart, regardless of what it was before). Mac and cheese, hot dogs, lobster, steak if it has red in it (or if it's chicken fried), popcorn, popcorn chicken, popcorn shrimp. Cajun! Tex-mex, breakfast burritos,  breakfast sandwiches, pancakes, biscuits and gravy, five dollar footlongs that cost $13.50, anything you can add bacon to, bacon, corn on the cob, salt potatoes,  chips and dip as a concept, mozzarella sticks, dinosaur nuggets, breakfast cereal, pigs in a blanket, turkey sausage, turkey, sausage, smoothies, milkshakes, ice cream cones.... um...  Gumbo.... jambalaya, chili, chili mac, chili dogs, sloppy Joe's, tuna noodles casserole,  casseroles,  hot dish..... uh.... that's all the kinds of shrimp. Oh, Hawaii is America, so we also get poke bowls\n\nThen there's food that we eat in America that we think of as foreign or exotic,  but really only exists (in the form in which we eat it) in America.  Most Americans have never eaten Chinese food, only food from a restaurant in America which calls itself Chinese.  Italian is a little less, but also a bit like that. Mexican and a little bit Indian as well.",
            "score": 1,
            "replies": [
                {
                    "author": "JustGoingOutforMilk",
                    "body": "This is just me being silly, but I think Scotland might want to have a word with you regarding \"most fried things!\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "jcash5everr",
            "body": "BBQ. Certain veggies/fruits such as corn and cranberries.",
            "score": 0,
            "replies": [
                {
                    "author": "Fun_Design_8834",
                    "body": "I'm not American, but one thing that strikes me as very American (maybe just southern?) is cassaroles. Like green bean cassarole, or other cassaroles you'd bring to a potluck. We obviously cook thing IN cassarole dishes where I'm from, but then it's lasagna for instance, and that feels different somehow?\n\nPlease correct me if I'm way off the mark, cassaroles might not even be American originally for all I know lol",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jcash5everr",
                            "body": "They are definitely a thing. I didn't think of it when I was making my few suggestions but my wife makes an amazing green bean casserole",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thirdlost",
            "body": "OP ask seemingly fun question\n\nTS give answers\n\nNS respond: you are wrong you ignorant Hicks",
            "score": 0,
            "replies": []
        }
    ]
}