{
    "title": "Any Regrets?",
    "author": "Maleficent-Toe1374",
    "subreddit": "AskTrumpSupporters",
    "rank": 30,
    "score": 21,
    "upvote_ratio": 0.68,
    "num_comments (reported by reddit)": 186,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1j1cox9/any_regrets/",
    "id": "1j1cox9",
    "selftext": "Do you or anyone you know have MAGAregrets or whatever from voting for Trump about a month into his second term?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "quendrien",
            "body": "The big issues with the Administration are what I expected — so can’t exactly say “regrets,” but certainly disappointed vindication.\n\nFor starters, the deportations are low—lower apparently than Biden’s and Obama’s monthly averages. Embarrassing!\n\nImmigration rhetoric keeps amping up wrt pathways to citizenship (H1Bs, newly announced “Gold Cards”)\n\nSome eerier and more deeply concerning things:\n\nThe alliance with sectors of Silicon Valley that are (or that work with) defense contractors benefitting massively from hawkish attitudes (see the significant associations with Peter Thiel)\n\nThe onboarding of Musk who has over-exaggerated or outright lied about the cuts of wasteful spending, or mischaracterized what that spending was for (cutting NPS funds? Seriously?), while he simultaneously develops policies that shield his companies \n\nThe weird and deceitful aspects like the complete failure to deliver on the Epstein files (because of course Congress and/or their PACs and donors would be implicated). This is a big one. If Trump wanted to “drain the swamp,” these files are his golden ticket. We could genuinely begin a new episode of American history *tomorrow* if those names were made public. But he won’t, and I didn’t expect that he would. \n\nAnd of course the deepening of our pledge to Israel.\n\nMost of the policies so far just seem like rabble rousing and not truly substantial. We’re really not dealing with the Rs version of FDR here despite the image both sides are trying to push. Just another DC pushover, however cantankerous and frustrating.",
            "score": 62,
            "replies": [
                {
                    "author": "TuPapiPorLaNoche",
                    "body": "Thank you for giving an honest and thoughtful personal assessment of how you view the current situation. \n\nIm curious how you feel about so many in this thread not giving any real answers to the post? Do you think its just trolling, a cultish attachment to Trump, and/or ignorance?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "quendrien",
                            "body": "Probably a mix of all 3. I see politicians, Trump included, as tools. I have no problem criticizing when criticism is needed. This isn’t football",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DifferenceKey2991",
                    "body": "Where have you seen that deportations are lower? I have primarily seen the opposite",
                    "score": 2,
                    "replies": [
                        {
                            "author": "quendrien",
                            "body": "https://www.reuters.com/world/us/trump-set-broaden-arrests-deportation-routes-expand-immigration-crackdown-2025-02-21/\n\nWild stuff.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Linny911",
                                    "body": "Deportations are lower because illegal crossings are lower. What matters more is how many are being let in, not how many are being deported.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "quendrien",
                                            "body": "True. There’s nuance. But the rate literally went off a cliff after the first week or 2",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Linny911",
                                                    "body": "That's because the number of illegal entrants did too.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "quendrien",
                                                            "body": "Friend, *conservative* estimates are tens of millions of illegals in this country. The Admin has deported less than 40k. At that rate not a single dent will be put into solving the problem (and it's not *even* at that rate anymore). Let's not cope.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Chizukeki",
                                                                    "body": "I deeply respect your honesty on this post. So thank you. I think I'm supposed to frame this as a question?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "quendrien",
                                                                            "body": "Thanks.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "awesomface",
                                                                    "body": "I mean, putting a stop to the actual problem is the obvious first step that absolutely helps. I would definitely like to see more deportations for the people here but obviously that can be a lot more difficult.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "quendrien",
                                                                            "body": "admin just doesn’t have that dawg in them actually",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "awesomface",
                                                                                    "body": "Yeah it's still early as well, but my only point is stopping where the source was is absolutely a necessary move to keep it from getting exponentially worse. Gotta remove the motivation for people to continue these migrations. I would like to see them continue to follow through and accelerate current deportations too, but imo we can actually manage a certain level of who's already come through but they shouldn't expect it's going to be a given nor free money.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thirdlost",
            "body": "The downvotes on this one are astounding. OP asked if any regrets, and TS getting downvoted into oblivion for answering that they have no regrets. \n\nIt seems so petty and hateful to me. And rather indicative of the modern progressive who has no tolerance for thoughts and opinions that do not agree with their own.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Linny911",
            "body": "How he's handling the Ukraine conflict, and treating friends and allies.",
            "score": 8,
            "replies": [
                {
                    "author": "BigDrewLittle",
                    "body": "What gave you the idea he would handle those any differently than he has, and how would you respond to TSs who love how he's treating Ukraine/Zelenskyy?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "coulsen1701",
            "body": "Not one. As a side note, this sub has turned into a downvote factory for depressed and angry leftists so they can feel like downvoting actually makes a difference in our lives and scream about egg prices, not a place to discuss differences. If mods aren’t going to rein this shit in there’s no reason for any of us to continue engaging here.",
            "score": 3,
            "replies": [
                {
                    "author": "Snacksbreak",
                    "body": ">If mods aren’t going to rein this shit in there’s no reason for any of us to continue engaging here.\n\nAre they able to stop people from downvoting? Also, this isn't a new problem, so don't most TS folks use burner accounts on this sub?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JoeCensored",
            "body": "Only the usual fake accounts on reddit pretending to be conservatives, but only ever posting far left opinions.\n\nThe only thing MAGA is worked up about right now is we expected the Epstein client list last week.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "Nah, most of the things he’s doing I expected. No administration is ever going to be perfect, so make no mistake I do have my fair share of grievances.",
            "score": 3,
            "replies": [
                {
                    "author": "jredjolly",
                    "body": "What’s on your list of grievances?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "His stance on Israel and DOGE. I’m not sure if CFPB should have been eliminated. I think a lot of Trump supporters are trusting Elon to do the right thing, but I’m personally uncomfortable of him doing that after learning it was an efficient program.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "jredjolly",
                                    "body": "Can you share more about your thoughts on Elon Musk? How risky do you think the DOGE efforts are?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Yeah, at this point I’m just hoping he actually tries to cut the Pentagon and negotiate drug prices. I think DOGE efforts are indeed risky because with a chainsaw you not only cut the fat, you might also cut some muscle and bone. \n\nI do acknowledge that some level of risk is acceptable though. He warned that there will be temporary hardship due to this shock therapy. This is the price of actually trying to balance the budget.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "-OIIO-",
                    "body": "Best decision I've ever made in my life.\n\nDOGE is solving big problems inside our gov.\n\nTrump is dealing with the war broker Zelensky very well. Hopefully we will end the war crap and the complaints of those bitchy Euro clowns very soon.\n\nEverthing is fucking awesome.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "DOGE is actually pretty controversial though. I think there are clear conflict of interest and I don’t feel comfortable with the CFPB being removed after learning it was an efficient agency.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "trilcks",
                            "body": "You aren’t upset that Trump isn’t being a tough negotiator and is scared of Putin?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "-OIIO-",
                                    "body": "Scared for what ?\n\nWe are United States, we do not take responsibility for bullshits and crap happened in EU.\n\nWe should mind our own business, rather than become a world police.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "trilcks",
                                            "body": "Upset that Trump is afraid of upsetting Putin while Putin doesn’t seem to take any of Trumps threats as credible?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "-OIIO-",
                                                    "body": "Putin is ultimately irrelevant to US.\n\nRussia will not invade US, US will not invade Russia. These two countries are separated by a nice ocean. \n\nSo why bother ?\n\nWe mind our own business, EU minds his own shithole dealing with Russia. \n\nIf EU wants our help, they need to pay. Very simple.\n\nThis is common sense.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thirdlost",
            "body": "OP (and other NS), all the stories you are hearing in the media about Trump. Supporters who have regrets is a lie. It is a fabricated narrative created to deceive you.\n\nMy one hope if anything Good is to come of this, is that seeing the answers from real people here will help you understand how the media lie and deceive you, so you don’t get deceived again in the future  \n\nAs for me, no regrets.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGlitteryCactus",
            "body": "He's been a great President so far. Definitely one of my favorites.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "AU_WAR",
            "body": "I do not have any regrets, nor does any of my family and friends.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OKGO9999",
            "body": "Only thing are Medicare because my parents and I rely on it. Do any of you guys feel the same about this? Or do you guys have private insurance?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChallengeRationality",
            "body": "I dont know anyone with regrets, I think most Trump voters in my circle are impressed by how quickly trump is moving",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "nope.",
            "score": -9,
            "replies": [
                {
                    "author": "-OIIO-",
                    "body": "Best decision I've ever made in my life.\n\nDOGE is solving big problems inside our gov.\n\nTrump is dealing with the war broker Zelensky very well.\n\nEverthing is fucking awesome.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JealousFuel8195",
            "body": "None! Zero! It's been 5 weeks. Why would or shoud I have any regrets?",
            "score": -8,
            "replies": [
                {
                    "author": "bigtiddyhimbo",
                    "body": "Maybe because in that 5 weeks, the economy has already taken a huge hit, our allies now no longer trust us, we’ve aligned ourselves with the likes of china, Russia, and North Korea, AND you are now very likely to lose your social security? Maybe that’s why?",
                    "score": 45,
                    "replies": [
                        {
                            "author": "JealousFuel8195",
                            "body": "In what was has the economy taken a HUGE hit? \n\nDid our allies trust us under Biden or did they take advantage? \n\nWhere is your proof that I will likely lose my social security? I am on social security. \n\nHow have we aligned ourselves with China, Russia and especially North Korea?",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "bigtiddyhimbo",
                                    "body": "If you have to ask that, then you’re not paying attention \n\nOur allies trusted us and you took that as being taken advantage of. We were in a mutually beneficial relationship with multiple countries, especially Canada, that are now being shat on \n\nElon musk has gone on record now on Rogans podcast saying that SS is a Ponzi scheme that should be cut out through DOGE. Good luck getting your social security check there brother. https://youtu.be/sSOxPJD-VNo?si=KyZl4vHf8ywabggz\n\nAnd we have voted consistently alongside Russia, North Korea, and China since Trump has reentered office. That shouldn’t surprise you considering how he and his second clown in command treated Zelenskyy at that last meeting. https://news.sky.com/story/amp/europeans-win-in-un-clash-with-us-over-rival-resolutions-on-ukraine-war-13316417\n\nAny other questions?",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "Flussiges",
                                            "body": "Mod note: this is not a violation of rule 3 because the TS directly asked a question.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "BWLangWrites",
                                            "body": ">Our allies trusted us and you took that as being taken advantage of. We were in a mutually beneficial relationship with multiple countries, especially Canada, that are now being shat on\n\nYou should be even more happy than. Now the Tarrifs being imposed by Canada on the USA are being reciprocated. Very mutual i'm sure you'll agree.\n\n>Elon musk has gone on record now on Rogans podcast saying that SS is a Ponzi scheme that should be cut out through DOGE. Good luck getting your social security check there brother. https://youtu.be/sSOxPJD-VNo?si=KyZl4vHf8ywabggz\n\nOh no. How dare they ever think about changing inefficiencies.\n\n>And we have voted consistently alongside Russia, North Korea, and China since Trump has reentered office. That shouldn’t surprise you considering how he and his second clown in command treated Zelenskyy at that last meeting. https://news.sky.com/story/amp/europeans-win-in-un-clash-with-us-over-rival-resolutions-on-ukraine-war-13316417\n\nHave you ever once stopped to think about what it takes to end a war? \n\nThere's two options because Ukraine can't take back their land with their own troops.\n\nWe can either \nA)\nthrow in our own troops into the mix. Possibly starting off an even larger conflict which risks starting off ww3 or even nuclear war.\n\nOr B)\nGive Putin an off ramp. Yea he's a piece of shit, yea he's an invader. But shouting it on the international stage is just about as far from helping in getting him to the negotiation table as you can.",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "iilinga",
                                                    "body": "You’re ok with your country looking so weak?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "FlexTape0",
                                                            "body": "Youre ok with aggravating WW3 with Russia? You realize there's little in the way for the US to act without diplomacy with Russia? This includes saying anything to provoke Russia into military action against us",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "iilinga",
                                                                    "body": "As if Russia didn’t start flirting with it when they first invaded Ukraine in 2014\n\nSo the only option is bully the victim of Russian aggression and hand Russia everything they want? That’s your idea of diplomacy? Russia have never been weaker militarily, they’re stretched thin and desperate for a win in Ukraine. And your country is handing it to them gift wrapped with a shiny Trump bow.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "bigtiddyhimbo",
                                                                    "body": "You think we should just fold to any country actively invading our allies because it might aggravate WW3? What precedent does that send about us? It makes us look weak. Whats the purpose of having the largest defense budget in the entire world if it’s not being used to defend.\n\nEver consider maybe Trump is just a Russian sellout? Or is that too hard for you to comprehend you got conned?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Snacksbreak",
                                                    "body": ">Oh no. How dare they ever think about changing inefficiencies.\n\nSo you want social security cut? What's the plan for the huge swaths of dependent elderly folks who currently rely on it?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Rodinsprogeny",
                                    "body": "How much do you rely on your social security? Would it be a problem for you if you lost it, or lost a significant chunk of it?",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Almost-kinda-normal",
                                    "body": "I have to ask a question, so I’ll phrase it like this. Does it bother you that for as long as I’ve been alive (49 years), us Aussies and pretty much every allied nation has had complete faith in our alliance, but that now, for the first time, we, the allies, are no longer trusting the US to have our back? Does it concern you that your historical allies might form a new alliance, that excludes the US? When/if that happens, does it bother you that you’d be on your own in the event of an invasion?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "JealousFuel8195",
                                            "body": "As an Aussie why do you care about American politics? I cant even tell you  the name of your prime minister.  If you no longer trust the USA it's probably because you have been indoctrinated by liberal media. \n\nWhat I find incredibly sad that an Aussie needs faith in the USA. That's speaks volumes for Australia.  \n\nNo it doesn't concern me that other counties might form an alliance excluding the USA. I would actually welcome that. Aussie's are misguided if they believe the USA wouldn't assist Australia. We have give Ukraine $66B in military aid. What makes you believe we would turn our back? Regarding the Trump, Zellinskyy meeting. The USA has no skin the that war other than humanitarian. We can't support them eternally. \n\nWhat invasion? Are we being invaded or are we invading another country? Regardless, frankly, if we were invaded we don't need the rest of the world. A great percentage of Europe and other countries have scaled back defensive spending. We're more than capable of defending ourselves. Russia's military has exposed itself as inept. Plus, they're in no military position to invade us. Militarily they have been decimated. \n\nThe more important question is if Australia was invaded your country would be incapable of defending your country. Australia spends $37B on defense spending. We spend more than 25x that amount. \n\nBritain $75B. France. France $61B. Germany $67B. Is their defense spending budgets. \n\nThe answer to your last question. No, it wouldn't bother me that we're on our own. We wouldn't need the help of Australia or Europe. Their military capabilities are a fraction of America's.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Almost-kinda-normal",
                                                    "body": "It isn’t “liberal media”. It’s GLOBAL MEDIA. Quite seriously, you need to start watching this shit show from a different perspective. Why do I care? Because whether you like it or not, it matters to the rest of the globe. When you guys vote for this rubbish, we all pay the price for it. Is it the fault of “the liberal media” that Trump accused Zelensky of starting the war? Do you think that Trump accusing Zelensky of being a dictator, then forgetting that he’d done it, was the liberal media’s fault? At what specific point do you accept that Trump has absolutely no clue about geopolitical topics or any semblance of diplomacy? For your information, even Sky News, the home of Murdoch’s empire, who’ve done nothing but kiss Trump’s arse for the past decade, are starting to pull back a bit. They are NOT “liberal media” in even the most vague sense of the term.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "iilinga",
                                                    "body": "Do you not get that you guys are big enough and loud enough to have impacts on other countries? Do you genuinely not understand that you have commitments both in terms of trade and security and aid with other countries?\n\nYou are disappointed we had faith in you? We supported your wretched country through multiple unnecessary conflicts in the Middle East. You benefit significantly from our free trade agreements. You need us to have eyes and ears in the southern hemisphere, without Pine Gap you have nothing but blindness in our region. Our arrangements are mutually beneficial. Did you really not know that?",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "-OIIO-",
                                                    "body": "This is gold.\n\nWe are the most powerful boss, so we can decide what card we will play.\n\nWe should not be forced into any bullshit.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "twodickhenry",
                                    "body": "The right has been talking about cutting/ending social security for years, hasn’t it?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "JealousFuel8195",
                                            "body": "That's been a false narrative from democrat politicians and liberal media to discredit republicans. Both political parties lie. I take what they say with a grain of salt. \n\nDo you believe everything you hear on CNN, MSNBC and The View?",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "twodickhenry",
                                                    "body": "I don’t watch any of those news sources. I have seen republicans call for the end of Social Security myself. Would you like sources?",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "awesomface",
                                                            "body": "I’ve never heard anything like this of any actual substance and of the ones that may call for it, it would also mean compensation for those who have put towards it and ending it for future generations not having to put money into it. No sane legitimate person would just say “end social security” as that would be almost certain massive revolt and violence for those that put 10s of thousands of their own money into it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "twodickhenry",
                                                                    "body": "[Here](https://youtu.be/ajtxCovanig?si=ValcL9KyV3xMv6mV) is a video of GOP Senator Mike Lee saying he would end Social Security, lamenting that you can’t say you want to reform, eliminate, or privatize Social Security. He calls it an entitlement (which is how it is generally referred to by republican lawmakers when they talk about cutting it) and says he will “pull it up by its roots and get rid of it”. \n\nI’m sure you’ll point out that this is from 2010, which is true (but doesn’t change that he clearly said it, to mass applause), but just in case, [here](https://x.com/BasedMikeLee/status/1863771172485104124?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1863771172485104124%7Ctwgr%5Ed8a82502710d9f9388ad7b9f1f44a52fac3d1e91%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Fwww.utahpoliticalwatch.news%2Fsen-mike-lee-tees-up-attack-on-social-security%2F) is a tweet he made that reinforces his view on it, which is thread that Elon retweeted.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "awesomface",
                                                                            "body": "This is definitely an example, so thank you, albeit not of a massive substance or something an average person would even notice. So Mike Lee is pretty much saying what I was saying, and even pointing out how dangerous it is to even bring it up because everyone is will take it as a blanket screwing of beneficiaries. What he’s saying is it is redistribution and an entitlement which it absolutely is, albeit maybe not the worst version of it. If it were just a forced retirement account for individuals and not paid and shared from others, that would be different. He’s saying it would have to continue towards current beneficiaries and be fair to others that have paid into it already as well, so yeah it’s not JUST end social security without any other details a but he does indeed call for ending it.\n\nPersonally, I know I would be able to do a lot more for my retirement if I didn’t have to contribute to social security so I would be in favor of not having it but we live in a society that it’s so engrained at this point that I’m not sure of any ways to realistically do it well. As he says, there would absolutely be growing pains.\n\nAs a conservative myself, I’m of the mindset that I want the government not to be involved in anything it absolutely shouldn’t have to be. If social security didn’t exist I would be 100% against creating it. As it stands, it exists and I’m hopeful it can sustain but because it’s the government we’re talking about, my faith in it is very low but it’s far from a top issue for me or for a majority of republicans.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "clumpymascara",
                                                    "body": "I think they signed something recently to cut social security and Medicaid. Did you think the government cuts would be just removing bloated bureaucrats from middle management? I mean ideally it would be, but nope.  But you should check proper sources and see if you're in danger.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "JealousFuel8195",
                                                            "body": "You think they signed something recently? What kind of response is \"you think\"? Then suggest I should properly check. \n\nStop believing the democrats and the media.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "clumpymascara",
                                                                    "body": "What do I care? I'm not on social security. Sounds like your problem.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "-OIIO-",
                                    "body": "They are just bitching without listing facts.\n\nThis is exactly what democrats did over the last 10 yrs.\n\nWhat a joke.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "wolfee_3",
                            "body": "🤣",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "-OIIO-",
                            "body": "Why do you call those trash countries which take huge advantage of us our allies ?\n\nIf they pay  and trade with us fairly, it's okay to call they allies.\n\nOtherwise all enemies.\n\nAlso we do not need the crap of NATO. It ends up sucking our own money. Other members just rely on our defense and refuse to pay. What a shame to have to deal with these scammers.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyOwnGuitarHero",
                    "body": "Nothing to be desired with his interactions with Zelensky?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Ivan_Botsky_Trollov",
                            "body": "with a guy that isnt living in reality with his demands?  nah",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fando1234",
                    "body": "In four years, are there any key things he might have done/not done that you would judge his presidency on?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cosmic_Dahlia",
            "body": "ZERO regrets. 🇺🇸",
            "score": -10,
            "replies": [
                {
                    "author": "Fando1234",
                    "body": "What criteria for success do you have at the end of 4 years? \n\nWhat would you see as a success or a failure of his presidency that he can be judged on?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "basedbutnotcool",
            "body": "There’s a few things, his Gaza plan in particular that I’m not too happy about. \n\nBut still I’ll take him over the democrats any day of the week",
            "score": 1,
            "replies": []
        },
        {
            "author": "sfendt",
            "body": "None! Its going way better than i expected.",
            "score": -17,
            "replies": [
                {
                    "author": "everest999",
                    "body": "Egg prizes being higher is included?",
                    "score": 24,
                    "replies": [
                        {
                            "author": "sfendt",
                            "body": "My egg prices are down from November.  But even if that was one thing I didn't like (Not an issue for me but even if ti was), there are so many more things being done right, and way more effective and better than I honestly expected.  Never heard of a perfect candidate, but Trump does way more good than bad, and I can't say that of any other president of my lifetime.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "everest999",
                                    "body": "Last I checked Egg prizes were up from November in a nationwide average.\n\nBut since you dont care about higher prizes for the average american, what good does Trump do that you do care about?",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "sfendt",
                                            "body": "Good thing I'm not paying the nat average then.  Border & deportation of illegals, DOGE, oil & gas, support Israel against terrorists, 2 genders, end DEI in government, at the top of my list.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "everest999",
                                                    "body": "Could you be more specific?\nI don’t know how these things are good or how/if Trump is even achieving them?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "sfendt",
                                                            "body": "Numerous reports of lower than ever illegal border crossings from various surces; video evidence of deportations happening, news reports about various countries accepting their citizens back sometimes afeter being shall we say encouraged, all the complaints from those that want to defend illegal immigrants.  Pretty clear that's working.  Keeps us safer, reduces cost on public services, protects american jobs, protects freedom for citizens and legal imigrants.\n\nDOGE keeps making news for stopping stuipid payments, excess, finding waste, some even pretty clearly fraud.  Waste in governemnt costs all taxpaying americans, stopping wastes helsp us all!  Reducing head count (sometimes by too many, but its ok we can re-hire where it happens).  Reducing head count saves money, helps all tax payers again.\n\nRelease of oil and gas development wil save energy prices bringing cost of gas down, again there are plenty of reports (and complaints) about this going on so pretty clear its happening.\n\nYou can also read the EO's on many of these things, and most blocked in courts the administration ends up winning.  I find a lot of good in all these things.\n\nSorry, reddit is only worth a limited amount of my time, if you need more evidence - search theinternet, read news sources, do your own research, I've done mine.  As for unsure if these are good things - some of this is up to the individual, but saving tax money, reducing government, securing our coutnyr and udoing damage by identity politics, new forms of racizm under the name DEI, etc is all damn good in my life.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "solembum",
                                                    "body": "How did the number of genders influence your life personally? Why is it so important to you?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "sfendt",
                                                            "body": "Becase Biology matters to me, and is important to me.  Because a proper legal definitoin protects the women in my life that I care about - protecting safe women only spaces (public restrooms, sporting events, etc) and because the defintiion of words and language matter.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "solembum",
                                                                    "body": "But the gender has nothing to do with biology? Shouldnt you care about the sex of a person instead if you care about biology?\n\n\nAs a nonsupporter I have to ask, do you think it is a bit contradicting to care about these specific women rights/protections while voting for Trump who was found guilty of sexual abuse? Who literally bragged about walking into a dressingroom full of (half) naked Teenage girls? Who said you just have to grab women by their pussy (without consent)? Who told a prostitute that its hot cause she looks like his daughter?\nCould voting this kind of man into the most powerful position in the world send a message to the women in your life?\n\nDo you also care about womens safety and protections when it comes to other stuff?\nFor instance three women every day are killed by their partner. What should be done about that?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sfendt",
                                                                            "body": "I do not care what gender role they want to be in life at all in any way UNLESS 1. I want to be intimate with them - which they have to be a biological femaile and identify as same, or 2. They want to be in female protected spaces - we protect women (biological) in bathrooms, locker rooms, etc for a reason; we have biological women's sports divisions for a reason - denying the biological difference is offensive and a violation of trust.\n\nI don't give a \\_\\_\\_\\_ about old quotes - grab em, etc.. I care about Presidential actions and on this subject President Trump's actions on the subject have been beyond reproach and supportive of what I belive in.\n\nThe women in my life that matter most to me support Trump as well.  And all I've talked to on the subject feel women's sports should be protected by biology not identity.\n\nOf course I care elsewhare, don't be a jerk - but you asked why it matters TO ME - and that is what I answered.  What sould be done about murder by familliar people is not relevant to President trump, or any regrets for getting him elected.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "tim310rd",
                                            "body": "Up from November? Which includes 3 months of Biden and one month of Trump. Yeah, really upset with Trump for that one.",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "G0TouchGrass420",
            "body": "No support him even more now",
            "score": -14,
            "replies": [
                {
                    "author": "hypotyposis",
                    "body": "What was he doing wrong before that made you support him less?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "Won't speak for the other poster but \"not being President\" kinda put a damper on his ability to do things prior to mid-January (or November; depending on how you look at his president-elect period).\n\nBut this was my first time voting for Trump so I admit I'm an outlier.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fando1234",
                    "body": "Silly that people are downvoting you just for answering the question.\n\nBut I do have a follow up, what would he have to do, or fail to do for you to see his presidency as a failure?\n\nI always liked Obama but there are a long list of things he failed at e.g. the whole attitude towards whistleblowers like Snowdon. \n\nWhat do you think trumps blind spots could be?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "G0TouchGrass420",
                            "body": "Recession, Major war\n\nI think trumps biggest test will be if china invades taiwan under his watch. If he's lucky china doesn't invade till he's out of office.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "OKGO9999",
                            "body": "Him trying to not be a war time President.  With his projection of power and strength, I thought he would be the perfect president to be a rock during war time.  War will help the economy too (which he is for).\n\nHe’s starting a trade war but it seems to be having an opposite effect, at least in the short term.  An actual war helps with economy because the resources used are spent back on American defense contracts and resources taken from the other countries (Ukraine,\nRussia, Canada, Mexico, etc).\n\nBut we’ll see how it goes as we’re still very early days.  I think people are jumping to conclusions too quick.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Fando1234",
                                    "body": "I thought his anti war/anti military industrial complex was a core part of his policies?\n\nHence his appointment of Tulsi gabbard. Which is something I strongly agreed with (though tbc if his approaches - like that with Ukraine - will actually achieve this goal).\n\nThe tax payer spent $2-3 trillion in Iraq. It feels like if that had been spent on American healthcare, infrastructure, energy or indeed anything else that would have helped the economy double. As it was boosting American jobs, and was creating something tangible citizens could use, not just a bomb that's whole purpose is to destroy itself. That's my take anyway.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "-OIIO-",
                                    "body": "I myself is a data eng at school, majoring in Econ at college. I can tell you Trump's policies are very solid and to the point.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Smiles4YouRawrX3",
            "body": "No, stop trying to project your fantasy that every MAGA regrets their vote onto us.",
            "score": -5,
            "replies": [
                {
                    "author": "DifferenceKey2991",
                    "body": "Are you aware of what projecting is?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "DifferenceKey2991",
                    "body": "Are you aware of what projecting is?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "KnownFeedback738",
            "body": "Every Trump supporter i know is very happy, expectations exceeded. Expectations are always low but usually not met anyway, so it’s not perfect but it’s much better than most ppl expected",
            "score": -8,
            "replies": []
        },
        {
            "author": "Flussiges",
            "body": "No. Everyone I know has been ecstatic.",
            "score": -28,
            "replies": [
                {
                    "author": "FrankenPinky",
                    "body": "Wouldn't you say the fight isn't over until you get what you want?  Rising inflation?  Border and immigration crisis?  Gaza/Greenland/Panama/Mexico invasion?",
                    "score": 26,
                    "replies": [
                        {
                            "author": "quendrien",
                            "body": "Yes, agreed. It's kind of embarrassing when non-Trump supporters hold our guy's feet to the fire on his promises more than we do. It's okay to be glad your person won, but can't be complacent and get lost in the victory while DC chugs on, business as usual.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "tinycerveza",
                            "body": "True, but he’s hardly going to accomplish all that in one month. So far it’s been good progress",
                            "score": -6,
                            "replies": []
                        },
                        {
                            "author": "tim310rd",
                            "body": "Inflation is going to level off once we can pass tighter budget bills and start easing interest rates. Really not interested in seeing foreign invasions, though I do think it is important all of those areas both step up their security and that the US sends a reminder that we are not to be taken advantage of, which we have already started doing. Trump has done a lot in his first month in office, he is at least holding true to the promises he made about what actions he would take, the effects will take time to happen.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "FrankenPinky",
                                    "body": "With the expansion of ICE and border patrol, the Elon 5k stimulus package, taking the Gaza strip, is there a tighter budget bill that is possible without cutting social services (Medicaid, Medicare/ SS) as they constitute more than half the budget?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "tim310rd",
                                            "body": "I don't think the 5k is something that will happen, at least not all at once. I think Trump will probably use savings to put into a sovereign wealth fund, and the money back to the taxpayer is the drop in taxation due to the government using the fund for revenue in lieu of taxes. The proposed ICE and border patrol increases are basically a drop in the bucket as far as the current fed budget is concerned. I doubt taking the Gaza strip is something that will actually happen.",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "skitso",
            "body": "This has been the most amazing 41 days of my adult life:",
            "score": -4,
            "replies": [
                {
                    "author": "-OIIO-",
                    "body": "Yea !!!\n\nVoting for Trump is the best decision I've ever made in my life.\n\nDOGE is solving big problems inside our gov.\n\nTrump is dealing with the war broker Zelensky very well.\n\nEverthing is fucking awesome.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "greenbud420",
            "body": "All the winning can be a lot to process at times.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Lemonpepperfruits",
            "body": "Naw",
            "score": -8,
            "replies": []
        },
        {
            "author": "goldmouthdawg",
            "body": "Nope",
            "score": -11,
            "replies": []
        },
        {
            "author": "IwinULose19692",
            "body": "Nope",
            "score": -3,
            "replies": []
        },
        {
            "author": "Ok_Ordinary_2472",
            "body": "Egg prices and bird flu are not really president agenda items. So we gucci.",
            "score": -27,
            "replies": [
                {
                    "author": "Mysterious-Zebra-167",
                    "body": "Lol they were when it was a different President. \n\nWere yall lying then or are you lying now?",
                    "score": 45,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "Do you have a link of that poster saying that?",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Final_Reserve_5048",
                    "body": "Why did JD Vance campaign in front of a wall of eggs shouting about how expensive they were then?",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "subduedReality",
                    "body": "If they aren't presidential items then why would they be brought up by any presidential candidate during the election cycle?",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "NeilZod",
                    "body": "The federal government can respond [to bird flu](https://www.cdc.gov/bird-flu/spotlights/h5n1-response-02262025.html). Do you think Trump should allow the Centers for Disease Control respond to bird flu?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Ok_Ordinary_2472",
                            "body": "which response would allow the prices to go down again? especially of free range eggs?",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "NeilZod",
                                    "body": "I don’t understand the question. Aside from Trump setting lowering egg prices as a part of his agenda, do you see that the federal government can be involved in bird flu, and therefore, it can be involved in egg prices?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Ok_Ordinary_2472",
                                            "body": "answer my question!",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "NeilZod",
                                                    "body": "You ask “which response.” What are the options?",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Horror_Insect_4099",
                            "body": "Recently announced plan:\nhttps://amp.cnn.com/cnn/2025/02/27/economy/bird-flu-egg-prices-higher\n\nOnce bird flu is under control flocks will bounce back very quickly, ESPECIALLY if prices remain high in the medium term giving massive incentives to sell more.\n\nI would wager that egg prices will be down significantly in one year’s time.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "NeilZod",
                                    "body": "> Egg prices are expected to increase by 41.1% this year, according to the USDA’s food outlook as of February 25.\n\nWhy do you wager that prices will be down in a year?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Horror_Insect_4099",
                                            "body": "Because chickens breed quickly and new chicks are able to lay eggs as soon as 16 weeks.  Flocks and egg production will eventually bounce back at exponential rates so long as chickens don’t go extinct.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "NeilZod",
                                                    "body": "So the USDA predicts that prices will continue to go up this year, but you predict they will go down? Why do you disagree with the USDA?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Horror_Insect_4099",
                                                            "body": "The article says prices are likely to stabilize in 3-6 months.  The following 6-9 months is a good runway for them to come back down.  I am an optimist that likes eggs.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "NeilZod",
                                                                    "body": "The article says that the Trump administration says prices will stabilize. The egg industry and a professor who focuses on egg production say that no one can predict that prices will stabilize until bird flu is under control. Why do you think the Trump administration has a better assessment here?",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "NeilZod",
                                                                    "body": "I imagine people are interested in eggs because Trump made them an issue. It’s just one of many things that Trump said he could influence without showing any effect?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Horror_Insect_4099",
                                                                            "body": "Trump could just wait for the avian flu to run its course then try and take credit when those prices eventually come back down.\n\nBut the article cites several specific actions being taken by current administration that might actually actively help faster.  Let’s give them a chance to work.\n\nEggs are delicious and nutritious for breakfast and an important ingredient in many restaurant foods.  I will be happy if those marvelous hard working hens are healthy again and egg prices fall.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "HerbertWest",
                                                                    "body": "Eggs are delicious and used in many home recipes, including baking. Do you like making homemade cookies?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "peter_pumpkineater95",
                    "body": "Many independents voted for Trump this time due to low prices being their issue . If trump delivers on that he can win in the midterms and jd can can win in 2028",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CardTrickOTK",
            "body": "Regrets? No. Because it was this or Kamala and Kamala likely would have been awful.  \nAre there things I don't like? Yeah. But that goes with anything.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Klutzy-Feature-3484",
            "body": "Egg prices still high but at least we ain't woke. Trump still my guy 🦅🦅🦅",
            "score": -38,
            "replies": [
                {
                    "author": "NeilZod",
                    "body": "Does the price of eggs truly matter? In the last few months, a significant percentage of egg-laying chickens have been culled to limit the spread of bird flu. Musk has been firing people who try to limit the spread of bird flu. Will you be surprised when eggs get more expensive and more scarce?",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 53,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "iiWavierii",
                            "body": "So if I make fun of liberals for chemically castrating children does that mean they are going to stop because i made fun of them? Obviously not…",
                            "score": -22,
                            "replies": [
                                {
                                    "author": "MedicalDeviceJesus",
                                    "body": "Has that ever actually happened?",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "iiWavierii",
                                            "body": "Yes.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "MedicalDeviceJesus",
                                                    "body": "Any proof?",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "iiWavierii",
                                                            "body": "Do you want me to list out sources of children having transgender surgery?",
                                                            "score": -15,
                                                            "replies": [
                                                                {
                                                                    "author": "MedicalDeviceJesus",
                                                                    "body": "You said liberals are \"chemically castrating children\" and I wondered if you have any evidence to support this claim?",
                                                                    "score": 22,
                                                                    "replies": [
                                                                        {
                                                                            "author": "iiWavierii",
                                                                            "body": "It’s the same thing.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "twodickhenry",
                                                                                    "body": "Medically, scientifically, and objectively, it isn’t. Do you have proof chemical castration is happening in children, or are you simply referring to gender affirming care as chemical castration?",
                                                                                    "score": 14,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "blondebuilder",
                                                                                            "body": "Why do conversations always die off once proof and evidence ever comes up?",
                                                                                            "score": 7,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mysterious-Zebra-167",
                    "body": "What do you think woke means?",
                    "score": 29,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "It’s a little over a month in.  My grocery prices have gone down quite a bit (I got eggs for less than five bucks a dozen!), gas prices are down, and I was able to make enough on my limited income to get an oil change, so hey, that’s good.\n\nI’m not sure what we are supposed to be regretting right now.",
            "score": -8,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PQ_Butterfat",
            "body": "Quite the contrary.",
            "score": -11,
            "replies": []
        },
        {
            "author": "UncleSamurai420",
            "body": "He's doing much better than expected, so I'm not sure what people would have regrets about.",
            "score": -3,
            "replies": []
        }
    ]
}