{
    "title": "Do you agree with Elon that the U.S. should leave NATO?",
    "author": "Dijitol",
    "subreddit": "AskTrumpSupporters",
    "rank": 23,
    "score": 92,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 444,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1j1sbsi/do_you_agree_with_elon_that_the_us_should_leave/",
    "id": "1j1sbsi",
    "selftext": "Why or why not? \n\nhttps://www.yahoo.com/news/elon-musk-publicly-supports-call-084016959.html",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "proquo",
            "body": "I disagree.\n\nThe goal needs to be getting our European partners to match the US' strength and capabilities so the US can take a junior role in European defense, especially now that Russia is depleted by Ukraine. It made sense for the US to have the greater burden of European defense post-WWII when most the continent was recovering or adjusting from WWII and the USSR was an economic and industrial titan. In 2025 it doesn't make sense for most our NATO allies to not be able to maintain their own reserves in their AO, or for only the UK and France to have force projection capability that is a fraction of what the US can do.\n\nWe should probably also be eyeing Australia, Japan and South Korea for future military partnership emphasis. The European theater is no longer the center of the world. The Asian Pacific theater is where the next major conflict is going to take place and we'd be better off strengthening our alliance with our partners there. I'd like to see Australia improve its force projection capacity.",
            "score": 25,
            "replies": [
                {
                    "author": "cpjauer",
                    "body": "Thank you for sharing your opinion. I actually think most people in Europe agree with you - Europe should be able to defend itself and not rely solely on the US for that. \n\nDo you think leaving NATO is something that could happen during Trump?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "Not even almost.\n\nCongress would have to approve it and there aren't enough Republicans who wouldn't oppose it to approve a withdrawal. Plus, Trump doesn't actually want to leave NATO. He's trying to pressure them into matching US commitments to their defense so the US can take a back seat and he can pursue defense cuts.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "fossil_freak68",
                                    "body": ">Congress would have to approve it and there aren't enough Republicans who wouldn't oppose it to approve a withdrawal.\n\nEven if we can't legally leave, couldn't the president just say \"as commander in Chief, I will not send troops to defend Nato\"?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "Potentially although I don't know the particulars of that and I assume at least some US forces are under NATO joint control at any given time so he may not have the opportunity. \n\nI think assuming Trump would bend every Treaty and agreement and process we have to not honor the NATO alliance is fear mongering, but it's great in getting Europeans to take their own mutual defense seriously and not rely on the US for the heavy lifting which is playing exactly into Trump's plans.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "cpjauer",
                                    "body": "I hope you are right. Thank you for your reply. I have to ask a question, so - have a good day? :)",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ThunderPoke91",
                            "body": "It's a near impossible task that requires 2/3 advantage or 67 votes in the senate. The Republicans hold 53. Not to mention not every republican would vote to leave. It is an unrealistic and improbable possibility.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "cpjauer",
                                    "body": "Maybe leaving nato is hard - but being a member whilst stating the US wouldn’t answer article 5 would mean the same. Is that not a possibility? Trump has already questioned wether he would respond to a Russian attack on members not paying 2% GDP",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Past-Guard-4781",
                    "body": "Why do you think Pacific countries should trust the US? What would stop the US in giving up Taiwan for some perceived benefit from China, since everything is transactional now?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "> Why do you think Pacific countries should trust the US?\n\nOh, I don't know. Maybe the near-century of cooperation between our nations and the massive American military presence in their nations, as well as the economic ties between us.\n\n> What would stop the US in giving up Taiwan for some perceived benefit from China\n\nThis isn't a concern that would be unique to Donald Trump. In order to get the US to leave the Asian Pacific to China they'd have to offer the type of deal that any president with common sense would consider.\n\nEven if the strategic necessity to defend Taiwan didn't exist, the US still wouldn't want to give China control over a major economic zone where a massive amount of global trade flows.\n\nChina has a dedicated intent to replace the US as a hegemon in Asia. They don't want to make a deal with the US because making a deal wouldn't get them where they want to be.\n\nCommon sense also tells us that Trump is aggressive on China. He would probably jockey for beneficial trade deals with our allies but he recognizes the need to keep China from expanding.\n\nThe intelligent thing for any ally of ours that is Trump-skeptic is to play the game and not act like it's a shock every time he tries to benefit the US in a deal with a partner.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RealPalexvs",
                                    "body": ">Oh, I don't know. Maybe the near-century of cooperation between our nations and the massive American military presence in their nations, as well as the economic ties between us.\n\n  \nWe have demonstrated that we are not allies to Canada and Europe, neither economically—through aggressive tariffs—nor militarily, as evidenced by discussions about leaving NATO. \n\nWe have also neglected our security obligations to Ukraine, which gave up its nuclear shields. \n\nWhy would anyone trust us now?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RealPalexvs",
                                    "body": ">Oh, I don't know. Maybe the near-century of cooperation between our nations and the massive American military presence in their nations, as well as the economic ties between us.\n\nAnd more importantly, why should the enemies be afraid of us if we withdraw in fear of WW3 or the cost?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "Because of the massive amount of military and industrial might we still possess and a willingness to break with established norms of the liberal economic order - such as targeted and deliberate strikes with no intent to expand and thus no fear of escalation such as with Iran or in Syria under Trump.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "Past-Guard-4781",
                                    "body": "Why do you think length of time matters, since it doesn't matter for our NATO alliance?",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "tvisforme",
                                    "body": "Why is it an \"ignorant\" question? Canada has had a long and friendly relationship with the US. It's just five weeks into Trump's current term and his actions have seriously damaged that relationship. Why should Asia or Europe be any different?",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bubbly-University-94",
                    "body": "As an Aussie I Agree with all of this. \n\nOnly problem is that the feeling here is that trump is a fickle ally.  \n\nAre trump supporters aware that his actions are creating a scenario where the previously unargued and unrivalled US security umbrella is now regarded as suspect and prone to transactionalism?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ThunderPoke91",
                            "body": "Completely and it's why I am completely opposed to how he is running his foreign policy. If I was in the pacific region I would be arming up because I think trump will try to weasel out of any defense of the region.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "proquo",
                            "body": "> Are trump supporters aware\n\nYes, of course. I'm OK with that. Our allies and partners should be viewing our interactions in the lens of \"what's in it for the US?\" We've been providing that security umbrella for generations at our cost, often to our detriment.\n\nTake Turkey as an example. It's a dictatorship, that was only ever quasi democratic and its NATO membership was purely to give us a front close to Russia. The result is that they've been an unreliable ally that has been developing closer ties to Russia, has territorial disputes with Greece who is also a NATO partner, put us in a very delicate position in Syria regarding our partnership with Kurdish forces against ISIS and frankly has a lot of American asking \"Why? Why are we doing this?\"\n\nIn the case of Europe I see no reason why Americans need to take the lead on Ukraine when the EU is right there with a more significant security concern in regards to Russia. That's Trump's whole point. Why are we carrying the majority of the burden when there's nothing being offered to us at the end of the path but Europe doesn't have to when they have the clearest benefit from Ukrainian security?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Bubbly-University-94",
                                    "body": "Are you aware that after the breakup of the Soviet Union, Ukraine was left with the third largest nuclear armoury in the world? \n\nThe United States wanted a peace dividend and a reduction in nukes and made overtures to Ukraine to give them up.  A large faction of Ukrainians didn’t want to give them up due to the historical ongoing threat of Russia, the US prevailed however and gave security guarantees to Ukraine in return for them giving up weapons that would have prevented this whole war by MAD? \n\nMoving forward do you think anyone who signs any sort of treaty with the US will have any faith in it being honoured?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "So, the idea that Ukraine \"gave up\" nukes is untrue and I've discussed it before and have no interest in litigating it again. I'll just note that at no point was it ever believed that Ukraine was a nuclear power, the nukes were always understood to belong to Russia, and the Ukraine SSR never had control of nuclear weapons and nuclear launch authority was kept in the Kremlin.\n\n> Moving forward do you think anyone who signs any sort of treaty with the US will have any faith in it being honoured?\n\nI don't think anyone should accept security guarantees from anyone else who doesn't have skin in the game. It's not a uniquely American issue. France and the UK were also signatory to the Budapest Memorandum.\n\nHowever the Budapest Memorandum is the most misunderstood document in modern history. It wasn't a defense agreement or a binding Treaty. It was a series of assurances that the US has lived up to.\n\nDirect military intervention on behalf of Ukraine is *not* one of the agreements of the Budapest Memorandum.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Bubbly-University-94",
                                                    "body": "1) If you have a fully functioning nuclear weapon, to remove the initiating system and replace it with your own would be a whole lot of steps removed from the process of having a nuclear deterrent as opposed to creating one from scratch. \n\nPotentially decades of work would you not agree? \n\n2) The UK, France and till now the US were supporting Ukraine in every facet bar troops on the ground.   That could be easily interpreted as living up to the security guarantee.   \n\nNow the US isn’t.   In fact has all but taken Russia’s side, when according to the security guarantee it should be firmly and securely in Ukraines corner.\n\nWhat message do you think this sends the rest of the world with respect to the United States as a reliable ally? \n\nI can tell you for a fact that every country around the world, including mine who has served alongside the US - through thick and thin in wars that had nothing to do with us under the understanding that we were part of a security umbrella are re-evaluating whether we shed blood for nothing. \n\nDo you think this is a good thing to have allies question?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "1. It doesn't matter. The 1991 Alma-Ata Protocol already determined the Russian Federation would inherit the Soviet nuclear forces. Ukraine was not in a position economically to maintain the nuclear weapons and lacked any of the infrastructure to do so or even target them, at any rate.\n\n2. There is no security guarantee. It is a series of assurances. The US has lived up to all of them. Direct assistance including military aid is not a requirement of the Memorandum and never was. That's not ambiguous. The Memorandum was a promise to not attack Ukraine, not use economic pressure on Ukraine, and advocate for Ukraine in the event it were attack. Sending them weapons or military assistance is not a requirement. \n\n> What message do you think this sends the rest of the world with respect to the United States as a reliable ally?\n\nI'm getting a little frustrated at this because I've been clear in my opinion and so has the Trump administration. \n\nThe signal to the world is that the US isn't the global piggy bank or shield. The EU needs to develop their own militaries to reduce the burden on the US to provide for European security. South Korea and Australia need to do the same.\n\nOur European NATO partners have been behaved as the junior partners in our mutual defense when the EU has a GDP equal to the US. There's no reason they cannot match the US commitment to our mutual defense. Instead they've outsourced much of that commitment to the US and the US hasn't gotten much in the way of tangible benefit from it.\n\nIt's not 1950 when the US is holding up western Europe Weekend At Bernie's style in the face of the Warsaw Pact. It's 2025. The EU economy is nearly as big as the US and yet their collective defense is much weaker. That's nonsensical.\n\nAustralia can't match the US defense commitment but they can at least acknowledge the need for US protection through favorable agreement with the US. Same with the Phillipines and South Korea. Why does Japan, a nation that has a constitutional prohibition on war, have a stronger military than Australia who has been a military partner of the US for generations? Can the US at least get something out of the deal if we have to take the majority responsibility for Australian defense?\n\nThat's the Trump foreign policy agenda. \n\n> Do you think this is a good thing to have allies question?\n\nFrankly, yes. Our allies have been our worst friends.\n\nThe Canadian military is in tatters. Its barely deployable, has aging equipment, is tiny and underfunded. Consider it has the longest coastline in the world and is surrounded by 3 seas but has 15 surface combatants in its navy.\n\nSpain made deals with the Taliban in Afghanistan to avoid combat, something that shocked the USMC forces that relieved Spanish troops.\n\nGermany has long ignored its military and has sent troops to joint training without weapons or night vision, refused to send tanks to Afghanistan for fear of making the mission too high profile and Rheinmettall revealed that a significant amount of stored Bundeswehr equipment in 2022 was unsuitable to send to Ukraine because it needed a year of refit to be usable.\n\nFrance was the first nation to leave NATO joint military command and spent most the Cold War uncommitted to sending troops to Germany and had no forward deployed units in NATO. Currently they have 400 Leclerc MBTs and no ability to make more.\n\nBritain has been a close ally but they have regularly slashed defense spending and their military leadership has been clear they would last a couple weeks in war with Russia. They had to get their bombers out of the trash heap and delay the retirement of an aircraft carrier to fight the Falklands War.\n\nSo on and so on.\n\nThe bottom line is it no longer makes sense for the US to be footing the bill for our collective defense. We should be allowed to expect our allies to step up or find the US giving them only as good as they've given. \n\nIt's not absurd for the US to say that Europe should be taking the lead in Ukraine because they have the immediate concern, anymore than it was for the US to make Europe take the lead in Libyan intervention.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Bubbly-University-94",
                                                                    "body": "I’m talking specifically Australia in this case. \n\nWe have shed blood with the us side by side in all the wars no one else went to. \n\nWe spend over 2% of gdp on defence. That’s rising to 2.4 over the next two years. \n\nWe have 1/5th of the population of Japan and  spend slightly less than them on defence.  55 billion Aud vs 55 billion usd\n\nStrategically speaking, Australia is home to a treasure trove of resources absolutely essential to warfighting, - that in a lot of cases China is the only main source.  Oh and Ukraine btw. \n\nDon’t you think it’s in the us’ interest to have a countries back that has steadfastly had yours for over 100 years, that is also a storehouse for essential minerals, gas, coal, steel, rare earths, oil, copper, vanadium, gold, silver, nickel…. As well as being strategically placed as an unsinkable aircraft carrier? \n\nCertainly seems that every other us president has thought so?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "proquo",
                                                                            "body": "It's not in our interest if it isn't in our interest.\n\nWhat Trump has been driving at is that protecting a place like Ukraine that has large amounts of natural resources isn't of benefit if we aren't getting the resources. Ukraine benefits from being the recipient of massive foreign aid with no commitment to repay in any way. The US wants to get repaid, hence the minerals deal.\n\nIn the case of Australia you're basically saying Australia can't provide totally for its own defense against China, and needs the US for aid. Ok, that's all well and good but what does the US get out of it?\n\nTrump's stance is that the US hasn't gotten enough from these deals while our partners have gotten a lot.\n\nEdit: to be clear my point on Australia is illustrative. I am not aware of any statements Trump has made about Australia.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bubbly-University-94",
                                                                                    "body": "Well like I’ve kind of mentioned, Australia has held up our part of the bargain by attending every war we have been asked to play a part in for a hundred years. \n\nOften when the rest of your allies declined to, or bailed out of. \n\nI guess to you that’s in the past though.  Everything starts anew and all the dead, wounded, crippled and billions spent count for nothing because it all reset or something?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "proquo",
                                                                                            "body": "It's not that it counts for nothing but should it count against the massive responsibility held by the US for Australia's defense?\n\nIsn't there a theory by which Australian involvement in US military conflicts is expected given the benefits of US military protection Australia enjoys?\n\nAustralia's biggest security threat is China. Does Australia's participation in the Vietnam War mean the US is adequately paid for keeping the peace in the Pacific and potentially warring with China to defend Australia?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Bubbly-University-94",
                                                                                                    "body": "Not just the Vietnam war. Korea, Vietnam, Somalia gw1/2 Afghanistan\n\nRight down to Australians integrated into the us military and vice versa, serving as a base for essential communications at pine gap and Exmouth. \n\nIn return we were offered the us defence umbrella.  \n\nGoing back to the question I keep asking.  If the us renegs - who will ever trust you in the future?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "proquo",
                                                                                                            "body": "I think you didn't understand my point. Is the obligation between us equal, or is the US giving more by providing a security umbrella than it gets?\n\n> who will ever trust you in the future?\n\nAh, so now all the American blood and treasure spent to safeguard the free world is meaningless. It's almost as though Donald Trump was right about the US being taken advantage of if the prospect of providing a reasonable incentive for the US to continue carrying the weight of defending western civilization is tantamount to a betrayal.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Bubbly-University-94",
                                                                                                                    "body": "We have spent blood defending your interests. \n\nWe have also allowed us companies access to resources at fire sale prices. \n\nOver the last four years chevron has paid zero in royalties on 111 billion dollars in Australian gas sales. \n\nSource: https://australiainstitute.org.au/post/zero-royalties-charged-on-111-billion-in-gas-sales/\n\nThat’s one example. \n\nIf you think the us hasn’t charged its pound of flesh you might want to think again. \n\nDo you think the US has ever even needed to rattle a sabre to defend Australia?\n\nIts reputation did that.   \n\nDid.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "proquo",
                                                                                                                            "body": "> Do you think the US has ever even needed to rattle a sabre to defend Australia?\n> \n> Its reputation did that.\n\nAnd now in 2025 the cost of these alliances is beginning to damage our ability to deter mutual enemies. China is only growing in power. India is not far behind and will one day seek to be a regional military power. North Korea is strengthening itself through cooperation with Russia and Iran is a menace in the middle east.\n\nThe United States does not have the resources to single handedly maintain global stability as it has for the last 70 years. Trump is pressuring our allies to increase their commitment to defense, or else create economic incentives for the US to maintain a security interest in our alliances or else face a world where the US cannot safeguard Europe and the Pacific at no cost to the defended.\n\nChevron benefiting economically does not recompense the cost of providing a security bubble across the Pacific ocean, nor does it negate the need to ensure defense commitments are shared equally among the committed.\n\nFrankly, any world leader that sees the US reputation as tarnished or unreliable because we are restructuring our defense commitments is short sighted and foolish. After nearly a century the geopolitical landscape had changed and our strategic concerns with it. The ANZUS Treaty was signed in 1951. Back then communist China was not an industrialized nation or a nuclear power and the USSR was the biggest threat to the western world. Things have changed dramatically and now that Australia appears to be on the frontline of a future conflict with China, it's reasonable for the US to want to renegotiate the terms of our defense pact to make it strategically sustainable long term.\n\nLook at this way: New Zealand and Australia cooperate very closely in military affairs. Their defense force numbers less than 20k men. In any real conflict there's no question that New Zealand will enjoy greater benefits of protection from its security partners than it could ever provide. I'm not asking how that is fair, I'm asking how is that sustainable or strategically sound for either the US or Australia for any reason other than it's the nice thing to do?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Bubbly-University-94",
                                                                                                                                    "body": "Yes we do things that are nice.   \n\nNew Zealand also provided 140000 soldiers in ww2 - 1/10 of their population at the time.   They can step up when needed and no one wants to play silly games with Māori…. They just pull your arms and legs off and pick their ears with the splintered bits !!!\n\nI can’t see this discussion going any further.  We are poles apart.  Thank you for engaging with civility and your truth. \n\n?",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Vysari",
                                    "body": ">Take Turkey as an example. It's a dictatorship, that was only ever quasi democratic and its NATO membership was purely to give us a front close to Russia\n\nWhat are you talking about? Erdogan and Putin do ***not*** see eye to eye. Turkey even offered to help broke a ceasefire between Ukraine and Russia and Putin ignored the offer.\n\nIf you needed a more obvious sign of their opposition to one another look no further than the Syrian conflict.\n\nErdogan has historically took the approach of sitting on the fence so he can try play off everyone involved for his own benefit. He's only unreliable in the sense that he's happy to have a purely transactional relationship with the international community. If you want his backing on something then you need to make it worth his while.\n\nI think there's another country in the process of re-evaluating its commitments to make them more purely transactional as well, isn't there? I wonder if people will see them similar to Turkey in terms of their reliability if they keep down this path...",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "> What are you talking about? Erdogan and Putin do not see eye to eye\n\nBe that as it may, in 2017 Turkey purchased S-400 systems from Russia. A NATO member buying weapons systems, especially surface to air missile systems, from Russia is ludicrous. It killed the F-35 transfer to Turkey because we couldn't risk Russia getting access to intelligence information on the platform and led to the US imposing sanctions on Turkey. A NATO member. There was serious talk about ejecting Turkey from NATO.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Vysari",
                                                    "body": "That’s essentially what happened, but it’s important to understand the context behind Turkey’s decision.\n\nTurkey had been trying to buy Patriot missile systems from the U.S. since 2009, but the US was slow to respond. By 2013, frustrated with delays, Turkey signed a deal to buy missile systems from China, which strained relations with NATO.\n\nLater that year, as the Syrian conflict escalated, NATO deployed Patriot batteries in Turkey to protect against potential threats. However, by 2015, they were withdrawn, with NATO stating that the immediate missile threat had diminished. Turkey saw this as the alliance failing to uphold its security commitments.\n\nBy 2017, Turkey cited continued U.S. delays in finalizing a Patriot deal as a reason for purchasing the Russian S-400 system instead. At the last minute, the U.S. made an offer, but it lacked the favorable financing and technology transfer that Russia had included.\n\nAt the end of the day, Erdogan did what Erdogan does - he played both sides, trying to leverage NATO and Russia against each other to get the best deal. But he miscalculated badly and didn’t anticipate the severe backlash, including Turkey’s removal from the F-35 program and U.S. sanctions as you mentioned.\n\nThis transactional approach - treating alliances as short-term deals rather than long-term partnerships - is something we now see reflected in Trump’s foreign policy rhetoric. Like Erdogan, Trump argues that the U.S. should only support allies if there’s a direct cost-benefit advantage. The problem? When you reduce alliances to mere transactions, partners stop seeing you as reliable - and they start making contingency plans.\n\nDo you think it's reasonable to say that if Trump follows the same path, the U.S. might find itself on the receiving end of the same treatment it once gave Turkey?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "I largely agree with your take but it strikes me as missing the whole crux of the issue.\n\n> At the end of the day, Erdogan did what Erdogan does - he played both sides, trying to leverage NATO and Russia against each other to get the best deal. But he miscalculated badly and didn’t anticipate the severe backlash, including Turkey’s removal from the F-35 program and U.S. sanctions as you mentioned.\n\nYes, exactly. Our NATO partner who we are committed to defend to the point of nuclear war treated the alliance as transactional. That's hardly a reliable ally when you consider the US has carried the majority burden of the alliance. You can't frame the NATO relationship in any other way than that the US has been the principle enforcement arm, and our partners have been beneficiaries of the mutual security umbrella.\n\nThat's the whole point.\n\nThe US isn't saying \"pay us for your defense\". The US is saying either match our commitment or, if you can't or won't, give us something to make it worth the risk and cost to the US. We get nothing from, say, Estonia or Latvia or Lithuania relative to the investment of coming to their aid if they are attacked. They benefit greatly from the security umbrella against Russia but given that they can't match the strength of their larger partners shouldn't those larger partners get something other than added liability out of the deal?\n\n> Do you think it's reasonable to say that if Trump follows the same path, the U.S. might find itself on the receiving end of the same treatment it once gave Turkey?\n\nIf our allies view an equitable arrangement between our nations as the US providing the security and its allies benefitting from it with no expectation of matching or compensating for that security then it would prove Trump's point that NATO in its current form is not in the US' best interest.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Vysari",
                                                                    "body": "I think perhaps you are underselling why the U.S. leads NATO and what it gains from doing so. Would you agree that the idea of the U.S. getting \"nothing\" from defending smaller allies ignores the immense strategic and economic advantages that come from maintaining global stability? NATO isn’t charity - it’s a tool of American dominance, allowing the U.S. to dictate global security policy, maintain military bases worldwide, and ensure that when conflicts arise, it doesn’t have to act alone. Given this, doesn’t it make sense that the U.S. benefits just as much, if not more, from NATO as its smaller allies do?\n\nWould you also agree that the U.S. economy thrives because of the stability its military guarantees? European and Asian allies rely on American defense, but in return, they trade in U.S. dollars, buy American weapons, and reinforce U.S. influence in global affairs. Isn’t this exactly what has kept the U.S. at the center of the world economy, ensuring its continued dominance?\n\nIf Trump takes a purely transactional approach to NATO, what stops allies from seeking alternatives? We already see France and Germany discussing independent European defense initiatives, and the more the U.S. signals that it sees NATO as a burden, the more other nations will look for ways to reduce their dependence on it. Isn’t this exactly what happened when Erdogan played both sides between NATO and Russia? Turkey lost trust, lost access to key military programs, and saw its influence diminish. If Trump treats NATO the same way, what makes you think the U.S. won’t face similar consequences - not because allies are freeloaders, but because they’ll start planning for a future where they can’t rely on the U.S. anymore?\n\nTrump certainly has more leverage than Erdogan did in these matters, but what makes you think this radical shift in stance won’t push allies away or force them to reconsider their commitments to the U.S.? Even if they comply with Trump’s demands, isn’t he still undermining his government’s own influence in the process?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "thedamnoftinkers",
                                                                    "body": "Do you remember the US calling for NATO members to increase defence spending to at least 2% of GDP? Would you say most NATO members have followed through?\n\nWhy do you think the US is talking about leaving NATO when NATO has done everything the US has asked of it?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CardTrickOTK",
                            "body": "I don't get why a nation wouldn't be transactional if said nation feels it's allies are mooching.\n\nYou can debate all day whether it's true or no, but the fact is the newer generations in America seem to be more anti-interventionist and concerned about their bills rather than what's widely perceived as footing the bill for foreign countries most of the probably couldn't point out on a map.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Bubbly-University-94",
                                    "body": "Have you considered that because strategically the us can fall without a shot being fired if say China has access to all the rare earths and the US has none?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CardTrickOTK",
                                            "body": "Yeah, but that's another story entirely and why we should be digging and drilling more.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Bubbly-University-94",
                                                    "body": "Are you aware of where the world’s rare earth reserves are?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CardTrickOTK",
                                                            "body": "China, Vietnam, Russia, India, Brazil for the most part. You act like the US has 0 though which isn't true.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Bubbly-University-94",
                                                                    "body": "Considering the demand the US has compared to its reserves and it wouldn’t last long.  Also considering it’s essential for the military - you would think strategically the us would be absolutely all over it wouldn’t you?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CardTrickOTK",
                                                                            "body": "That is the goal",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ivan_Botsky_Trollov",
                            "body": "**Are trump supporters aware that his actions are creating a scenario where the previously unargued and unrivalled US security umbrella is now regarded as suspect and prone to transactionalism?**\n\nsoo the USA needs to pay-babysit the defense of all its \"allies\"\n\nare u aware that this looks like  freeloading to many of us?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lemystereduchipot",
                    "body": "What are your feelings that Musk is parroting a Russian talking point with the referenced tweet?",
                    "score": 18,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "I don't really care. He's entitled to his opinion and it's hardly the first time the idea has been floated.",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "lemystereduchipot",
                                    "body": "Do you care about his deep business interests in China and how seemingly never criticizes that country too?",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "No. Why would I? He's allowed to do business with China.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "fossil_freak68",
                                                    "body": ">No. Why would I?\n\nBecause he is in a policymaking position given to him by the president. If China has leverage over his decisions in his private businesses, how can we be confident that isn't going to influence his decisions on which government spending programs to cancel, and which to keep?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "He's not in a policymaking position. He's in a consulting position. Obviously there is a risk of Elon being compromised by China just like how Eric Swalwell, Nancy Pelosi and Kathy Hochul were.\n\nHowever I like the job he's doing and there's a variety of factors at play that mitigate the likelihood of Musk being a Chinese agent. I don't think Musk being a risk to national security is an issue of particular import and is mostly used to deflect from the value of the work DOGE is doing.\n\nI don't care about his takes on international relations.",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "fossil_freak68",
                                                                    "body": ">He's not in a policymaking position. He's in a consulting position.\n\nAre you saying Elon doesn't have any delegated authority to make cuts?\n\n>I don't care about his takes on international relations.\n\nEven when he is helping make decisions about US foreign policy, including where and how much foreign aid to spend?",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "proquo",
                                                                            "body": "> Are you saying Elon doesn't have any delegated authority to make cuts?\n\nYes.\n\n> including where and how much foreign aid to spend?\n\nIn regards to USAID only. Other direct foreign aid is through congress. USAID is an executive branch agency that funnels money to NGOs. Musk is not making foreign aid cuts, he's recommending cuts to wasteful spending on NGOs.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "fossil_freak68",
                                                                                    "body": "So what does Musk mean when he says he \"deleted\" USAID?",
                                                                                    "score": 9,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "proquo",
                                                                                            "body": "That he was instrumental in eliminating USAID. Obviously.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "fossil_freak68",
                                                                                                    "body": "but you wouldn't consider that to be a policymaking position?",
                                                                                                    "score": 9,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "proquo",
                                                                                                            "body": "No. He's not making policy.",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "fossil_freak68",
                                                                                                                    "body": "I'm genuinely asking her, not trying to be dense or going for a gotcha. If someone is able to say \"cut this\" and then the money is immediately cut (sometimes to the tune of hundreds of millions of dollars), why shouldn't I consider that person a policymaker?",
                                                                                                                    "score": 5,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "proquo",
                                                                                                                            "body": "Because the president is the one making and/or approving policy. Elon works for the president. He's making good recommendations. That's not the same thing as being a policymaker.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "fossil_freak68",
                                                                                                                                    "body": "In your view, is the president the only policymaker in the executive branch?",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "proquo",
                                                                                                                                            "body": "Yes. All executive power is vested in the president. Donald Trump himself issued an executive order reaffirming this.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "fossil_freak68",
                                                                                                                                                    "body": "And can the president delegate that authority to those working for him, or does he have to make every policy decision?",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "proquo",
                                                                                                                                                            "body": "He can delegate authority. He has not delegated that authority to Musk.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "fossil_freak68",
                                                                                                                                                                    "body": "Should we (voters) then interpret every funding decision DOGE has made as a direct policy decision from the president? If not him (nor Musk) then who?",
                                                                                                                                                                    "score": 3,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                            "body": "Yes we should. We should interpret every executive decision as coming from the president unless stated otherwise.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "fossil_freak68",
                                                                                                                                                                                    "body": "So when an email is sent to all federal workers under order of DOGE, but then some cabinet secretaries tell their employees to ignore the email and not respond, what is the chain of command here?",
                                                                                                                                                                                    "score": 3,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                            "body": "Trump has given authorization to DOGE to conduct these types of assessments. \n\nTrump has stated clearly that federal workers who ignore these emails may be at risk of termination. \n\nThere is only ambiguity in the minds of ideologues. DOGE has authority to make assessments on technology and personnel to recommend cuts. This isn't in question to anyone except the dishonest.\n\nEdit: Kash and Tulsi have authorization to direct their staff not to answer due to handling classified material and ongoing investigations. They've stated they will handle it in-house.",
                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "fossil_freak68",
                                                                                                                                                                                                    "body": "Did tusli make that policy announcement , or the president?",
                                                                                                                                                                                                    "score": 3,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "proquo",
                                                                                                                                                                                                            "body": "As far as I am aware Trump has not made any official statement on it but we aren't privy to whatever internal discussions occurred regarding those agencies.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Inmyprime-",
                                                                    "body": "How can you be sure about that? He owns X. Trump (and Putin) read X. His supporters read X. Putin’s supporters post on X. Does this not bother people?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "proquo",
                                                                            "body": "I have no idea what you're even trying to claim.\n\nAOC is on TikTok. Shall we consider if she's a Chinese asset?",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "r2002",
                    "body": "Some believe when Trump criticizes NATO he's trying to achieve the scenario you described through \"asking for more and settle in the middle\" smart negotiations -- but when Elon talks about leaving NATO is he also just using it as a negotiating tactic or do you think he actually believes it should be done?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "I don't think Elon is in a place to dictate foreign policy and he's allowed to express an opinion and point of view.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ultronomy",
                    "body": "You know what? I hard agree with this take. I think leaving NATO would just be shooting ourselves in the foot. However, Europe does need to get in board with contributing to their own defense. If Russia/China tries to make a huge land grab, they will be the first line of defense. They cannot rely on the US for the first response. In my mind, a NATO where all countries contribute equally is far more fearsome than one that hides behind the US.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AdAggravating3893",
                    "body": "Does the threat of pulling out of NATO and the disregard for established treaties possibly make it harder to do me future allies?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "Well sure, it could. But is that a good reason to be committed to an uneven arrangement with severe consequences? Or might it make more sense to end a bad arrangement in order to establish better ones with nations willing to be engaged?\n\nAnd why does NATO have a mechanism for withdrawal if it is secretly supposed to be a permanent pact?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Flussiges",
                    "body": "> The goal needs to be getting our European partners to match the US' strength and capabilities so the US can take a junior role in European defense, especially now that Russia is depleted by Ukraine.\n\nThe only way to do this is to leave. Otherwise it's like telling your deadbeat son to get a job so you can stop paying his rent. He's not going to do it until you actually cut him off.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "sfprairie",
            "body": "No.  Absolutely not.  As appalling as isolationism is, it is not going to be to our benefit.",
            "score": 3,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Do you see any benefits to leaving NATO?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sfprairie",
                            "body": "No.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AccomplishedCarob307",
            "body": "No",
            "score": 5,
            "replies": []
        },
        {
            "author": "notapersonaltrainer",
            "body": "Look, I’ve heard all the boomer platitudes about why NATO is a sacred cow—\"they're our friends\" \"soft power,\" \"shared values,\" \"it's in our interest,\" \"we’ll lose credibility,\" \"America leads the free world,\" \"defending democracy,\" \"rules-based international order,\" \"global stability,\" \"strength through unity,\" \"protecting our allies protects us,\" \"they reluctantly sent a few troops to Iraq\" etc. \n\nHowever, in my lifetime this has been the *actual* manifestation of this \"friendship\":\n\n* Europe has imposed tariffs on the United States for decades, yet when Trump's trade policy mirrored theirs, they cried foul.  \n\n* European nations have consistently underspent on NATO commitments—even after a decade that saw two Russian invasions. Yet when the U.S. asked them to simply meet their agreed-upon obligations, they acted as if we're traitors.\n\n* The United States has disproportionately funded Europe’s defense, while European countries put their own security at risk—weakening their militaries, indulging in cheap Russian gas, and gutting their energy security (which NATO itself flagged as Russian [subversion](https://foreignpolicy.com/2014/06/20/russias-quiet-war-against-european-fracking/)).  \n\n* And when the U.S. repeatedly [pointed out](https://www.youtube.com/watch?v=M5MJEMHZZsI) the absurdity of this, European leaders [laughed](https://www.youtube.com/watch?v=FfJv9QYrlwg) and [played dumb](https://www.youtube.com/watch?v=0CvQmWoog18). Yet they still call America \"compromised by Russia,\" lol.  \n\n* Europe strangles its own tech sector while placing enormous fines on American companies and [threatening](https://www.politico.eu/article/eu-elon-musk-donald-trump-interview-thierry-breton-letter-social-media/) U.S. CEOs.  \n\n* While the U.S. upholds free speech as a fundamental right, Europe increasingly embraces speech [authoritarianism](https://www.cbsnews.com/news/policing-speech-online-germany-60-minutes-transcript/) and demands that American companies [comply](https://www.reuters.com/technology/apple-removing-end-to-end-cloud-encryption-feature-uk-bloomberg-news-reports-2025-02-21/).  \n\n* A majority of Germans said they [wouldn’t support defending NATO allies in a Russian conflict](https://www.euractiv.com/section/politics/news/majority-of-germans-wouldnt-support-defending-nato-allies-in-russia-conflict/). After a century of American-led reconstruction, defense, and goodwill, Europe doesn’t even pretend it would reciprocate.  \n\n* European governments push green policies that cripple their industries and raise energy costs, then turn around and buy energy from the very nations they claim to oppose. Meanwhile, they lecture the U.S. about climate while relying on American exports to keep their lights on.  \n\n* Economically, Europe is stagnant—zero growth, aging populations, and industries that can’t compete without protectionism, even from [each other](https://www.ft.com/content/13a830ce-071a-477f-864c-e499ce9e6065). Yet they scoff at the American economy while relying on U.S. innovation, financial markets, and consumers to keep them afloat.  \n\n* Culturally, Europe sneers at Americans while its own societies become lifeless, self-loathing, and demoralized. Europeans mock American patriotism but seem to have almost negative pride and structural disdain in their own nations. They openly despise Christianity while mass-importing Islam and bending over backward to accommodate it.  \n\nThis isn't an alliance—it's a hostage situation. And Trump is somehow the only one negotiating with half of America inexplicably taking Europe's side. \n\nIt's reminiscent of how Gen Z boys have been relentlessly flagellated for privilege—yet their entire existence has been the media, academia, and workplace institutionally skewed against them—but they're expected to pedestalize everyone else—or be branded Nazis. It's the same exact playbook down to the Nazi rhetoric. \n\nAmericans are starting to ask for mere *reciprocity* from Europe almost a century after reconstruction (due to Europe's self inflicted destruction). Reciprocity at this point should be table stakes for \"friends\". Especially a wealthy one with massive resources. Yet they're having an absolute tantrum. \n\nAll I hear are the same unpersuasive, self-righteous, outdated boomer talking points. Maybe that worked on boomers. But I won't vote for my families' lives to die for ingrates. Especially not after how the EU is behaving now. NS, I have no beef with you sending your sons to take back Donetsk right now. They are taking volunteers. \n\nWhen someone is used to being coddled, reciprocity feels like an attack. But it’s not—it’s just long overdue. At some point they can start acting reciprocal or this one-sided relationship has to end.",
            "score": -12,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "What happens if we withdraw from NATO, economically and military wise?",
                    "score": 24,
                    "replies": [
                        {
                            "author": "SomeFatNerdInSeattle",
                            "body": "Would you care if NATO brought in China to fill the gap left by the US?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Did you mean to ask me?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SomeFatNerdInSeattle",
                                            "body": ">Did you mean to ask me?\n\nNo sorry",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Ivan_Botsky_Trollov",
                                    "body": "then they will change the name?\n\nChina isnt anywhere near the Atlantic\n\nand it would be amusing to see euros sooo willing to befriend a regime like China, while at the same time riding the high horse of morality and behaving like \"humanitarian superpowers\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "notapersonaltrainer",
                            "body": "Europe immediately restores their nuclear power programs. They restart fracking again against Russia's [wishes](https://foreignpolicy.com/2014/06/20/russias-quiet-war-against-european-fracking/). This patches the biggest leverage point Putin has on Europe. No longer being an energy suck also brings down global energy prices and thus inflation. LNG tankers suffer. \n\nThey increase their defense spending like we've asked for decades. \n\nEuropeans have to go back to work/vacation hour parity with Americans and developed Asian countries (boo hoo). \n\nUS military spending remains the same but refocuses on countering modern Chinese threats (retooling for drone, robotic, AI, space warfare, etc) instead of proxy war against Russian WWII tanks. Winners and losers in the defense space. \n\nEconomically depends what they do with tariffs. With a reciprocal policy the ball is in their court to bring it to zero and unleash free trade if they want it.",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "When we relinquish our soft power and strategic global positions?",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "ArrantPariah",
                                    "body": "> Europeans have to go back to work/vacation hour parity with Americans and developed Asian countries (boo hoo).\n\nYou don't like vacations?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "sixseven89",
                                            "body": "I think he means the money would be spent on the other things he mentioned instead",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "I completely misread that. Thank you?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Phedericus",
                    "body": "* Europe has imposed tariffs on the United States for decades, yet when Trump's trade policy mirrored theirs, they cried foul.\n\nThe tariffs that exist between Europe and the US are result of multilateral agreements that involve tariffs just a small part of a much larger complex deal, it's not like Europe woke up one day and put tariffs on the US on a whim. The US agreed to those tariffs, and got something in return as part of a negotiation.\n\nIn some cases, like the automobile industry, the tariffs are the result of multilateral agreements between Europe, the US, China, etc, and are placed on all non-EU cars, not on US cars. Changing tariffs for the US specifically would trigger guarantees for other countries as well. It's much more complex than \"You tariff me I tariff you\".\n\nWhy don't just try to negotiate a new deal, instead engaging in a trade war or threatening to leave NATO? \n\nIs it possible that you are misunderstanding other points as well?",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "To6y",
                    "body": "The obvious main benefit of a strong alliance is that it's a deterrent to incoming hostile actions.  You experience that benefit every day.\n\n> A majority of Germans said they wouldn’t support defending NATO allies in a Russian conflict. After a century of American-led reconstruction, defense, and goodwill, Europe doesn’t even pretend it would reciprocate.\n\nThis is an article about a single poll, taken in 2017.  Do you really think that's relevant given everything that's happened between then and now?\n\n> And when the U.S. repeatedly pointed out the absurdity of this, European leaders laughed and played dumb. Yet they still call America \"compromised by Russia,\" lol.\n\nTrump was just echoing the same advice from Obama in 2014, by the way.\n\nBut again, this all happened 7 years ago.  Quite a lot has changed.  Why not make your comments about the *current* state of things?",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": "Would you care if NATO brought in China to fill the gap left by the US?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "SorryBison14",
                            "body": "A US, Russia, India, Japan alliance vs China and the EU would be fine, no worse than allying with the EU.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "notapersonaltrainer",
                            "body": "If by fill the gap you mean fill Europe's rectum in return for China's Century of Humiliation. \n\nGlobal alignment would shift to US, Russia (which has happened before), and India vs China-EU. Russia isn't dumb enough to not understand basic power balance. \n\nEurope would fall into chaos as it slowly and stupidly wakes up to the fact that China or any other patron won't tolerate nearly the same exploitive & manipulative behavior America regularly puts up with. Or that China will use European bodies like Russia uses North Koreans in any conflict. \n\nMeanwhile US would pick up multiple allies who actually *would* use extreme measures to counter Chinese expansion.",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": "So would you care?",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "notapersonaltrainer",
                                            "body": "I'd care in that it is a large event and I generally pay attention to large events.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SomeFatNerdInSeattle",
                                                    "body": "I'll rephrase, would it concern you?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "notapersonaltrainer",
                                                            "body": "Sure. I have some European stocks I'd have to sell.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sixseven89",
                            "body": "Is that an actual possibility? Dear lord.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": ">Is that an actual possibility?\n\nI don't see why it wouldn't be possible if the US continues to make itself an international pariah.\n\nWould you care if they brought it in china?",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Big_Poppa_Steve",
                            "body": "You have got to be kidding",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": "Why would I be?",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Big_Poppa_Steve",
                                            "body": "That’s like my crazy girlfriend threatening to leave me for a convicted rapist. Get real.",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "SomeFatNerdInSeattle",
                                                    "body": "Realistic or not, would you care?",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Big_Poppa_Steve",
                                                            "body": "I don’t deal in hypotheticals",
                                                            "score": -7,
                                                            "replies": [
                                                                {
                                                                    "author": "SomeFatNerdInSeattle",
                                                                    "body": "Why?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Big_Poppa_Steve",
                                                                            "body": "Don’t waste my time",
                                                                            "score": -6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RainbowTeachercorn",
                                                                                    "body": "Aren't you wasting your own time by being on a sub that is designed to clarify TS beliefs/ideas/thoughts and actively choosing to be combative and not clarify your position?",
                                                                                    "score": 8,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Eisn",
                    "body": "The only time article 5 was invoked was by the US and NATO responded. Seems to me that it was fine for the US when that happened. Europeans died for the US calling in NATO, did they not?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "proquo",
                            "body": "God forbid the NATO alliance do its job of defending its member states.\n\nYou're pretty much admitting the point of the alliance was for the US to do the heavy lifting of European defense while Europe wasn't expected to throw in.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Eisn",
                                    "body": "My point was that the only time the alliance was activated was when the US was attacked and the Europeans defended them. Why would I make the inverse point?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "proquo",
                                            "body": "Either the alliance exists to provide for mutual security, which includes the US being able to rely on its European partners to honor the alliance, or it doesn't. To suggest the US owes the alliance or should be grateful for Europe holding up its end of the alliance after the US has been the majority of the alliance is proving the point that the US is giving more than it's getting.\n\nAnd let's put things into perspective here; our NATO partners collectively lost 1131 troops in Afghanistan. Every death tragic, but hardly a major investment for the alliance especially when the US lost 2459 of its own troops.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "KenseiNoodle",
                    "body": "The problem with your argument is that you see geopolitics simply as a ledger of dollars spent. This is not how you assess global alliances and influence. \n\nIf international relations were just about who spends more money, the US should withdraw from Asia Middle Eastern everywhere else too. But power is NOT just about budgets. It’s about global influence. NATO isn’t subsidizing Europe. It’s about maintaining American dominant or global region. the second we abandon NATO Russia and China filled the board and suddenly Washington scramble to control the world that no longer listens to it. \n\nLet me put this in a more personal framework: if you were the biggest business in town, then you get to call the shots and everyone listens to you. As a leader, you do spend more money than other businesses to keep things in order, but this means everyone follows your rules and does business on your terms. \n\nNow imagine another large business like China, who sees America wanting to pull away from this control and wants to fill that void. Are you OK with China expanding their control?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "wijnandsj",
                    "body": ">Europe has imposed tariffs on the United States for decades, yet when Trump's trade policy mirrored theirs, they cried foul.\n\nAny country cries foul when it comes to tariffs. Also the USA tariffs EU goods. Here's some facts.\n\n[https://think.ing.com/articles/eu-us-trade-strategy/](https://think.ing.com/articles/eu-us-trade-strategy/)\n\n>European nations have consistently underspent on NATO commitments—even after a decade that saw two Russian invasions. Yet when the U.S. asked them to simply meet their agreed-upon obligations, they acted as if we're traitors.\n\nOn the 2014 NATO summit an agreement was reached to up the spending. For the current year it looks like only 6 countries aren't going to meet those requirements. If your idea of \"asking\"  is showing up here with a very insulting set of lies at a security conference and then hinting like a mobster that everyone should spent 5% except the USA that message isn't going down well\n\n>The United States has disproportionately funded Europe’s defense, while European countries put their own security at risk—weakening their militaries, indulging in cheap Russian gas, and gutting their energy security (which NATO itself flagged as Russian [subversion](https://foreignpolicy.com/2014/06/20/russias-quiet-war-against-european-fracking/)).\n\n  \nI'll grant you the energy thing, that's stupid. The rest.. we rode the peace dividend wave, some of us a little too long. But we weren't invading and destabilizing countries around the world.\n\n>Europe strangles its own tech sector while placing enormous fines on American companies and [threatening](https://www.politico.eu/article/eu-elon-musk-donald-trump-interview-thierry-breton-letter-social-media/) U.S. CEOs.\n\nOK, that's just some baseless accusation. \n\n>While the U.S. upholds free speech as a fundamental right, Europe increasingly embraces speech [authoritarianism](https://www.cbsnews.com/news/policing-speech-online-germany-60-minutes-transcript/) and demands that American companies [comply](https://www.reuters.com/technology/apple-removing-end-to-end-cloud-encryption-feature-uk-bloomberg-news-reports-2025-02-21/).\n\nAnd more.  We have this weird idea that if you want to do business here you play by local rules.\n\n>  \nA majority of Germans said they [wouldn’t support defending NATO allies in a Russian conflict](https://www.euractiv.com/section/politics/news/majority-of-germans-wouldnt-support-defending-nato-allies-in-russia-conflict/). After a century of American-led reconstruction, defense, and goodwill, Europe doesn’t even pretend it would reciprocate.\n\nFirst of all, that's a 2017 article. Secondly.. as a country that was the ONLY ONE EVER TO INVOKE ARTICLE 5 I really don't think you should discuss reciprocity\n\n>Economically, Europe is stagnant—zero growth, aging populations, and industries that can’t compete without protectionism, even from [each other](https://www.ft.com/content/13a830ce-071a-477f-864c-e499ce9e6065). Yet they scoff at the American economy while relying on U.S. innovation, financial markets, and consumers to keep them afloat.\n\nWTF does this have to do with a defense alliance? Also, yet again not entirely true, there's a little growth\n\n>  \nCulturally, Europe sneers at Americans while its own societies become lifeless, self-loathing, and demoralized. Europeans mock American patriotism but seem to have almost negative pride and structural disdain in their own nations. They openly despise Christianity while mass-importing Islam and bending over backward to accommodate it.\n\nAnd America wants to go full christo-Taliban. What's wrong with cultural differences? Or religious freedom (wasn't that in your constitution?) \n\nAlso.. most of europe is in front of the USA where it counts\n\n[https://www.theglobaleconomy.com/rankings/happiness/](https://www.theglobaleconomy.com/rankings/happiness/)",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Dijitol",
                    "body": "I found this in the article you linked. \n\n>According to the US think tank, which interviewed people in European countries, the US and Canada, “NATO’s image is improving on both sides of the Atlantic.”\n\n>The alliance enjoys high approval ratings in Poland and the Netherlands (both on 79%). Germany ranks third in the list on 67%, followed by Canada (66%), the US and United Kingdom (both 62%), France (60%) and Spain (45%).\n\n>In all eight NATO countries surveyed, approval ratings increased compared to the previous year. In Sweden, which is not a member of the alliance, NATO enjoys 47% approval.\n\nhttps://twitter.com/SamJamesMorgan/status/867328636881440769\n\n>In terms of what parts of the political spectrum support NATO, Europe and the US differ completely. On this side of the Atlantic, it is the conservatives that favour it the most (in Germany, 77%), while in the US it is the left and liberal contingent who support NATO (81% versus 48% of American conservatives).\n\nSo the vast majority of Europe  support NATO. Do you factor all this into your research of Germany?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "h34dyr0kz",
                    "body": ">But I won't vote for my families' lives to die for ingrates.\n\n\nDo you think the families of those that died in Afghanistan feel that they shouldn't have sent their loved ones to die for ungrateful Americans after we invoked article 5?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "whateverisgoodmoney",
                    "body": "American living in Germany for over 7 years.\n\nThe reaction you saw this weekend all over Reddit was petulant children, most of whom would never offer their own life in defense of Ukraine.\n\nGo read the German subs. Very, very few are willing to go themselves or send their children. I know not one person in Germany that would send Germans to Ukraine. Not one.\n\nThe realization that the US will not fight for them for free is starting to set in starting today.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "blkpingu",
                            "body": "Why are you in Germany and why haven’t you left yet?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "whateverisgoodmoney",
                                    "body": "Why would I leave?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "blkpingu",
                                            "body": "You seem dissatisfied with Germany and supportive of a man who diametrically stands against everything we hold dear in Germany. If Trump is your champion, why be in Germany?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "SorryBison14",
                                                    "body": "Given how many Germans voted for the AfD, I don't think you have the right to talk about German values as though you get to speak on behalf of all Germans.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "blkpingu",
                                                            "body": "If Trump attacks Greenland, would you join forces on Europes side or the American side?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SorryBison14",
                                                                    "body": "I wouldn't need to join the military. The occupation would be rapid and virtually uncontested, nothing worth concerning myself over.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "-OIIO-",
                    "body": "This is very helpful and in detail",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Honky_Cat",
                    "body": "tl;dr - In NATO - The US is the rich uncle that funds vacations, bails you out when your washer dies, yet everyone in the family still talks shit about at events he can't make.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "jinawee",
                            "body": "Do you think the US would have the same power projection without bases in Europe? Do you think they should close them? Do you think US bears no responsibility in desestabilizing Ukraine, Yugoslavia, Serbia, Georgia for its own benefit?",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thedamnoftinkers",
                    "body": "Has America paid the same amount it's demanding its European allies pay?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tvisforme",
                    "body": "> A majority of Germans said they wouldn’t support defending NATO allies in a Russian conflict. After a century of American-led reconstruction, defense, and goodwill, Europe doesn’t even pretend it would reciprocate.\n\nThe article you linked to does suggest that only a minority of Germans would support defending a partner country, but it also says support has increased from last year. Furthermore, the first line states \"European approval of NATO is on the rise, according to a US study\" and seven of the eight countries surveyed had majority support for NATO itself. How did you interpret that as \"Europe doesn’t even pretend it would reciprocate\"?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Scynexity",
                    "body": "I would like to fully agree with this.",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "Flussiges",
                    "body": "Nailed it. For me, it's the parts you said about values. I don't want my country to help defend countries that espouse leftist values. They are my enemy.",
                    "score": -92,
                    "replies": [
                        {
                            "author": "elCharderino",
                            "body": "Why are they your enemy? ",
                            "score": 39,
                            "replies": []
                        },
                        {
                            "author": "americanherbman",
                            "body": "so are around half of Americans are your enemy?",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "Ivan_Botsky_Trollov",
                                    "body": "the feeling is mutual TBH",
                                    "score": -19,
                                    "replies": [
                                        {
                                            "author": "RainbowTeachercorn",
                                            "body": "Do you truly think other Americans consider you their enemy?",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 98,
                            "replies": [
                                {
                                    "author": "Sithire",
                                    "body": "The first part of this comment is so ironic that it's all most cringeworthy.",
                                    "score": -36,
                                    "replies": [
                                        {
                                            "author": "diederich",
                                            "body": "Is it possible to not share someone's values and also not be their enemy?",
                                            "score": 32,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Ivan_Botsky_Trollov",
                                    "body": "**Do you realise how utterly brainwashed you are when you consider everyone who doesn’t share your opinion “enemies”?**\n\nyou mean the way those liberal regimes treat  the right wing parties in their countries?",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "tvisforme",
                                            "body": "> you mean the way those liberal regimes treat the right wing parties in their countries?\n\nI'd like to hear more about which countries you're referring to as well. Could you elaborate as to whether you mean the treatment of traditional right-wing parties (such as Canada's Conservative Party) or the hard-right parties (such as Germany's AfD)?",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Ivan_Botsky_Trollov",
                                                    "body": "**I don’t think you could be any more ridiculously vague if you even tried to.**\n\n  \nwhat part is vague?\n\nyou seem to come from sweden.\n\nHow did other parties treat the Swedish democrats?\n\nlike the end of civilization as liberals know it.\n\nRidiculous regimes, ridiculous to support them",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "KriistofferJohansson",
                                                            "body": "> what part is vague?\n\nI literally told you above. The very least you can do is to point to a country and point to what treament you think is unfair. \n\nHow does a right-wing party being treated unfairly in another country affect America so badly that right-wingers must feel the need to utter the words \"everyone who isn't with me is my enemy\"? Should American politics be based on other countries' politics, and if so, which countries? All of them, or just the ones fitting certain agendas?",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Ivan_Botsky_Trollov",
                                                                    "body": "**that right-wingers must feel the need to utter the words \"everyone who isn't with me is my enemy\"?**\n\nsoo when USA liberals promote  their own values worldwide... are you similarly opposed to it?  e.g. like exporting all the manufactured support for LGBT and European liberal governments readily accepting it with enthusiasm\n\nOr its only NOT ok when its the right wing doing so?\n\nalso.\n\nI pointed to a specific example in Sweden and I see you are simply ignoring  my reply.\n\nThere's no need on further replies from my part.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "KriistofferJohansson",
                                                                            "body": "> soo when USA liberals promote their own values worldwide... are you similarly opposed to it? e.g. like exporting all the manufactured support for LGBT and European liberal governments readily accepting it with enthusiasm\n> \n> \n> \n> Or its only NOT ok when its the right wing doing so?\n\nMate, what are you on about? This isn't about values being promoted or exported. I'm asking you, plain and simple, do you understand how bad American politics have gotten if you must consider anyone who doesn't share your beliefs to be your enemies? How is that a sensible reaction to anything? \n\n>I pointed to a specific example in Sweden and I see you are simply ignoring my reply.\n\nFirst of all, you most definitely did not point to a specific situation where a right-wing party was unfairly treated regarding something. Go on, when was SD unfairly treated for something members of their party said or did?\n\nSecondly, you're on a subreddit where YOU are supposed to be asked questions and answer them. That's literally the whole point. My comments will be automatically deleted if I stop asking questions. If that concept isn't your thing then you have nothing to do in here. The original question wasn't even for you, you chose to join this discussion. The least you can do is bother answering.",
                                                                            "score": 10,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Dzugavili",
                                                                            "body": ">like exporting all the manufactured support for LGBT and European liberal governments readily accepting it with enthusiasm\n\nWhat suggests to you it has been manufactured and exported? It seems to me that the homophobes lost the culture war there and what has been going on is largely natural.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Tyr_Kovacs",
                                            "body": "I mean this sincerely, Don't you find typing that embarrassing?\n\n\nI realise the question was framed very aggressively, but you can say that without whataboutisms.\n\n\nYou could say \"that's not a fair or nice way of asking me\" you could say \"that's insulting\", you could say \"you're wrong to ask like that\". Heck, you can appeal to thr mods if you think it's bad faith...\n\n\nBut just \"they do it too\"... that's what a child does. They point fingers and whine that life isn't fair as way to avoid responsibility.\nI'm sure you've seen little kids do that all the time.\n\n\nDoes it not give you pause to think that that's your best response?\n\n\nDoes it not embarrass you?\n\n\nMaybe you're built different, but I'd certainly think twice if I had to throw a toddler tantrum to avoid directly engaging and it seems to be a default response for other TSs.\n\n\nWhy do you think that is?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Ivan_Botsky_Trollov",
                                                    "body": "**I mean this sincerely, Don't you find typing that embarrassing?**\n\nsincerely, the only embarassing thing is the childish response of euro liberals -and  also from the USA- whenever a right wing party gains traction there in europe.\n\nwhile some immigrants, refugees are the ones ramming cars on people --- euro liberals are mega concerned about some right wing.\n\n**Does it not give you pause to think that that's your best response?**\n\n**Does it not embarrass you?**\n\nas I pointed, If I was an euro liberal like the above person seems to be, I'd be VERY embarrassed to either be soo brainwashed about the ghost of some imaginary right wing foe, while my countrymen are attacked and my  priorities require ignoring things like this, or accepting it as normal:\n\n[https://en.wikipedia.org/wiki/2025\\_Munich\\_car\\_attack](https://en.wikipedia.org/wiki/2025_Munich_car_attack)",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Tyr_Kovacs",
                                                            "body": "I understand.\n\n\nIt's much easier to throw out totally unrelated talking points than to engage.\n\n\nI asked you a simple, direct question and you've rambled on about \"euro libs\" and the Munich attack, and failed to engage with the question at all.\n\n\nI don't think anyone is impressed by this, it makes you look weak that you can't answer a direct question with a weird emotional rant.\n\n\nIt makes you look like a coward that you can't just engage in good faith, or ignore the question, but you are compelled to ramble off talking points.\n\n\nI'd like to think you aren't some weak snivelling empty suit, I'd like to think you have sincerely held beliefs that can stand up to scrutiny. \nI hope I'm right and you're just trolling.\n\n\nIn either case, simple question:\n\n\nWhy are you here? Why are you responding in this subreddit?",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Ivan_Botsky_Trollov",
                                                                    "body": "terrible wall of text saying nothing.\n\nNevermind, there are some other NS which are worth engaging, like OP",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "beaherobeaman",
                                            "body": "I am also curious what treatment of right wing parties you are referring to?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Ivan_Botsky_Trollov",
                                                    "body": "ignore it as much as possible:\n\n[https://www.nytimes.com/2025/02/23/world/europe/germany-election-firewall-afd.html](https://www.nytimes.com/2025/02/23/world/europe/germany-election-firewall-afd.html)",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "beaherobeaman",
                                                            "body": "I haven't ignored it. Been well aware of the AFD. Discussing productively begins with a clarification of terms. \n\nDo you think think that Europe/Germany has any justification for their actions against the AFD given they've had more intimate consequences (ie, the near leveling of the continent, 80 years of stigma (Germany)) as a result of fascist movements?",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "vbcbandr",
                            "body": "So anyone left of the center you have in your own mind is your enemy? Are you being facetious?",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "RainbowTeachercorn",
                            "body": "Isn't it a bit sad to consider other humans who are.trying to love their lives in the way they see fit, without actually harming you (in fact many probably support.your right to believe what you do, even though they disagree with it)?\n\nWhat do you consider \"enemy\" level \"leftist values\"? For that matter, a) what are \"leftist values\" and (b) which countries do you believe espouse them?",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MakeGardens",
            "body": "I’m not going to take a hard stance on this. I truly do not know what the right decision is, but it sure seems like we are getting a bum deal from the whole NATO thing.",
            "score": 1,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "What leads you to believe this? What are some pros and cons of being in NATO?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "CardTrickOTK",
            "body": "At the bare minimum, I think ALL of NATO should have stricter policies on what they will support.\n\nIf a random NATO country decides to pick a fight they shouldn't be entitled to support because of that.",
            "score": 1,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Has any country done this?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CardTrickOTK",
                            "body": "Is that not literally what is presently happening? Escalating tensions with Russia when the biggest member is pushing for peace?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Is that not literally what is presently happening? Escalating tensions with Russia when the biggest member is pushing for peace?\n\nHow did a random NATO country pick a fight?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CardTrickOTK",
                                            "body": "Didn't Starmer just talk about jets and boots on the ground?  \nAmerica wants this fighting done.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "Is this what you mean by a random NATO country starting a war? Because I saw it as Putin starting it by invading.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CardTrickOTK",
                                                            "body": "No, I mean he is instigating escalation rather than attempting to deescalate.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CanadianBaconne",
            "body": "America basically is NATO. Most other countries don't do anything. That's the reason. But the truth is America has many military bases in Europe. So it's very unlikely to happen.",
            "score": -3,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Do you see having bases on foreign soil, as a net positive for America?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "CanadianBaconne",
                            "body": "It's kind of just part of American history. The bases in Europe and Japan are results of WW2. Same with South Korea. For obvious reasons there's no bases in China, Russia, India, Brasil, even Vietnam. I wouldn't be surprised if we have some still in Iraq and Afghanistan. No American President will ever just give them up. They make things like war, trade, and influence on the global stage much easier. As with any empire, like the Romans at some point we could get overextended. Then China, Russia, etc. might try to fill that gap. This is basically what Trump wants with Panama and Greenland. We already have a military base on Greenland by the way. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mitoma333",
                                    "body": "If they are relics of WW2, how come so many Eastern European countries house US bases and military installations?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ivan_Botsky_Trollov",
            "body": "this  paper alliance perhaps shuld have been dissolved in 1991-92\n\nA neat example of its usefulness was Yugoslavia, 1992-1995.\n\nwhile the Uk and France and Germany were sobbing and writing letters, it took the US president at the  time ( Clinton) to force some peace among the belligerents.\n\nAs for now, NATO has outlived its strategic or tactic usefulness to the USA.\n\nThe ONLY valid argument from a nationalist point of view to keep this.. thing going is because it creates MANY jobs for the US military:\n\n[https://www.statista.com/statistics/1294271/us-troops-europe-country/](https://www.statista.com/statistics/1294271/us-troops-europe-country/)\n\n[https://www.bbc.com/news/articles/c3de8r2327go](https://www.bbc.com/news/articles/c3de8r2327go)\n\n[https://www.defense.gov/News/Releases/Release/article/3078056/fact-sheet-us-defense-contributions-to-europe/](https://www.defense.gov/News/Releases/Release/article/3078056/fact-sheet-us-defense-contributions-to-europe/)\n\n  \nshuld the USA leave NATO?\n\nyes, but gradually.",
            "score": 0,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Isn’t a weaker NATO, good for our enemies?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Ivan_Botsky_Trollov",
                            "body": "the ones funding it  shuld be Euro countries, since they benefit the most for it",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "They sure as hell stepped up the last year. It went from like 2 countries to like 23 countries contributing what we asked them to. But still, is a weaker nato good for our enemies?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Ivan_Botsky_Trollov",
                                            "body": "**They sure as hell stepped up the last year. It went from like 2 countries to like 23 countries contributing what we asked them to**\n\nthey need to carrry the bulk of the cost\n\n\n\n  \n**But still, is a weaker nato good for our enemies?**\n\nwhich enemies?\n\nIran?  Israel is all we need\n\nwhile our \"allies\" as usual roll over to Islam\n\n[https://policy.trade.ec.europa.eu/eu-trade-relationships-country-and-region/countries-and-regions/iran\\_en](https://policy.trade.ec.europa.eu/eu-trade-relationships-country-and-region/countries-and-regions/iran_en)\n\n  \nChina?  the big mistake comes from the Nixon presidency and its hard to untangle that.\n\n  \nRussia?  Not an enemy yet, but a menace to eastern europe",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "Why do they need to carry the bulk of the cost when our NATO spending doesn’t change if they spend more or less? Unless we start closing down overseas bases and operations? \n\nOur enemies are any authoritarian regimes. Like Russia or China or North Korea. \nWhy should let any of our enemies gain more power? \n\nRussia is constantly hostile towards America. Theyre trying to sabotage our democracy. Why would/should we go soft on them?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Ivan_Botsky_Trollov",
                                                            "body": "**Our enemies are any authoritarian regimes. Like Russia or China or North Korea. Why should let any of our enemies gain more power?**\n\nerrr...no\n\nsorry but this is pure Captain America fantasy\n\nThe USA has NO problem at all accomodating to authoritarian regimes if it fits some interests.\n\nThe list isnt exactly short and non-controversial:\n\nSaudi Arabia\n\nQatar\n\nChina\n\nSoviet Union ( with Stalin-lover FDR)\n\nand countless dictators from the Shah of Iran, to Franco to many many Latin American dictators\n\neven Saddam Hussein was a friend at some point in the 1980s",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "How does Russia fit our interests?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Eisn",
                    "body": "Ah, so it wasn't useful to the US after 9/11?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Ivan_Botsky_Trollov",
                            "body": "not much tbh",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Eisn",
                                    "body": "Can Europe and Canada have their dead people be alive again for supporting the US?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Ivan_Botsky_Trollov",
                                            "body": "if possible...",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mitoma333",
                    "body": "NATO did come in handy post 9/11 and during the US wars in the middle east, no?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mitoma333",
                    "body": "Does that also mean the US should remove all their forward operating bases, nuclear weapons and advanced warning systems in Europe?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ivan_Botsky_Trollov",
                            "body": "eventually yes\n\nthe only solid argument to sustain NATO for the USA is the amount of military jobs it provides.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jinawee",
                    "body": "Was NATO useful to USA in Kosovo?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ivan_Botsky_Trollov",
                            "body": "**was NATO useful to EUROPE in Kosovo** is the right question\n\nsince the yugoslav wars were an Euro problem, and they were unable to solve it on their own",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jinawee",
                                    "body": "If it was an Euro problem then why did Clinton crusade to illegally bomb Serbia bypassing Congress? Why did CIA finance, train and support a designated terrorist organization? Why did Holbrooke and Albright try to portray the KLA as freedom fighters? Do you think USA did not try to desestabilize a Russian ally?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ivan_Botsky_Trollov",
                                            "body": "Clinton did stuff for humanitarian reasons, like also that dumb intervention in Somalia\n\n**Why did CIA finance, train and support a designated terrorist organization?**\n\nthe \"loyalties\" of the CIA change with political needs\n\nDidnt they support al Qaeda at some point?\n\n  \n**Why did Holbrooke and Albright try to portray the KLA as freedom fighters?** \n\nthe USA took a side?  I think Bin laden was portrayed as a hero vs the Soviets in the 80s as well\n\n\n\n**Do you think USA did not try to desestabilize a Russian ally?**\n\nin 1998-99 with a non- hostile relationship with Russia's Yeltsin? I doubt that was the main reason to do it.\n\nHowever, I also dont see the strategic value of Serbia - a landlocked and rather poor country- to Russia. or anyone.\n\nThe main reasons seem to have been humanitarian.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "itsakon",
            "body": "He’s an employee.          \nDisagree of course but who cares.",
            "score": -20,
            "replies": [
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": "Why do you think we should be part of NATO?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "itsakon",
                            "body": "To promote diplomacy and cooperation between nations as well as to prevent another global war.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": "Why do you think so many trump supporters and elon are against it?",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "CalvinsStuffedTiger",
                                            "body": "Because only the U.S. Poland and Greece spend more than 3.0% of GDP on defense at 3.49%, 3.9%, and 3.1% respectively, but if you look at raw numbers the U.S. spends over 10x the next closest NATO country, Germany \n\nNATO created as a defense against Russia and the people who would be impacted the most directly by Russian attacks don’t seem to care that much about arming themselves against a Russian attack, so why should the United States be on the hook to step in with the resources and the military? \n\nDo you think the threats of letting Ukraine into NATO or not letting them into NATO would be as impactful of a leverage point if the United States military was not involved in NATO?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ops10",
                                                    "body": "Nations next to Russia are spending comfortably over the agreed upon 2% and most have so for a while. It is reasonable because, as you pointed out - they'd be most directly impacted.\n\nWhy is the never agreed upon  3% or the recently floated 5% an issue because they haven't been fulfilled? Why leave after Europe has woken up to fulfill their 2% obligation?\n\nAnd since we're here - why give up strong leverage on countries foreign and defence policy?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "CalvinsStuffedTiger",
                                                            "body": "Because the risk/reward is asymmetric. Russia isn’t invading the United States and we aren’t reliant on anything that Europe produces. \n\nIf Europe cared about leverage against Russia then maybe they shouldn’t have decommissioned all of their nuclear power plants (except for France) and become completely reliant on Russia for oil and gas. How could they not see that this exact thing would happen? \n\nAnd while we are here, why do you think Obama didn’t have a more aggressive approach to Russia when they invaded and annexed Crimea?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ops10",
                                                                    "body": "Umm, I have no idea why Barack \"The Russian Reset\" Obama had such a meek response to Crimea when his admin showed their absolute ineptitude with Georgia in 2008, other than incompetence. I'm not sure why you want to use Obama's Russia policy as a measuring stick for Trump? Especially when, and I'm in awe it is the reality, the current path struggles to pass it *after* a reality check on Russian power?\n\nAs for \"if Europe cared so much\" - yup, serious mistakes were made, in greed and naïveté. Some NATO members have been upset about it for decades, not just US. But again, why step away now as things are improving within the alliance, rather than decade ago when it was much more decadent?\n\nBuilding alliances is hard work and unless US doesn't plan to return to MENA theatre in the next few decades, if not centuries, it'd be cheaper to keep it on a backburner rather than throw away. Especially since US had to give so little concessions and got so much say when the current one was built? My take is that unless US seriously has decided to remove their interest from Europe and its surroundings, this looks something akin to Brexit (although with much better local position). And even if leaving NATO is a wise move, is it wise to sour relations that much whilst doing it?",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "itsakon",
                                            "body": "Because they feel other countries are not pulling their weight fairly, as they state over and over.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "SomeFatNerdInSeattle",
                                                    "body": "Why not fix these perceived problems instead of just throwing the baby out with the bath water?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "itsakon",
                                                            "body": "Germany laughed when Trump told them to  quit buying Russian oil.              \n\nIf they’re not going to follow advice when it comes to helping themselves, they’re not going to follow American  orders to pay more to NATO. We are not the boss of European countries?             \n\n&nbsp;\n\nHere’s Trump in 2016:               \n\n> NATO was set up at a different time. NATO was set up when we were a richer country. We’re not a rich country anymore. We’re borrowing, we’re borrowing all of this money...NATO is costing us a fortune and yes, we’re protecting Europe with NATO but we’re spending a lot of money. Number one, I think the distribution of costs has to be changed. I think NATO as a concept is good, but it is not as good as it was when it first evolved.”                \n\nhttps://www.cbsnews.com/news/trump-nato-past-comments/            \n&nbsp;\n\nAnd while it’s not NATO exactly, here’s the kind of money we spend vs. Europe.                \n\nhttps://www.statista.com/statistics/1303432/total-bilateral-aid-to-ukraine/                   \n\n\nThough I disagree with quitting world peace organizations, the cost  isn’t just a “perceived” problem.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "swantonist",
                                    "body": "Why should I not care when the guy who has Trump\nin his pocket is suggesting leaving NATO? Why are you downplaying such shocking statements?",
                                    "score": 25,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Inmyprime-",
                    "body": "Who? Trump to Musk?",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "riskyrainbow",
                    "body": "Do you think the power one holds is necessarily reflected in their official role?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "itsakon",
                            "body": "Do you think Musk holds power outside of the role he was hired for?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "riskyrainbow",
                                    "body": "Yes of course. I'm speaking of actual, de facto power, not de jure. Do you think that the richest man on the planet has an amount of influence on the president's actions comparable to others with a similar amount of officially designated power?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "itsakon",
                                            "body": "I feel like this could be reasoned out.            \nRich business people deal with rich business people all day. So no, I don’t think Musk holds any more influence than anyone else who might get hired to do the job.            \n&nbsp;\n\nIf wealth was a factor of influence, it works better behind closed doors. Like what people suspect with the Koch brothers or George Soros.  Or a thousand other business influencers. Or countless lobbyists.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "UncleSamurai420",
            "body": "Warsaw pact and USSR are long gone. Maybe not dismantle the alliance entirely, but paring it back might make sense.",
            "score": -14,
            "replies": [
                {
                    "author": "Soncro",
                    "body": "In a hypothetical scenario where China were to suddenly threaten the US, e.g. they invade Guam, do you think the US should strengthen the alliance again?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "UncleSamurai420",
                            "body": "If China invades Guam? lol. I guess we’d invoke article 5. Not sure what Latvia would do about it though.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Soncro",
                                    "body": "Latvia would be at war with China in such a scenario, and defend NATO countries as well as they can.\n\nIf you like to keep article 5, how do you envision paring back?",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "Amatak",
                                    "body": "Thousands of Latvian, Estonian and Lithuanian troops served in Iraq and Afghanistan. The whole of an alliance is greater than the sum of its parts, but I guess this is something you don't really care about?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "UncleSamurai420",
                                            "body": "Must be nice to feel so righteous. Do you have a question, or is this just about you expressing your disdain for me?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Amatak",
                                                    "body": "I don't feel righteous, I feel absolutely horrified by Trump's actions, on a level that I can't begin to express. Everything I stand for is being methodically dismantled by Trump and his cronies - freedom, democracy, the fifth estate, international cooperation, free trade, the rule of law; values that America used to be a shining beacon for. I do not want to live in a world ruled by Chinese or Russian dictators, and seeing Trump give them everything they ever wanted (let's be real, not in his wildest dream did Putin ever think the US would contemplate leaving NATO) breaks my heart.\n\nI do not have disdain for you. You've been conned, it happens. Do you feel disdain for your fellow countrymen who disagree with you?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "UncleSamurai420",
                                                            "body": "I don't feel disdain for anyone.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Eisn",
                                    "body": "Why would anyone help the US again?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "UncleSamurai420",
                                            "body": "I’m not following. What are you asking about?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Eisn",
                                                    "body": "Do you know when was the only time article 5 was invoked?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "UncleSamurai420",
                                                            "body": "After 9/11 if I’m not mistaken.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Literotamus",
                    "body": "Why is Russia currently acting like the USSR?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "UncleSamurai420",
                            "body": "Russia is collectivizing the farms? Seems like a bad idea to me.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Literotamus",
                                    "body": "Do you think it’s a good idea to abandon your allies? And if we do will you agree with their decision to defend Canada and Greenland? Or Mexico if they decide they wanna join?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "UncleSamurai420",
                                            "body": "Oh the US would certainly defend Canada or Denmark (Greenland). I’m sure Mexico could contribute if they wanted to.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Literotamus",
                                                    "body": "I mean against Trump’s attempts to start trade wars, or annex? Or send troops to Mexico to stabilize the border? All things he’s indicated. Would you agree with the natural decision for Europe to defend their allies if this all leads to stronger defense alliances minus the United States?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "UncleSamurai420",
                                                            "body": "Trump has attempted to annex Canada? You need to examine your media diet if you believe that. If the US military invades Canada I’ll actually eat my hat. In that absolutely outlandish eventuality, sure, France and England should do their best to resist.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Literotamus",
                                                                    "body": "Why wouldn’t you respond to any of the other things he’s indicated? I don’t think he will attempt to annex Canada, no that’s the least likely of the things he’s mentioned.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "UncleSamurai420",
                                                                            "body": "So if the US sends troops to guard the border against illegal crossings, you would like some European power to do what? Like, you think Sweden should station troops in Mexico or something? I just don't really get how you believe that there could be armed conflict between the US and a NATO member. Where are you getting your information?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Literotamus",
                                                                                    "body": "I wouldn’t like them to do anything of the sort. I’d like Trump to not cuck us out of the negotiations and our leadership position and our alliances in general. I’m asking you what if Trump continues to isolate us? Fully abandons them? And they all eventually sign a new treaty that says they will fight with one another in defense of any member’s territory because Russia is endangering Europe?\n\nThat’s just a matter of some dominoes falling. No I don’t want it. But Trump has weakened our standing and we have fewer cards to play now. Decisions are going ahead without us.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "UncleSamurai420",
                                                                                            "body": "Who is us? I don't know who you are.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Literotamus",
                                                                                                    "body": "Why are you pretending you don’t know I meant the US? Or that that’s all I said?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "UncleSamurai420",
                                                                                                            "body": "I very genuinely do not understand you.\n\n\\> But Trump has weakened our standing and we have fewer cards to play now.\n\nWhose standing? Who is \"we\" with fewer cards to play?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Literotamus",
                                                                                                                    "body": "The United States is no longer leading the talks to end the war. Now that’s Europe. They are planning a ceasefire along with troops to Ukraine plus the air superiority that would naturally bring. \n\nThe United States had the role in leading those talks until Friday. Biden never truly leveraged against Russia, and Trump hasn’t either. Instead he applied pressure to Ukraine, to accept a ceasefire with no security talks until later. \n\nNow Europe says they are drawing up a plan they will hand to the United States to sign. If we (the United States) do not sign it, and Europe forms a new defensive alliance without us, is that just fine with you? Regardless of whatever future alignments take shape are you ok with Trump just weakening our seat at the table for no good reason?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "UncleSamurai420",
                                                                                                                            "body": "If European powers ally Ukraine, but Ukraine doesn't join NATO I'd see that as a huge win. Ukraine would have some backing from the west, but the US could scale back involvement.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EverySingleMinute",
            "body": "Yes. Full stop",
            "score": 0,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "What are the pros and cons of leaving NATO?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "awake283",
            "body": "I don't know that I want us to leave, but I do want major changes.",
            "score": -2,
            "replies": []
        },
        {
            "author": "heroicslug",
            "body": "Honestly? Yes.\n\n\nWhat has NATO done for us lately?",
            "score": -3,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Why are some pros and cons of NATO?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "heroicslug",
                            "body": "Historically, it was a good counterbalance to the Soviet Union.\n\n\nToday? I can think of no pros. Only cons. \n\n\nPaying to defend smaller weaker countries, and pledging to go to war alongside them in the event they are attacked? \n\n\nThose mutual defense treaties are precisely what led to World War I.\n\n\nBack to my question, what has NATO done to benefit us lately?",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "It’s helped us maintain global power? Keeps the Russians away?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "heroicslug",
                                            "body": "The Russians can't even take Ukraine. Do you think they seriously pose a threat to the United States, given their current condition?",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": ">The Russians can’t even take Ukraine. Do you think they seriously pose a threat to the United States, given their current condition?\n\nIf they take Ukraine, this would give Russia so much more power. But also, Russia doesnt just need military might to destabilize us. Their cyber department does a pretty damn good job. But I guess Trump doesn’t share this view. Do you?",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MattCrispMan117",
            "body": "No but l would like to se us sanction or at least threaten to sanction EU countries untill they repeal their \"\"hate speech\"\" laws.\n\nYou dont get to be part of the free world if you dont allow free speech.\n\nAnd ultimately if they refuse to relent there could be conversations about withdrawaling from NATO if these authoriterian european regeims continue to give their people free speech.",
            "score": 0,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "We saw hitler gain power through hate speech. Why would Europeans allow this happen again? Why should people be able to instill fear into other people just for being different?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "MattCrispMan117",
                            "body": "\\>We saw hitler gain power through hate speech. Why would Europeans allow this happen again?\n\nBecause they dont want to be an authoriterian shit hole?\n\nBecause they (presumably) want to maintain an allience with the United States??\n\nl'm sorry but this is just a rediclous perspective to me: \"Allowing free speech brought about an authoriterian dictator who banned free speech so we have to become authoriterians and ban free speech to ensure that doesn't happen.\"\n\nDo you understand my point?\n\nEurope under hate speech laws is genuinely no different to me then the USSR.\n\nAnd l think our approach towards them should be the same until they accept freedom.\n\n\\>Why should people be able to instill fear into other people just for being different?\n\nBecause that's what freedom means. \n\nThe ability to say WHATEVER you want and not get thrown in a concentration camp.\n\nlf Europe is gona continue on this road there's no meaningful difference between them and the russians so why should we care what flavor of authoriterian regeim rules europe?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "So there’s a fine line between speech and hate speech. Europe has determined that they don’t want their people living in fear when hatred. Can you share a specific example of someone unfairly being punished for hate speech?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "MattCrispMan117",
                                            "body": "Every single example dude.\n\nl catagorically reject this frame work and find it abhorent.\n\nThese people are fucking fascists (just like Putin) and so long as they continue to surpress there peoples speech they are morally equivilant to Putin or Ping or Kim Jung Un.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "Seeing how Russia kills people for their speech, why would you rather be allies with them and not Europe? Seems like a huge double standard.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "MattCrispMan117",
                                                            "body": "l dont want to be allies with either.\n\nl just dont want the world to end in nuclear hellfire.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "We’ve been helping Ukraine for years. \nNorway, Finland, Estonia, Latvia, and Lithuania are all NATO countries that border Russia. Why hasn’t he sent nuclear hellfire to these countries?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CptGoodMorning",
            "body": "I'm open to it. \n\nNATO is an old arrangement that has turned into a big Wealth Transfer to up-hold a snooty, soft, arrogant, weak European socialist nanny system so weak that they can't even handle a country the power-size of Texas without us having to step in. They're totally feminized, and acting more like anti-free speech, anti-democracy, CCP tyrants than any sort of Free World first world nation.\n\nPerhaps forcing them to embrace masculinity, empowering military culture/men, putting such men on the pathway to their elite class and leadership, it will have the effect of eventually actually bringing them back to the USA.\n\nKind of an odd reverse outcome thing. The best way to bring Europe closer, and help them, is to dissolve NATO. Maybe NATO is hobbling them and stopping us all from moving beyond the 1900s world.   \n  \nI for one, want to move beyond the Post-WW2 order (\"Post War Consensus\", PWC). Does Russia need to be our enemy for ever and ever? Can Europe do no wrong? When do we re-assess what was good about the PWC of the mid-1900s? Do we need to larp out the 1940s, 1960s frame for eternity?",
            "score": -12,
            "replies": [
                {
                    "author": "temporaryuser1000",
                    "body": "You’re arguing against Europe for being anti free speech and anti democracy and in the same breath asking why you need to be enemies with Russia. Do you think Russia is pro free speech and democracy?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "CptGoodMorning",
                            "body": "> You’re arguing against Europe for being anti free speech and anti democracy and in the same breath asking why you need to be enemies with Russia. Do you think Russia is pro free speech and democracy?\n\nCountries like UK and Germany are imprisoning, fining, or investigating thousands of people a year over words \"offensive\" to the left. And also targeting Christians to harm them, and becoming less free speech than Russia. Becoming more like CCP. \n\nGermany, Romania, and I think it was Austria, are all circumventing democracy to change the rules or worse to keep the left in power. Further, they have a track record of meddling in our elections to subvert our democracy and to harm my people.\n\nIf these are our \"allies\", and Russia is the same or less harmful, then why should we eternally consider them an enemy? If America is going to be the only Free country in the world, then it stands to reason we're going to have to make friends with some countries that are not (just like we currently are with UK and Germany, who are not Free countries at all). If Russia can be a friend, then sounds like a powerful friend to have.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dijitol",
                    "body": "Why would this economically and strategically speaking be good for America? What happens when all these countries deem our foreign military bases to be obsolete?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "CptGoodMorning",
                            "body": "I'm not convinced current NATO arrangement is economically better than if we dissolved it. Nor that having immobile bases in Europe is better than not.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "What do you think military significance of having a military base on foreign soil is?",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "thedamnoftinkers",
                                    "body": "Is there such a thing as a mobile military base, aircraft carriers aside?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "CptGoodMorning",
                                            "body": "Look up Agile Combat Employment and the recent initiative to have a more gas-like presence instead of big bases. Missile threats make big bases dangerous.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jinawee",
                    "body": "Do you think USA is not feminized? Do you think Poland, Hungary, Croatia, Romania, Albania and Turkey men are less masculine than USA?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "CptGoodMorning",
                            "body": "> Do you think USA is not feminized? Do you think Poland, Hungary, Croatia, Romania, Albania and Turkey men are less masculine than USA?\n\nI was more so referring to West Europe.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Last-Improvement-898",
            "body": "Yes , or change it so russia can join",
            "score": -5,
            "replies": [
                {
                    "author": "Literotamus",
                    "body": "Why would you ever want Russia to be apart of NATO when they prove themselves untrustworthy every chance they get?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Last-Improvement-898",
                            "body": "So you are on the side of war and killings instead of deals like zelenski gotcha",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Literotamus",
                                    "body": "Oh so you’re either just not American or you like the idea of Trump being a pussy? I’m not sure which…Russia is causing all the killing. They can stop it any time. But we both know you don’t care",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Last-Improvement-898",
                                            "body": "The idea of trump being a pussy by trying to stop the killings with this deal is a deluded one lets me know in what kind of circles you get your narrative from, \n\nthinking the real NATO is somehow not in the best interests of aggravating this conflict since forever and pinning it 100% on russia, is deluded as well",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Literotamus",
                                                    "body": "Do you genuinely think that’s what happened on Friday? Or are you lying?\n\nTrump refused to discuss security for Ukraine. So no he did not attempt to end the war",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Last-Improvement-898",
                                                            "body": "Literally the only reason trump even cares about this is to stop the killings….\n\nSure man they hadn’t discussed security before that, obviously trump was betrayed by zelenski unwillingness to diplomacy he had One job, \nPD i expected it since i saw him on lex ….hes lost the plot",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Literotamus",
                                                                    "body": "We removed ourselves from the table by being weak and now Europe is leading the talks. They will present us a plan to sign. Is that better?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Last-Improvement-898",
                                                                            "body": "I am not an expert in military capabilities some people fear they cant do anything but keep prolonging the money laundering without US backing, others fear nuclear response from putin if threats or escalations are made, and now today they where talking of giving ukraine nukes backed by france and Uk all of these right now are ifs that could change trumps response, \n\nin short yes judging by how zelenski is acting is good he didnt engage with putin in talks right now and the US should back out as well to put pressure on zelenski.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Literotamus",
                                                                                    "body": "Why in the world would the US put pressure on Ukraine and not Russia?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Last-Improvement-898",
                                                                                            "body": "Because ukraine doesnt have nukes and zelenski is the one not wanting to stop the killings according to trump? Are you implying the us hasn’t put pressure on russia already",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Literotamus",
                                                                                                    "body": "Russia has threatened nukes over a dozen times since the war started. He won’t drop them. Because Russia isn’t under threat. That’s a no brainer. \n\nIf they go home all Russians will be safe. Why do you believe their lies when they do it so constantly?\n\nYes I’m implying Trump hasn’t put pressure on Russia yet. And Trump is lying when he says that, would that bother you if it was true?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Last-Improvement-898",
                                                                                                            "body": "It doesnt bother because it isnt true at all lol even biden snapped at zelenski for saying what you said, \n\nwhat lies are you talking about i am watching a clip rn of zelenski saying he doesnt want ceasefire and the sec advisor says trump was under impression that  zelenski wanted to talk about one on Friday\n btw ive just noticed, so my initial comment was right about trump wanting to negotiate the killings end ultimately",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Literotamus",
                                                                                                                    "body": "Zelenskyy wants a ceasefire with security guarantees, because one without them doesn’t mean anything. Why do you think Europe is proposing its own ceasefire with security guarantees if Ukraine doesn’t want them? Why wouldn’t you watch all of the relevant meetings instead of a soundbyte or Dave Smith probably?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Last-Improvement-898",
                                                                                                                            "body": "Lol dont even know who that is, yeah thats the biggest load of BS I’ve ever heard you want europes”security guarantees “over the US ones  go right ahead for all i care",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Literotamus",
                                                                                                                                    "body": "No that’s not what they prefer, Trump refused to discuss any guarantees with Zelenskyy. Are you lying or just refusing to go find out?\n\nObviously they’d love it if the US would have those discussions",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Last-Improvement-898",
                                                                                                                                            "body": "Yeah and have you heard his list of demands for security guarantees?  is not gonna happen let me break it to you… friday he was supposed to have shown that awareness to start negotiations",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Literotamus",
                                                                                                                                                    "body": "The security guarantees will include European soldiers in Ukraine and the air superiority that naturally comes along with that. \n\nIs that a problem for you? Because Trump just gave up our say in the matter",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Last-Improvement-898",
                                                                                                                                                            "body": "I already addressed that earlier",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Literotamus",
                                                                                                                                                                    "body": "Right, but that pretty much flat out means Ukraine will have the strength to take back its territory. Because of how weak Russia is and how inferior their equipment is to Europes. Are you really just fine with the United States have no further role in this? Even if it means Ukraine decides to take back all their land? Or Russia decides to give nothing up?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Last-Improvement-898",
                                                                                                                                                                            "body": "In that scenario yes the US should keep away and out of NATO",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Literotamus",
                                                                                                                                                                                    "body": "That sounds insane. That is world war three and you’d rather not try to stop it?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Last-Improvement-898",
                                                                                                                                                                                            "body": "In that case we did try to stop it and it would be ww3 without the US and pretty short most likely it would be insane",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "CJKay93",
                                                                    "body": "> Literally the only reason trump even cares about this is to stop the killings….\n\nThen why does he refuse to contribute to enforcing the peace, unlike Europe? It's clear he's not interested in peace so much as he is in the Russian market.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Last-Improvement-898",
                                                                            "body": "I think the reasons why i think the deal is currently falling through have been explained, i dont think what europe is proposing will lead to peace either",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "CJKay93",
                                                                                    "body": "We know why the deal fell through: the minerals deal as it stands does not guarantee Ukraine's sovereignty security. This is a really basic ask of a country under invasion seeking to end it, no? Why is Trump unwilling to contribute to a just peace?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Last-Improvement-898",
                                                                                            "body": "Different definitions of “just”guess…",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Amatak",
                                    "body": "When did Zelensky start a war with Russia? Was it in 2014? 2022? 2008?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dijitol",
                    "body": "What are the pros and cons of leaving NATO?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Last-Improvement-898",
                            "body": "What am i chatgpt? Is my opinion as a neutral observer of its history, the nature of this conflict and having common sense",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": ">What am i chatgpt?\n\nI don’t know. So what are some pros and cons of staying with NATO?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "interbingung",
            "body": "Yes. Make sense, EU has not been contributing as much as they should, the US doesn't have infinite resources. The US has its own massive national debt problem.",
            "score": -4,
            "replies": [
                {
                    "author": "KeepitMelloOoW",
                    "body": "Respectfully, why do I see so many trump supporters care about the EU contributing their fair share, but when the left says billionaires need to contribute a fair share, the right freaks out? What is the difference?",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Dijitol",
                    "body": "Why do you think this will be a net positive economically and strategically speaking for America?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "interbingung",
                            "body": "Because the US doesn't have infinite money, we have record high national debt. We should be cutting spending across the board.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Can you elaborate? I understand not all debt is bad debt. Why shouldn’t we keep overseas bases to maintain soft power and strategic positions across the globe?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "CalvinsStuffedTiger",
                                            "body": "Not all debt is bad debt…unless you’re in a situation like we are in where just the interest payments on the existing debt exceeds the entire department of defense budget for the year.  Just the interest…\n\nImagine if the interest on your credit card debt exceeded your rent or mortgage payment. And in 1 year it exceeded your rent/mortgage + utilities. And within the decade it was going to exceed all the income you make in a year, because that’s how compounding interest works. \n\nHow would you feel about paying for your timeshare vacation rental in another country? Would that be important? \n\nWe are literally in a house on fire fucking crisis moment, and it bothers me to no end that democracts refuse to acknowledge this, or they try to handwave the problem away by saying things like, “let’s just tax the billionaires!” Or they invent some bullshit economic theory like MMT to say absurd things like, “the U.S. can never go bankrupt because our debt is in USD, so we can just print more USD to pay for our USD debt”. \n\nFirst of all, there are not nearly enough billionaires to pay off our debt obligations, even if you straight seized all of their bank accounts. Second, on a more practical level, how exactly are we going to tax these individuals that have unlimited accounting and financial resources? What mechanism do democrats propose that can’t easily and legally be avoided by moving their permanent residence and/or corporate headquarters to another country? \n\nThere are only 3 ways out of the hole we have dug ourselves into. We need to grow the GDP by doing a bunch of shit that’s going to feel really icky to do honestly, like drill for more oil and gas, mine more minerals, and reduce regulations to make it easier to do business in America and manufacture products here. \n\nWe need to dramatically cut spending all the way to the bone, that means no, we don’t need overseas bases and we shouldn’t give a shit about soft power or whatever.  The only two places where diplomacy and soft power matter imho are in the Democratic Republic of Congo where 70% of the Cobalt in the world is mined, a mineral required for lithium-ion batteries and Taiwan where 80% of the overall computer chips and 100% of the next-gen computer chips are manufactured.  Losing access to either of those territories will fuck our GDP goals.\n\nThe 3rd is that we need to raise taxes…for everyone. And we need to raise them to levels that are going to fucking hurt for everyone. It is what it is, it’s going to be a tough pill to swallow, but it will be easier to swallow if we can show that the government isn’t squandering 80% of the tax dollars they receive.\n\nI didn’t want Trump as a president, i would kill for another Obama or Bill Clinton.  But that person that actually cares about the debt and/or being pro-business doesn’t exist in the Democractic party, so now we’re stuck with this clown show in the Republican Party.  But at least they’re trying to address one of the points I made above as far as government spending.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "thedamnoftinkers",
                                    "body": "And increasing taxes?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "itsmediodio",
            "body": "As long as Europe continues to criminalize speech, banish democratically elected populist political movements, underfund their defense at the expense of the USA, undermine the strategic planning and negotiations of the USA, and encourage harmful mass economic migration, I don't see why they should be favored over other authoritarian countries like Russia and China.\n\nEurope and our NATO \"allies\" had an amazing opportunity to united the USA behind them after Trump was elected. All they had to do was increase their defense spending, embrace free speech, embrace democracy, and accept the various valid criticisms the American people have for these international alliances. \n\nInstead they've shown that they see the USA as little more than a piggy bank and bodyguard they can use to enrich themselves and hide behind when things gets tough. The second that we disagree, they have nothing but vitriol and disrespect. We're not the leader of the free world and I don't think we have been for years. We're tools. An international global elite has used the US as a mercenary group to plunder the world with one hand while raiding the wallets of our citizens with the other.\n\nSeeing them rally behind Zelensky after that clown blatantly disrespected our country has really opened my eyes and changed my perspective.\n\nWe should withdraw from Europe. They keep threatening us, saying that if we leave them they'll make a deal with China.\n\nPerhaps they've never considered the possibility of the USA, Russia, and China forming a new geopolitical and economic alliance and locking them out. It's clear the USA is alone in the world in terms of its values, once your country jails you for speech or they ban a political party they're no different from China or Russia imo.\n\nAs much as they're screaming about how ashamed they are of us, I can confirm that the feeling is mutual. The western alliance has become a farce.",
            "score": -5,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Why would China want to team up with us? Why would we want to join forces with authoritarian regimes?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "itsmediodio",
                            "body": "We're the most powerful country in the world, they're the second largest economy in the world and we're each the largest trading partner of the other. Together with Russia, the second most powerful military on earth, our three nations can do literally anything.\n\nAs far as working with authoritarian regimes, we already are allied with multiple authoritarian regimes, including ones in NATO like Turkey. \n\nFrom a larger perspective though, there are no other countries in the world that are truly free and democratic anymore. Once your country accepts the idea of throwing people in jail for expressing wrong opinions and banning political parties, with a populace that has no way of overthrowing their government, you're no longer living in a free country. The USA is alone, but we're alone as the only country on earth which isn't following that trend.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "Why do you have a problem with throwing people in jail for wrong ideas, yet want to team up with a country who literally murders people for insulting Putin?",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "moorhound",
                                    "body": "Can we really rag on Europe banning certain political parties when we have, uh, 2 of them?",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "CJKay93",
                                    "body": "> We're the most powerful country in the world\n\nFor how much longer at the current rate, do you think?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Amishmercenary",
            "body": "I'm not opposed to this, I'd be open to discussing this possibility - I think the issue is that these global organizations - created in the wake of WW2 for the \"winners\" to consolidate power and try to prevent another WW from happening have been coopted by bad faith actors who are seeking to exploit the \"global\" part of these organizations.\n\nMaybe NS' can fill me in - what are the top 3 benefits that the US is afforded by being a part of these organizations? Do those benefits outweigh the negatives?",
            "score": -14,
            "replies": [
                {
                    "author": "Steve825",
                    "body": "Basically, the US was viewed as the most powerful, most trust worthy nation in the world, the protector of democracy, the leader of the free world. The foundation of NATO.\n\nYes the parties in charge changed, but they stuck to any deals made by the previous lot. \n\nThis gave you immense soft power, if you made a deal, it might favour the US a bit, but you were so rich that it was always possible to get a deal that was good for both parties.\n\nNow? Any time Republicans get in, they're likely to cancel any plans made by the Democrats, and increasly probably the other way round. Heck, Trump cancelled a US/Canada/mexico deal and made a new one in his first term, then cancelled his own deal and imposed 25% tariffs in his 2nd. Plus, just piss off it's leader and any deal you've made vanishes.\n\nSo why make deals with the US? Why trust you? Why make a trade deal? Why buy anything when at the drop of  a hat, you won't be able to get any more spares for it because your leader offended their leader.\n\nWe can't plan for the US to support us any more.\n\nBy trying to look powerful, Trump has made you look untrustworthy and unpredictable. Unpredictable is the worst thing you can be. Don't expect anyone to count on you for anything for the future, which means don't expect people to buy things from you either.\n\nI think in the short term, people won't have other options, so you'll be able to make some gains though bullying. But long term? Long term people will plan to leave you out\n\nMake sense?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": ">Basically, the US was viewed as the most powerful, most trust worthy nation in the world, the protector of democracy, the leader of the free world. The foundation of NATO.\n\nWhile I agree with this, my point is that overall NATO doesn't seem like that much of a net benefit to us. \n\n>Yes the parties in charge changed, but they stuck to any deals made by the previous lot.\n\nThis is simply incorrect. \n\n>Don't expect anyone to count on you for anything for the future, which means don't expect people to buy things from you either.\n\nLol. We are the most powerful prosperous country on earth. Pretending like we'll become some pariah because Trump was in charge for a few years is pure fantasy.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Steve825",
                                    "body": "I'm not saying things will fall apart straight away.\nIt's going to be a few decades.\n\nBut I don't think you know how much soft power you're losing.\n\nI work for an NGO that removes land mines, 70% of our funding was US. Till last month, now it's gone.\n\nAround the world the US is pissing off countries at a record pace. The whole EU (though till their defence industry is up and running in a few years they can't do much), mexico, Canada, loads of African and east Asian counties too.\n\nA load of countries where you were helping them, increasing your influence, now you're not.\n\nAnd this can't be fixed, not for decades. If a democrat does come back in power and say \"we're sorry\", well too late. Every country in the world has to plan how to work in a world where the US will slap a 25% tariff on them as a hello. For the most part that's going to involve planning to not need the US in the first place.\n\nIt'd take a decade or two, but I think this could topple the US as a financial super power. You get me?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">I'm not saying things will fall apart straight away. It's going to be a few decades.\n\nCool let's see it. \n\n>If a democrat does come back in power and say \"we're sorry\", well too late. Every country in the world has to plan how to work in a world where the US will slap a 25% tariff on them as a hello.\n\nSo it will take decades, but if a Dem wins in 2028 it will be too late? That makes no sense to me\n\n>It'd take a decade or two, but I think this could topple the US as a financial super power. You get me?\n\nNaw this is pure fantasy",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Steve825",
                                                    "body": "Yeah, ofc it's too late if a dem wins in 28.\nWhy plan for that, when in 32 Trump Jr wins and your back to 25% tarrifs?\n\nYou can't plan for the Democrat turn, you have to assume Republicans",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": ">Yeah, ofc it's too late if a dem wins in 28. Why plan for that, when in 32 Trump Jr wins and your back to 25% tarrifs?\n\nAs a TS Jr isn't even in my top 10. But perhaps he'd be popular with other TS'. \n\n>You can't plan for the Democrat turn, you have to assume Republicans\n\nSo the financial collapse of the west relies on Republicans being elected every election? How convenient.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "thedamnoftinkers",
                                                                    "body": "Are you going to address the questions they brought up?\n\nAlso, do you think the fall of the US means the \"financial collapse of the west\"?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Amishmercenary",
                                                                            "body": "They asked one question that I answered\n\nYes",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "thedamnoftinkers",
                                    "body": "Who says the US is the most powerful prosperous country on earth? And why?\n\nDo you remember when the US president was called the \"leader of the free world\"? Do you think he still deserves that title?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">Who says the US is the most powerful prosperous country on earth? \n\nMe",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CC_Man",
                    "body": ">Maybe NS' can fill me in - what are the top 3 benefits that the US is afforded by being a part of these organizations? \n\nNot an expert, but following come to mind:\n1. Much more amplified voice at the table when it comes to NATO-related conduct.\n2. The ability to receive aid if/when attacked. To-date, I believe the US is the only country to have invoked Article 5.\n3. Ability of all participants to maintain safe defense levels with reduced spending.\n4. A deterrent for any inviting between member nations.\n5. Deterrence against global beligerrants from attacking any NATO members and the resulting death or economic effects.\n\nYes, I'd say worth any negatives. What are the negatives?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": ">Much more amplified voice at the table when it comes to NATO-related conduct.\n\nYes, I'm aware that being in NATO means we have a voice at the table- I'm asking what exactly the benefit of being at the table is. \n\n>The ability to receive aid if/when attacked. To-date, I believe the US is the only country to have invoked Article 5.\n\nDidn't we still have the vast majority of troops active after 9/11 in Afghanistan though? It's probably due to Europe's lower defense spending across the board, but personally I'd place much higher trust in American soldiers than NATO soldiers in general. \n\n>Ability of all participants to maintain safe defense levels with reduced spending.\n\nNATO countries still haven't met their spending goals. \n\n>A deterrent for any inviting between member nations.\n\nAny inviting? wym? \n\n>Deterrence against global beligerrants from attacking any NATO members and the resulting death or economic effects.\n\nI don't think anyone wants to go to war with the US any time in the near future- and it's not because we're a NATO member. If being part of NATO isn't a deterrent towards a bunch of backwards terrorists living in caves in the desert, then I don't think it's quite the deterrent you're making it out to be. \n\n>What are the negatives?\n\nThe effort, the money, the political theater. I just think it's a black hole of endless spending and corruption all in exchange for some diplomatic ego stroking.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cpjauer",
                    "body": "4 Big benefits I would consider (couldn’t choose)\n\n1) Securing peace in Europe - and thereby ensuring global stability, which means a huge deal for economic growth and development. A war-torn Europe and messed up international trade would be terrible for American economy \n\n2) supporting the ideals of America - by supporting NATO, America keeps nations who share ideals of the importance of freedom and democracy in existence. If you believe in democracy and freedom, it is not worth protecting from other non-democratic countries attacks? \n\n3) War has a tendency to spread - a war torn Europe, with multiple nuclear weapons, could drag the US into war, as we have seen before. Being in NATO makes European war much less likely. \n\n4) soft power - The USs position in the world cannot be taken for granted. If US leaves NATO, the EU and other nations that have been allied with the US, such as Japan and South Korea, even Canada, would begin to trade, invest and share knowledge with other nations. This would mean the US would develop less, and have a worse economy, which would be bad for all Americans. \n\nI am from Europe- I understand that the US thinks it is time for Europe to be able to defend itself against Russia. I think so too. I think Trump is in his full right to demand this from Europe. But leaving NATO, even as Europe is actually investing billions of billions in defense right now, I cannot understand why. \n\nI am really interested to hear your thoughts on each of my points - what do you think?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": ">Securing peace in Europe - and thereby ensuring global stability, which means a huge deal for economic growth and development. A war-torn Europe and messed up international trade would be terrible for American economy\n\nEurope - including non-NATO nations?  Or you're just saying NATO members? \n\n>supporting the ideals of America - by supporting NATO, America keeps nations who share ideals of the importance of freedom and democracy in existence. If you believe in democracy and freedom, it is not worth protecting from other non-democratic countries attacks?\n\nI don't see how the US leaving would prompt the Europeans to start another Euro-wide war with themselves. \n\n>The USs position in the world cannot be taken for granted. If US leaves NATO, the EU and other nations that have been allied with the US, such as Japan and South Korea, even Canada, would begin to trade, invest and share knowledge with other nation\n\nWhat? These nations already trade, invest, and share knowledge with other nations...\n\n> But leaving NATO, even as Europe is actually investing billions of billions in defense right now, I cannot understand why.\n\nI just don't see the return on investment. The US wastes so much money being in these groups without the material benefit we once saw.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "cpjauer",
                                    "body": "Thank you for your reply! \n\nif US leaves NATO before the other NATO-countries can build up, Europe could end up in war, both NATO and non-NAtO countries. Russia could attack many countries, leading to more war in Europe. \n\nYes, other countries trade with the US, but I think the US benefits massively because it is seen as a partner. Consumers might stop buying  as much products from the US, companies would invest less in the US, researchers would be less prone to move to the US and so on. Behaving more isolated would mean, I think, that the US would loss a lot of its pull. \n\nIs it crucial to leave NATO right now, during the most exposed Europe has been from Russias attack on Ukraine? Don’t you believe that Russia is a threat to Europe or do you, no offense intended, not care about the life of Europeans enough to postpone leaving NATO for a few years until Europes defense is much stronger?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">if US leaves NATO before the other NATO-countries can build up, Europe could end up in war, both NATO and non-NAtO countries. Russia could attack many countries, leading to more war in Europe.\n\nI just don't see why Russia would attack nuclear-armed European countries. If Russia wanted to start a nuclear war they could have done so anytime in the past 50 years.\n\n>Consumers might stop buying as much products from the US, companies would invest less in the US, researchers would be less prone to move to the US and so on. Behaving more isolated would mean, I think, that the US would loss a lot of its pull.\n\nI think you are confusing the cart for the horse here - US science, trade, and investment is what makes other countries want to be a part of these organizations with us - not the other way around.\n\n>Is it crucial to leave NATO right now, during the most exposed Europe has been from Russias attack on Ukraine?\n\nBut Ukraine isn't a part of NATO - if NATO wanted them in they could have pulled them under their umbrella.\n\n>Don’t you believe that Russia is a threat to Europe or do you, no offense intended, not care about the life of Europeans enough to postpone leaving NATO for a few years until Europes defense is much stronger?\n\nPrimarily I don't see Russia as that much of a threat- their entire economy is smaller than some of our larger states. I get that for Europeans they might seem like this big bad, but imo they're more like a 2nd world country.\n\nEven if Russia started a purely non-nuclear offensive on Europe, and even if somehow there were no nukes flying in response, the EU would still slam Russia. So it makes no sense for them to attack.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "cpjauer",
                                                    "body": "Thanks again, I appreciate your comments. \n\nMost EU countries believe Russia is a threat to them - are they wrong? Russia might be poor compared to Europe, but they have something Europe lacks - manpower and being able to use your soldiers as pawns, without facing backlash. Not to mention war expereince. \n\nI agree, US science and trade are a major pull, but you don’t think the US isolationist approach will do anything? Soft power and the international status of America is without any pull? \n\nThat will be my last rounds of questions, cheers!",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": ">Most EU countries believe Russia is a threat to them - are they wrong?\n\nIn what way? In terms of invasion? This is simply incorrect. Russia invading nuclear-armed countries would be a suicide mission. \n\n>Russia might be poor compared to Europe, but they have something Europe lacks - manpower and being able to use your soldiers as pawns, without facing backlash.\n\nI'm not sure where you're getting your numbers from, but the numbers are very comparable in terms of pure manpower- AND EU countries have nukes. \n\n>I agree, US science and trade are a major pull, but you don’t think the US isolationist approach will do anything?\n\nI think it would allow for the US to step back, and focus on our own success, rather than being part of this political theatre. We would still be the most important partner for international trade, without many of the drawbacks.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ivan_Botsky_Trollov",
                            "body": "**Securing peace in Europe** \n\nthis is... Europe's responsibility\n\n\n\n**supporting the ideals of America**\n\nah some euro nations now jail citizens for mean social media comments, are willing to ignore 20-25% of their population because \"far right\" and cant even protect their women from foreign rape gangs, plus many western europe govts are curiously dedicated to importing as many \"refugees\" as they can.\n\nThese arent american ideals.\n\n\n\n**War has a tendency to spread**\n\nnot always, but if the likes of Uk and germany are so concerned, go declare war on Russia.\n\nIt would be a win-win situation, liberal govts and their supporters fighting against what they seem to hate: white straight men from a Christian majority country.\n\n\n\n**soft power** \n\nthe only \"soft power\" any country needs is a nice economy and stability",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "cpjauer",
                                    "body": "About peace) My point was that war in Europe would be bad for US economy. \n\nAbout the ideals) The European countries are democratic and free, some of them more so than the US, if you look at rankings - as the world democratic index, world press freedom index and world free speech index. How is it I democratic to not listen to 20-25% of the population, when the US doesn’t listen to nearly 50%? The parliamentary system of most EU countries actually means that the elected representatives actually work together. \n\nSoft power gives economic stability .",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "jinawee",
                                    "body": "> this is... Europe's responsibility\n\n\nDo you think it's US responsibility to provoke wars in Europe as they have done?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ivan_Botsky_Trollov",
                                            "body": "??\n\nthe USA stopped a war in Europe while europe was totally impotent to do so:\n\n[https://www.britannica.com/event/Dayton-Accords](https://www.britannica.com/event/Dayton-Accords)",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "jinawee",
                                                    "body": "So you don't think the sanctions of Yugoslavia were intended to destabilize it? You don't think Germany and UK got US approval to support the break up? You don't think promising Ukraine NATO membership, supporting Euromaidan and supplying them weapons accelerated the war?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Ivan_Botsky_Trollov",
                                                            "body": "this sounds like an absurd socialist-russophile POV about what happened\n\nthe sanctions as usual, had the goal of not allowing weapons into that place.. but those big brain bureaucrats apparently werent aware of the black market for weapons\n\n**You don't think Germany and UK got US approval to support the break up?**\n\nCroatia and Slovenia and Bosnia wanted out despite whatever the UK or USA wanted.\n\n**You don't think promising Ukraine NATO membership, supporting Euromaidan and supplying them weapons accelerated the war?**\n\nI can invite whoever I want to my party, and if someone opposes it by force its not my fault, its on HIM.\n\nPerhaps Russia should try to have countries interested on allying with it, instead of fearing it?\n\nAnd the justifications for invasion are pure bunk, Russia is surrounded at least since 2004, when the Baltics joined... yep, for 20 years NATO has had missiles 200 miles away from St Petersburg.\n\nThe mediterranean?   NATO with Turkey controls the access, plus the USA 6th fleet.\n\nRussia shuld give up its delusions of grandeur.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "jinawee",
                                                                    "body": "I can't disagree with what do you say.\n\n\nDo you consider Tucker Carlson a russophile? And Trump?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ivan_Botsky_Trollov",
                                                                            "body": "Tucker has devolved from a  good  right wing commentator to a quasi-simp for Russia.\n\nTrump has a strange affinity for Russia as well, but not as strong yet as that from certain hero for liberals:\n\n[https://today.uconn.edu/wp-content/uploads/2012/02/roosevelt\\_stalin.jpg](https://today.uconn.edu/wp-content/uploads/2012/02/roosevelt_stalin.jpg)\n\nthe reasons why many on the right currently tolerate or even like Russia are a bit complex, but have to do a lot about what Russia is NOT in contrast to what most western european countries are as of today.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "swantonist",
                    "body": "Can you name a single negative to being in NATO?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "The time, effort, and money involved in being apart of the politcal theater is the first thing that comes to mind.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "swantonist",
                                    "body": "Why do you consider time, effort and money negative things? Aren’t those great ways to build our future and alliances?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">Why do you consider time, effort and money negative things?\n\nBecause we don't have unlimited time, money, and effort. Overall I just don't think the ROI is worth it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "swantonist",
                                                    "body": "Hypothetically, if the US was able to be in NATO free of charge would you support the US being part of NATO?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": "If we got all the potential protections without any of the drawbacks? Sure.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CelsiusOne",
                    "body": "Why do you put \"winners\" of WW2 in quotes?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "No reason.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "thedamnoftinkers",
                                    "body": "Didn't it take effort?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "Not really",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dijitol",
                    "body": "Can you share your pros and cons of NATO?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "I'd just read through other comments, I think I've done a decent job of explaining. If you have something specific feel free to ask.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": "You’ve posted what you feel are the pros and cons in another thread on this post?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "I'd just read my comments and ask about anything specific :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CC_Man",
                    "body": ">Maybe NS' can fill me in - what are the top 3 benefits that the US is afforded by being a part of these organizations? \n\nNot an expert, but following come to mind:\n1. Much more amplified voice at the table when it comes to NATO-related conduct.\n2. The ability to receive aid if/when attacked. To-date, I believe the US is the only country to have invoked Article 5.\n3. Ability of all participants to maintain safe defense levels with reduced spending.\n4. A deterrent for any inviting between member nations.\n5. Deterrence against global beligerrants from attacking any NATO members and the resulting death or economic effects.\n\nYes, I'd say worth any negatives. What are the negatives?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "Answered in your first response. Cheers!",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jaded_Jerry",
                    "body": "This.  The irony is that these organizations are becoming the very thing they were ostensibly created to prevent.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "jinawee",
                            "body": "What do you mean? That NATO contributed to the Soviet expansion and attacks of its member? Or that NATO is Soviet?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Jaded_Jerry",
                                    "body": "NATO was created to stop the spread of the Soviet Union, which no longer exists, and prevent the spread of Communism, which it's totally cool with now.\n\nThe US pays disproportionately into NATO's military budget and ANY talk we have of pulling out because of such a bunch of NATO countries who DON'T pay the shares they agreed to get mad and pretend WE'RE the ones being unreasonable, even though the US is trillions of dollars in debt, NATO missions rarely, if ever, have anything to do with US interests abroad, and NATO only seems to increase the risk of unnecessary wars.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "CelsiusOne",
                                            "body": "How is NATO cool with communism? What do you mean by that?",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sshlinux",
            "body": "I agree. It's been 80 years. There's no need for troops in Europe. They can step up and start paying for their own defense. Would save us a bunch of money.",
            "score": -8,
            "replies": [
                {
                    "author": "jinawee",
                    "body": "Do you think the US should close its European bases? Close its 700 world bases?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "sshlinux",
                            "body": "Yes",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pongjinn",
                    "body": "The only time Article 5, the mutual defense clause, has been invoked was after we were attacked on 9/11.  And NATO answered.  Do you think this factors in to whether we should remain in NATO?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "sshlinux",
                            "body": "No it doesn't because 9/11 was an inside job by the CIA and Mossad.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "h34dyr0kz",
                                    "body": "You think the Bush government was so capable that they pulled off 9/11 without leaving any tangible evidence and every person involved was so committed to the cause that 20 years later they won't come clean about their involvement?\n\n\nHow many people do you think they had to coordinate?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Literotamus",
                    "body": "Would you agree our allies’ decision to cut ties with us and agree to help protect Canada/Greenland/Mexico/Panama from Trump’s goals there? Assuming we abandon NATO while Russia is waging an expansionist war in Europe?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "noluckatall",
            "body": "Well, I'm not on board with Europe dragging us into a hot war over Ukraine because they're too blind to negotiate a settlement.  If NATO means we are bound by stupid decisions by our allies, then yes, we should leave it or make our support conditional.",
            "score": -2,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Why should Ukraine surrender to a mutual enemy of America?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "MattCrispMan117",
                            "body": "Why does Russia have to be our enemy??\n\nlf its because of \"muh democratic values\" how are the europeans any better when they cancel elections and censor speech???\n\nThe US interest is preventing a nuclear war which destroys the globe.\n\nUsing our influence on Ukraine to prevent that is not a bad thing.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Dijitol",
                                    "body": ">Why does Russia have to be our enemy??\n\nThey’re an authoritarian regime. \n\n>lf its because of “muh democratic values” how are the europeans any better when they cancel elections and censor speech???\n\nPutin murders anyone who criticizes him. I would  Also like to see what you’re talking about.\nCancelling elections due to martial law? \nSpeech censorship? Can you share some examples? \n\n>The US interest is preventing a nuclear war which destroys the globe.\n\nYes. We can have an interest there and also let them join NATO. Other bordering countries joined NATO and that has kept Russia at bay.  \n\n>Using our influence on Ukraine to prevent that is not a bad thing.\n\nIs Helping Ukraine defend against a mutual enemy not the best thing?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "MattCrispMan117",
                                            "body": "\\>Cancelling elections \n\n[https://www.theguardian.com/world/2024/dec/06/romanian-court-annuls-first-round-of-presidential-election](https://www.theguardian.com/world/2024/dec/06/romanian-court-annuls-first-round-of-presidential-election)\n\n\\>Speech censorship? \n\n[https://www.youtube.com/watch?v=-bMzFDpfDwc](https://www.youtube.com/watch?v=-bMzFDpfDwc)\n\n\\>Yes. We can have an interest there and also let them join NATO. \n\nLetting Ukraine Join NATO while the war is going on would be suicide. \n\nWhatever suffering Ukrainas feel its nothing compared to what the outcome of a nuclear war would be.\n\n\\>Is Helping Ukraine defend against a mutual enemy not the best thing?\n\nNot when its leading to WWlll.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Dijitol",
                                                    "body": "Did you not see that Russia meddled in the Romania elections? That’s why they canceled it. \n\nGermany seen Hitler come to power with hate speech. Why shouldn’t their people be safe from hate speech?\n\nRussia threatened other bordering countries to not join NATO. Yet he never invade when they joined. Why is this different? \n\nWe’ve been helping Ukraine for years yet ww3 hasn’t happened. \n\nSo what are thoughts on Russia being an authoritarian regime? \nWhat about Putin murdering journalists and other politicians for opposing him? Do you still think we should friends with them?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "MattCrispMan117",
                                                            "body": "\\>Did you not see that Russia meddled in the Romania elections? That’s why they canceled it.\n\nYeah every major power the world over \"medals in elections\" that doesn't meant you cancel results because memes got pushed on social media.\n\nDo you think Trumps election in 2016 should have been annulled for the same reason???\n\n\\>Germany seen Hitler come to power with hate speech. Why shouldn’t their people be safe from hate speech?\n\nBecause it defeats the purpose of not having Hitler come back.\n\nlf you regulate peoples speech you ARE under an authoriterian country. You live under conditions similar to the third reich. There is no POlNT in preventing an authoriterian government from coming to power if you have to become and authoriterian government to do that.\n\n\\>Russia threatened other bordering countries to not join NATO. Yet he never invade when they joined. Why is this different?\n\nBecause they weren't at war with Russia at the time.\n\n\\>So what are thoughts on Russia being an authoritarian regime? What about Putin murdering journalists and other politicians for opposing him? Do you still think we should friends with them?\n\nl think we have as much reason to be \"friends\" with him as we do the european union under there currently laws.\n\nWith the EU's hate speech laws there is no meaningful difference between them and Russia to me.\n\nl'm not fan of Putin cracking down on free speech or Europe.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "h34dyr0kz",
                                                                    "body": "But Russia didn't post memes on social media. Russia ran a coordinated campaign with a Romanian politician, something illegal in Romanian law.\n\n\nWhy is a country mitigating foreign influence in their election a bad thing?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mk81",
            "body": "Preferably the UN first.",
            "score": -2,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "Why?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Klutzy-Feature-3484",
            "body": "We should be putting all our energy into securing our border first. Protecting our own country and citizens should be the top priority. Why spend money overseas when we can invest in keeping America safe and strong?",
            "score": -20,
            "replies": [
                {
                    "author": "CJKay93",
                    "body": "Why do you consider these things to be mutually exclusive?",
                    "score": 33,
                    "replies": [
                        {
                            "author": "MattCrispMan117",
                            "body": "Because we've had liberals for years and years tell us \n\n\\>\"securing the southern border is impossible!\"\n\n\\>\"winning the drug war is impossible!\"\n\nlf we dont have the strength to do even THESE things we have no busisness at all devoting ANY resources to policing the wrest of the world.\n\nNot till illegal crossings are at ZERO, not till overdose rates are at ZERO, not the last rapist, rioter and murderer are put behind bars should we devote a red cent to anything else.\n\nHundreds of thousands of children are trafficked every year and liberal media says there's no way to stop it.\n\nWell maybe there isn't, but l BET if every US soldier deployed on forigne soil the world over was brought home and put on the southern border the problem would get better.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aquagardener",
                    "body": "Do you think the United States is too poor to invest in multiple methods of defense and national security?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "MattCrispMan117",
                            "body": "l mean if people are still coming across the border we clearly aren't spending enough.\n\nMaybe we could do both things but until one is done we should not worry about thhe othher.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "curiousjosh",
                    "body": "Do you not feel allies play a key part of keeping America safe?",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Ihavemagaquestions",
                    "body": "Practically, how would it work if a global war were to erupt if the US were to stand alone?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "MattCrispMan117",
                            "body": "Nuclear armegedon.\n\nThat's how any world war ends now regardless what the sides are.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CaspinK",
                    "body": "How do you view the theory as a safer more stable global order makes America safer?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "jinawee",
                    "body": "Do you think US should stop spending money overseas in NATO and foreign bases? Withdrawal would mean that around $100 billion could be redirected to CBP.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "these-pretzels",
                    "body": "Do you believe we can retain our status as a world leader by pulling ourselves off the field?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MattCrispMan117",
                            "body": "No but why should we be world leader?\n\nWhy does the world NEED a leader??\n\nWhy dont we just NOT have a one wold goverment???",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "these-pretzels",
                                    "body": "Do you think China will agree that no world leader is the best solution? Or do you think they would be interested in replacing the US on the world stage?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "thedamnoftinkers",
                                    "body": "Do we have a one world government?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Flussiges",
            "body": "Absolutely. It doesn't benefit us.",
            "score": -5,
            "replies": [
                {
                    "author": "Dijitol",
                    "body": "What makes you believe this?",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}