{
    "title": "General opinions on NASA/Artemis - should it be subject to DOGE cuts?",
    "author": "Robertium",
    "subreddit": "AskTrumpSupporters",
    "rank": 29,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1j1u3u8/general_opinions_on_nasaartemis_should_it_be/",
    "id": "1j1u3u8",
    "selftext": "No one on the campaign trail talked about how China is making huge leaps in their space program - last year they became the first country to successfully return samples from the far side of the moon.  When the ISS deorbits they will have the sole functioning space station in Earth orbit.  They have the budget, resources and a path to land humans on the moon before 2030.\n\nNASA's Artemis program, on the other hand, is suffering from many setbacks and delays.  The official landing date has been pushed back \\~4 years and the modified Starship that is supposed to take them there is still just a design.  [In the 1960's, NASA peaked at around \\~4% of the total federal budget, but nowadays they don't even get 0.5%.  ](https://en.wikipedia.org/wiki/Budget_of_NASA)\n\nShould NASA still be subject to the same cuts/budget reductions as many other federal agencies?  Wouldn't that make it harder for the US to pull ahead in the new space race?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "G0TouchGrass420",
            "body": "Shouldn't even be a question. They should be drastically cut. Our SpaceProgram at this point should be relegated to R&D only.\n\nWhether people like it or not StarShip makes this stuff look silly.",
            "score": 2,
            "replies": [
                {
                    "author": "Robertium",
                    "body": "Would or wouldn't that be a detriment to America's ability to win this new space race?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "G0TouchGrass420",
                            "body": "You mean the space race SpaceX has already won? Also no reason to keep it some what funded for r&d",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "G0TouchGrass420",
                            "body": "By all means R&D should still be done and satellites made and all that good stuff however actually putting a payload into orbit there is no reason for the Artemis program. Starship does it better for cheaper and its already here.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "G0TouchGrass420",
                                            "body": "waste of money",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "whateverisgoodmoney",
            "body": "Redirect all NASA funding to SpaceX.\n\nWe will be to the Moon and Mars within 10 years and be returning payloads of minerals from the asteroid belt in 15.",
            "score": 1,
            "replies": [
                {
                    "author": "Robertium",
                    "body": "Are you aware that SpaceX starship is already integrated into the Artemis Plan?  Artemis III has them using a modified Starship to actually land on the moon.  Also, did you know that private contractors have been building parts for NASA since the Apollo era?  [All the bits and pieces from the Apollo lander for example were contracted out.  ](https://apollo11space.com/meet-the-makers-the-private-contractors-that-powered-apollo/) So NASA's funding technically goes to them anyways.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lemmegetdatdick",
            "body": "All waste should be cut.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "Potentially. You are right, no one talked about this. With the advancement of private rocketry, primarily SpaceX, the focus of NASA should be reviewed.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Davec433",
            "body": "What does the space race accomplish for everyday Americans?",
            "score": 0,
            "replies": [
                {
                    "author": "Atomic_ghost1",
                    "body": "I'm not sure if you're joking or not. You do understand that the space race and things like ICBMs go hand in hand correct? Mutually assured destruction only works if the threat is mutual.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Davec433",
                            "body": "Space race has nothing to do with ICBMs. The ability to put satellites in orbit equals ICBMs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}