{
    "title": "Sailing... close call",
    "author": "ecky--ptang-zooboing",
    "subreddit": "SweatyPalms",
    "rank": 2,
    "score": 200,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 38,
    "url": "https://v.redd.it/24e6fvs4qepe1",
    "id": "1je02z4",
    "selftext": "",
    "comments": [
        {
            "author": "qualityvote2",
            "body": "Congratulations u/ecky--ptang-zooboing, your post does fit at r/SweatyPalms!",
            "score": 1,
            "replies": []
        },
        {
            "author": "humildemarichongo",
            "body": "He goes into a sort of bucket seat, not in between the boats. My guess is he either wanted a safe spot so he wouldn't get launched off the boat, or to get to the steering wheel.",
            "score": 75,
            "replies": [
                {
                    "author": "lylisdad",
                    "body": "I think he was trying to provide ballast so they wouldn't capsize.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "DerekFizz",
            "body": "Can someone explain why he ran towards the impact?",
            "score": 21,
            "replies": [
                {
                    "author": "SubmarineRaces",
                    "body": "The USA boat had right of way and Japan needed to keep clear. Boats sail upwind roughly 45° to the wind and have to switch which side the wind is on via tacking occasionally. So relative to each other they are basically either sailing parallel to each other or at 90° to each other. Japan and USA were converging on each other and in an attempt to keep clear, Japan decided last second to tack but did so too late and too slow. The guy in the video is the wing trimmer. During a tack, the wing doesn’t really need trimming so he’s the first to usually change sides as that’s the most efficient window of time to do it. Thats why he was running over to his position.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "DerekFizz",
                            "body": "Thanks, but what's tacking?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "SubmarineRaces",
                                    "body": "Switching sides so the wind goes from say 45° on the left side to 45° on the right side or vice versa. Technically it’s when you switch sides with the wind direction crossing the front of the boat. If the boat is headed down wind, it’s called gybing, where the true wind direction cross the stern when switching sides.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Madolah",
                                            "body": "and Long my yer big Jibs draw! 🌊",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No-Valuable5802",
                    "body": "he needs to pull his sail back down else the impact would have caused his sail to flip up and GG. I think the correct phrasing is, he was there to ensure the sail won't flip the other way like how a coin flips. See he was grabbing onto the side and whole body simply act as a dead weight to pull the sail down. Nevertheless, it's still some dangerous stunt there!",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThrustTrust",
            "body": "The way that guide rope slices thru the outrigger is amazing.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Mr-SlowMotion",
            "body": "Did he literally save the boat wit his body type shit?",
            "score": 38,
            "replies": [
                {
                    "author": "IchBinEinSim",
                    "body": "Yes and no, apparently he used his body to keep his sail from moving by grabbing onto its line when he jumped into the compartment but his boat deflected the blue boat.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Lolthelies",
                    "body": "I can’t answer that, but I do know throwing something between your boat and something else to prevent it from crashing is a thing.\n\nI once saw a tugboat do this exact same thing between a giant freight ship and the riverbank (the tugboat went between the freight ship and riverbank). It just bounced right off and things were good",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "drifters74",
            "body": "I don't understand what's happening here",
            "score": 8,
            "replies": [
                {
                    "author": "ssrowavay",
                    "body": "I sail. I've watched it 20 times. I have no idea what's happening here.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Crazy-Crocodile",
                            "body": "Sail GP match racing cutting it a bit too close... \n\nhttps://youtu.be/iSAIELBYbTk?si=L0V42x69_4aKPqVt\n\nHere's some more context.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MXTwitch",
                    "body": "According to another commenter, the guide rope is slicing through the outrigger. Hope that helps.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "broadarrow39",
                    "body": "The fact it's sped up doesn't help",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "PikachuuuCSGO",
            "body": "Pearl Harbour V2.0",
            "score": 5,
            "replies": []
        },
        {
            "author": "burnthefuckingspider",
            "body": "the boat literally got sliced by the rope.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Opalknights763",
            "body": "How did he not get crushed",
            "score": 11,
            "replies": [
                {
                    "author": "GalaxyStar90s",
                    "body": "Strong tights.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Suddenly_234",
                    "body": "Adrenaline",
                    "score": -15,
                    "replies": [
                        {
                            "author": "GhostPiggie",
                            "body": "Adrenaline isn't gonna stop you from getting crushed.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Suddenly_234",
                                    "body": "Well,it did in this situation.",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "Captn_Deathwing",
                                            "body": "🧐",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "GhostPiggie",
                                            "body": "No I'm pretty sure he still got crushed. Check the video again, maybe you missed it.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "IchBinEinSim",
                                                    "body": "He didn’t get crushed because he jumped into a compartment before just the blue boat hit, so the impact was between the two boats. The impact did cause him to fall backwards and hit the other boat with his upper body, but the blue boat was already being deflected by his boat. It probably felt like being thrown against a wall but I wouldn’t call that being crushed.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "i_do_be_like_that",
            "body": "wait what just happened???",
            "score": 2,
            "replies": []
        },
        {
            "author": "notcomplainingmuch",
            "body": "Looking at this from a competition rules perspective, it was clearly the fault of the US boat. Both are sailing on a starboard tack and the US boat is upwind, so it has to change course to avoid collision. \n\nEven if the white boat tacked from port (not shown), it already had full wind in its sails from starboard.\n\nA collision that makes the other boat unable to continue would directly disqualify you. \n\nOr did I get it wrong?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pariam",
            "body": "Guy on white boat, we can see video from both boats, right?\nHe run inside capsule? (Don't know the name). He looks fine.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bobsuperman",
            "body": "I see the hole he jumped into to keep the sail from flipping.crazy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrGoesNuts",
            "body": "Is there a rope through the hull of the other boat in the last frame?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Nuts_Milk",
            "body": "USA USA USA!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hwilliams0901",
            "body": "How they dont see each other? I mean like how did it get this close?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThrowinNightshade",
            "body": "That’s not a close call. That’s a collision.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crusty54",
            "body": "What the fuck happened, and whose fault was it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sunderland6969",
            "body": "Kamikaze from the Japanese!",
            "score": 0,
            "replies": []
        }
    ]
}