{
    "title": "338Canada Federal Election Model - a Liberal majority Government is now the most likely outcome if there was an election tomorrow | LPC: 177, CPC: 132, BQ: 25, NDP: 7, GRN: 2.",
    "author": "ShreckAndDonkey123",
    "subreddit": "dataisbeautiful",
    "rank": 1,
    "score": 678,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 143,
    "url": "https://338canada.com/federal.htm",
    "id": "1jechp9",
    "selftext": "",
    "comments": [
        {
            "author": "Dr_thri11",
            "body": "Trump could've had a very friendly government to his admin if he was capable of shutting the fuck up.",
            "score": 338,
            "replies": [
                {
                    "author": "S_A_N_D_",
                    "body": "I think it plays a role, but also Poilievre overestimated his appeal and played a very one sided strategy. Too much credit is being given to Trump. \n\nHis whole persona was that he's not Trudeau, and that he'll kill the carbon tax. He never actually tried to connect with people or make them like him because he didn't need to. A lot of people didn't *want* to vote for him, they just didn't want to vote for Trudeau. \n\nUnfortunately for him, Carney also isn't Trudeau, and he's already killed the carbon tax (or at least the major part Poilievre was focusing on). Those two things took 90% of the wind out of the conservative party strategy up to this point. \n\nThe thing is, I can't remember any sound bite of Poilievre in the last year, in any news clip, that isn't one where he is either railing against Trudeau, or railing against the carbon tax. He just has no depth publically that he was willing to show (likely because it's not as average joe friendly as he tries to come off). \n\nNow that there is a real issue at hand, he's been completly silent except for \"we'll I'll deal with that and by golly we'll fight for you\". It rings hollow. Other than that, he still just seems to be bent on likening Carney to Trudeau instead of actually trying to get people to invest in and trust him.\n\nEven in the absence of Trump I don't think Poilievre's lead would have held once the Liberal leadership changed. It may not have gone as far as it currently has, but I think he would have lost his majority.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "ominous-canadian",
                            "body": ">railing against Trudeau, or railing against the carbon tax.\n\nHis attack ads on YouTube are still calling the PM \"Carbon Tax Carney\" lol",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "S_A_N_D_",
                                    "body": "yeah he's just shifting the goal posts. Now he's saying he'll remove the industrial carbon tax as well, which honestly I think will backfire since it gives an avenue for others to claim he's in the pocket of large corporations and big oil. Danielle Smith is doing the same. \n\nHis only angle is to just try and stir up resentment. Not once has he instead shifted focus to leading.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "mcs_987654321",
                                            "body": "The bigger issue is that removing the corporate portion would jeopardize our preferential trade terms with the EU under CETA, and a time when pretty much the only priority to like 90% of Canadians is diversifying trade away from the US. \n\nSeriously, it’s a stunningly bad position (tactically AND politically), and that Poilievre didnt immediately understand that reality is the biggest red flag yet.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HeeyWhitey",
                            "body": "PP is literally a professional complainer/critic. It's the only thing he knows how to do.",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "Drewy99",
                            "body": ">The thing is, I can't remember any sound bite of Poilievre in the last year, in any news clip, that isn't one where he is either railing against Trudeau, or railing against the carbon tax. \n\n\nHow could you have missed him railing against \"woke\" ?? He wouldn't shut up about it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tampering",
                                    "body": "What about the 'political elites'. Never mind he's never worked a day off of Parliament Hill in his adult life.   \n  \nRemember when he made fun of the crappy little house that a poor family lived in?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Flying_Momo",
                            "body": "worse was him using the phrase Common sense Conservative even when eulogizing Horgan when he died. PP was always a slimy weasel and never liked him. I had resigned to fact that he was going to be PM but hopefully he doesn't get into power.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "whatsinanaam",
                            "body": "Literally all of the credit should be given to Trump. Carney = Trudeau. They are the same side of the exact same coin.",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "LeBonLapin",
                                    "body": "They really aren't - Carney is a step to the right for the Liberal party, have no doubt.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "ominous-canadian",
                                    "body": "I don't think so. I think a lot of people like the idea of such an experienced economist leading the nation during this whole tariff nonsense. Carney has also changed two controversial policies of Trudeaus.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "whatsinanaam",
                                            "body": "People want so badly to believe this.  RemindMe! 12 months",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ominous-canadian",
                                                    "body": "Believe what? He is a highly qualified economist- which is what we need right now. I hope he does well and that Canada does well, too. But realistically, in 12 months, we will probably see Canada in a worse economic state simply due to the fact that things are uncertain, and there's an absolute lunatic to the south of us. That said, I think we'll be way better off in 12 months with Carney than a populous career politician. \n\nEither way, I hope whoever wins the election does well for Canada. Elbows up!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Messer_J",
                                    "body": "Trudeau is a Progressivist drama teacher. Carney is a Centrist banker. They are not the same",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aaandfuckyou",
                    "body": "Thank fuck he didn’t, because Canada doesn’t need or want a Trump-friendly government.",
                    "score": 85,
                    "replies": [
                        {
                            "author": "Powerful-Cake-1734",
                            "body": "Honestly, as a Canadian, I’m somewhat happy with trumps threats and tariffs. It woke up and unified Canada. With a little work, conservatism can be pushed to the fringes where it belongs.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "mcs_987654321",
                                    "body": "Can’t quite get to “happy” over an existential threat that absolute best case will have brutal effect on hundreds of thousands of Canadians - but between the unity, the common sense and seriousness with which most people are treating this, and the fire it lit under the country to once again thing in Hydro Quebec level mega projects…\n\n…yeah, hell of a silver lining.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "blighander",
                    "body": "No price it's too high to pay for him to shut up for once in his miserable life. It's his trademark.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Realtrain",
                    "body": "I do wonder how much of the flip is due to Trump trumping, vs Trudeau resigning. Obviously both had impact, but I wonder which was bigger.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dr_thri11",
                            "body": "I don't claim to have my finger on the pulse of Canadian politics, but wasn't Trudeau already stepping down?  And wouldn't voters associate his party with him?  Seems to me that Trump being an antagonistic dick and picking a fight through tariffs would be the bigger factor.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Realtrain",
                                    "body": "Trudeau announced he was stepping down in January (right before Trump's trade war), due to his pretty severe unpopularity. Many were arguing that he personally was the reason that the Liberal party was polling so poorly, hence why he stepped aside to find new leadership before the elections later this year.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "horatiobanz",
                    "body": "Ironically, it makes it more likely that Canada continues to have huge systemic problems and eventually becomes a failed state with liberals back in power.  I wonder if it was intentional.",
                    "score": -39,
                    "replies": [
                        {
                            "author": "Dr_thri11",
                            "body": "Bruh no country as rich as Canada is in danger of becoming a failed state. It's a rich country with rich country problems.  Which can be challenging, but failed states are like Haiti and Somalia.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "thisisdropd",
                                    "body": "His definition of failed state is when liberals are in charge.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "resuwreckoning",
                                    "body": "I mean are you in favor of like another 25 million uneducated punjabis being imported to Canada based on misplaced notions of generosity?  \n\nBecause that’s the liberal playbook to increase GDP.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dr_thri11",
                                            "body": "Anyone who says the number is 25 million is lying to you. That's an absurd number and anyone reporting it can be disregarded as a crackpot. But sure there's definitely a debate to be had about appropriate immigration levels. A failed state doesn't mean recession level struggles. A failed state is like I said Haiti and Somalia not something a country with the gdp of Canada really has to worry about.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "resuwreckoning",
                                                    "body": "I love the “sure there’s definitely a debate to be had about appropriate immigration levels” was branded as implicitly racist by the very party that you’re suggesting there’s not really much to worry about.\n\nOver the long run, increasing Canada’s population to the degree and manner that liberals (and reddit) seem to want would lead to a failed state, yeah.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Dr_thri11",
                                                            "body": "You really don't understand the enormous gulf between a rich country and a failed state if you  think that's even a remote possibility.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "gsfgf",
                            "body": "So do you actually believe what you post, or are you posting just to post it?",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "TheShishkabob",
                            "body": "Is this the type of garbage that Americans really think about Canada?\n\nHow fucking pathetic.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Canadian-Owlz",
                            "body": "Yeah, the economist with multiple degrees and achievements would totally be much worse than the career politician.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Optimus_Prime_Day",
                            "body": "Ha, maybe Canada should vote PP in, tariff our allies and break all treaties, insult the left, ignore judges, and defund everything to give the super rich a mega tax break instead?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "4FriedChickens_Coke",
            "body": "Pretty hilarious that Trump winning totally destroyed the carefully executed lead that the Conservatives had cultivated against some pretty obvious Liberal shortcomings under Trudeau. I’d be very surprised if they had a fighting chance now",
            "score": 163,
            "replies": [
                {
                    "author": "invariantspeed",
                    "body": "It wasn’t him winning. It was him blathering.\n\nActually, there was a sense that a Conservative government might do better dealing with Trump than Trudeau. So even if Trump’s election didn’t really give them a bump, it didn’t hurt them either. If you can remember all the way back (3ish months ago) to when Trudeau flew to Florida to meet Trump after he announced he was going to tariff Canada, his approval and that of the Liberals in general *cratered*. He wanted to look in control, but he came across as weaker than he already looked. It was after that incident when the numbers started showing the Conservatives with a run-away victory and the Liberals being practically wiped out. Trump had already started with the “governor Trudeau” business and the Liberals had numbers that literally could be called apocalyptic.\n\nWhat happened was threefold:\n1. Trudeau agreed to step down, so he stopped being a drag on the party.\n2. Trump didn’t stop so the Canadians realized he was being serious. That put the nation in survival mode, for one, and, for two, it made a lot of people a lot more distrusting of Conservative politicians who associated themselves with Trump and Trump-like things.\n3. The Liberals picked Carney to lead. He’s both not seen as politics as usual and he’s seen as highly competent in economics. He earned a lot of respect for competently managing multiple economic troubles while telling people the truth without making many enemies.\n\nTLDR: Trudeau and the Liberals did the literal oposite of what Biden and the Dems did in the US and Trump doesn’t know how to shut tf up and take a win. He snatched defeat from the jaws of victory for the Conservatives.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "fantasmoofrcc",
                            "body": "That, and Carney is boring...like \"Ben Stein\" boring. I like my leaders boring.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "invariantspeed",
                                    "body": "I too like my leaders boring and my times *precedented*.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mcs_987654321",
                                    "body": "Boring but still a bit spicy. Honestly think that he and champagne are going to pull Chrétien-Martin 2.0, just reversed (especially since champagne is also a shawinigan boy).",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KathyJaneway",
                            "body": ">He snatched defeat from the jaws of victory for the Conservatives.\n\nYeah, Trump really likes snatches... Especially non-consensual ones. Canada conservatives didn't ask for it - but he did it anyway. 🤣🤣🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hagamablabla",
                    "body": "It reminds me of how China crippled the KMT's electoral chances by cracking down in Hong Kong. People just can't stop snatching defeat from the jaws of victory.",
                    "score": 31,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShreckAndDonkey123",
            "body": "For context, this is the first time in several years the Liberals have had more than a 50% chance of forming a majority Government at the next GE per 338Canada's model.\n\nCPC Majority - 99% chance (44 days ago) -> CPC Majority - 1% chance (today)\n\nThis turnaround is pretty crazy.",
            "score": 231,
            "replies": [
                {
                    "author": "junkthought",
                    "body": "Can I ask how accurate has 338 been in the past?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ShreckAndDonkey123",
                            "body": "[https://338canada.com/record.htm](https://338canada.com/record.htm)",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "Medea_From_Colchis",
                            "body": "They are pretty much the go-to aggregate pollster in Canada.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Realtrain",
                                    "body": "Makes me miss America's 538 :(",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aveugle_a_moi",
                    "body": "Jesus christ. That's a genuinely insane turnaround.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "SunshineSeattle",
                    "body": "Nice to see that Canadians arent fucking cray cray. Unlike your neighbors to the south 🫤",
                    "score": 42,
                    "replies": [
                        {
                            "author": "amoral_ponder",
                            "body": "Yes they switched from cray cray to not cray cray in 44 days according to you.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "RaiSilver0",
                                    "body": "they saw what’s happening in America and learned\n\nthis is good, gives me hope that people can change",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "asinine_assgal",
                                            "body": "It had to do with the US outcome but that’s not quite it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Eric848448",
            "body": "Trump saved Trudeau’s legacy didn’t he?",
            "score": 153,
            "replies": [
                {
                    "author": "Icommentor",
                    "body": "More importantly:\n\n1. Trudeau got replaced by a political newcomer, so this new guy hasn't disappointed voters yet.\n2. Pierre Poilievre, the opposition leader has demonstrated a pathetic level of spinelessness in a time of crisis. He's also been nothing more than a unidimensional repeater of angry slogans when concrete measures are urgently needed.\n\nIn short, this is overwhelmingly the opposition's failure. Actually, this is one man's deep, deep failure. Thank god we are on our way to dodging this bullet. The man has nothing that human beings seek in a leader.",
                    "score": 134,
                    "replies": []
                },
                {
                    "author": "mcs_987654321",
                    "body": "Eh, crisis Trudeau and international Trudeau were always pretty awesome, suspect that would have come to dominate with a little distance. \n\nAlso: Domestic Trudeau was really solid, he just got nailed by a few global and historical trends that would have bitten any PM on the ass. \n\nAnd had a truly deranged media ecosystem that has quite literally had a grudge against him since before he was born. \n\nBut yeah: hell of a note to go out on, and incredible handoff to Carney.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "NIN10DOXD",
                            "body": "I'm Americans still relatively young, but from immediate memory I'd say Trudeau has been the best Canadian Prime Minister in my lifetime as an outsider looking in. He definitely hit a ditch before Trump pulled him out at the end, but I remember him being extremely popular in Canada and especially here in the States for his first few years.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "mcs_987654321",
                                    "body": "Canadian politics is weird, and hard to explain to outsiders, but part of that is just down to the basically unshakable “law” of Canadian politics of switching things up massively every 10ish years, and there always being a fair amount of excitement/optimism when that happens. \n\nIt’s why it such a big deal that the conservatives have so spectacularly shit the bed, they had been basically gift wrapped a huge 10-year swing election win. \n\nBut yeah, if you’re young you’ve probably only seen one of those every 10 year “honeymoon periods”, and that was Trudeau’s. Also: the international media was VERY excited about how handsome he is, but that wasn’t so much a thing here.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "invariantspeed",
                            "body": "I mean there also was the carbon tax and the Canadian VA apparently offering a disabled vet “medically assisted death” instead of an elevator. That played real well nationally.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "mcs_987654321",
                                    "body": "The consumer carbon tax is gone, and the low level phone operator who used awkward phrasing during a difficult conversation was unfortunate, but has absolutely nothing to do with federal politics.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "invariantspeed",
                                            "body": "Both had much to do with federal politics and more than a few people in the CPC hung their hats on that.\n\nYes, the consumer carbon tax is in its way out…that was my point. Like half the CPC argument is gone right there.\n\nAnd, yes, the phone operator wasn’t acting as part of some macabre federal policy, but that wasn’t the point. The Conservatives RAN with that story…",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TheShishkabob",
                                    "body": "The person who \"offered\" that was fired pretty fucking quickly. Condemning a nation or even a national party based on one now-out-of-work idiot who went off script is wild.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "invariantspeed",
                                            "body": "I don’t disagree. I’m saying it played *very* poorly to many audiences in Canada. Fairly or not, Trudeau became a toxic association for many Canadian voters.\n\nIt honestly reminds me of the right wing POV on Biden pre-election. Thankfully, Trudeau had the good sense to not fight the investable like Biden and gave his party a chance to recover. Now LPC is positioned to protect the nation. I think history will probably have a mostly positive view on Trudeau’s legacy, as someone who stepped down for the greater good when the moment sharply changed.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OrangeJr36",
            "body": "Carney should call an election ASAP.",
            "score": 41,
            "replies": [
                {
                    "author": "gsfgf",
                    "body": "At this point, the next election is *the* election, right?  If he calls an election now, they won't have another in October?  I agree.  Everything else aside, Canadians are gonna start feeling the trade way before October, which isn't ideal for an incumbent government.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "ali2326",
                            "body": "Correct, unless of course the new government elected after the snap election immediately loses a vote on a supply bill or a specific motion of no confidence",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "mcs_987654321",
                                    "body": "I’m picking up what you’re putting out there, but at this stage even a CPC minority is looking like a hell of a lift.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheShishkabob",
                            "body": "Yes. Canada does not have set election dates so an election in a month would mean that there wouldn't be one in October.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "ominous-canadian",
                            "body": "Yes, once an election is held, the Prime Minister Office does not need to call another for 5 years. However, they can strategically call an election within that 5-year timeframe, which is what Trudeau did in 2022.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "invariantspeed",
                    "body": "A few months ago, in an interview with John Stewart, he said the government replacing Trudeau’s cabinet would do exactly that. This is a good test of him keeping his word. Yes, the country needs stabilizing, but he’s technically in a placeholder role until he gets a mandate. Even if it’s only symbolically early because there’s already only 7 months left to the election, he needs to call for an earlier date than in October.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Tryoxin",
                    "body": "I think he'll do exactly that. This is a little \"my uncle's neighbour's nephew said...\" so take it with a grain of salt, but my mom runs a non-profit housing org here in Ottawa and chats regularly with a lot of politicians. She was saying that people close to Carney have told her they're expecting an election to be called by the end of the month (they were telling her this because, *during* an election, getting funding becomes a lot more difficult).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cuddlyaxe",
                    "body": "As an aside it's such a silly and unfair system that the ruling party can just decide when they want to call an election like that. Timing elections like that feels very undemocratic\n\nOfc idk if there's a good alternative for parlimentary countries. I think the UK tried fixed terms for a while but that didn't work out too well for them",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DisparateNoise",
            "body": "Shouldn't Carney call an early election like right away then? Secure his spot as PM while still in the honeymoon period? In 8 months, everything could change.",
            "score": 17,
            "replies": [
                {
                    "author": "ScottNewman",
                    "body": "He is.  Everything he is doing - visits to UK and France, the King, the arctic, is to get free publicity and campaign materials before the writ drop.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "ShreckAndDonkey123",
                    "body": "It's all but confirmed he'll call one this week. The question is just what day he picks. Sooner the better",
                    "score": 34,
                    "replies": [
                        {
                            "author": "invariantspeed",
                            "body": "Given this sudden and unprecedented lead, definitely sooner than later. They’d be fools to drag it out.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "gsfgf",
                                    "body": "And get it done before the trade war hits voters.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "invariantspeed",
                    "body": "If he tried to wait, it would look like he’s trying to do exactly what you’re saying. That’s a bad look in functioning democracies.\n\nA minority government also only exists at the whims of the opposition parties. If they can unify around a vote for no confidence, the election happens anyway but the PM has the added benefit of looking stupid.\n\nThis is also the first time in a long time that the LPC looks like it could win a majority. There isn’t much room up from here but there’s a lot of room downward. Canada also generally switches parties after a government has been in this long. The fact that they’re where they are with so much uphill in their way is a big deal.\n\nNow is the time for so many reasons.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SmilingNevada9",
            "body": "Crazy that LPC and BQ would even come together to form a coalition (at least according to the article). I always thought it would have been more likely a LPC and NDP coalition would form (even tho the last coalition wasn't the most successful for either party imo).",
            "score": 14,
            "replies": [
                {
                    "author": "BuvantduPotatoSpirit",
                    "body": "By far the most common mode of minority government in Canada's history is just to govern as a minority and get votes as needed from whoever will give them to you.  Coalitions are very much the exception, and if the NDP gets as burned by it as looks likely, I wouldn't expect another for quite a while.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Cormacolinde",
                    "body": "It gives no indication as to the plausibility of them forming a coalition, it only indicates if the numbers would allow them to do such a thing. the number of projected NDP MPs is so much lower than the BQ, it is thus unlikely they could even hold the balance of power this time.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "invariantspeed",
                            "body": "At this point, it’s not about numbers. It’s about a show of unity. If they can officially form a coalition even if LPC has a majority, it’s just shows the country that they’re on the same page and not playin politics with a real threat.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SmilingNevada9",
                            "body": "Ahhhh makes sense. Thanks for clarifying that!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mcs_987654321",
                    "body": "Nothing crazy about it, has happened a few times before. \n\nCoalition doesn’t need to be official either, there doesn’t even need to be some kind of non binding agreement to work together. \n\nIt’s only the CPC that can operate in minority, bc they can’t/wont work with any of the other parties.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "TheShishkabob",
                    "body": "The BQ is pretty close to the LPC on most issues. They're both centrist parties. \n\nThe article is merely showing that they *could* form a coalition, not that they *would*. Coalitions don't really happen in Canada so it's really only a thought exercise.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "probablynotaskrull",
            "body": "I’m very glad about this, but can I just say:  first past the post sucks!",
            "score": 7,
            "replies": [
                {
                    "author": "queenkid1",
                    "body": "If only we could've elected a political party that would've changed the system... oh wait, we did.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "xbbgun",
                            "body": "And that is why liberals lost my vote",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "splendidpluto",
            "body": "I can only hope people can see Carney as the leader Canada needs. He got us out of the 2008 financial crisis in good shape and I'm certain he can do it again.",
            "score": 26,
            "replies": [
                {
                    "author": "invariantspeed",
                    "body": "He has the reputation and (currently) the good will. He has the opportunity to prove himself and not squander this political capital like others have in the past.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "reddfawks",
            "body": "Looks like PeePee really pissed away his lead!\n\n*Seinfeld bass line*",
            "score": 43,
            "replies": [
                {
                    "author": "Optimus_Prime_Day",
                    "body": "Time to Flush the PP",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "ScottNewman",
            "body": "I'll believe it when I see it.  There is still a significant split in the polling companies.  Nanos, Innovative, and Abacus all still have a Conservative lead in polls.\n\nAlso - polls are snapshots in time and campaigns matter, as does turnout.  Time to get to work.",
            "score": 9,
            "replies": [
                {
                    "author": "mcs_987654321",
                    "body": "All the polls are following near identical trends, and even the ones that give some marginal popular lead to the CPC would still hand the LPC an easy minority bc of conservative vote concentration. \n\nThat said, the election hasn’t even been called, and Canadians generally vacillate quite a bit over the course of them, so who knows where things will land…but the snapshot as of today sure indicates that the CPC would fucked.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mr-Klaus",
            "body": "The Canadian conservative movement was boosted by MAGA - even their politicians started acting like MAGA politicians in the states.\n\nNow that Canadians can see what an actual MAGA government looks like, they no longer want a part of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "afoogli",
            "body": "Keep in mind in the last two election under similar circumstances both Turner and Campbell have polled 50% or what MC is polling than ended up being destroyed, history tends to repeat itself",
            "score": 4,
            "replies": [
                {
                    "author": "ColinBonhomme",
                    "body": "Turner and Campbell faced Mulroney and Chretien. Poilevre is not in the same league as either of those.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doctor_Amazo",
            "body": "Well it won't be tomorrow but I will be shocked if one isn't called before the end of the month.",
            "score": 1,
            "replies": [
                {
                    "author": "mcs_987654321",
                    "body": "I’ll take the under on that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AbnormallyBendPenis",
            "body": "Only Trump is capable of making Canada forget how much our youth quality of life has declined in the past 10 years and how much it has improved for boomers! Let’s have LPC for 10 more years! Hopefully I can sell my property for double the price in 2030 xd",
            "score": -16,
            "replies": [
                {
                    "author": "bowtiedan",
                    "body": "If only there was another level of government that had more impact on the day to day life of Canadians… perhaps the Provincial Government…. No, it must be Trudeau fault",
                    "score": 21,
                    "replies": [
                        {
                            "author": "queenkid1",
                            "body": "Where did they blame Trudeau? You brought him up, not them. He's the figurehead for all the issues the Liberal Party has accelerated down the drain during their leadership (at all levels), but he isn't solely responsible. \n\nYou're doing the same switcheroo that the Liberal Party is trying to do; act like any criticism of the Liberal's massive policy blunders over the last decade is either (a) people mad at *just* Trudeau, or (b) somehow not applicable to the new leadership coming in, despite them having held high positions in the party. \n\nThis is a party that has consistently denied the changes in the cost of living and how it impacts people, massive levels of overspending going against even their own limits they put in place and increasing the deficit to a degree that is unanimously unsustainable and will shackle generations to come. New figurehead, same bullshit, still not fulfilling many of their promises to Canadians.",
                            "score": -5,
                            "replies": []
                        },
                        {
                            "author": "AbnormallyBendPenis",
                            "body": "Not what I said, Trudeau was perfect",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "invariantspeed",
                    "body": "LPC for another 10 years might be unlikely. This is kind of like the US tending to elect the same president in wartime. Canada is picking a wartime government, but once the current situation climaxes, Canada will start to look more at the other issues again. War is a fight or flight situation.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "gsfgf",
                            "body": "What's the CPC's stance on trade?  Both countries are going to need pro-trade governments to mitigate the damage.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TheShishkabob",
                                    "body": "They're pro-American trade and, lately, anti-European trade. \n\nPretty much a terrible combination of factors at the moment.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "TristeonofAstoria",
                                    "body": "They are generally pro-trade and anti-interprovincial trade barriers, but their recent call to remove all industrial carbon taxes would prevent us from tariff-free trade with the EU, who are shaping up to be a major trade partner.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "invariantspeed",
                                            "body": "Carney is taking that wind out of the CPC sails by getting the LPC behind removing the consumer carbon tax.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "da2Pakaveli",
            "body": "haha please keep going Trumpy",
            "score": -1,
            "replies": []
        },
        {
            "author": "mr_ji",
            "body": "Is there an election tomorrow?  Maybe focus on when it matters.",
            "score": -42,
            "replies": [
                {
                    "author": "frankyseven",
                    "body": "Well, there is going to be an election called before Monday and will happen within 37-50 days of it being called. So...",
                    "score": 31,
                    "replies": [
                        {
                            "author": "mr_ji",
                            "body": "So...no.",
                            "score": -45,
                            "replies": [
                                {
                                    "author": "fmaz008",
                                    "body": "Folks: only ever do surveys the day before an event. There is no point in collecting early data and planning a strategy more than 24hrs ahead of said event.\n\nFocus on what matters: which is *no further than 24hrs ahead*.",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "mr_ji",
                                            "body": "There's no point in making it sound like opinions have changed with so little information and no bearing on elections so far out.  This is what we grown-ups call *propaganda* (the bad kind).",
                                            "score": -27,
                                            "replies": [
                                                {
                                                    "author": "raybond007",
                                                    "body": "Ah yes, my favourite kind of propaganda... the one that's just a collection of polls from respected polling institutions. \"We grown-ups\" is a hilarious assertion while you're claiming that purely un-editorialized data is a propaganda.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "kingbeerex",
                                                    "body": "Or just “polling”",
                                                    "score": 18,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "RaiSilver0",
                                                    "body": "you think opinion surveys and polling are propaganda?",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TheShishkabob",
                                                    "body": "Literally all of what you said is objectively wrong.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "mr_ji",
                                                            "body": "I'm getting the impression they don't have dictionaries in Canada.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "TheShishkabob",
                                                                    "body": ">There's no point in making it sound like opinions have changed with so little information \n\nIf you know anything about Canada today you know this part is untrue. All across the country there have been very visible shows against the US, from O Canada being sang in Quebec (in English!) to American produce rotting on the shelf. Every single demographic in every single province has moved away from the CPC. These are objective facts.\n\n>and no bearing on elections so far out. \n\nAn election will likely be called this week. Unless you think it's possible something even more insane than the US threatening to annex us is even possible then nothing is going to have as drastic of a shift in our politics in the opposite direction of the current trend.\n\n>This is what we grown-ups call propaganda (the bad kind).\n\nPolling isn't propaganda. \n\nSo was it the \"literally\" part or the \"objective\" part of my comment you took umbrage with? I ask because both were used correctly.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RNKKNR",
            "body": "Shame. More liberals. Canada is going downhill fast.",
            "score": -102,
            "replies": [
                {
                    "author": "UsedToHaveThisName",
                    "body": "What’s the alternative? Be taken over by America and become a territory with no representation?  Yeah, sounds great.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "RNKKNR",
                            "body": "Alternative? Were you not here for the past 10 years???",
                            "score": -67,
                            "replies": [
                                {
                                    "author": "UsedToHaveThisName",
                                    "body": "Buddy, here’s the reality right now. \n\nA vote for Carney and the LPC means we might be able to make it through US tariffs with a semblance of a country with someone that ran the Bank of Canada in 2008 when the US experienced a catastrophic recession. \n\nA vote for Poilievre and the CPC means we become the territory of Canada and the US takes whatever resources it wants. \n\nThat’s the reality. I don’t give a shit about what happened for the last 10 years. The situation is drastically different now compared to before January 20th.",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "ZingyDNA",
                                            "body": "You really believe there's a chance we join the US under any leader? 🤣",
                                            "score": -21,
                                            "replies": [
                                                {
                                                    "author": "Stephenrudolf",
                                                    "body": "I don't think we have a choice under certain leadership.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "ZingyDNA",
                                                            "body": "You think we won't have a choice but get annexed, if the conservatives win the election? You know PP said repeatedly he won't let that happen?",
                                                            "score": -13,
                                                            "replies": [
                                                                {
                                                                    "author": "TheShishkabob",
                                                                    "body": "It took him dipping dozens of points in polls before he would even mention it wasn't entirely Trudeau's fault. He *still* jointly blames Canada for the matter rather than it being 100% on the US.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ZingyDNA",
                                                                            "body": "He didn't blame Canada. He blamed the Liberal leadership that put us at a worse position to deal with this. You can disagree with him, but he certainly didn't blame Canada.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TheShishkabob",
                                                                                    "body": "That's not what happened at all. He was pretty goddamn clear on the fact he thought it was Trudeau's fault despite the fact that Trump has been very clear that the tariffs are to lead to an annexation. The fact we're Canada and not the US was always the openly stated \"problem\" that Polievere tried to pretend wasn't known. \n\nIf you haven't noticed from the post we're commenting on, Canadians understood what was said and what was meant.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RNKKNR",
                                            "body": "Carney is Trudeau 2.0 \n\nIt'll literally be the continuation of the past 10 years. Same people. \n\nAs for 'US takes whatever resources it wants' - we're already selling 78% of national resources to US. There's no need to 'take' anything, they already have it.",
                                            "score": -39,
                                            "replies": [
                                                {
                                                    "author": "fmaz008",
                                                    "body": "And yet the orange fellon had to repeat numerous times that \"already having it\" was not enough: that Canada should be the 51st state. (Which really would be a territory not a state)\n\nI get why so many people will vote for the __least worst__ option.",
                                                    "score": 19,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Stephenrudolf",
                                                    "body": "Keep repeating \"carney is trudeau 2.0\" and all you'll do is remind everyone you have no thoughts of your own. \n\nHe's the most conservative leader the lpc has had in decades.",
                                                    "score": 21,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "snoosh00",
                                    "body": "What's your favorite piece of legislation that pp has proposed or passed? What do you think that will do for you?\n\nAlso, Did you know *you* have the same level of security clearance as pp?",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "McG4rn4gle",
                                            "body": "As leader of the opposition Pollievre can't pass any legislation and most of what he's proposed has been to just try and unfuck what Trudeau has given us which of course has gone nowhere because Trudeau and Singh have held the reins and rode this country to the point where they needed a bolt out of the blue from down south to wash away all their ineptitude.\n  \nAnd there's nothing sinister about Pierre not getting the security clearance, it's just once he's privy to the intelligence he has to shut up about what he knows  - it's a tactical choice as leader of the opposition and nothing more but he could get the clearance this afternoon if he so chose.",
                                            "score": -13,
                                            "replies": [
                                                {
                                                    "author": "snoosh00",
                                                    "body": "Name one policy.\n\nA \"tactical choice\" to allow him to spread disinformation is a good quality in a politician? A \"tactical choice\" to literally be uninformed is a good trait for a politician?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "McG4rn4gle",
                                                            "body": "Abolishing C21.\n  \nThe security clearance issue came up because it was found that China and India had been meddling in our elections to benefit the LPC (that is an objective fact) but the supposition is also that perhaps they interfered to the benefit of the CPC in certain strategic ridings - if Pollievre was briefed on those classified matters then he'd be hamstrung by being unable to talk about them which is exactly what all the others with security clearance have done.  \n  \nIF he got that clearance then he's muzzled on that topic by law - so it's not disinformation, if anything it could be turning a blind eye to hypocrisy because theoretically his party was assisted as well (again hypothetically for the sake of conversation) but it's a classified matter.",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "snoosh00",
                                                                    "body": "Ok, so the one policy you state is just a loosening of handgun restrictions... Good to see you're really concerned about \"really issues\".\n\nCool, so he's keeping himself in the dark so he doesn't learn more about election interference that helps him out, and him specifically (but he'll rag on the liberals for getting the same interference? Am I getting that correct?).\n\nIt's really funny to hear how empty your support for him is. I'm going to be supporting Carney and the liberals because I value our sovereignty and economic future that is currently in the hands of the bully down south.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TheShishkabob",
                                                    "body": ">As leader of the opposition Pollievre can't pass any legislation \n\nWhat about his time in politics before that? Anything stand out?\n\n>and most of what he's proposed has been to just try and unfuck what Trudeau has given us which of course has gone nowhere because Trudeau and Singh have held the reins and rode this country to the point where they needed a bolt out of the blue from down south to wash away all their ineptitude.\n\nSuch as what exactly? Point to something tangible so we can figure out what you're raging about. \n\n>And there's nothing sinister about Pierre not getting the security clearance, it's just once he's privy to the intelligence he has to shut up about what he knows - it's a tactical choice as leader of the opposition and nothing more but he could get the clearance this afternoon if he so chose.\n\nThat's not fucking good enough. We're under threat by the singular superpower on Earth and there have been multiple countries implicated in foreign meddling in our elections. The fucking cowardice of hiding from those issues while trying to be Prime Minister is completely absurd and indefensible. \n\nBeing *maybe* pushed towards not lying constantly is the worst defense for him by the way.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "sirgunt",
                                    "body": "The definitive crystal balls are out in full force today.  I’m a cpc shill apparently too, I keep learning more and more about myself from complete strangers here lol",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zaphod_85",
                    "body": "Better than the Satanism that passes for \"conservatism\" nowadays.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "gsfgf",
                            "body": "Dude, the Satanists are good people.  They're a part of the resistance.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sirgunt",
            "body": "Projections, based on a system running “simulations”…. So, it means nothing, got it",
            "score": -34,
            "replies": []
        }
    ]
}