{
    "title": "[OC] Boston Employee Salaries By Department (2015-2024)",
    "author": "ironpiggy44",
    "subreddit": "dataisbeautiful",
    "rank": 4,
    "score": 54,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/gallery/1jeijwy",
    "id": "1jeijwy",
    "selftext": "",
    "comments": [
        {
            "author": "Latter_Cheetah_2887",
            "body": "Wasn’t it found that Boston police were stealing millions of hours of overtime. Did anything happen with that?",
            "score": 1,
            "replies": [
                {
                    "author": "ironpiggy44",
                    "body": "This was another motivator for the visualization. It's a pretty common belief in Boston that the police rake in tons of money every year in overtime, but I had no idea the magnitude.\n\nThat said, some people did get convicted. Ex: https://www.boston.com/news/crime/2024/08/07/former-boston-police-officer-gets-prison-time-overtime-scandal/?amp=1",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Primetime-Kani",
                    "body": "All police essentially steal egregious amount of hours in all cities, it’s crazy because any assignment or some traffic stop can be logged as lasting many hours. It’ll probably never be improved anywhere",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CO-RockyMountainHigh",
                            "body": "If government contractors have had to report hours to the nearest 0.1 hour increment for the past couple DECADES so can cops. \n\nHow is this even a thing be systemic with; dashcams, body cams, and police cars with GPS? \n\nSomeone probably just needs the power to audit them and more importantly the power to fire those who commit time theft.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Primetime-Kani",
                                    "body": "Because they are most union minded and seniority trumps everything. \n\nThey’ll get super angry after putting in so much time and not getting as much as generation before them were getting. \n\nThe benefits they receive is a dream for most other professions.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Zeddit_B",
                            "body": "Don't allow overtime unless assigned. Log stops just like Jira tickets. AI compiles the stoppage notes from video taken during the stop.\n\nBut it'll never happen. Once you give a group something they like (overtime, here) it's very hard to take it away.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ironpiggy44",
            "body": "This is a follow up to the previous graphic I made about Boston crime maps. Instead of answering the question of how much crime takes place in Boston, this one answers the question of \"did defund the police actually happen?\" The answer is it didn't. I thought it was also useful to compare across to other high spend departments like the fire department and education. \n\nIn the parsing of the data, education counts anyone who works at a school, using education key words in the department name to segment the data. The fire department and police department are easier to detect. \n\nYou can also see the number of workers at each data point if you use the tool itself. This can be found here: [https://jerrying123.github.io/budgets/boston.html](https://jerrying123.github.io/budgets/boston.html)\n\nData used can be found here: [https://data.boston.gov/dataset/employee-earnings-report](https://data.boston.gov/dataset/employee-earnings-report)\n\n**Tools:**   \nChartJS  \n**Hosted:**  \nGithub Pages",
            "score": 1,
            "replies": [
                {
                    "author": "LaughingLikeACrazy",
                    "body": "Should have made a base graph 2015 and put total average salary included overtime in it. Might even compare it to inflation in each year.. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Situation4785",
            "body": "What about the Dunkin' employees?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrBleak",
            "body": "Surely there are more departments than fire, police, and education no? \n\nThe city I work for has a dozen or so divisions with Parks & Rec generally the lowest paid and police/fire at the top end but many others land closer to the middle making this seem perhaps more stark than the actual situation.",
            "score": 1,
            "replies": [
                {
                    "author": "ironpiggy44",
                    "body": "Correct. I got lazy. But also the rest of the data is as you say and therefore less insightful imo as the controversial salaries are education (too low) and police (overtime/too high).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MrBleak",
                            "body": "Fair enough, and I wasn't trying to construe that as disagreeing. Education salaries are criminally low especially compared to emergency services.\n\nMore just making a point over the overall salary expectations across a municipality.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FatherJack_Hackett",
            "body": "Sorry, am I reading this right?\n\n$160k+ for a police officer?\n\nThe UK fucking sucks. London police officers start on a salary of £38k a year, which is about $50k. Over three times less.",
            "score": 1,
            "replies": []
        }
    ]
}