{
    "title": "NOT OOP: r/trueoffmychest: My sister slept with my boyfriend and is now trying to take over my job.",
    "author": "angelove2701",
    "subreddit": "redditonwiki",
    "rank": 9,
    "score": 9,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/gallery/1jediv5",
    "id": "1jediv5",
    "selftext": "https://www.reddit.com/r/TrueOffMyChest/s/foIFBocJ4H",
    "comments": [
        {
            "author": "ChordStrike",
            "body": "I'm sorry - the night OOP gave birth, her sister went home with the bf?? This better not be real because if it is, I would be furious with OOP. Even going so far as to marry her cheating bf and then help out her awful sister? Come on.",
            "score": 62,
            "replies": [
                {
                    "author": "PsychologicalKey132",
                    "body": "Username is TruthorTale. I dont think its true",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Gacha-game-enjoyer",
                            "body": "What do you mean the litterly have truth in there name",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "beccadahhhling",
                    "body": "It happens. The night my husband and his sister were born, his dad was down in the car in the hospital parking lot getting a blow job from his wife’s best friend while his wife was getting sewn up from an episiotomy.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Natural_Sky_4720",
                    "body": "Well my biological dad was literally at my mom’s literal childhood best friends house (so my mom, her bestfriend and our cousin all lived in a shared apartment) with my mom and i’s cousin and was screwing said cousin while my mom was in HARD labor with me with no meds i mean her labor with me was bad and she ripped all the way from rooter to tooter man. Then our cousin brought him up to the hospital and they all acted like everything was all cool. So sadly this type of sick shit does indeed happen. Oh and get this.. i look a LOT like the cousin he was screwing while i was being born. I wonder if thats his karma lol",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "HUNGWHITEBOI25",
            "body": "You know…i’m trying to be sympathetic towards OOP…but when you CONSTANTLY make awful decision after awful decision i lose sympathy.\n\nI’m PRAYING this is fake and NOBODY is THIS much of a doormat",
            "score": 17,
            "replies": [
                {
                    "author": "atlantagirl30084",
                    "body": "No way would someone be their own sister’s supervisor.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "BikergirlRider120",
            "body": "Reta is a bad sister. Op wasn't being smart either for helping reta and marrying the cheater. I hope she went no contact with both of them for good.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Awwwan",
            "body": "Thank god its fake because i usually try to not blame the victim but im really tempted in this case",
            "score": 3,
            "replies": []
        },
        {
            "author": "8512764EA",
            "body": "wow\n\n3 kids all different dads",
            "score": 1,
            "replies": []
        },
        {
            "author": "Do_over_24",
            "body": "What in the Jerry Springer did I just read?",
            "score": 1,
            "replies": []
        }
    ]
}