{
    "title": "How Dating in Utah Be",
    "author": "Death_trap13",
    "subreddit": "redditonwiki",
    "rank": 14,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/redditonwiki/comments/1jeghug/how_dating_in_utah_be/",
    "id": "1jeghug",
    "selftext": "I know this subreddit is aware that Utah is truly wild, so I thought you guys would think this first date story was funny. I was attending BYU-Provo (I know, my first mistake. I briefly wanted to go into accounting and BYU has one of the top three programs in the country for that), and some of the required credits are religion credits in the different main scriptures Mormons use (Old Testament, New Testament, Book of Mormon, Doctrine & Covenants if anyone cares). I was in one of my required Book of Mormon classes and we were paired off to discuss different verses and I felt like I got along really well with this guy and we kept talking after class while he walked me back to my car. We exchanged numbers and he asked me on a date and seemed like a normal dude, for a guy I met in a BYU religion class. I say \"seemed\" for reasons you will shortly understand.\n\nHe didn't have a car which is fair for a college student so I picked him up and the first thing he says when he gets in the car is to ask what I read in the scriptures that day. And I was like, weird, but I guess that's the class we have together so maybe he's trying to stay in safe territory or something? So I kind of awkwardly said what I read and asked some questions about his day or whatever. We went to Olive Garden for dinner and while we were there, he did *not* improve at asking questions. He asked me loud enough for the surrounding tables to hear \"so, what's your favorite commandment?\" And I just about choked. Because, like, what? So, in a rare moment of witty pettiness, I responded rather quickly with \"The Law of Chastity.\" The two girls sitting at a table nearby who'd been watching me like they were trying to decide if intervention was necessary started laughing.\n\nWe then went ice skating because I was giving this guy way too many chances (I'm a recently recovered people pleaser who hadn't yet started recovery at the time) and I stg he didn't even moved his feet at all I was dragging this man across the ice and ice skating was literally his idea. He then ghosted me after a couple days of texting about how we should go on another date some time. Which worked out cause I was trying to figure out how to say we shouldn't, but it was still wild to me that he took off like I was the problem. I didn't ask anyone what their favorite commandment was, but whatever guy.\n\nAnyway, unrelated, but I later realized I was lesbian which is completely unrelated but probably didn't help his cause much because I genuinely couldn't tell you if he was cute enough to compensate for his personality because I'm not into that sort of thing.",
    "comments": []
}