{
    "title": "Its not a joke, but I didn't get what happened",
    "author": "OneElephant7051",
    "subreddit": "PeterExplainsTheJoke",
    "rank": 6,
    "score": 708,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 46,
    "url": "https://www.reddit.com/gallery/1je74k1",
    "id": "1je74k1",
    "selftext": "Its a wholesome comic apparently ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Make sure to check out the [pinned post on Loss](https://www.reddit.com/r/PeterExplainsTheJoke/comments/1472nhh/faq_loss/) to make sure this submission doesn't break the rule!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PeterExplainsTheJoke) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoodlingDottler",
            "body": "I think the lesson to be learned here is that we should value everyone's lives as much as we value ours",
            "score": 275,
            "replies": [
                {
                    "author": "cupholdery",
                    "body": "I'm still reeling from the panel where the mom chooses revived youth over her own child's life. You want to believe that's fiction but....",
                    "score": 94,
                    "replies": []
                },
                {
                    "author": "manicmania6",
                    "body": "I think the real lesson is that we should learn how grammar and spelling works.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "And_a_piece_of_toast",
            "body": "Ah, this made me well up a bit.\n\nThe daughter goes to wish mountain to heal her mother but realises that there's a catch with the \"payment\". E.g. the old lady sacrifices her son in exchange for her youth thinking that will make the wish last a long time but she just proves she does not place any value on her son's life.\n\nIt then cuts to some time later when the previously ill mother is now in good health but doesn't seem to recognise her daughter. Cut back to the mountain where the daughter gives payment in the form of her mother's memory of her. Something that causes the daughter permanent pain and so makes the wish last.",
            "score": 226,
            "replies": [
                {
                    "author": "OneElephant7051",
                    "body": "Oh I get it I confused the lady wishing for youth is the mother of the lady earlier.\nThanks",
                    "score": 71,
                    "replies": [
                        {
                            "author": "0000000000000007",
                            "body": "Yeah the art style was confusing and they don’t show the main characters mother at the beginning",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Nero_A",
                                    "body": "They did show the mother in the beginning, however the only real noticeable difference is the hair style. Still confusing, nonetheless.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "0000000000000007",
                                            "body": "You’re right. I missed that square.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "314159265358979326",
                    "body": "Read the comic. Didn't get it. Read your explanation. Reread the last half. Got it. Cried. It's beautiful but heartbreaking.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moistfruitcake",
            "body": "This isn't a joke, I wasn't prepared to cry today you bastard.",
            "score": 48,
            "replies": [
                {
                    "author": "Jaegerjaquez_VI",
                    "body": "Fr I thought the joke was always porn, but this is just depression",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Heezuh",
            "body": "They want to heal their mother because she's heavily sick and will die if nothing is doNe, so they find out there's a mountain that once you reach the top, You get a wish\n\nThe main character gets there and has to wait for their turn because of how many people are there (Ilustrating that everyone would want a wish)\n\nOnce the main character gets to the top, the goo genie reveals to them that the wish needs a sacrifice, and depending on the sacrifice, the wish will last longer or become more powerful depending on the wish itself\n\nBefore this we can see an example of a different mother sacrificing their child for youthness, one would consider this a big sacrifice but because of how little she cared for her own son, her wish lasts little and dies a few steps later\n\nThe main character then wishes for his mother to heal, but as a sacrifice they offer the genie to make their mother forget about the son forever, which the genie considers a huge sacrifice and thus MC's mother is instantly cured\n\nThe little flashbacks you can see between MC and MC's mother while she's out of the bed are just snippets on what happened after they made their wish (the mother not remembering them, and them being happy because their mother is now cured)",
            "score": 39,
            "replies": []
        },
        {
            "author": "Striking_Credit5088",
            "body": "Blond dude watches someone granted the wish for wings, then decides to go to wish mountain to save his dying mother.\n\nMeanwhile at wish mountain a different old lady wishes to be made young in exchange for her sons life. It works, her son dies and she becomes young again. This is a story within the story, separate from our blond dude protagonist.\n\nBlond dude wishes for his mother to be well and sacrifices his mother's memories of him in exchange. It works. She gets well but forgets about her son. Then she runs into her son who she no longer remembers, and notices his necklace. He says \"My mother gave it to me\". His mother, thinking Blond dude is talking about some other woman who is his mother, then inquires as to how his mother is doing. He replies she's doing well, not revealing that she is blond dudes mother.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Principesarei",
            "body": "The old lady is her mom. She had the other half of the necklace, but didn't know the girl, meaning erasing her mom's memory of her as a payment works",
            "score": 3,
            "replies": []
        },
        {
            "author": "Phaylz",
            "body": "Idk if it was you or the original, but there's a page out of order",
            "score": 2,
            "replies": [
                {
                    "author": "sweetish-tea",
                    "body": "No I think it’s the right order, because 13 to 14 has it transitioning to a grey background",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheMaskedHamster",
            "body": "I'd guess the part that's hard to understand is the interaction with the woman later.\n\nThe woman with the other half of the fish is the girl's mother, but her mother no longer remembers her due to her sacrifice.  But she's happy that her mother is well.\n\nI appreciate the sentiment of love for her mother, but let me say this as someone who has felt that way but is coming around the bend in age:  I would rather die than forget my child.  As precious as a parent's memory of their child is to the child, I promise that it's worth yet more than that to any good parent.",
            "score": 2,
            "replies": []
        },
        {
            "author": "StonkycadeV2",
            "body": "I find it hard to believe you actually read this and didn't understand it",
            "score": 2,
            "replies": []
        },
        {
            "author": "SypeSypher",
            "body": "no idea why everyone's comments are deleted on my screen.\n\nBut basically the girl wanted to save her mom, so she climbed the mountain, and we see that the wish-granter takes payment of something valuable to you, so the woman that sacrificed her son didn't view her son as valuable so her wish did not last very long, then our main protaganist gave up her mom's memory of her because that was something she really valued but she wanted her mom to live. Then at the end we see the mom is alive at the store wearing the other half of the necklace that the protaganist is wearing, but she doesn't recognize her daughter because she forgot as payment, the daughter is crying but she's happy because her mom is alive and doing well",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fantastic_Falcon_236",
            "body": "Hi, Dr Hartmann, Peter's doctor, here. Sure the comic looks kinda wholesome on a first reading.  However, when you think about real-life parallels, it kind of looks like the wish gave mom Alzhiemer's since she doesn't recognise her child. Let's hope it doesn't progress past memory loss.",
            "score": 4,
            "replies": [
                {
                    "author": "SnooHabits3911",
                    "body": "I didn’t get that at all",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Fantastic_Falcon_236",
                            "body": "If nobody else in the world remembers the wishmaker, then it's a Peter Parker/Spider-Man: No Way Home wish that fixes the timeline. If it's an elderly parent who's physically healthy, but can't recognise her adult child, it's Alzhiemer's. Probably not what the creator was aiming for, though.\n\nSo what this ends up being is a case of reader's experiences shaping the lens through which they see the comic. There's no absolute wrong or right here. Someone else who's also got a lot of experience working with Alzhiemer's patients might also agree that is one way you could interpret the comic. \n\nA contract lawyer might disagree with all of us and say the wish can't be legally fulfilled because the wishmaker is offering something they don't own the intellectual or creative rights (and similar being true for the woman wishing to be young again).",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Alternative_Year_340",
                                    "body": "People with Alzheimer’s aren’t healthy. They aren’t just losing memories; their brains are slowly forgetting things like how to walk, how to bathe, and eventually, the heart starts forgetting etc",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "SnooHabits3911",
                                    "body": "Just put the fries in the bag",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "avoidallauthority",
                                            "body": "holy ignorance",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SnooHabits3911",
                                                    "body": "They took the time to explain something I didn’t ask for 🤷‍♂️",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kheldarson",
            "body": "The idea is that you can have your wish granted, but it comes at a cost (like most things in life). And the length of the wish is determined by how precious the thing you sacrifice is to you. Hence the mom sacrificing her son's life for youth, and being told that her wish will be fleeting since she obviously put such a low price on her child's life.\n\nSo our main character sacrifices his mother's memories. He'll remember her, she won't remember him, and he'll have to deal with that for the rest of their shared time: a permanent repeating cost. The woman we see at the end that he talks to is his mother; she's well and healthy and doesn't remember her son at all, despite them having a shared necklace. So the kicker is that when she asks \"how's his mother\", he's crying as he looks at her (his mother), and can honestly answer that she's well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "citrusandrosemary",
            "body": "I did not expect anything that could ever be posted on this page to actually bring me to tears. I lost my mom 5 years ago and this just really hit me in the heart. For fuck's sake",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loco-Motivated",
            "body": "She left her mother so much that she he willingly chose to be a complete stranger just for her to be healthy again.\n\nIt's a doggy boat to put it simply, would you do the same?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SherbertChance8010",
            "body": "🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "manicmania6",
            "body": "Reaches*********************",
            "score": 1,
            "replies": []
        },
        {
            "author": "Virtual_Pressure_",
            "body": "1- Get to the mountain.\n2- Get express for 100 Billion.\n3- Ask for 101 Billion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IamRobbyEl",
            "body": "Dammit. This just hit me so hard, I'm sitting here crying on r/PeterExplainsTheJoke. My mom is currently hospitalized and her mind is now foggier than I've ever seen it. When she first had her stroke 5 years ago and she recovered so quickly it really shocked doctors, this time she doesn't seem to be snapping back. This comic led me to a deep, deep moment of introspection that I was completely unprepared for. Thank you, OP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legitimate_Dealer_94",
            "body": "Jesus Christ. Thanks for giving me depression",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xannith",
            "body": "It isn't a joke. It's a touching story.",
            "score": 1,
            "replies": []
        },
        {
            "author": "19ghost89",
            "body": "Others have already explained the meaning, and I will agree that it's sad and made me well up too.\n\nBut I also want to put it out there that I think it's actually pretty stupid.\n\nIt paints health and long life as ultimately more valuable than memories and time well spent.\n\nThe mother doesn't suffer because she loses her memories of her daughter. But I bet if the mother had been given the option herself to be sick and keep her memories or to be well and lose them, she'd choose the former. She had that choice taken away from her and she doesn't even know it. The daughter thinks she is being noble and unselfish, but really she has cost them both something irreplaceable. Who knows how her mother feels in this new life? She is physically well, but she has no daughter. She could very well be extremely lonely.\n\nIn her self-sacrifice, the daughter has failed to account for how much she might mean to her mother. That is a critical error. In a loving relationship, never forget that you are half of the equation.",
            "score": 1,
            "replies": [
                {
                    "author": "Casuallybittersweet",
                    "body": "That wasn't the point at all. The point was that she understood the assignment. The other woman wasn't being morally condemned by the mountain, she just didn't understand the way this was being measured. And so she got what she paid for. Something flipant, expendable and easily cast aside. A fitting product for such a cheap payment. After all, how much did she honestly care about her son's life if she's that willing to let him die for her own gain? \n\nBecause it's not about the general, more broad idea of what it's worth. It's about what it's worth to YOU. That's the point. It's not about ethics and morality. It's about what gives something it's true value",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnugglePetal",
            "body": "thats wassup hahaha",
            "score": -2,
            "replies": []
        },
        {
            "author": "CountChallis",
            "body": "The lesson is this strip is too long. Made it to page 13 before I got bored with it. Yawn.",
            "score": -9,
            "replies": [
                {
                    "author": "ducknerd2002",
                    "body": "How do you survive in day to day life when a 3 minute story is too long for you?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "CountChallis",
                            "body": "I get by fine without worthless, time wasting comic strips",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "ducknerd2002",
                                    "body": "Technically, all stories are 'worthless' and 'time-wasting'. You just seem like a miserable person.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "CountChallis",
                                            "body": "Fuck you. Because I have a different opinion I’m miserable?  News flash, not everyone in life will have your opinion. You seem like a judgmental little cunt.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "ducknerd2002",
                                                    "body": "> You seem like a judgmental little cunt.\n\nPot calling the kettle black. You're the one calling the cute short story 'worthless and time wasting' just because you have a lousy attention span.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "CountChallis",
                                                            "body": "And you’re the one obsessed with what I say. You fucking douche, get a life.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}