{
    "title": "The irony is deafening",
    "author": "ancienttribeofthesky",
    "subreddit": "Anarcho_Capitalism",
    "rank": 1,
    "score": 218,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 56,
    "url": "https://i.redd.it/zcrwq0tjinie1.jpeg",
    "id": "1inkm7c",
    "selftext": "",
    "comments": [
        {
            "author": "Fox_Mortus",
            "body": "Do they think that small business is the opposite of capitalism? These idiots seem to think that whatever corporations do is capitalism and anything that goes against corporations is anti-capitalist.",
            "score": 202,
            "replies": [
                {
                    "author": "Grouchy_Competition5",
                    "body": "Finally! Let’s defeat capitalism by selling goods in a free market at prices determined by buyers and sellers -  or by “supply” and “demand,” if you will.",
                    "score": 65,
                    "replies": []
                },
                {
                    "author": "standardcivilian",
                    "body": "The brainwashing is fully complete.",
                    "score": 64,
                    "replies": []
                },
                {
                    "author": "JewelJones2021",
                    "body": "It seems the word capitalism has a different meaning to different people. Maybe us marketists should use that word instead of capitalism, so that it is not confused with the implied definition above which resembles corporatism or corporate capitalism.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "RireBaton",
                            "body": "That's why I eschew the term capitalism in favor of \"free markets\". Capital refers to the goods and money itself, free market refers to the more important concept of the ability to voluntarily trade however you want without interference from another party.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "EconGuy82",
                                    "body": "I see a lot of leftists on Reddit who will say someone is all the way to the right on economic issues because they’re “capitalist,” which means that they support private ownership of the means of production.  Nevermind the fact that they support heavy regulation of the market restrictions on trade…",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "JewelJones2021",
                                    "body": "Yes, and there's a lot less room for misinterpretation.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "b0ltscr0ller",
                    "body": "TBD a LOT of people from all ends of the political spectrum don't understand the difference between capitalism and corporatism.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Vinylware",
                    "body": "Economic literacy was never their strong-suit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No-One9890",
                    "body": "So I believe the anti-cap part is the not price gouging. Setting prices below market value out of generosity",
                    "score": -24,
                    "replies": [
                        {
                            "author": "PitsAndPints",
                            "body": "Is that generosity? Or is it catering to an adjustment(or outright rejection) of the current market value? Anyone willing to sell below the current market value gains a competitive edge and opens themselves up to gaining otherwise-uninterested new customers\n\nAll of this is being done(it seems) without a demand for state interference from the group in OPs screenshot",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "No-One9890",
                                    "body": "Good point",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kapitaali_com",
                    "body": "going against corporations is anti-capitalist in most cases",
                    "score": -66,
                    "replies": [
                        {
                            "author": "loonygecko",
                            "body": "\"Capitalism is an economic system characterized by private ownership of the means of production..Under this system, business owners retain ownership of the goods produced.\"",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "GunkSlinger",
                                    "body": "...\"or that which they exchange them for.\" Taxation is theft.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "kapitaali_com",
                                    "body": "you sure af aren't a capitalist if you're a small business owner",
                                    "score": -43,
                                    "replies": [
                                        {
                                            "author": "GunkSlinger",
                                            "body": "I'm a small machine shop owner. I produce goods all the time. I've even produced machines that produce other goods. You have a very limited perspective on what a business is.",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "kapitaali_com",
                                                    "body": "the capital is owned by corporations (capitalists), this was the case in marx's time and nothing has changed since then",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "author": "EconGuy82",
                                                            "body": "Small business owners own capital and means of production… WTF are you talking about?",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "GunkSlinger",
                                                            "body": "LOL. Ok Kommisar.",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Secretsfrombeyond79",
                                                            "body": "Marx himself referred to small producers as Petit Bourgeoise.\n\nI know socialists won't touch a book on economics to save their lives, but for the love of god can you at least read fucking marx himself ???",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "kura44",
                                            "body": "You don’t know what capitalism is.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "kapitaali_com",
                                                    "body": "how many billions in your bank account bro?",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "kura44",
                                                            "body": "…What?",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "thermionicvalve2020",
                            "body": "Lolol",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Official_Gameoholics",
                            "body": "\"Does he know?\"",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "slowpoke_1992",
                            "body": "Bad bot",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NeoGnesiolutheraner",
            "body": "So they want to beat Government regulations by Capitalism. Has anyone told them yet?",
            "score": 82,
            "replies": [
                {
                    "author": "ThinkySushi",
                    "body": "https://preview.redd.it/5v7nf9aqipie1.png?width=720&format=png&auto=webp&s=0b0e9d69a6faf40865eb3e7946bf2ba2b42956a3",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "andyc3020",
            "body": "Let’s just let them think they’re fighting capitalism.",
            "score": 55,
            "replies": [
                {
                    "author": "loonygecko",
                    "body": "That's a good point, we could just relabel all the stuff we like with names they'll like more and they'll probably go for them.   For instance, instead of saying 'lower taxes,' let's call it, 'govt income assistance.'",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "beast_mode209",
            "body": "Whoops they just got shut down for health code violations and lack of permits 😂",
            "score": 114,
            "replies": [
                {
                    "author": "Secretsfrombeyond79",
                    "body": "They are risking the spread of diseases and encouraging tax evasion, they'd rather buy cheaper eggs than help the poor, we need a ban in assault eggs right now !!!\n\nBut seriously, it's like the USA left is slowly remembering why their party was called LIBERAL. It's funny and heartwarming in a way.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "pepe_silvia67",
                            "body": "I think we should drop a comment in the thread about banning high capacity egg cartons…",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "loonygecko",
                    "body": "IDK if you are joking or not but they could well  be.   I doubt all these people have all the million licenses and permits to sell food items.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "WendisDelivery",
                            "body": "These people have no idea what small businesses and manufacturers have to deal with.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "livinglife_part2",
                            "body": "Farmers market. I sell about 30-40 dozen eggs a week, and I'm not a commercial chicken farm, I'd need about 500-1000 chickens before USDA would require permits and really start to care.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "beast_mode209",
                            "body": "I’m joking for sure but you know that’s going to happen",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thermionicvalve2020",
            "body": "Lefties fighting the results of Democrat policies, lol.",
            "score": 34,
            "replies": [
                {
                    "author": "Secretsfrombeyond79",
                    "body": "\"Lefties fighting the results of Democrat policies, lol.\"- By doing everything they were opposed to, free market and unregulated purchase of goods. \n\nThe irony is so delicious I can't eat regular food anymore.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "eico3",
            "body": "They don’t even realize that this is the capitalism they hate so much.",
            "score": 33,
            "replies": []
        },
        {
            "author": "jazrad50pt3",
            "body": "Beat capitalism with capitalism.",
            "score": 28,
            "replies": [
                {
                    "author": "EconGuy82",
                    "body": "It’s only fair, given that the Republicans twice elected a socialist to own the libs.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unlucky-Pomegranate3",
            "body": "Apparently, capitalism is when the USDA orders a hundred million chickens slaughtered.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Ultrafisk",
            "body": "Honestly I don't care what they call it. If they implement free markets, avoid paying taxes and call it beating capitalism I won't be there to bitch about semantics.",
            "score": 23,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "Like Jefferson said: \"In matters of style, swim with the current; in matters of principle, stand like a rock.\"",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Baller-Mcfly",
            "body": "![gif](giphy|9MJ6xrgVR9aEwF8zCJ)",
            "score": 8,
            "replies": [
                {
                    "author": "vbullinger",
                    "body": "![gif](giphy|H1wPB41Fn5dfWfGxYi)",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Solinvictusbc",
            "body": "Geographical differences in prices are funny. They are wanting eggs under 6 bucks and here I am not wanting to buy at 5",
            "score": 9,
            "replies": [
                {
                    "author": "RireBaton",
                    "body": "My thought exactly. I've never spent that much for eggs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "j0oboi",
            "body": "We’ll use capitalism to defeat capitalism!!!!",
            "score": 8,
            "replies": []
        },
        {
            "author": "WeedRambo",
            "body": "Hahahahahaha \"let's use capitalism, that'll help us overcome capitalism.\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rogue-Telvanni",
            "body": "My god, they're SO CLOSE.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shoot_2_Thrill",
            "body": "TIL that the market rushing to meet demand by following high-price signals is… checking notes… defeating capitalism\n\nShortages lead to high prices. High prices lead to increased production. Increased production leads to price and supply stability. Wasn’t this literally day one of Econ 101??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Great_Opinion3138",
            "body": "How do ppl not get that price is literally the fucking signal the whole way through the supply chain from supplier to purchaser. It allows efficient allocation of resources to those who gain the most value. Basic economics by Thomas sowell should  be essential reading in school and colleges would help solve so many problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tertinian",
            "body": "Capitalism defines the relationship between people with access to capital and those without, and the power dynamic between those two groups.\n\nFree-Market is not synonimous with Capitalism or the other way around.\n\nYou can have Capitalism without free-market, take Fascist Economies where private ownership isnretained, but the state imposes prices, wages and production goals, thus taking control of the markets. E.g. Nazi Germany.\n\nSame way you can have Free-Market Socialism, e.g. Slovenia during the Cold War.",
            "score": 1,
            "replies": []
        }
    ]
}