{
    "title": "Whitehouse Weaponized DOJ",
    "author": "Historical_Arm_5165",
    "subreddit": "Anarcho_Capitalism",
    "rank": 2,
    "score": 53,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 26,
    "url": "https://www.reddit.com/gallery/1inr3ri",
    "id": "1inr3ri",
    "selftext": "This leaves it fair game for the other side or should the other side just turn the other cheek?",
    "comments": [
        {
            "author": "blackie___chan",
            "body": "It's the boondocks conundrum: is it ok to snitch to the police, on the police? \n\nThe answer is yes. Real world material losses is the only way out. Of all the Judeo-Christian values that will ultimately sink the West it's the over application of 'turn the other cheek'. There is no benevolent benefactor. If you do not secure your rights against tyranny, no one will.",
            "score": 22,
            "replies": [
                {
                    "author": "Intelligent-End7336",
                    "body": "> Of all the Judeo-Christian values that will ultimately sink the West it's the over application of 'turn the other cheek'.\n\nTurning the other cheek wasn't pacifism, it was a subtle act of defiance as it forced the aggressor to either escalate (acknowledging you as an equal) or back down.  Of course, that doesn't work when the other side doesn't care about honor to begin with.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "blackie___chan",
                            "body": "Or care at all because they only covet and recognize power and hierarchy derived from power. The only correct action Republicans have done in recent years was expand the removal of the filibuster for judges. It's never materially expanded since, not for the left not trying, primarily for this reason.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WadeBronson",
                    "body": "Tit for tat theory. Agreed.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "blackie___chan",
                            "body": "Ok an individual level, between rational human beings, I agree with the concept that in a world that practices an eye-for-eye that humans will never see opportunity because everyone is blind. \n\nGovernment, especially in a republic, is not individuals. It is aggregations of people. The turn the other cheek concept isn't even applicable. It's a disingenuous approach by godless people who only worship at the altar of subjugating others to get the other side to unilaterally disarm. \n\nIf I have to play the government game then I choose to elect warriors that will fight against the internal lust for power that is the essence of government over a coward that rolls over on inapplicable principles so they can grift without the media being mean to them.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": ">  Of all the Judeo-Christian values that will ultimately sink the West it's the over application of 'turn the other cheek'.\n\nNote that this is particular to Christianity, and is [not a *Judeo*-Christian value](https://www.chabad.org/library/article_cdo/aid/1791975/jewish/Is-Turning-the-Other-Cheek-a-Jewish-Value.htm).",
                    "score": 0,
                    "replies": [
                        {
                            "author": "CarTar98",
                            "body": "Actually a significant point.\n\n\nIf Jews believed in turn the other cheek as well as other teachings of non-violence from Jesus, they would never have been the fucking bullies that they are in the Middle East.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "blackie___chan",
                            "body": "True. Good correction. Thanks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Celtictussle",
            "body": "Can someone summarize for me? Maybe I’m too tired to see the connection.",
            "score": 8,
            "replies": [
                {
                    "author": "bongobutt",
                    "body": "Seconding the request.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Midnight-Bake",
            "body": "The only responsible action is to create barriers so the DOJ cannot be weaponized by the next president.\n\n\nSaying \"it's my turn to be a tyrrant\" is only a step away from actual liberterian solutions.",
            "score": 4,
            "replies": [
                {
                    "author": "Wrathofsteel",
                    "body": "My thoughts exactly, the most libriaterian first action move going into office would be dismantling the nsa, irs and cia.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-One9890",
            "body": "Well ya, the issue is the difference in treatment between trump, biden, and Obama who all had \"misplaced\" classified documents.\nWe alrdy had proof it was weaponization. All 3 should have gone to prison",
            "score": 5,
            "replies": []
        },
        {
            "author": "Will-Forget-Password",
            "body": "Category 5 consisted of any NARA inventory pertaining to the contents of the boxes. These records are being withheld in full.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bongobutt",
            "body": "Fun aside about turning the other cheek:  \n  \nI've heard it argued by a scholar that the \"turning the other cheek\" story is misunderstood.  \n  \n> Matthew 5:38-42 - You have heard that it was said, ‘An eye for an eye and a tooth for a tooth.’ But I say to you, Do not resist the one who is evil. But if anyone slaps you on the right cheek, turn to him the other also. And if anyone would sue you and take your tunic, let him have your cloak as well. And if anyone forces you to go one mile, go with him two miles. Give to the one who begs from you, and do not refuse the one who would borrow from you.  \n  \nIt is obvious that Jesus is arguing for a non-violent form of resistance. \"Kill 'em with kindness,\" if you will.  \n  \nBut it isn't a good understanding to say Jesus is advocating \"rolling over\" when people bully you.  \n  \nUsing the mile example. Roman law said that a soldier on a road had the right to demand free labor from anyone, and force a civilian to carry his bags for up to a mile. So by \"volunteering\" to walk 2 miles, what are you doing? You are making it appear as though the soldier is breaking the law. The soldier is only allowed to force you to go 1 mile, and if he says, \"but the guy *volunteered* to go two miles!\" - no one will believe him. So you are going to get that guy in trouble. And the Romans were not *kind* when disciplining their soldiers.  \n  \nAnd the cheek example: note that it said slapped on your \"right\" cheek. Then offer the other. In other words:  \n\"Ohh. You just hit me with your left hand. That's your weak hand. *Give me a real hit.*\"  \n  \nIn other words, if you understand the context of the society they lived in, most of these things Jesus is calling for is begging for the other person to break the law. This is a call for a stiff spine and just defiance. It is saying not to retaliate, yes, but it is doing so in a way that is even more damaging to your \"enemy\" than hitting back would be.  \n  \nSo yeah. I advocate turning the cheek.",
            "score": 2,
            "replies": [
                {
                    "author": "bluefootedpig",
                    "body": "The context is that Jesus was explaining that we are not of this world, our treasure is up in heaven. So fighting evil here is pointless. \n\nIn your quote, it says \"do not resist evil\", your volunteering to make him look bad would be resisting evil.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thelonioussphere",
            "body": "I don’t believe in turning the other cheek on almost any matter",
            "score": 4,
            "replies": []
        },
        {
            "author": "Savant_Guarde",
            "body": "If you were to remove Trump's name from any of the narratives and insert anyone else, even Trump’s most ardent enemies would say it was political persecution. \n\nOf course this was weaponization, easy to see.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GunkSlinger",
            "body": "With all the craziness going on I'd almost forgotten about all the classified documents Biden stored in his garage. I wonder if the Trump admin will prosecute him over that. My own stance would be to be above doing that.",
            "score": 1,
            "replies": [
                {
                    "author": "helmutboy",
                    "body": "That was already decided by the Special Council appointed by the Biden administration who determined that Biden two years ago was too feeble to stand trial (let alone be president), something at least half the country knew 4+ years ago.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "orwll",
                            "body": "I was just thinking about that the other day. I wonder when we're going to hear the recording of Biden's deposition in that case.\n\nIf (when) we find out the recording doesn't match the transcript, that's when things could get interesting.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Scipio_Columbia",
                            "body": "Close, but actually very different from what you said. The prosecutor said he thought Biden was fit to stand trial, but that he would use the idea that he was a tottering old man to his benefit such that no case should be pressed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "XDingoX83",
                    "body": "I would charge the investigators and staff who knowingly prosecuted a non case for political reasons. This isn't just Trump, more prosecutors should be charged with crimes when they knowingly go after innocent people because they want a conviction. When they withhold exculpatory evidence because their career matters more than the truth. That is one of the primary issues with the criminal justice system. The state has unlimited funds and power to contort the evidence against you with no ramifications. If prosecutors were personally liable for their actions more they would be far more likely to be fair in their prosecutions.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "OSHAstandard",
                    "body": "Didn’t biden find the documents and turn them in and fully cooperate vs trump who refused to return. Then he and his lawyer drafted up a letter swearing that he turned everything over after giving some things back and then he had someone move the rest of the documents and then he got raided and they found the rest. Same same",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Will-Forget-Password",
                            "body": "\\*cough\\* Mike Pence \\*cough\\*",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GunkSlinger",
                    "body": "This also begs the question (colloquially), can a president preemptively pardon *themselves?*",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}