{
    "title": "Meet the second redbull seat",
    "author": "ninkcantdraw",
    "subreddit": "formuladank",
    "rank": 1,
    "score": 996,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 37,
    "url": "https://i.redd.it/90810c2lmsoe1.jpeg",
    "id": "1jbok6e",
    "selftext": "",
    "comments": [
        {
            "author": "DuckSwagington",
            "body": "We all know the real racing is against the Saubers and Haas'",
            "score": 109,
            "replies": []
        },
        {
            "author": "Mindaim",
            "body": "Good thing they did not put Yuki yet.",
            "score": 72,
            "replies": [
                {
                    "author": "Admirable-Design-151",
                    "body": "I honestly think any driver would fail in that seat at this point",
                    "score": 50,
                    "replies": [
                        {
                            "author": "prontoingHorse",
                            "body": "Put the original Golden Boy in that second seat or Daniel.\n\nI'm mean hell how worse could Dany do? At least he'd bring in the sponsorships, unlike Liam and unlike Checo the car won't be in pieces even if he ended up at p20.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Admirable-Design-151",
                                    "body": "Daniel isn't his 2020 self anymore, he'd probably do as poorly in that seat as Checo, even Yuki I don't think would adjust, and its not Liam's fault, its RedBulls fault, they do not understand how to handle the second driver in their team, clearly, at this point, RedBull would probably be better if they just had Max",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "quintinza",
                                            "body": "> ...at this point, RedBull would probably be better if they just had Max\n\n\n_IF!?_",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Admirable-Design-151",
                                                    "body": "yeah, because at least with just Max, there isn't a second car to be crashed",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GordoPepe",
                                            "body": "Not sure why he's even still being discussed. Ric did poorly over VCARB he'd absolutely crumble on the RB. His confidence is just gone in fact he took the RB19 for a spin end of 2023, literally did spin a few times. Yuki should have given that seat instead of Lawson but I guess I'd rather Lawson have his Icarus moment than Yuki",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "raittiussihteeri",
                                                    "body": "Yeah man the spin on a damp track was such a big hit on his confidence that he ended up.. performing well in that test? lol what",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "kittenbloc",
                                            "body": "no, because who would they use as their guinea pig for terrible offsetting strats?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "randy24681012",
                                    "body": "We still got ricc stans in 2025?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MagentaBucks",
                                            "body": "Always",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Berry_Sauce",
                                            "body": "In Ricc we trust",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Subtle_Tact",
                                    "body": "For people that claim to love his smile, you all keep gunning for his tears.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dngleberry_hndpmp",
                    "body": "Actually Hadjar is next in line.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "imdeadinsidelmao420",
            "body": "HOLY FUCK THIS IS SO GOOD",
            "score": 94,
            "replies": []
        },
        {
            "author": "Hari1503",
            "body": "4 WDC, 5 destroyed careers is cold af.",
            "score": 27,
            "replies": []
        },
        {
            "author": "Karmyuh",
            "body": "https://preview.redd.it/dejs2mxvosoe1.jpeg?width=358&format=pjpg&auto=webp&s=ecc833de51d6f9edf9683aa3fba64b87742044fb",
            "score": 46,
            "replies": [
                {
                    "author": "Little-Particular450",
                    "body": "If it's spoken it's slander. This is text so it's Libel",
                    "score": 3,
                    "replies": [
                        {
                            "author": "RedditerYouDontKnow",
                            "body": "Ok J. Jonah Jameson",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "quintinza",
            "body": "Watching the quali today I thought \"Max is looking ominously good already.\"\n\n\nSeeing how Liam also struggled with getting that car out of Q1 I honestly believe Max is just so much better than everyone else at this moment that it is not even close.\n\n\nSomething really makes that car hard to drive, there is no way that Lawson is so much worse than both Racing Bull drivers. The car is just a fast handfull and Max somehow wrestles it into submission.\n\n\nIt's like that crazy headstrong horse that can only be handled by certain jockeys, and when that horse clicks with a jockey it's just magic. Any other jockey ends up in the weeds, this guy ends up on the winners rostrum kissing the trophy.",
            "score": 60,
            "replies": [
                {
                    "author": "lummloser",
                    "body": "Sure, that may be true now, but considering how badly Max struggled last year mid to late season I wouldn't be surprised if that horse once again started turning on him.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "PotroastXII",
                    "body": "This us true, Albon discussed it in an interview where the car is extremely sensitive, but Max is able to and prefers the car being that sensitive while with other drivers it makes you tense up and cause you to drive slower",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "9iaguaro",
            "body": "It’s usually more than 7 q1 exists. Should’ve put 7 points contribution to WCC",
            "score": 13,
            "replies": []
        },
        {
            "author": "Thats_absrd",
            "body": "The Metallica reference is perfection",
            "score": 11,
            "replies": [
                {
                    "author": "karl1ok",
                    "body": "Peak \"Gimme fue, gimme fie, gimme dzjabadzjaba da\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Additional_Signal507",
            "body": "I think they fuel the second redbull with turpentine and yak milk. either that or it's been hexed by daniil kvyat after max stole his girl",
            "score": 8,
            "replies": [
                {
                    "author": "HowNondescript",
                    "body": "Max's firstborn is containing the curse till they turn 18. Max will be the apex rookie",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SorceryScout",
            "body": "The dude with actual meme making skill and humor",
            "score": 5,
            "replies": [
                {
                    "author": "Minigrappler",
                    "body": "I thought that this sub was only for low effort shit",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "akgis",
            "body": "Iam a fan of Yuki too but lol RIPing Lawson so soon is 3 degrees of salt",
            "score": 3,
            "replies": []
        },
        {
            "author": "magicthunderlemon",
            "body": "Danny Ric did say the second seat was cursed before he left, think he might of been onto something",
            "score": 3,
            "replies": []
        },
        {
            "author": "SlayerBVC",
            "body": "Rumor has it that Lindblad might be in the seat by Interlagos.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lummloser",
            "body": "At this point I think Red Bull purposefully builds their cars so only Max can drive them and that's it. Lawson is just a phantom limb to them that they're vaguely aware of but doesn't exist when they look at it directly.",
            "score": 1,
            "replies": [
                {
                    "author": "XmenSlayer",
                    "body": "If we go by other drivers account it just seems the car fundamentally is just hard to drive compared to the rest of the grid it seems(maybe only sauber is worse to just being a steamroller with a f1 engine). But i just hope one if those rookies can pick up the mantle in time within RB or they will face being ejected out of the top 4 when max leaves.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "DiscombobulatedSwing",
                            "body": "From what I read the red bull car is more set up towards the theoretical maximum performance from sims and the wind tunnel, but ofc drivers aren’t going to be perfect and driving on those set ups are extremely difficult because they aren’t adapted to driving styles (aside from max). Max is one of the drivers on the grid that could probably get the closest the theoretical maximum despite the challenges.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "XmenSlayer",
                                    "body": "Yea, thats what i personally gather as well from it all. \nSeems tho it is still quite quick if you can tame the Bull...",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}