{
    "title": "to say you were following the peace deal",
    "author": "Sc_e1",
    "subreddit": "therewasanattempt",
    "rank": 9,
    "score": 2989,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 69,
    "url": "https://i.redd.it/u234rkg8aepe1.jpeg",
    "id": "1jdyz2n",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Welcome to r/Therewasanattempt!\n\n#Consider visiting r/Worldnewsvideo for videos from around the world!\n\n[Please review our policy on bigotry and hate speech by clicking this link](https://www.reddit.com/r/therewasanattempt/wiki/civility)\n\n\nIn order to view our rules, you can type \"**!rules**\" in any comment, and automod will respond with the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therewasanattempt) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JAYTEE__66",
            "body": "The same kind of peace-deal that Trump and Putin will agree upon.",
            "score": 161,
            "replies": [
                {
                    "author": "warpentake_chiasmus",
                    "body": "The worst atrocities happened under Biden.\n\nWhen it comes to Isrl, it doesn't matter who the president is, the US policy is the same, I.e., arm them to the teeth.",
                    "score": -76,
                    "replies": [
                        {
                            "author": "Administrative-Ad970",
                            "body": "Good luck with this opinion here. The same shit happened under biden but somehow this will all be trumps fault. These people are fucking deranged.",
                            "score": -63,
                            "replies": [
                                {
                                    "author": "warpentake_chiasmus",
                                    "body": "I'm not even from the US. When it comes to Isrl, The rest of the world isn't fooled by the Biden=good/Trump=bad fairy tale. Both are heavily in favour of business as usual as regards the Middle East.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "Administrative-Ad970",
                                            "body": "I can't remember any administration that openly opposed israel in the us. Like you said, they all seem to be in support with everything over there staying exactly the same.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "___Cyanide___",
                                                    "body": "JFK did propose to list AIPAC as a foreign entity (honestly why are they NOT foreign they literally have the word “Israel” in its name) but something bad happened to him after that.",
                                                    "score": 13,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Stubbs94",
                                                    "body": "Honestly, and it's sickening to even say... The last US administration that properly pushed back against Israel was Reagan....",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Ok_Savings6233",
                                                    "body": "eisenhower did.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kurtist04",
                                    "body": "Which is part of why we have Trump. People sat out of the election bc they were protesting Biden.\n\nI don't know why you're pretending they were ok with it when Biden did it, when there have been huge protests this entire time.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Toa_Firox",
                                    "body": "Oh, I'm sooo sorry that pointing out how one of these is the worst of two evils is apparently deranged to say.\n\nNobody is saying Biden was good, he was 100% complicit in genocide, but it's dumb ass opinions of saying blaming Trump is pointless since Biden did it that led to low voter turn out. Yes they both do it, but jesus fuck Trump does it with so much more malicious enthusiasm and that should rightly so be pointed out!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "___Cyanide___",
            "body": "“Hamas-run”\n\nWestern propaganda still running on full steam eh?",
            "score": 602,
            "replies": [
                {
                    "author": "ObvAnonym",
                    "body": "I mean, look at her. A pink flip-flop wearing, spider-man fan, little terrorist if I ever saw one. \n\n/s cause we live in the stupid timeline.",
                    "score": 235,
                    "replies": [
                        {
                            "author": "LoverOfLag",
                            "body": "Yeah, but it's Miles Morales Spider-Man, so it must be DEI!!!",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "___Cyanide___",
                            "body": "Yes! What a dangerous and deadly terrorist she is!",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "warpentake_chiasmus",
                    "body": "'Targets' were bombed. I.E., women and children.\n\nThe genocide never stopped - all through this 'ceasefire'.",
                    "score": 51,
                    "replies": []
                },
                {
                    "author": "HourEast5496",
                    "body": "Zionist-run BBC always uses manipulative language.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Luc2992",
                    "body": "thought the same thing. as if to plant the idea that it must be an exaggerated number because provided by hamas...\n\nunbelievable",
                    "score": 28,
                    "replies": [
                        {
                            "author": "platp",
                            "body": "Yes. If they ever wanted to inform their audience, they would point out in the past, after every massacre by Israel, everyone including Israel agreed Hamas' numbers are at least 85-90% accurate.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarlonShakespeare2AD",
                    "body": "It’s very very sad\n\nFuck all terrorists of course\n\nBut innocents are dying. Children.\n\nHorrific.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "warpentake_chiasmus",
                            "body": "Repeat after me. They're not 'dying'.They are being murdered and slaughtered in a genocide.",
                            "score": 72,
                            "replies": []
                        },
                        {
                            "author": "___Cyanide___",
                            "body": "Yes fuck all the zionist genociders.",
                            "score": 26,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lawls91",
                    "body": "They don't call it a final solution for nothing.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "l2ewdAwakening",
            "body": "Has to be a Guinness world record, for war crimes in the shortest amount of time...",
            "score": 305,
            "replies": [
                {
                    "author": "Gurkenlos",
                    "body": "Well, with trump in 100% support of Israel, they can go faster now with the genocide.",
                    "score": 109,
                    "replies": [
                        {
                            "author": "Administrative-Ad970",
                            "body": "I'm sorry, was biden not in full fucking support of israel? This entire war was allowed, and not even attempted to be stopped under biden. Holding trump accountable for this is crazy work.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "PrincessPlusUltra",
                                    "body": "Okay but now Trump is in charge and is supporting them even more. Trump is fully responsible.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Gurkenlos",
                                    "body": "I think biden would have done something if Isreal would do it faster (as in like send a little bit less weapons). I think Isreal was doing this genocide slower as they could, so they won't lose support from USA Germany and so on. I think now Isreal can make it faster because they won't fear any repercussions.\n\nKeep in mind I don't think the USA would have stopped it. i don't think biden trump or kamala would have done something to stop it. In fact, they all are in support of the genocide/Isreal. My hope is that it would be as slow as possible till something/someone would say enough hamas is defeated or shit like that, and Isreal would go back to being an apartheid stated. There is sadly, in my opinion, only the option going from hell to shit.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Administrative-Ad970",
                                            "body": "Exactly. Israel must have something real juicy on the ruling class of this country. It's the only thing that makes sense.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Administrative-Ad970",
                                                    "body": "No. As much as i believe the people of Palestine should have their sovereignty, hamas is a terrorist org plain and simple.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "___Cyanide___",
                                                            "body": "And why is that?",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Administrative-Ad970",
                                                                    "body": "Now that's a great question. I love my country but Definitely don't think the usa has ever been the good guys. It's all perspective i guess.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bitch-in-real-life",
                                    "body": "We unfortunately are legally tied to Israel and have to give them aid. I don't think any president really has a say in it, unfortunately. I also am not fully aware of what our legal obligations are so if anyone can correct me, please do.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "deprivedgolem",
                                    "body": "No this person loves killing an expelling Arabs slowly as opposed to quickly. Apparently, the guy who drowns people is worse than the one who strangles them",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Lucas926675",
                            "body": "They must have the cards…",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DevelopmentOk9942",
            "body": "Peace is coming after they have created\nGerman Lebensraum, \"living space\"  for new Israeli settlers.",
            "score": 30,
            "replies": [
                {
                    "author": "MuricasOneBrainCell",
                    "body": "I'm just praying that Israeli arrogance gets to the point where they outright attack an Arab power like the Saudis. I think the Arab nations would not let that slide.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "___Cyanide___",
                            "body": "Syria be like:",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "MuricasOneBrainCell",
                                    "body": "Are you claiming that Syria is an Arab power?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "___Cyanide___",
                                            "body": "Used to be. They had a lot of Russian and Iranian weapons. Until the Zionists came.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "platp",
                                                    "body": "The Syrians took back power from Iran and Russia backed minority dictator Assad. I have to correct you there. Now the zionists attack Syrians as they never attacked Assad regime because it was preventing the real people of Syria gaining power.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "The_F_B_I",
            "body": "\"Yes, peace deal\" \n\n\"Oops I mean piece deal, as in we put everyone into pieces\"",
            "score": 66,
            "replies": []
        },
        {
            "author": "tistisblitskits",
            "body": "https://preview.redd.it/eojftlefyepe1.png?width=960&format=png&auto=webp&s=b2f5363118980911762c5d539189b6466dfa32f3\n\nThis is what the times of israel has to say about the attack.",
            "score": 55,
            "replies": [
                {
                    "author": "MuricasOneBrainCell",
                    "body": "These fucking savages have how many Palestinians hostages held without proper charge or trial? \n\nThe news media calls them prisoners. They're not. They're hostages.\n\nIsrael says the strike is in response to hamas refusing to give back hostages. Whilst refusing to give Palestinian hostages back. There's a reason when the hostage exchange was happening. Israel would give back a larger number than Hamas. Because they had wayyyyyy more hostages in total.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "just_nobodys_opinion",
                            "body": "And they consider Israeli lives worth more than Palestinian lives.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "platp",
                                    "body": "I have said this before. If there is a hostage situation, most of it is Palestinian hostages Israel abducted from their homes and their land. And not relatively small amount of Israeli hostages Palestinians took to free their own in exchange.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Usernameoverloaded",
                    "body": "Lying for the apartheid fascist state as always",
                    "score": 39,
                    "replies": []
                }
            ]
        },
        {
            "author": "justicewarrior357",
            "body": "The world is cooked, the US will raid and siphon the globe’s wealth for the global bankers and enslave us all,",
            "score": 13,
            "replies": []
        },
        {
            "author": "DZT99",
            "body": "They already used the attack and the hostages to justify the absolute destruction of a nation. They will continue to use the hostages to their advantage, that's the type of government they have.\n\nWhat's curious is that the isreali government is also infected by religious extremists. \n\nThe response to the attack was always going to be disproportionate. The government was waiting for an excuse and they got it.\n\nIt's sad because the isreali government is an insult to their God, an insult to isreali people that always wanted peace and an insult to their ancestors.\n\nKilling children almost every single day and yet they continue. It's beyond barbaric.",
            "score": 11,
            "replies": []
        },
        {
            "author": "antoniamabee",
            "body": "BBC now reporting over 400",
            "score": 11,
            "replies": [
                {
                    "author": "Sc_e1",
                    "body": "Reuters as well",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "25electrons",
            "body": "Israel is butchering children by the hundreds. Speak out against this genocide!",
            "score": 9,
            "replies": []
        },
        {
            "author": "Impossible_Secret649",
            "body": "They just want a new beach",
            "score": 8,
            "replies": []
        },
        {
            "author": "chubs66",
            "body": "I am so sick and angry at this assault on people who have already have nothing but ashes and nightmares. This must stop.",
            "score": 5,
            "replies": []
        },
        {
            "author": "chiquinho61",
            "body": "The new Nazis are everywhere",
            "score": 5,
            "replies": []
        },
        {
            "author": "Monobluemagic",
            "body": "They call US before this",
            "score": 3,
            "replies": []
        },
        {
            "author": "MCMXCIV9",
            "body": "Trustworthy does not exist in the Zionist dictionary",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -9,
            "replies": [
                {
                    "author": "platp",
                    "body": "> Hamas IS a terrorist organization not a “resistance group” What is the main goal of Hamas ? To destroy Israel and wipe its people off this planet.\n\nIOF is a terrorist organization and Israel is a terror nation. Israel will not stop until every native in the land is genocided. That includes people of Jordan and Syria and Egypt. And what then? Will their bloodthirst stop? I really doubt the colonizers will one day say, we have enough, let others live. They will always want more because that is what colonizers do.\n\nThe colonizers, the terrorists, the genociders have to be defeated!",
                    "score": 5,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "platp",
                                    "body": "They did not have to fight for their lives in any Arab nation until they started the Nakba. And even then, Mossad had to intervene and do false attacks against them.\n\nAnyway you are either misinformed (which I doubt) or very very disingenous. They have already colonized parts of Syria and they always show maps depicting where they want to colonize. They argue frequently that Jordan is part of Palestine and therefore theirs. And you knwo the reality of them already colonizing peoples land and still colonizing Palestinian land more and more every single day shows they are there for colonization and not peace. They are there to replace the natives. They will not stop even if they completely replace the natives of one country.\n\n> What the hell else do you expect them to do beside defend the current home ?\n\nGo back to where they came from? Almost all of them are welcome in USA and other European countries. They choose to stay in the colonized land. They choose to be in a colonizer nation. They choose to be a part of genocide.\n\nAnd why the hell do we have to care about what happens to colonizers and genociders? Why do we have to think about their accomodation? They should first be defeated. Then we can talk about how they should continue.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "platp",
                                                    "body": "Zionism is an ideology founded in the late 19th century with the goal of colonizing some place and replacing the natives of that place. Later they decided Palestine is the best place for colonization. In zionist congress of 1897 they called themselves \"colonists in Palestine\". They have migrated there with the goal of colonization when Palestine was occupied by the British. They have said Palestine was \"a land without people\". And they finally colonized parts of it. To this day, they still take more and more of Palestinian land. They still expell Palestinians from their land. And now they are on a genoicde phase. Why would you doubt they are colonizers? They were proud to be colonizers until the term started having a bad meaning in peoples mind.\n\nIn the last few months, they invaded more of Syrian land. And they have been inaving parts of Syria for decades and have built colonies on it. Why would you deny that Israel took parts of Syria?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "platp",
                                                                    "body": "> it seems initially the history was that the British and ottoman had the Jews immigrating there to live alongside the Palestinians initially.\n\nYou are reading zionist rewritten history. I told you that zionists in zionist congress 1897 called themselves \"colonists in Palestine\". Can you say that this is not true and if this is true that you will believe they are colonizers who chose to colonize Palestine in order to replace its people?\n\nI will not waste anymore time trying to teach you history and reality while you tell me provide proof again and again. Educate yourself and do not join the colonist genociders. This is not something any person should do. You don't even know Syria is being invaded even more by Israel? Try getting your information outside genocide media then.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "wiredallwrong",
            "body": "Of course peace would be the option but I wonder if death is better. I can’t begin to imagine the images in their head, fear and lack of food, sleep and basic human needs.",
            "score": -13,
            "replies": []
        }
    ]
}