{
    "title": "To have freedom of speech without foreign intervention",
    "author": "Particular_Log_3594",
    "subreddit": "therewasanattempt",
    "rank": 16,
    "score": 187,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 8,
    "url": "https://v.redd.it/keawcipibgpe1",
    "id": "1je55d4",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Welcome to r/Therewasanattempt!\n\n#Consider visiting r/Worldnewsvideo for videos from around the world!\n\n[Please review our policy on bigotry and hate speech by clicking this link](https://www.reddit.com/r/therewasanattempt/wiki/civility)\n\n\nIn order to view our rules, you can type \"**!rules**\" in any comment, and automod will respond with the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therewasanattempt) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoadandHardtail",
            "body": "“Russian asset theory,”while plausible, is actually just a distraction from a much more serious threat arising from the fact that all branches of government are bought by Israeli special interests.",
            "score": 20,
            "replies": []
        },
        {
            "author": "_el_duderino_87",
            "body": "Say it louder for the folks in the back, John!",
            "score": 11,
            "replies": []
        },
        {
            "author": "catharsisdusk",
            "body": "I got an erroneous 3-Day Reddit ban under Rule 1 for suggesting Pro Palestinian protestors change up their tactics. I appealed it, and the ban was removed after a day and a half.",
            "score": 4,
            "replies": []
        },
        {
            "author": "killians1978",
            "body": "Imagine fighting to overcome all the antisemitic rhetoric in the 1800s and 1900s about Jews influencing the media and government, just to have the government that claims to represent your heritage weaponize exactly those same tools to cloak its atrocities in your name. How are more Jews not absolutely livid about this?",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheMichevious",
            "body": "Is the dude on the left using a green screen or something?",
            "score": 1,
            "replies": []
        },
        {
            "author": "culturetears",
            "body": "Who wants to watch their entire life burn down to the ground for being one of 15 people willing to speak up against one of the most obvious yet powerful open conspiracies against reality? No one. It's an impossible battle cause they've got the western governments, media and corporates on lock.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Carrots_and_Bleach",
            "body": "The main threat to a free discourse in america is its illiteracy. \n\n\n50% can only read badly, of wich \n40% are practically illiterate.\n\n\nCouple this with a egocentric society and why would anyone put in the effort to expand their views and knowledge?\nWhy would someone invest their time to be proven wrong?\nWhy would you look beyond those convenient sources of information, wich present it simplified and in black-or-white?\n\n\nIt remains, democracy is needs a strong society. A bunch of egomaniacs make for a poor, impulsive society.",
            "score": 0,
            "replies": []
        }
    ]
}