{
    "title": "CMV: (Canada) liberals suddenly adopting a widely popular conservative policy is not an “own the conservatives” moment",
    "author": "IncidentHead8129",
    "subreddit": "changemyview",
    "rank": 9,
    "score": 56,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 88,
    "url": "https://www.reddit.com/r/changemyview/comments/1je6ain/cmv_canada_liberals_suddenly_adopting_a_widely/",
    "id": "1je6ain",
    "selftext": "I was gonna vote liberal anyways, but recently I see a sentiment online that I strongly disagree with.\n\n“Axe the carbon tax”had been what the Conservative Party had been campaigning on for quite a while, and if I’m not mistaken, a pretty popular policy too. After Mark Carney announced that he will be removing the carbon tax, aka doing exactly what the conservatives had proposed to do and criticized the liberals for not doing, people started acting like “liberals DESTROYED conservatives” and “conservatives will lose their minds”.\n\nI disagree. Doing the best for the country and changing policies to fit what the citizens need is always what the politicians should do. If the conservatives proposed a change that’s popular, and the liberals adopted it: great! That’s a good platform for the two parties to collaborate on or at least see eye to eye on.\n\nBut that’s not what’s happening. People are acting like their tribe successfully infiltrated an enemy tribe and stole their tribal treasure with no repercussions.\n\nIf there’s any negative feelings about this situation, it can only be, “oh, liberals had no choice but to shift a bit more to the right to try and gather more voters. Let’s hope they will actually be more popular than before, unlike what happened to our neighbour down south”. Not “ha, the conservatives are utterly disabled and useless after we took over their most popular policy!”\n\nTo summarize: I don’t think the Canada liberals adopting the widely popular anti-carbon tax stance of the conservatives is, or should be, a “conservatives get owned” moment.",
    "comments": [
        {
            "author": "DeltaBot",
            "body": "/u/IncidentHead8129 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/1je7jo3/deltas_awarded_in_cmv_canada_liberals_suddenly/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "score": 1,
            "replies": []
        },
        {
            "author": "gijoe1971",
            "body": "He's dropping the consumer carbon tax not the corporate carbon tax, which is infuriating the conservatives, because it still makes the corporations accountable but takes the pressure off consumers. And he's using the corporate carbon tax to invest in carbon capture and green infrastructure. None of this is what the conservatives want. So he's not adopting a conservative policy at all. \nRead his actual platform here: \n\nhttps://markcarney.ca/media/2025/01/mark-carney-presents-plan-for-change-on-consumer-carbon-tax",
            "score": 1,
            "replies": [
                {
                    "author": "Alternative_Pin_7551",
                    "body": "The Conservative counterargument is that the corporations just pass on the cost to consumers, so we still get affected",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jfleury440",
                            "body": "From what I understand the corporate part is a trade requirement so if we don't have it other countries will just tack it on.\n\n\nAs far as consumers being affected. Yeah, but that's sort of the point. Make polluting things slightly more expensive to encourage less polluting things. Use the generated money for cleaning up the pollution. It also pushes companies to do less polluting things because it will make their margins better. Try to leave our kids with something.\n\n\nIf you want to attack it I would go after the whole double bureaucracy of it. The government spends a ton of money subsidizing fossil fuels to make them cheap just to turn around and add fees to make it more expensive. Why not just lower the subsidies. But then we get back to the whole trade thing. This seems to be what Countries decided to do.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Alternative_Pin_7551",
                                    "body": "I actually liked the consumer carbon tax model with the carbon tax rebate a lot. I don’t think we should have gotten rid of it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jfleury440",
                                            "body": "Unfortunately the conservatives put a lot of time and effort into turning the carbon tax into political poison.\n\n\nIn the end there are other ways to deal with the issue that should be effective. Carney is going to have to go down a different path.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Alternative_Pin_7551",
                                    "body": "And to clarify I support the industrial carbon tax. I was just saying what the Conservative counter argument is",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheOneWithThePorn12",
                    "body": "The funniest thing I heard on the news yesterday was Polievere calling it a shadow carbon tax. I cringed hearing that. They really and truly have nothing else to campaign on. Even the ads on TV still say Carbon Tax Carney. Like OP has to consider his has completely ruined the Conservatives campaign.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Alternative_Pin_7551",
                    "body": "And to clarify I support the consumer carbon tax and I’m aware of the carbon tax rebate",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SK_socialist",
                    "body": "Carbon capture is absolutely what conservatives want. Brad Wall, patron saint of cruel greedy dipshits, famously chose for Saskatchewan to build carbon capture at a coal plant using public money. Their plan from the start was to sell co2 to oil companies for enhanced oil recovery (getting an extra 20% of oil out of the ground).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MarcelleHVu",
                    "body": "Are we supposed to believe that corporations won't pass the costs of the carbon tax onto consumers, but that they will pass the costs of tariffs onto consumers? LOL",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kazthespooky",
            "body": "> people started acting like “liberals DESTROYED conservatives” and “conservatives will lose their minds”.\n\n\nCan you share who these people are? It's hard to change your view about \"some people\". This usually just becomes a game of people creating straw men and knocking them down. ",
            "score": 1,
            "replies": [
                {
                    "author": "jfleury440",
                    "body": "I've heard people talk about how this will hurt the conservative party's election campaign. Which I agree with.\n\n\n\nBut I haven't seen anyone say it will \"destroy conservatives\" or make them \"lose their minds\". If that's been said I'd wager it's from a vocal very small group of not very smart people or just troll farms.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ImperviousToSteel",
                    "body": "Garden variety liberals. Haven't seen anyone prominent but it's all over bluesky and Facebook. I'm jealous you haven't seen it. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kazthespooky",
                            "body": "> Garden variety liberals.\n\n\nGreat, quote someone. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dood9123",
                                    "body": "My parents and basically everyone I see on Facebook when I check to see what people are up to before not opening the app for a month",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Kazthespooky",
                                            "body": "Which part is the quote?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ImperviousToSteel",
                                            "body": "^^ this person is also in on the grand conspiracy. *Twirls moustache*",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "dood9123",
                                                    "body": "I don't know what you're on about, I'm just stating what I see with the liberal circles I see\n\nI mainly surround myself with progressives and leftists rather than traditional liberals",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ImperviousToSteel",
                                                            "body": "Making fun of the other person saying basically if we don't give them screen shots they won't believe us. ",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jfleury440",
                                            "body": "A lot of people paraphrase things poorly. Sometimes in bad faith.\n\n\nWithout seeing any examples it's hard to actually discuss.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ImperviousToSteel",
                                                    "body": "The idea is clear and coherent. You could cast doubt on whether or not the OP and others are lying that people are displaying this sentiment if you like, or you could just engage with the idea. ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "jfleury440",
                                                            "body": "I engaged as much as I could. The person I was responding to was making a big deal about being asked for examples to further the discussion.\n\n\n\nhttps://www.reddit.com/r/changemyview/s/DJOsztBYU1",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ImperviousToSteel",
                                                                    "body": "The question doesn't need examples. The question is is Carney scrapping the consumer carbon tax an \"own the conservatives\" moment. Did he get a one up on them by adopting at least a part of their big policy? ",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jfleury440",
                                                                            "body": "I don't feel like OP framed it that way but okay.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ImperviousToSteel",
                                                                                    "body": "I get the meaning clear enough from that, the bits about what they / I am hearing from online liberals is some motivation to bring this conversation forward, but not necessary. Either Carney got a big win here or he's caved to conservative ideology and maybe that's more damaging than any electoral win. ",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jfleury440",
                                                                                            "body": "He's still talking about fighting climate change. He's just going to go about it a different way because the conservatives spent so much time and effort turning the carbon tax into political poison.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ImperviousToSteel",
                                                                                                    "body": "Has he committed Canada to now meeting or exceeding emissions reductions targets and said specifically how that will happen?\n\n\nThat would be a refreshing break from nearly 30 years of fucking things up since the Kyoto accords. ",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "changemyview-ModTeam",
                                            "body": "Sorry, u/ImperviousToSteel – your comment has been removed for breaking Rule 5: \n\n> **Comments must contribute meaningfully to the conversation**.  \n\nComments should be on-topic, serious, and contain enough content to move the discussion forward. Jokes, contradictions without explanation, links without context, off-topic comments, undisclosed or purely AI-generated content, and \"written upvotes\" will be removed. Read [the wiki](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5) for more information.  \n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%205%20Appeal%20ImperviousToSteel&message=ImperviousToSteel%20would%20like%20to%20appeal%20the%20removal%20of%20\\[their%20comment\\]\\(https://old.reddit.com/r/changemyview/comments/1je6ain/-/mig0nha/\\)%20because\\.\\.\\.) within one week of this notice being posted.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AskHowMyStudentsAre",
                            "body": "I don't spend time on Facebook or blueaky. Nobody is saying this in my life",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ImperviousToSteel",
                                    "body": "Ok. I guess it's not happening then and this is a coordinated effort to make up the idea. A big lie. Mu Hu ha ha ha ha.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IncidentHead8129",
                    "body": "This is valid concern, but I really didnt think of bookmarking specific comments that represent this sentiment. I decided to make this post after seeing similar comments across multiple days. I think you can find some on r/Canada or similar. But I acknowledge that it’s a minority opinion.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ZappSmithBrannigan",
                            "body": "I will never understand why anyone takes \"random comments from nobodies on the internet\" as anything to even care about, never mind have an in depth discussion about. \n\nYou realize anyone can say anything on the internet right? Just because you saw 5 comments on reddit saying something doesn't make it the majority opinion among liberals.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Kazthespooky",
                            "body": "What would change your view here? Obviously this is completely subjective so everyone can have different interpretations and be equally \"correct\" in their personal opinions. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "halflife5",
                            "body": "You got one guy'd in chat.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "pgm123",
                                    "body": "Also known as nutpicking.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "IncidentHead8129",
                                    "body": "What does that mean?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "halflife5",
                                            "body": "When a streamer sees one comment in their chat saying something they don't like and hyper focus on it like everyone is saying it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "IncidentHead8129",
                                                    "body": "I’m not pretending everyone is saying that, I just want to say that I disagree with this sentiment when it comes up.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "wpgsae",
                                                            "body": "The problem is that you have failed to demonstrate that even a single person has this opinion, and instead tell us to \"go look over there, I promise you'll find them\".",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TuskaTheDaemonKilla",
                                                            "body": "Never seen this sentiment come up, ever.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "halflife5",
                                                            "body": "Also you're talking about liberals, they're almost as bad as conservatives and will always go right before going left. It's in the interest of capital. Your mistake was thinking these people are progressive at all in the first place.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "turndownforwomp",
            "body": "I think it’s less about “owning” conservatives in general and more about highlighting the emptiness behind PP’s endless use of slogans. His platform has withered because he really hasn’t done a good job running *for* anything and is mostly known for “Axe the Tax”. However, I do think issues in the US play a much greater role in the recent resurgence of Liberals in polling.",
            "score": 1,
            "replies": [
                {
                    "author": "IncidentHead8129",
                    "body": "I agree that PP just seems to can’t stop throwing out slogan after slogan, that’s a major reason I wouldn’t vote for him. I think Il give you a !delta because I may have taken this online sentiment too literally. I just really hate the idea of a scenario that could have been seen as a good thing that both parties could agree on seemingly turned into a moment of “A destroys B”.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YardageSardage",
                            "body": "There are people on both sides who are ALWAYS looking to fight, and who will try to spin any good thing at all as them \"destroying\" the other side.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FearDaTusk",
                                    "body": "... yes, but also, this is how the Media (including Social Media) make their money. \n\nI don't ride the hype one way or the other but I do think it's good to be aware of how any topic is easily spun to create more \"ratings.\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "TylertheFloridaman",
                                    "body": "I hate it when articles use words like slam when discussing one side doing something to another such a stupid over dramatisation",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DeltaBot",
                            "body": "Confirmed: 1 delta awarded to /u/turndownforwomp ([13∆](/r/changemyview/wiki/user/turndownforwomp)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Imaginary-Orchid552",
                            "body": ">I just really hate the idea of a scenario that could have been seen as a good thing that both parties could agree on seemingly turned into a moment of “A destroys B”.\n\nRegardless of the liberals describe this situation, it is ***completely antithetical*** to how the conservative party behaves right now. Everything is \"owning the libs\", gotchas, mean nick names, and political posturing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarcelleHVu",
                    "body": "PP has plenty of ideas, reducing immigration to Harper levels(and tying it to housing), federal incentives to ~~provinces~~ municipalities for housing construction, criminal justice reform, etc.\n\nYou just can't put all of that into an ad. And many of his political opponents don't care to look into them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TylertheFloridaman",
                    "body": "I am willing to bet if Trump didn't win then PP would have won",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ordinary_Narwhal_516",
            "body": "I’m a Liberal. My party didn’t “own” Conservatives. What did happen is we got rid of a policy that had been tried but had become poisoned publicly. Now the Conservatives are getting owned, but that’s because Skippy is still parading around behind his “Axe the Tax” podium.",
            "score": 1,
            "replies": []
        },
        {
            "author": "screampuff",
            "body": "Do you have some examples of people doing that? Most of what I see is people saying conservatives are in shambles because it was their only talking point for the past several years. Which is sort of meme-like.\n\nAnd that it feels like Pierre Pollievre is stuck in a time loop from before Trump’s inauguration, because despite everything going on with Tarrifs and sovereignty, he is still talking about the Carbon tax. It feels almost jarring, like he’s not allowed to speak on anything that hasn’t gone through rounds of focus group testing to make sure the slogans will help his polling.\n\nLately he did say he would remove pricing on industrial emitters which doesn’t make sense because we need to increase trade with Europe now more than ever who will start penalizing trading partners who don’t price carbon.\n\nit basically seems like he is not competent enough to speak on serious issues at hand. And even if he does now manage to come up with some good points, it will still be alarming because of how long it took him to do so….that’s not something that can fly in the position of prime minister facing serious threats to our country.",
            "score": 1,
            "replies": [
                {
                    "author": "MarcelleHVu",
                    "body": "> with Europe now more than ever who will start penalizing trading partners who don’t price carbon.\n\nThe EU is more hesistant than ever now on the CBAM given their interal economic woes. They're already talking about exempting most companies and delaying it for a year, with the largest centre-right group in the European Parliament proposing to delay it for two years. And it only applies to a few goods: steel, cement, aluminum, fertilizers, hydrogen, and electricity.\n\nAnd negotiations between states are central to trade and just because the EU implements a policy doesn't mean Canada has to take it lying down. The only people making your argument are those that supporting carbon pricing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IncidentHead8129",
                    "body": "Sorry, I didn’t remember which subreddit the comments are on. I agree that they are in the minority.\n\nI don’t see this as a “conservatives get destroyed” scenario, because other conservative policies like their stance on immigration is popular too. And I don’t see this as a liberal win either, since they are moving slightly more to the right, possibly because they would have a low chance of winning otherwise.\n\nThe things that I do agree with you are: 1. PP is like a broken record and can’t stop pointing fingers 2. People that my post describes are in the minority.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Delli-paper",
            "body": "It's all tribalism. Once you parse out what the statement they're making means, it's \"we have defeated the enemy tribe by depriving them of their platform\", not \"we have advanced Liberal values\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Malthus1",
            "body": "It’s about the harm this does to the Conservative campaign. That harm has two aspects.\n\nThe first is that it highlights that the Cons have only a few issues that have traction - and they are all attacks on Liberal policies. Change the policy, and the Cons seem to flounder. That floundering is what most Libs are crowing about.\n\nThe second is that the new Lib leader seems able and willing to pragmatically shift policies on some issues to gather voters. This harms the Con attack that the Libs are a bunch of dangerous ideologues. Discarding a policy enacted by the Trudeau government also undercuts the Con attack that the new government is just the same as the old.\n\nThe downside for the Libs of course is that they are adopting this policy because it is popular, not because they think it is correct. \n\nHowever, to directly address the OP’s point: the crowing the Libs are doing is because of the impact this move has had on the election. An election is always a bit of a team game, one side wins and the other loses, what is good for one side is bad for the other - and that’s just how elections work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "enthymemes",
            "body": "I don't disagree with you, but I'll try to change your mind anyway.\n\nThe real 'blow' to the conservative party is that it will be more difficult to campaign on the carbon tax. They'll still do it, it just won't be as effective. The carbon tax is deeply unpopular in Canada and had become a rallying call for those dissatisfied with the Liberal party and had become synonymous with the the affordability issues the average Canadian is facing and general dissatisfaction with the economy. It was the core of the conservative platform, it was their 3 second sound bite that they could repeat again and again.\n\nThe issues of affordability and economy still exist, but the conservatives have lost their soundbite. Additionally, Carney has a brand of being the 'economy' guy, so the conservatives lose a bit on that argument as well. This is not a dagger to the heart of the conservative 'platform', but it does weaken them and may force them to pivot less than a month away from an election.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WinteryBudz",
            "body": "I think you're listening to the more hyperbolic voices on this. I've not seen anyone claim the Liberals \"owned the conservatives\" with such wording. I have seen, and I agree, that the Liberals have at least in part, neutered some of the CPC campaign by removing the consumer carbon tax.\n\n Poillierve has been demanding a \"carbon tax election\" for at least a year now, that's basically off the table now and he's being forced to pivot, which he's doing a pretty terrible job of so far, hence the \"conservatives getting destroyed\" narrative going around now. On that point it's still too early to get overconfident, nothing is set in stone, but it is true the CPC has lost a 20+ polling lead which is pretty devastating for them heading into the inevitable election soon...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Plan5228",
            "body": "Astroturf propaganda does not a sudden shift in sentiment make",
            "score": 1,
            "replies": []
        },
        {
            "author": "SK_socialist",
            "body": "The title is correct but I take issue with your reasoning. You are correct that liberal partisans/supporters are overemphasizing the conservatives’ lost strategy and misspent campaign sloganeering.\n\nThe conservatives got what they wanted! This is not an own!\n\nWhere I disagree with you is this: after 10 years of poisoning the well with 3 (THREE!!) elections where their main policy was to abolish the carbon tax, the CPC finally got their wish. They used every tool they could: nakedly corrupt provincial governments launched EXPENSIVE lawsuits against the Feds over the carbon tax. Privately/Foreign-owned Postmedia news companies have published anti-carbon tax op-Ed’s for ten years. And other strategies, like funding the Freedom Convoy and strikebreaking activities in Alberta and Saskatchewan. What does all this mean? Well, If the carbon tax was truly unpopular, the conservatives would have won in 2015, 2019, and 2021. They didn’t. They spent an enormous amount of political energy to fight the carbon tax AND STILL COULDNT WIN.\n\nThe carbon tax was and is NOT unpopular. The key popular piece of the carbon tax is the Carbon Rebate: it’s the major reason for what makes the carbon tax policy palatable to the 60-70% of Canadians who don’t vote for the Federal Conservatives.\n\nThe business wing of the Liberal Party just won the leadership race. These people ideologically sit in between Liberals and Progressive Conservatives (the defunct precursor to the Conservative Party). Christia Freeland resigned as finance minister because of fiscal policy disagreements, and she subtly derided wealth redistribution policies pushed by Trudeau. The Liberals aren’t actually capitulating to *popular support* here: they’re capitulating to wealthy resource extraction companies and their investors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GonzoTheGreat93",
            "body": "I’m a former card carrying LPC member and I haven’t seen a single person crowing about the things you’re saying. \n\nCarney pulled the rug out from under the Conservatives, who have been running on exactly two policy platforms: “axe the tax” and “Trudeau evil.” \n\nThe Conservatives had a 20+ point lead in the polls for nearly two full years on that basis alone. As a result, they’ve been acting like they are the True, Real Government who the Liberals have unjustly kept out of power. Pierre Poilievre has campaigned for the last two years with the arrogance of a frontrunner despite very little likability. \n\nThat 20 point lead has absolutely **evaporated** since Trudeau’s resignation and Carneys policy change. Many of us are amused at the prospect that PP is finding out that he’s actually incredibly unpopular when people have an alternative they don’t hate more. When the emperor finds out he has no clothes, it’s pretty funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redditcritic6666",
            "body": "The Canadian's Liberals historically are the middle populist party. It has swung left in the last decade with policies such as the carbon tax, legalized weed, loose immigration policies, massive spending on \"social infrastructure\" leading to running deficits. \n\nTimes has change and now when the country finally runs out of money and doing poorly, it move back to the right by eliminating Carbon Taxes, lowering immigration, and they signal this move by having Justin Trudeau resign and put in a banker - Mark Carney, in its place as the next party leader. \n\nThe liberals has been copying the other party's policies and double down as if it was their own. It was done a decade ago because legalized weed and immigration was pretty much the Left's space which was occupied by the NDP and they out NDP-ed the NDP. It's now the same where they copied the Conservative's Policies to \"axe the tax\" and focus on fiscal policies by trying to get close to the EU. In short, they've abandoned their own left leaning followers and the policies they've established for the last decade and move right, which is literally \"owning\".\n\n\"Doing the best for the country and changing policies to fit what the citizens need is always what the politicians should do.\"... but the Liberals haven't been doing that for the last few years. Flooding their own country with immigrants (and solo a large percentage from one solo country) can't be good for the country. Continually running large deficits can't be good for their own country. Letting Criminals run rampant with guns while having nonsensical gun restriction on legal gun owners isn't good for their own country. Paying a contractor 54 million to develop a mobile app where the president of that app developer ended up being an staffer for the government isn't certain \"for the good of that country\".\n\nMy biggest gripe here is that the Liberal party of Canada's swaying to the right  is that it's not so much as \"for the good of the country\" but just a bid and lips service to stay in power. Mark Carney was caught on a hot mic saying he'll reinstate the carbon tax as soon as he's elected. Another problem here is that these populist party lacks long term planning. Canada would have been in a much better position right now if some of these very same policies they've implemented weren't there, and now they are just preying on people's short term memories and undoing polices at they themselves has put into place. A lot of people didn't realized that those right leaning policies are \"popular\" are because things have gotten really bad, and it's bad because of all those left leaning polices that was in place for the last decade.\n\nA government that only spend in good times and only started cutting when times are bad isn't a good government to begin with. A government that campaigned on back-tracking their own policies are just an admittance that they've screwed up and therefore isn't a good government.",
            "score": 1,
            "replies": [
                {
                    "author": "SK_socialist",
                    "body": "I wouldn’t describe the Canadian liberals as populist…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zenmin75",
            "body": "This is how conversation politics works, which is why I don't like it.\nCreate a crisis, convince people they're being oppressed, scammed, etc. then run on it. The carbon tax actually benefited the vast majority of people, but the liberals did a shit job of explaining it, and the conservatives did an excellent job of rolling out disinformation and propaganda. They convinced people that it was costing working families thousands a year even though people MADE money off the rebates.  If you take away the fake crisis that conservatives created, they have nothing. Every single policy they have is anti liberal, not pro Canada, so they start to crumble when the liberals adjust to make the populous happy. MAGA is no different.  Make the people hate each other, create a fake narrative that the current government is corrupt, stealing, pedophiles, intentionally letting in \"enter ethenicity here\" criminals to eat your pets,  etc. to create outrage so they pretend to save the day if they get voted in.\nOur conservative party refuses to work together with the opposing government to create a better Canada, so get butt hurt when the liberals work with them to make Canadians happy.  It's dumb, dangerous, and why we need to protect our democracy with every vote we have in the next election by standing against that type of politics.  It's a slippery slope, and the US should be a warning to us all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aidan0b",
            "body": "I agree that what you're saying *should* be true, but in the current political moment that's just not how it's working. The fact is that the conservatives are acting owned, whether you really think they have been or not. Poilievre was going so hard on \"Axe the Tax\" \"Carbon Tax Carney\", and then when Carney announced he'd be canceling the consumer carbon tax, Poilievre just... didn't stop saying the same stuff. He just keeps spouting the same lame nicknames and saying \"I'll Axe the Tax for *real*\". Sure, the liberal abandonment of the tax should have been an acknowledgment that the cons were onto something and a moment of bipartisan agreement, but the cons (or their leader, at least) clearly doesn't see it that way, and he's been caught completely flat-footed",
            "score": 1,
            "replies": [
                {
                    "author": "ImperviousToSteel",
                    "body": "They might flounder publicly for a bit on messaging, but privately they are absolutely grinning over getting their opponents to adopt at least part of their big policy. Conservatives care more about shifting the goal posts right than they do winning the most immediate election, they are ideology first, electoralism second. \n\n\nThey might lose this election, but the ground has now shifted for them to run on an even more right wing platform next time. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "aidan0b",
                            "body": "I really don't think there is a coordinated behind-the-scenes Conservative effort here. See; Doug Ford repeatedly praising Carney and not saying a word about PP",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ImperviousToSteel",
                                    "body": "It's not coordinated, it's just part of what/who they are. Their goal isn't just winning and governing, it's a continual pulling of the Overton window to the right. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "aidan0b",
                                            "body": "I've seen a lot of this sort of concern and it feels a little hyperbolic to me. The leftist cry for a long time has been \"focusing on consumer impact on climate change is a distraction, we need to focus on big industrial pollutors\", and Carney is keeping (and increasing, if I'm not mistaken) the industrial tax. Carney is well known as an environmentalist, and even if this is an adoption of a Conservative promise, I don't feel it represents a real significant rightward shift",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ImperviousToSteel",
                                                    "body": "I mean if the result is Canada actually starts meeting/exceeding emissions reduction targets sure. That's not been the track record of the LPC to date, and I don't know why you'd run for them if that was your goal, but I'd really like my cynicism disproven there. ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "advocatus_ebrius_est",
                            "body": ">Conservatives care more about shifting the goal posts right than they do winning the most immediate election, they are ideology first, electoralism second. \n\nI think it is interesting that you say this in the context of the Carbon Tax, which was originally a conservative position to begin with. If you are right, then shouldn't the conservatives have been happy with a climate change solution that centres market forces and not direct government intervention?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ImperviousToSteel",
                                    "body": "No, because they've moved further right since. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "shosuko",
            "body": "Are liberals really moving right on this?  Or is it just a response to Elon / Tesla?",
            "score": 1,
            "replies": [
                {
                    "author": "ImperviousToSteel",
                    "body": "The policy is more right wing, they have moved right regardless of who it's in response to. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "shosuko",
                            "body": "Really?\n\nI would see them \"moving right\" only if the intentions for the act were the same, ie the desire to abolish the credit regardless.\n\nIf its only in response to a specific situation they aren't really shifting b/c if that situation changes they will quickly revert.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zavtra13",
            "body": "The liberals adopting conservative policies to attract conservative voters is the ratchet effect in action. We need to stop electing neoliberal politicians regardless of their party affiliation, lose the CPC and LPC.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CartographerKey4618",
            "body": "I don't think it's specifically the carbon tax. A lot of \"conservatives\" around the world adopted much of America's culture war talking points, including in Canada where they had a nationalist movement that was also pretty pro-Trump. They hitched their wagon onto the MAGA movement and now that America has made itself persona non grata in Canada because of Trump, their poll numbers have fallen quite sharply.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nightshade78036",
            "body": "In that case, what would constitute a \"conservatives getting owned\" moment? Poilievre made his entire campaign about 2 things: \"I am not Trudeau\" and \"axe the tax\". Both of those things are now dead talking points and the conservatives are unable to move on from them, leading to them tanking in the polls. If this isn't a \"conservatives getting owned\" moment then frankly I don't know what is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "turtledove93",
            "body": "People aren’t acting likes it’s an “own the cons” moment. They’re laughing at Poilievre because “Axe the Tax” was basically his entire shtick, and polls had the cons in the lead thanks to it. The public’s switch has been very quickly reflected in polls after Carney ended the taxes, with liberals now in the lead. PP has spent A LOT of his time talking about ending the carbon tax, without it he doesn’t seem to have much of a party platform left.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sadge_A_Star",
            "body": "The consumer carbon tax has been pretty unpopular and is the most visible, direct carbon tax hitting your average Canadian, so arguably its not just adopting a conservative policy, but a response to public sentiment, esp after years of economic struggle.\n\nAlso, it's not the most impactful part of the suite of policies, ie the industrial carbon tax is the main driver of changes in emissions (this is my understanding anyways), so dropping the consumer part is relatively low impact to the whole strategy.\n\nNot alone this, he also promised to make up for the loss of this policy with something else. This would have to be either beefing up the other carbon tax or some kind of regulatory approach, which don't align with what I'm hearing from Conservatives. For example, I recently saw headlines that PP and Danielle Smith are now attacking the industrial carbon tax or claiming its just a liberal distraction.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BanMeForBeingNice",
            "body": "The consumer carbon tax is a theoretically good idea, Pigouvian taxes work to reduce consumption, but it doesn't work well when it is on things people need like home heating, without readily available alternatives. Like many things in economics and other fields, objectively it is good policy, but that doesn't make it popular. All the messaging in the world can't change that, either.\n\nThere's other ways to accomplish the same ends, this one was tried and didn't work.\n\nNo one was \"owned\". And it wasn't like they \"adopted a conservative policy\" (which by the way, carbon pricing broadly is the product of conservative thinkers), they saw a policy didn't work and scrapped it. That's what governments are supposed to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gamestopdecade",
            "body": "I’m not 100% positive about Canadian politics I live in the US. When an existential crisis happens both parties try to until as many people as possible. Our dumbfuck of a president is, from the best I can tell, threatening all of you. Sometimes you have to come together on things you normally wouldn’t in times of great stress. It’s not killing anything, it’s asking everyone to join together because of our village idiot is serious you are all gonna half to work together.\n\nI can not apologize enough. To me you guys are siblings. I totally get the hate and am sorry we are in this situation. Once a real viable leader comes forward (I’m no leader) I will 100% be in the streets.\n\n(Thinking this over, I think trump is smart going back and forth. I wanna protest but if I do he might just go right back against what he said and people will say he is being sarcastic) man I don’t know what to do or what is right",
            "score": 1,
            "replies": []
        },
        {
            "author": "RhodesArk",
            "body": "It truly is not, it is a \"Team Canada\" moment. The ministers  that remain are not focused on Parliamentary success at all, they're focused solely on trade war. The leadership convention a few weekends ago was entirely centered around the threat from the US. The opposition wasn't even a factor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leafboy238",
            "body": "I think there is a very good argument that removing the consumer carbontax DID destroy the Conservatives in the sense that it took the only strong platform they had to stand on.  The Conservatives failed by creating a platform that could so easily be dismantled by a pragmatic opposition. \n\nWhen we look at what has been happening in Canada, it is quite plain to see that the Conservatives are failing to adjust to the chamging political landscape and are now floundering while the Liberal government pulls ahead in adressing our most pressing issues.\n\nThe polls look grim for Pierre Poliavre, and i do not think his prospects will improve as it has now been proven how fragile the Conservative platform really is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RocketRelm",
            "body": "But people only care about tribalism and simplistic messaging. If nobody votes on policy anymore, then puffing up your tribe becomes the democratic good. That's what makes people happy, therefore, that is what is \"good for the country\". If you don't convert your actions into political momentum,  did you even really do it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "hangender",
            "body": "Sounds about right. Even schumer had to become a conservative to beat the conservatives.",
            "score": 1,
            "replies": []
        }
    ]
}