{
    "title": "CMV: Donald Trump and his administration are going to singlehandedly reverse all of the work that Joe Biden did to ensure capital punishment became a last resort as opposed to a given punishment",
    "author": "Justafunofstuff",
    "subreddit": "changemyview",
    "rank": 11,
    "score": 31,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 81,
    "url": "https://www.reddit.com/r/changemyview/comments/1je94ey/cmv_donald_trump_and_his_administration_are_going/",
    "id": "1je94ey",
    "selftext": "I want to believe that states will remain in control of decisions regarding capital punishment however federal executions are still a [MASSIVE CONCERN](https://screenshot-media.com/politics/human-rights/us-death-penalty-under-trump-why-executions-are-on-the-rise/).  I mean, during Trump's first term, the federal government resumed executions after a 17-year hiatus, carrying out *13* executions in quick succession. I read in the article that I linked that more people were put to death in just six months than during the combined terms of the previous ten presidents. I personally do not believe in capital punishment and I don't think I'll ever change my mind on that. But please someone try and educate me as to why Trump's term might not actually well and truly mess everything up.",
    "comments": [
        {
            "author": "tonydanzatapdances",
            "body": "Not even gonna try to change your opinion. Just wanted to say this subreddit is tiring when 90% of posts are just “CMV: Trump (insert theory)” \n\nGo do something about the situation instead of this.",
            "score": 1,
            "replies": [
                {
                    "author": "PrivetKalashnikov",
                    "body": "Tbh I think 90% is actually an understatement. I would love to have a Trump megathread or ban Trump as a topic for a week.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Imoa",
                            "body": "It's especially exhausting when the majority of the posts about Trump don't want to have their minds changed, it's like arguing with a bunch of walls. Most of the posters aren't trying to change their minds, they're trying to soapbox about Trump and show that they're right because no one can successfully debate their stance.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Morthra",
                            "body": "> I would love to have a Trump megathread or ban Trump as a topic for a week.\n\nJust ban it permanently. Almost every single \"Trump/conservatives bad\" post results in the top level comments just jerking off OP using a \"well it's actually worse than you thought\" line of attack. The level of dehumanization I have seen towards conservatives is even greater since the last election than what was seen towards the other people who can't be discussed on CMV.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mini_macho_",
                    "body": "Yup just looked at the \"hot\" subreddit posts and the 8 hottest were about Trump/Conservatives",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HadeanBlands",
            "body": "I think you've already made your own argument, right? Trump's first term saw 13 executions... but that was followed by Biden's term! How can Trump \"well and truly mess everything up\" in his second term if in his first term he was only swimming against the tide? Like is the next Democratic president going to be more pro-death penalty than Biden? Why would that happen?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Upset-Fennel3547",
            "body": "Go outside and live your life…… holy shit..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Recent_Weather2228",
            "body": ">Donald Trump and his administration are going to singlehandedly reverse all of the work that Joe Biden did to ensure capital punishment became a last resort as opposed to a given punishment\n\nJoe Biden didn't work to make Capital Punishment a last resort.  He worked to make sure it was non-existent.  Trump is taking it back to being a last resort.  13 executions over 17 years is a miniscule number.  That *is* using it as a last resort.  That's less than one execution per year.  Do you really think that not even one person per year is committing a crime worthy of the death penalty? \n\n>more people were put to death in just six months than during the combined terms of the previous ten presidents.\n\nThat says more about those presidents not carrying out justly deserved executions than about Trump.  Again, it was 13 executions.  It's ridiculous that we haven't had 13 executions in the previous ten presidents' terms.  \n\nTrump is making capital punishment a last resort again, when it was previously non-existent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Full-Professional246",
            "body": "So first - when you remove a 'hiatus', it make sense you clear a backlog of pending executions that have already been litigated over and over. Whichever president did this would have a similar result. The longer the pause, the more people 'stack up' waiting having exhausted thier appeals.\n\nThere is no justification to think that this would repeat or continue beyond clearing the backlog and in turn not return to the normal course and flow of death row inmates through the legal processes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eggs-benedryl",
            "body": "what did joe biden do about this topic exactly?",
            "score": 1,
            "replies": [
                {
                    "author": "stephenmw",
                    "body": "Biden paused all federal executions and then at the end of his presidency commuted the sentence of all but 3 death row inmates. Apparently he (or his people) still felt that 3 people should be put to death.\n\nWhat he didn't do is get congress involved to prevent more people from being sentenced to death.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sourdough9",
            "body": "Why do you believe that capital punishment should be a last resort. Why are we spending resources housing and feeding the worst of the worst. We should be capital punishing more. I don’t see why we keep them on this earth",
            "score": 1,
            "replies": [
                {
                    "author": "wpgsae",
                    "body": "Either you believe the justice system is infallible, or you believe it's okay to execute innocent people sometimes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sourdough9",
                            "body": "I feel like once found guilty it should be up to the jury to determine the punishment and it has to be unanimous. That way it’s only being used when the evidence is overwhelming",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "wpgsae",
                                    "body": "Do you believe that the justice system is infallible then? Because innocent people have been found guilty by juries in the past.\n\nYou say capital punishment should be used more often AND only when juries unanimously decide on capital punishment when evidence is overwhelming. I don't see how you can hold both of these beliefs without some level of cognitive dissonance.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HadeanBlands",
                            "body": "I'll say 5%. If 1 in every 20 executed people was factually innocent of the crime that'd be at the upper edge of okay.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HadeanBlands",
                                            "body": "How many innocent people are you okay being imprisoned by the state?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HadeanBlands",
                                                            "body": "I think we are just using different definitions of \"ok with\" then. There are tons of innocent people being imprisoned right this very day and you're doing nothing about it. So you're okay with it.\n\n\"which is why I dont support it actively\"\n\nHey, you know, if the question was 'how many innocent people do you *support* being executed' then of course my answer is zero! But you asked a different question.\n\nEDIT: And now you've blocked me. Okay then.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "flairsupply",
                                                                    "body": "I dont support prisons.\n\nYou actually support executions. Thats what I meant.\n\nIm not okay with anyone in prison, including the innocent. Youre okay with executing people, including the innocent. You think killing innocent people is justified if its in the name of your revenge fantasies.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EtheusRook",
            "body": "Yes. But also, the positive to hold onto is that progress and truth will always win in the end. It will drag them kicking and screaming into the future, even if they've set us back for now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "flairsupply",
            "body": "Trump only has two people he can even execute. Biden commuted all but two federal executions to life sentences. Trump cannot force states to execute more, that isnt a power he has.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "changemyview-ModTeam",
                    "body": "Comment has been removed for breaking Rule 1:\n\n> **Direct responses to a CMV post must challenge at least one aspect of OP’s stated view (however minor), or ask a clarifying question**. Arguments in favor of the view OP is willing to change must be restricted to replies to other comments. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1).  \n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%201%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Allthenamestaken10",
                    "body": "Execution is more expensive. This is a fact.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Green__lightning",
                            "body": "This is intentionally the case because of mandatory appeals and such, this was done so the Left could use that argument. I'd make a specific Last Appeal Court, everyone goes to it before execution, and make it standard practice to go through everything very thoroughly in this court, with everything properly documented as public record, ensuring an open and fair system, but specifically making it the only appeal for such cases to prevent it going on forever.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Allthenamestaken10",
                                    "body": "You’re right, it’s a conspiracy and everyone should get one shot to prove they’re innocent in a shortened timeframe before we kill them. If they can’t? Tough shit must have been guilty. Unless you genuinely believe the government is always right, or are fine with innocent people being killed, you shouldn’t honestly believe that we should have *less* scrutiny and checks in the execution process",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kedulus",
                            "body": "No it isn't. The thing that costs a lot that that gets wrongly attributed to the death penalty is people being allowed infinite appeals.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Allthenamestaken10",
                                    "body": "Because death row is, in fact, a part of the death penalty.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Kedulus",
                                            "body": "Death row is, at most, a location in a prison where people waiting to be executed are kept.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Allthenamestaken10",
                                                    "body": "Would you consider the price of a cell, or clothes, food, or a bed to be unrelated to the price of life imprisonment? Or are the conditions of security and housing also related to the nature of one’s sentence?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Kedulus",
                                                            "body": "I don't consider those unrelated to a sentence of life imprisonment because they are a part of keeping a prisoner alive and imprisoned. The costs that are related to a sentence of execution are only those that go into the process of performing the execution. There are labor costs, material costs, and infrastructure costs. They are, however, quite cheap compared to the alternative(s).",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Allthenamestaken10",
                                                                    "body": "Yes, and death row is one of those costs, execution is not just shooting someone in the head and going home, it is a legal process, and a lengthy one at that because killing someone is quite irreversible, so you had better not fuck it up. One does not simply teleport from prison, to a noose, to a grave.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Kedulus",
                                                                            "body": "Death row is imprisonment, not execution.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Allthenamestaken10",
                                                                                    "body": "Okay? But it’s part of the process of execution, they aren’t out there for fun. “Food is part of feeding, not imprisonment.” “Concrete is part of construction, not imprisonment.” You are separating two things that don’t exist without each other.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jealous-Factor7345",
                    "body": "It's mostly the innocent people that get killed that is objected to.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Green__lightning",
                            "body": "But that's not a problem of capital punishment, that's a problem of wrongful conviction. There should be higher standards of proof in most courts, the whole innocent until proven guilty thing has became uncomfortably eroded. I posit having the death penalty may actually help, given how much more people care about a wrongful execution than a wrongful imprisonment, thus motivating higher standards to convict.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jealous-Factor7345",
                                    "body": ">But that's not a problem of capital punishment, that's a problem of wrongful conviction. There should be higher standards of proof in most courts, the whole innocent until proven guilty thing has became uncomfortably eroded.\n\nYou're partially right. I'll be convinced that capitol punishment is a reasonable option if you can identify a system that could actually kill people while being 100% certain that no innocent people will be killed. As far as I am aware, this is not possible. It's certainly impractical.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Green__lightning",
                                            "body": "But 100% accuracy isn't a reasonable standard for anything. That's saying we can't do it perfectly, so we shouldn't do it at all. \n\nUnder that logic, why is imprisoning anyone valid? Because you can let them out later? Putting two people in jail for half their life is no less evil than killing one person. \n\nWe need realistic, but high standards. They might even round up to 100%, but they'll never actually be there.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Jealous-Factor7345",
                                                    "body": "IMO it is a reasonable standard for state executions, especially when the option of life imprisonment is nearly as effective as keeping these people out the general population.\n\nEdit: That said, I'd be willing to accept something like 1 in a billion chance, which would round pretty close to zero. Maybe a bit lower than that.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Green__lightning",
                                                            "body": "It's more expensive if you ignore intentionally inflated costs, it has less of a disincentive effect on crime, and it causes less impactful change in the result of wrongful execution/imprisonment. Furthermore, prisons should be meant to rehabilitate inmates, and life imprisonment is both making them be a bad influence on others, and since there's no plans for rehabilitation, naught but a death sentence by old age.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Jealous-Factor7345",
                                                                    "body": "What you're missing is that higher standards inevitably inflate costs. Executions in places with relatively high standards *already* cost more than life in prison. If we want even higher standards, that's just going to cost more.\n\nLife in prison offers the possibility for mistakes to be caught,, and we've already seen some people exonerated in our lifetime.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Allthenamestaken10",
                    "body": "Execution is statistically more expensive than life in prison. No I’m not kidding, look this up. And giving the government the option to legally execute people means you have to 100% trust the government, at least with regards to law, or just be okay with the government murdering innocent civilians",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CaptCynicalPants",
                            "body": ">Execution is statistically more expensive than life in prison. \n\nThen we need to fix this problem. But that's also besides the point. We don't (and must not) execute people because it's cheaper. We should (and must) execute people because it is the morally correct consequence for their crimes.\n\n>giving the government the option to legally execute people means you have to 100% trust the government\n\nNonsense. We *entrust* (a word with a fundamentally different meaning than 'trust') the government with enacting Justice because it is the only entity capable of doing so with any degree of fairness. 'Justice' enacted by private entities is fundamentally and unavoidably biased. Therefore we must entrust and empower the government to execute people not because we trust them, or because they're right all the time, but because execution is the morally correct response to certain crimes, and they are the only entity that can morally perform that duty. What you and I might be comfortable with doesn't matter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Allthenamestaken10",
                                    "body": "What you are comfortable with is in fact relevant to what you vote/advocate for. And price is relevant because you brought it up, the tax payer dime also pays for death row. But also stating that execution is “the morally correct consequence” is literally just an opinion. So all you have here amounts to, “they should do it cause I think so.” I don’t think that killing people who did a horrible thing is worth the risk of killing people who didn’t, especially at cost, and especially especially considering that the government is entirely in control of what those “heinous crimes” are. That isn’t a set definition, and is not something that I think should be given to the government to decide at will.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CaptCynicalPants",
                                            "body": ">considering that the government is entirely in control of what those “heinous crimes” are. That isn’t a set definition\n\nOn the contrary, rape, pedophilia, and murder are heinous crimes regardless of what the government says about them. That is why we can and should demand that such criminals be executed, because that is the morally correct response to such crimes.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Allthenamestaken10",
                                                    "body": "What objective source do you draw this morality from?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "deadpoolfool400",
                    "body": "You’re awful quick to kill people in a system that has been shown time and again to be incapable of passing perfect judgement every time. Until there is a way to do so, I don’t believe the state has the moral authority to end lives on behalf of its citizens.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MalekithofAngmar",
                            "body": "I think this is a bad criticism of the death penalty, because what, it's just a big oopsie if the state exonerates you after 40 years in prison but the end of the world if you were killed instead?\n\nEven if we abolish the DP it's still a major problem that we are convicting innocent people.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "deadpoolfool400",
                                    "body": "I'm not sure I follow your argument here. Yes, it's a major problem that we are convicting innocent people so capital punishment should not be on the table. And to your comment about exoneration, it's not just a big oopsie when they can't get a job to support themselves or collect social security because they haven't worked in decades.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MalekithofAngmar",
                                            "body": "You don't follow, no.\n\nThe problem is that we are convicting innocent people. It would still be bad even if the DP wasn't on the table, because it isn't a big \"oopsie\" if the state puts you in a cage for 50 years. It would still be a problem, albeit a lesser one, even if we were just handing out false convictions of misdemeanors. \n\nBut we aren't. You only get the DP if you are found guilty of crime that you would otherwise do life/many decades in prison for. Adding the DP into the mix only marginally increases the badness of a false conviction. To me at least, being put in a cage for 50 years is only slightly better than a death sentence, and some people have even expressed preference for death over life in prison. \n\nBecause of this, your argument is better characterized by the statement \"false convictions are bad\", not that the DP is bad. If everyone we convicted was guaranteed to be 100% guilty, would you support the DP?\n\nDo you follow now?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "deadpoolfool400",
                                                    "body": "A marginal increase? Adding the death penalty to a false conviction increases the miscarriage of justice exponentially. If they are executed, the opportunity for exoneration and restitution are removed permanently, let alone their freedom and ability to live a normal life. They will never see their name cleared and they will die looking at faces filled with hate and sadness that someone else caused. \n\nThe state has an obligation to deliver justice fairly, but also to protect its citizens from the government infringing on their rights. So yes, false convictions are bad on every level. However, since they do happen even for the worst offenses, we can't discuss the death penalty without pointing out that fact. \n\nAnd whether or not you think it would be more merciful than letting someone rot in prison for a crime they didn't commit, I don't feel comfortable killing someone if there is even a slight possibility that they don't deserve it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MalekithofAngmar",
                                                            "body": "Does it though? People who get exonerated from death row are regularly there for decades. People who were wrongfully executed are often exonerated after they would've died from natural causes. Again, you can't give people back their life but you also can't give them back stolen decades. To me you seem to be presenting world where people are rushed off to be executed only for the crucial evidence to pop out of the woodwork seconds after death is confirmed, which would be required for said exponential growth in \"badness\". Instead we are looking at more marginal increases in moral \"badness\".\n\n>I don't feel comfortable killing someone if there is even a slight possibility that they don't deserve it.\n\nDoes this same logic not apply to life sentences, particularly without parole?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "deadpoolfool400",
                                                                    "body": "What are you arguing here? That we should allow the state to kill innocent people because they'll still be incarcerated for a while and killing them doesn't make things much worse? And since we can't give them back time served it doesn't matter anyway? That's an incredibly cynical approach. \n\nI'm not presenting any particular scenario other than a prisoner who is wrongfully convicted, and whose sentence is death. When the exculpatory evidence shows up is inconsequential. All that matters is that they are innocent of the crime and killing them for it is wrong. \n\nNo the same logic does not apply because, while the state can grant freedom when a verdict is overturned, they cannot bring someone back to life. That is why it is important to err on the side of liberty when discussing the death penalty.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MalekithofAngmar",
                                                                            "body": "I am arguing that we would not actually evade very much moral badness by abolishing the death penalty for the reason that we execute innocent people, as the majority of these people would've had their whole life or 90% of it stolen from them one way or another. Saying \"just for a while\" doesn't show the reality that many of the falsely executed would've lived and died in prison. When the exculpatory evidence shows up is absolutely critical to the falsely accused, because if it doesn't show up in their lifetime, so what? From the state's perspective they lived and died guilty. You cannot return a man who served a life sentence his life if it has already ended naturally.\n\nThe moral failing was had when they were falsely convicted of a serious crime, not because they got a marginally worse sentence.\n\nI oppose the death penalty for other reasons, I just think this argument is a poor one to support the death penalty. It's a good argument for judicial reform.\n\nEDIT:\n\nTo me it is very cynical to think that it's some kind of moral victory to have a bunch of falsely accused people locked away for life and say \"At least they can't be executed!\"",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CaptCynicalPants",
                            "body": "To refuse to act unless you can do so perfectly 100% of the time is to not act at all, and thus to deprive people of justice on purpose. \n\nDeliberately depriving someone of justice out of fear is equally as bad as treating them unjustly, because it **is** treating them unjustly.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "premiumPLUM",
                                    "body": "So how many innocent people are you okay with dying so that someone else can have \"justice\"?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CaptCynicalPants",
                                            "body": "How many innocent people are you ok with locking in prison for life so that someone else can have \"justice\"?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "premiumPLUM",
                                                    "body": "If I was able to pick, zero would be ideal.  But I don't believe in life sentences without the possibility of parole.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CaptCynicalPants",
                                                            "body": ">If I was able to pick, zero would be ideal.\n\nAgreed, 0 is the goal. Yet that is not the system we live in, and we never have.\n\n> I don't believe in life sentences without the possibility of parole.\n\nThis is deeply wrong. Child rapists don't deserve to keep breathing, never mind receive parole.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "premiumPLUM",
                                                                    "body": "> Agreed, 0 is the goal. Yet that is not the system we live in, and we never have.\n\n0 is a pretty achievable goal if you just choose to not accept life in prison without the possibility of parole as a given part of your justice system.  I believe all people have the opportunity to change and become functioning members of society.  And in cases where the person never changes or their crimes are too horrific or there is such overwhelming evidence that there is no question of guilt (Dylan Roof tending to be the go-to example for many people), their parole is denied indefinitely.\n\nThere are a lot of countries in the world that go by this model and it tends to be more successful than the US system.\n\nSo again I have to ask, what's your number?  If you support the death penalty as it is, then your number is as high as 4%.  What if it went up?  Is 4 innocent people murdered by the state a worthy sacrifice to murder 96 guilty people?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CaptCynicalPants",
                                                                            "body": ">Is 4 innocent people murdered by the state a worthy sacrifice to murder 96 guilty people?\n\nSacrifice? Of course not, The number ought to be 0. But yes, I support the death penalty even knowing mistakes are made because those mistakes are not deliberate or ignored.\n\nKilling an innocent person on purpose is entirely different from killing an innocent person that you were 100% convinced was guilty and only found out was innocent later. We already do this in society by having different punishments for murder vis a vi manslaughter.\n\nThis is particularly true when it is caused by someone else committing a crime. The government is not morally responsible when justice is perverted by another criminal successfully framing someone for their own crime.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "premiumPLUM",
                                                                                    "body": "We're the government.  We're a government of and by the people.  So I do feel like it's a little on us if we support a system we know is going to kill innocent people.\n\nPersonally, I feel greater empathy for the innocent than anger at the guilty.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CaptCynicalPants",
                                                                                            "body": "Then you are valuing criminals over their victims, despite the fact that there are an order of magnitude more victims of crimes than their are victims of judicial injustice.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "CaptCynicalPants",
                                                                                                    "body": "Then you are valuing criminals over their victims, despite the fact that there are an order of magnitude more victims of crimes than their are victims of judicial injustice.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "premiumPLUM",
                                                                                                            "body": "Yep, very much a Blackstone's Ratio kind of person",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Expensive-Ranger6272",
                                    "body": "What about the family of people where the system does get it wrong. Where is the justice for them?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CaptCynicalPants",
                                            "body": "What about the families of people who are wrongly imprisoned for life? Where's the justice for them?\n\nYou already tolerate a system that makes mistakes that cost people their lives, to the enormous detriment of their families. What we're quibbling about here is the degree of those mistakes, and from the perspective of families locking someone up for life is just as catastrophic as executing them. More so, in many cases, as living people can continue to have new negative psychological impacts on their loved one, whereas dead people cannot",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "changemyview-ModTeam",
                    "body": "Comment has been removed for breaking Rule 1:\n\n> **Direct responses to a CMV post must challenge at least one aspect of OP’s stated view (however minor), or ask a clarifying question**. Arguments in favor of the view OP is willing to change must be restricted to replies to other comments. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1).  \n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%201%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheMcWhopper",
                    "body": "Hard disagree.  The worst punishment, imo is being locked an 8x11 cell for 23 hrs a day for the rest of your life. Death is too easy for those who commit the worst crimes",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CaptCynicalPants",
                            "body": "We do not execute people because that's the worst thing that can happen to them. The purpose of the justice system is not to make people suffer. If that were the case we'd still be crucifying people. Therefore it doesn't matter if life in prison is \"worse\" than death. \n\nRather the purpose of the justice system is to protect society from, and discourage, criminals, and the best way to protect society from people who can never be allowed to rejoin it (pedophiles and rapists, for example) is to execute them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheMcWhopper",
                                    "body": "Execution is a cop out for these guys. The worst of the worst deserve nothing more than to be left to their own thoughts for the rest of their lives, never to see the sun again. No opportunity for parole. It still follows the justice system the way you see it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CaptCynicalPants",
                                            "body": "This is equally unjust. Prisons do not exist to make people suffer, they exist to protect society.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "TheMcWhopper",
                                                    "body": "Wrong!! They did it to themselves.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Cauliflower_2001",
            "body": "Fantastic! ",
            "score": 1,
            "replies": []
        },
        {
            "author": "kolitics",
            "body": "If you believe that Trump has espionage ties to Russia, he may not want harsh and capital federal punishments. With 34 felony convictions and 54 other charges against him already he may want to start setting a precedent for a lenient and forgiving justice system. Why push for more death penalty when he could scheme up house arrest at mar a lago incase future charges are brought against him by his political opponents?",
            "score": 1,
            "replies": []
        },
        {
            "author": "nhlms81",
            "body": "I think projection based CMVs are some of the hardest, b/c they are definitionally future oriented. However, one way that I think is useful is to consider the variables that are influencing our projection. It is helpful to be aware to humans are *notoriously* bad about forecasting ([Humans Are Bad at Predicting Futures That Don’t Benefit Them - The Atlantic](https://www.theatlantic.com/science/archive/2017/11/humans-are-bad-at-predicting-futures-that-dont-benefit-them/544709/)), and this is true across many domains. \n\nSo... let's stipulate that we're not very good at predicting things... that means that you're not very good at predicting things. That's not an attack on your concern / your ideals, just something to keep in mind as we consider the likelihood of your predicted outcome. \n\nThe second thing i think we should consider would be something of our own biases. Again, not a critique of your perspective of Trump, but if i asked you, \"is there *anything* you think Trump will do over the next 4 years that *won't* \"mess everything up\", does anything come to mind? if the answer is, \"i think Trump will mess up pretty much *everything... \",* then the likelihood we're right about that is fairly low, or, at best, not very useful. Even if Trump was the world's most effective operator, successfully, \"messing everything up\" would require expert skill and incredibly \"good\" fortune. \n\nWhich makes me point to the third thing. Even if you're right, there is a substantial amount of chance that dictates outcomes. And chance being chance means we can't predict outcomes w/ much certainty. \n\nSo, you're probably ok in being concerned about a risk, but probably don't need to be as certain about the outcome.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KungFooCat",
            "body": "That’s the goal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AWatson89",
            "body": ">Donald Trump and his administration are going to singlehandedly reverse all of the work that Joe Biden did\n\nYou could've stopped there. That's the main reason we voted for him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sorkel3",
            "body": ">Donald Trump and his administration are going to singlehandedly reverse all of the work that Joe Biden did\n\nNo need to go further.  This is Trump's vengance tour against Biden because he fixed the colossal mess Trump left behind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character_Term9048",
            "body": "Donald Trump is a TRAITOR to the USA.",
            "score": 1,
            "replies": []
        }
    ]
}