{
    "title": "CMV: Trump did not \"deport\" the Venezuelan immigrants",
    "author": "TurboKid1997",
    "subreddit": "changemyview",
    "rank": 8,
    "score": 154,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 278,
    "url": "https://www.reddit.com/r/changemyview/comments/1je94ru/cmv_trump_did_not_deport_the_venezuelan_immigrants/",
    "id": "1je94ru",
    "selftext": "I would say this closer to \"Extraordinary Rendition\" except in this case the people were in the United States, vs I believe previously it was taking people from other countries and never bringing them to US jurisdiction. Deporting them to their home countries would be one thing, this is not just deporting.  He basically sent them to the equivalent of a for profit Guantanamo Bay in El Salvador where they will be indefinitely detaineed for \"terrorism\" and used for cheap labor.  They already tried to send them to Guantanamo once, so this keeps in line with it.  Marco Rubio said, speaking about the prisoners in El Salvador, \"If one of them turns out not to be[a gang member], then they're just illegally in our country, and the Salvadorans can then deport them to Venezuela.\".  It seems based on some of the articles, that the only thing linking them to a gang is a rose tattoo.  ",
    "comments": [
        {
            "author": "DeltaBot",
            "body": "/u/TurboKid1997 (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/1jeb0xf/deltas_awarded_in_cmv_trump_did_not_deport_the/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZX52",
            "body": ">used for cheap labor\n\nAs I understand it CECOT inmates aren't used for labour - they're kept in their cells 24 hours a day except for an hour of exercise per week. Other than that, they only leave their cells to go to medical or solitary, and they *never* leave the building, which is kept at full brightness 24 hours a day.",
            "score": 1,
            "replies": [
                {
                    "author": "Teknicsrx7",
                    "body": "Only the worst prisoners are kept in that situation\n\nThe rest do labor for profit (which goes to the prison).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sweaty_Ad4296",
                            "body": "Considering these people were never sentenced, that amounts to slave labour and punishment without a crime.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mercut1o",
                                    "body": "It's slave labour even if they're convicted. If you can't legally consent to sex, legally assemble to exercise free speech or unionize, or seek remote employment suitable for your skills then you are a forced laborer and a slave. Just because some opt in with the hope of lessening their term doesn't make it anything less than a coercive and inequal power dynamic.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Noob_Al3rt",
                                    "body": "> Considering these people were never sentenced\n\nDo you have a source for this?  I didn't even think the government even released their names let alone their records.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "atx_sjw",
                                            "body": "Your understanding is correct, and the government is not disclosing that information, so it’s hard to prove a negative, though easy for them to prove the people had a criminal history if that were actually true.\n\n[Here’s an article where an attorney claims that one deportee who sought asylum had no record](https://www.theguardian.com/us-news/2025/mar/18/trump-venezuela-migrants-deportated-el-salvador). That’s probably as close as we can get for the moment.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ZX52",
                            "body": "Do you have a source for that, as I understood it CECOT was exclusively for \"the worst.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Teknicsrx7",
                                    "body": "Honestly I saw it in a documentary, it was them working on cars and one other thing. But there’s no chance of finding it now, when I search anything related to it I just see the same articles copy pasted on every site and all the vids are the same news clips.\n\nI believe it may have been about the full prison system down there and not just CECOT so I may have gotten confused on that part, but I can’t even find it at this point so I have no clue",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "MindComprehensive440",
                                    "body": "Policing prison camps is one simple example.\n\nVideo from 2024 about CEDOT: https://youtu.be/tWjq0ECRxhA?si=-8DSf_ydcaFv3KHO",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Anything_4_LRoy",
                                    "body": "bukele likely puts who he honestly believes is \"the worst\" in the worst conditions.  i would expect most of those to be convicted in el salvadore tho... i have no faith that he will, simply incarcerate, anyone he doesnt believe fully is \"the worst\".  i trust he will try and profit from the situation and who cares if a few die in fights with tools type shit.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TurboKid1997",
                    "body": "Bukele on his Twitter, \"Over time, these actions, combined with the production already being generated by more than 40,000 inmates engaged in various workshops and labor under the Zero Idleness program, will help make our prison system self-sustainable. As of today, it costs $200 million per year.\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ZX52",
                            "body": "Is there any corroboration of this, or just Bukele's word? In all the reporting I've seen on CECOT itself, I've seen no evidence of the existence of these workshops. All descriptions I've heard about the prisoners' routines describe them as only having a break from their cells for bible study and exercise.\n\nAccording to AP News from just 2 days ago:\n\n>[The prison does not offer workshops or educational programs to prepare them to return to society after their sentences.](https://apnews.com/article/el-salvador-trump-prison-immigrants-4ab3fc3c0474efb308084604b61f8a37#:~:text=The%20prison%20does%20not%20offer%20workshops%20or%20educational%20programs%20to%20prepare%20them%20to%20return%20to%20society%20after%20their%20sentences)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ahotasu",
                                    "body": "The reports indicate there are no classrooms or workshops at the prison. This is not a mutually exclusive fact from the government leader saying these prisoners will be part of a \"Zero idleness program\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Wyvrex",
                                    "body": "Keep in mind A workshop in the educational context is different from a workshop in the labor context. They fact they are saying they arent offering workshops or educational programs is saying they arent offering educational seminars (workshops) not that there arent areas with tooling setup to produce items (workshop)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "talithaeli",
                                    "body": "Two different meanings of the word workshop. There is a workshop that is a place where people work, and there’s a workshop that is a guided space for learning and preparation. The first one very much seems to exist and the second one does not.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ZX52",
                                            "body": ">The first one very much seems to exist\n\nCan you please provide a link.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "talithaeli",
                                                    "body": "It’s from the quote you were responding to…",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ZX52",
                                                            "body": "What do you mean? The AP article? Nothing in there mentions a place the prisoners are going to to perform labour. \n\nYou claimed these places exist in CECOT. I haven't seen any evidence of this, other than unsubstantiated claims from Bukele's social media. If you've found evidence of their existence that I have missed, please would you provide it. I'm happy to be educated on this, but all I've been given so far is claims.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ahotasu",
                                    "body": "The reports indicate there are no classrooms or workshops at the prison. This is not a mutually exclusive fact from the government leader saying these prisoners will be part of a \"Zero downtime program\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "FetusDrive",
                                    "body": "Is Bukele trying to make the situation seem worse than it is? That wouldn’t make sense",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "creepindacellar",
                            "body": "sustainable prison systems, how grotesque.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Terrible_Use7872",
                            "body": "How much are other countries paying to use their prisons?  That probably gets factored into that dollar amount.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Dubbleedge",
                            "body": "Give a source beyond Twitter. Thanks. If you don't you may as well be stimming on your chest for the credibility it amounts to.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DankLeader",
            "body": "Could you clarify why you think this is an important distinction and why you would like this view changed? Both are unclear to me based on your post alone.",
            "score": 1,
            "replies": [
                {
                    "author": "RandomGuy92x",
                    "body": "Those people haven't just been deported. They've been sent to a mega prison in El Salvador solely based on accusations by ICE agents or police officers without ever having been granted a trial to defend themselves. Many apparently have been classified as cartel members solely based on some tattoos on their body. \n\nThat may not be technically extraordinary rendition. But it's obviously something very different than simple deportation. And it's a massive violation of human rights to deprive those people of a fair trial.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DankLeader",
                            "body": "I'd call it human trafficking, but I'm trying to understand why OP believes it's important to call it \"Extraordinary Rendition\" so that I can better understand what the view they want challenged really is.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "The_Lost_Jedi",
                            "body": "I wonder if people realize that the ultimate result of such is going to likely be very ugly.\n\nI should stress I'm just analyzing trends here, and making predictions, not advocating for violence - but I fear that violence will be the result. After all, when people realize that this is the result, and that they will have no legal recourse or defense, it's entirely possible that many will defend themselves violently rather than just go peacefully, as some of these initial deportees did. Hell, you'd literally have MORE RIGHTS as a defendant on murder charges here in the USA than these poor fucks had.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Noob_Al3rt",
                            "body": "> They've been sent to a mega prison in El Salvador solely based on accusations by ICE agents or police officers without ever having been granted a trial to defend themselves. Many apparently have been classified as cartel members solely based on some tattoos on their body.\n\nDo you have a source for this?  I didn't think the government had released any information yet.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "minimumnz",
                            "body": "how is it not techincally an extraordinary rendition? seems like it is.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RandomGuy92x",
                                    "body": "Extraordinary rendition is defined as abducting people from a foreign jurisdiction and transfering them to a third state. \n\nSo when the US kidnapped people from Afghanistan and Iraq and sent them to Guantanamo Bay that would have been an extraordinary rendition. \n\nBut detaining people who are already present in the US and then sending them to a foreign jurisdiction is technically not an extraordinary rendition since you're not abducting someone from a foreign jurisdiction. \n\nBut of course it's still fucked up that people are being imprisoned overseas without due process.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Purgatory115",
                                    "body": "Something Something right to remain silent?? It's not just Something said in those dog shit cop shows you can't presume guilt because someone rightfully doesn't want to talk to you.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RandomGuy92x",
                                    "body": "And if that's the case that would still have to be proven in court. I'm sure there are experts who specialize in identifying cartel members by their respective tattoos. And if you are accused of being a cartel member you still have the right to defend yourself in court against accusations.\n\nYou can't just skip the judicial process and act as if the executive branch had the power to sentence people to prison without granting them a trial.\n\nWhy do so many MAGA people not believe in the Constitution?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Happinessisawarmbunn",
                                            "body": "Im sure there are also cell phone records, witness testimony and a slew of other evidence used to make these decisions. There is no proof that they are just put in jail for having tattoos only…",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "RealCrownedProphet",
                                                    "body": "All things that should be documented through the normal legal processes and for a judge to review.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Happinessisawarmbunn",
                                                            "body": "No body is arguing that they shouldn’t be. Find someone else to discuss made up stories",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "RealCrownedProphet",
                                                                    "body": "That was not at all clear by your points. Don't play games.\n\n> Edit: you know what. You people defending cartel are truly a piece of work. Beyond my comment, there is a  whole host of other evidence used to denote affiliation. That’s includes the phones and bank transactions. If you really think these people are in jail For a tattoo you need a wake-up call\n\nNo one is defending cartels. We are defending due process, which was not followed here.\n\n> There is no proof that they are just put in jail for having tattoos only…\n\n> Well when you are trained by cartel not to talk to cops, often times the ONLY way to identify someone is by tattoos…\n\nNone of this proof has been presented to any legal process beyond \"Trust us, we have it.\" That isn't how the process works.\n\n\nDon't be a disengenious asshole.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Happinessisawarmbunn",
                                                                            "body": "You haven’t done the homework to prove otherwise.\n\nYou want to defend cartel, that’s on you.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RealCrownedProphet",
                                                                                    "body": "https://www.reddit.com/r/changemyview/s/bfCgF3GyhB\n\nWhy are you defending ignoring the Constitution?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Happinessisawarmbunn",
                                                                                            "body": "Ultimately there will be some innocent people in this process but there is no time now to be picky since the U.S. is falling apart and cartel are playing a large hand in that. It’s gonna get messy, get ready!",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "RealCrownedProphet",
                                                                                                    "body": "Can you stick to one response thread? I responded to this basic sentiment in the other one.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "RealCrownedProphet",
                                                    "body": "Evidence still needs to be processed through the normal legal processes.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Happinessisawarmbunn",
                                                            "body": "There is no evidence to suggest the normal legal\nProcess wasn’t used in these cases.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "RealCrownedProphet",
                                                                    "body": "They admitted they don't care what a judge thinks and act as though the judge's order to halt is biased and not a real order.\n\nhttps://www.cbsnews.com/news/trump-administration-ignored-order-gang-removal-flights/\n\nThey invoked some wartime law, when we are not at war with Venezulea, and skirted due process.\n\nLooks like you need to do your homework.\n\nhttps://www.axios.com/2025/03/16/trump-white-house-defy-judge-deport-venezuelans\n\nhttps://www.reuters.com/world/americas/venezuelans-deported-el-salvador-by-us-denied-due-process-says-top-lawmaker-2025-03-17/\n\nwww.bbc.com/news/articles/cr5219ezjrpo\n\nhttps://www.pbs.org/newshour/show/white-house-ignores-court-and-invokes-alien-enemies-act-to-deport-hundreds-of-venezuelans\n\nhttps://www.npr.org/2025/03/17/nx-s1-5329796/u-s-deports-hundreds-of-venezuelans-to-el-salvador\n\nEdit: https://www.axios.com/2025/03/17/tom-homan-deportation-flights-trump-court-order\n\nhttps://www.foxnews.com/media/tom-homan-calls-out-federal-judge-defying-logic-ruling-stall-trump-deportations?intcmp=tw_fnc\n\nhttps://www.thehill.com/homenews/administration/5198604-border-czar-trump-deportation\n\nEdit2: Corrected wording about \"admitting they ignored ruling\". They don't care what judges think is more correct and are now acting like the President has no lawful checks by the judicial system.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Happinessisawarmbunn",
                                                                            "body": "“So the legal experts that I spoke to, whether it’s Wehle or immigration experts, agree that gang members who have been convicted should certainly be deported, but that due process is key here.”\n\nOkay so you are correct and I’m also correct.\nAt the end of the day the vast majority of these guys are cartel, there will be a few others that are not.\n\nWhen you are dealing with millions of cartel in the United States, you most certainly will make mistakes.\n\nMaybe if the previous administration wasn’t making it insanely easy for anyone to come over we wouldn’t be in this messed up situation. \n\nNow a heavy hand is going to come down and remove everyone they can because there isn’t time for niceties anymore. War is on the horizon",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RealCrownedProphet",
                                                                                    "body": "Mistakes would have been less likely if they followed the process. Would you still think it was acceptable if you or the people you loved were rounded up and sent to a random country you don't even belong in because you \"looked\" like a member of some extremist group and the US was just like \"whatever, mistakes happen, guess we will never know which ones of those were actually bad?\" No, you fucking wouldn't.\n\nAlways with the whataboutism.\nBiden and Obama deported many undocumented people from the United States. Why does everyone act like they just left some magical door open and let everyone wander in willy-nilly?\n\nhttps://www.migrationpolicy.org/article/biden-deportation-record\n\nhttps://www.reuters.com/world/us/trump-set-broaden-arrests-deportation-routes-expand-immigration-crackdown-2025-02-21/\n\nhttps://leitf.org/wp-content/uploads/2021/04/Enforcement-Priorities-Memo.pdf&ved=2ahUKEwjjl8nbqJSMAxWP_8kDHSxgLm8QFnoECBEQAQ&usg=AOvVaw1-8txH4RjstY8RV4tiF4vW\n\nhttps://www.nytimes.com/2025/01/22/us/trump-biden-immigrants-deportations.html?smid=nytcore-android-share",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Happinessisawarmbunn",
                                                                                            "body": "You act like these people were all just picked off the street and thrown on a plane.\n\nAnd yes, during the Biden administration A record amount of illegals immigrants came in. Officially? 10 million. Unofficially? Far more. Simply unacceptable. NO country on earth would allow that to EVER happen except the Biden administration. It’s actually astounding how rediculous those numbers are",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "RealCrownedProphet",
                                                                                                    "body": "1. That is pretty much exactly what happened. Picked up -> plane. No legal processing, no judge, deportation at the say-so law enforcement and the federal government.\n\n2. Show me these \"unofficial numbers\". What kind of argument even is that? Seriously? \"Yeah, they deported tons of people, but the super secret numbers/reports show they actually kept the backdoor open for more.\"\n\nI'm gonna be straight-up, because I am not sure if you just aren't deep into this shit like I am or if you are another MAGA troll online or any combination of asshole/bot/malicious agent, etc. I am going to operate under the assumption that you are a relatively honest person who is \"tough on crime\" and wants to \"do the right thing.\"\n\nPoliticians lie - yep, a large majority, on both sides do. Don't mistake my defense of the system or defense of Biden/Obama in this situation as some blind loyalty. I will call out Democrats just as often as Republicans, the Green Party, the Libretarians, the Whigs, whatever.\n\n________________________________\n\nTrump is a conman, he has been for literal decades. The people he surrounds himself with are conmen, liars, and a some of them are legitimate and admitted white supremecists. (You could be a white supremencists/nationalist, and I can't really help you there, but will assume you are not that far gone. My comments apply either way.)\n\nTrump and his people would sell you and 99% of this country out for a dollar. They are currently grifting for far more than a dollar. They are selling out this country, and you (and me), in front of all of us. They would happily put you on that same plane they used for these alleged cartel members if they thought they would benefit from it in some way.\n\nI would have this same argument with any other person if it was you on those planes, despite our differences in opinion and political leanings. The process is the process, and rights are rights.\n\nWhile you believe that this is just some hammer of justice coming down with the iron fist of the law, this is them eroding the system to make it that much easier to do the same to you and anyone you love if that is what they choose to do down the line. There is a way to be harsh on crime and still be above board when it comes to legality and human rights.\n\nWhile you might see me/us/the left (or whatever label you ascribe to us) as the enemy, we are not. Despite what you think of our politicians, do not confuse us with them. There is a reason the Dems lost, and it was not completely because of Trump and MAGA. If you don't think we see their bullshit, you would be wrong.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Happinessisawarmbunn",
                                                                                                            "body": "You spend 90% talking about trump and 0% talking about how most of these guys really ARE CARTEL.\nSure they didn’t receive due justice and sure there are a few people not cartel- but most of them are. That’s the messed up situation we are all in- it’s gonna be messy but someone has to take out this trash.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "RealCrownedProphet",
                                                                                                                    "body": "Dude, seriously, I have said this multiple times, but I will spell it out.\n\nWhat **PROOF** is there beyond comments about \"tattoos\" and \"trust us\"? Verified proof, not your assumption that they have phone calls and text messages and photographs, what proof has the federal government documented and provided to anyone - including the legal system - that they are what the government claims they are?\n\nThe cops could pick you up today and throw you on a plane and say that you have one of those tattoos and deserve to be locked up and people aren't supposed to ask them to prove it? People aren't supposed to ask them to show the documentation and phone calls and whatever other evidence? We are just supposed to believe them?\n\nSeriously, what is going on with conservatives and MAGA these last 10 years? There used to be some semblance of healthy skepticism about the government, but as soon as it's your guy in the White House - a KNOWN conman - you all are just like \"Yeah man! Whatever you say dude. Do whatever you want because we won't ask any questions and will defend whatever you do without an ounce of critical thinking.\" Are you serious?\n\nIf it was Biden in there claiming that a bunch of people were Russian/Ukrainian/whatever spies and we were going to ship them to France, you would just defend that shit? I know I fucking wouldn't.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Happinessisawarmbunn",
                                                                                                                            "body": "It’s not my guy. Both parties are whack.\n\nHowever, over 10 million immigrants were totally just welcomed into the US under the Biden administration (officially, unofficially it’s much more)\n\nIm sure there will be a few innocent people here or there. It’s what’s gonna happen when you have to quickly clean up a mess like that..",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "RealCrownedProphet",
                                                                                                                                    "body": "You keep saying this, and I am not going to keep arguing in circles with you. It's pretty simple.\n\n\"Unofficial\" numbers mean nothing without proof. Why do you keep bringing it up? Provide proof, or it is literally meaningless. That is imaginationland stuff. It could be anything.\n\nYou know what the \"unofficial\" numbers say about people who defend the federal government's handling of this specific situation? 100% of them eat poop for breakfast. That's legit kind of gross. I don't know why you eat poop every morning, but you should probably stop.\n\nIf they followed the legal process, sure, mistakes happen. Everyone acknowledges that. But not following the process is a surefire way to ensure more mistakes happen and that this will be abused by anyone in power. One day, that mistake could be you, and because of things like today going unchecked there will be less opportunities for someone to find and catch you before you just become another \"mistake\" in some El Salvadorean prison. Send cartel members back to Venezuela, or to prison, or to wherever, but prove they are actually cartel members first.\nThat is literally all we are saying, and you are acting like that is somehow unreasonable, and that we are supporting cartels. That's insanity talking, and it's bullshit and disengenious. We are trying to protect your rights as well, and you don't even seem to care to protect yourself from the possibilities of things like this happening to you.\n\nYou are not correct in your stance here. I say this with zero malice, so I hope you will at least internalize some part of it: Open your eyes and mind and see this shit for what it really is before it is too late.\n\nStay safe out there.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "changemyview-ModTeam",
                                                    "body": "Your comment has been removed for breaking Rule 2: \n\n> **Don't be rude or hostile to other users.** Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2).\n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%202%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "changemyview-ModTeam",
                                            "body": "Your comment has been removed for breaking Rule 2: \n\n> **Don't be rude or hostile to other users.** Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2).\n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%202%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "changemyview-ModTeam",
                                    "body": "Your comment has been removed for breaking Rule 2: \n\n> **Don't be rude or hostile to other users.** Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2).\n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%202%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TurboKid1997",
                    "body": "I am unsure what rights, if any, the Venezuelan immigrants are given, I guess is part of it. Not sure what the 6 Million dollar contract says.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DankLeader",
                            "body": "Again, I'm unclear on what your view is. You seem to believe the term \"deport\" is inaccurate, but to my understanding the term \"extraordinary rendition\" is itself simply a euphemism for state sponsored abduction. Perhaps I am wrong and there is some specific context to this, but if \"deport\" is inaccurate then I'd imagine the term \"extraordinary rendition\" suffers from a similar lack of specificity and context. I'm trying to understand what is the view you want changed.\n\nIf you problem is that you feel the language is too soft, then \"extraordinary rendition\" is even worse because it's even softer, if you would like to use a harsher term I believe \"human traffiking\"would be more direct and accurate. [Trump triggered the economic crisis in Venezuela](https://www.aljazeera.com/news/2019/8/6/trump-imposes-economic-embargo-against-venezuela) during his first term, and then brought in refugees from Venezuela, [he even extended their stay](https://www.axios.com/2019/06/12/trump-increased-protections-venezuelans-fleeing), and now he is sending them to a third country as for profit slave labor without due process.\n\nHowever it remains unclear to me if this is your view and concern, hence why I am asking these questions.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TurboKid1997",
                                    "body": "∆ The term is not perfect.  But I think it does show somewhat the deprivation of rights. Human Trafficking also shows the deprivation of rights, in much stronger terms. Ultimately I am trying to see what rights they have if any in El Salvador, or are they still US prisoners. Which seems unclear.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DeltaBot",
                                            "body": "Confirmed: 1 delta awarded to /u/DankLeader ([7∆](/r/changemyview/wiki/user/DankLeader)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DankLeader",
                                            "body": "Thank you! Glad I could be of help.\n\nHowever, I'd still caution against \"extraordinary rendition\" because that term came into use precisely to try and hide the human rights abuses being done in places like Guantanamo Bay during the War on Terror. To you it might be clear what you mean by it, but it won't mean anything to people who did not live through those news cycles, or who might be from different countries. Using that term ensures that most of the people who read what you write or hear what you say will miss the point you're trying to draw attention to.\n\nAs to their rights, given they were never convicted anywhere I'm not sure they have any left. There is no conviction to be appealed, and there is no government to appeal to. As I understand it Bukele could not release the prisoners to Venezuela itself either, if he did they could simply try to go back tot he US.\n\nMainly I believe we are waiting to understand if some of the comments Bukele made means they will be used as forced labor or if the intent is for CECOT to function as an effective death camp through death by natural causes alone due to the absurdly poor living conditions. After all with 100 people in a single cell with only 2 toilets disease seems inevitable, but while hundreds have already died it is difficult to estimate how this might look at full scale given how empty most of the facility remains given it's planned capacity.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "TheMothHour",
                                            "body": "You should listen to this podcast. It talks about our deportation laws. By international law, you need to have a country to agree to take them in - reguardless of where their country of origins. You cannot just dump them in a country. \n\nIn the podcast, it explains that the US in the 40s (?) deported Peruvians to Japan. Its actually worse ... but it is too long and confusing to type up on my phone. If you want to flip tables in anger for what was done to these people, just listen.\nhttps://pca.st/episode/e673f473-d0cf-4385-9749-1b6b649fb1ec",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ExNihilo00",
                    "body": "They were detained without due process and shipped to a freaking gulag where they will remain for who knows how long despite no formal charges much less a conviction. If you don't think that's an important distinction from simply being deported there's something wrong with you.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DankLeader",
                            "body": "They'll remain there forever. The prison cost over 100 million to build and costs million to run, it depends on exploiting the forced labor of it's detainees to try and recover that money. That's why in El Salvador they have mass court trials where they sentence people 100 at a time, they need more workers to justify the labor camps. I'm just trying to understand why OP considers it \"Extraordinary Rendition\" and why that's an important distinction to them. Personally I'd refer to is as human trafficking, after all it was Trump who created the economic crisis in Venezuela, then brought in the Venezuelan refugees from the economic crisis and then even extended their stay.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ExNihilo00",
                                    "body": "The distinction seems important to me because they are calling it deportation when, like you said, it's human trafficking. Hell, it's literally slave trading. When they call it deportation they are completely misrepresenting it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DankLeader",
                                            "body": "Right, and if that's the case with OP I'd also recommend he use terms such as human trafficking and slave trading, because extraordinary rendition is a term that was made up to serve as a euphemism for state abductions precisely because it is softer language, so if the problem is the use of language to disguise the actions of the administration OP is making it worse. Deportation at least, has a direct link to the holocaust (which was btw partly inspired by US mass deportation initiatives), \"extraordinary rendition\" is a buzzword the CIA came up with to hide precisely these types of actions.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ExNihilo00",
                                                    "body": "Deportation is a legal process that literally every country has. It's not inherently bad, though it often is misused and abused by certain countries.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "DankLeader",
                                                            "body": "Of course, but never en masse. Find any example of mass deportation and you are likely to find abuses of the highest order.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ExNihilo00",
                                                                    "body": "Yeah, that's true.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "c0l245",
            "body": "Is your claim that their current prison situation is still under US Jurisdiction and therefore they weren't deported?",
            "score": 1,
            "replies": [
                {
                    "author": "minimumnz",
                    "body": "Deportation requires a judicial process. They didn't receive this so it's a extraordinary rendition not deportation.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "audaciousmonk",
                    "body": "There’s some level of custodial relationship still  involved, because the US is paying El Salvador to administrate their incarceration \n\nAlso people who are deported normally are  released in another country, not transferred directly into custody, much less prison sentence (another country performing an arrest after deportation is a separate matter)\n\nThese people were transferred directly into the custody of El Salvador, which would typically be considered an extradition. Except extraditions involve criminal charges from the country requesting extradition, not one country paying another to take their prisoners without the recipient country having their own charges to bring against the prisoner\n\nThough I’m sure El Salvador / US will make something up where its lacking",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TurboKid1997",
                    "body": "I think that is part of it.  We are paying Bukele 6 Million dollars.  I think part of the CIA Black sites programs was that the jurisdiction is disputed.  Who is ultimately in charge of them getting released?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "c0l245",
                            "body": "If they were not deported, and still within US jurisdiction, shouldn't they be entitled to habeas corpus and therefore be able to challenge their incarceration through appeals?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BugRevolution",
                                    "body": "Schrodinger's deportation. Just like Guantanamo, the government could simultaneously claim they are under US juridiction and therefore not deported, but not subject to US jurisdiction and therefore not entitled to constitutional protections.\n\n\nWhich was the great travesty of Guantanamo.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Equivalent_Sort_8760",
                                            "body": "And like the entire Iraq “oops wrong country” war this is almost never spoken about. The silence and complicity of our media is why this country is sliding into oligarchic fascism.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Level21DungeonMaster",
                                                    "body": "That. Man… I like never talk about this to anyone but I was in the military during the prequel to that war. I saw it coming and I still believe the US were the aggressors. I went AWOL because I knew, I just knew, that Bush was about to start something evil AF and I wanted to not be a part of that at all.\n\nThat decision hurt my career, but I’ll never think it was the wrong choice.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Equivalent_Sort_8760",
                                                            "body": "Of course we were the aggressors.  Does anyone have the balls to say we weren’t?  Yea Sadam was a bad guy , in a rough place full of bad guys but no nukes and nothing to do with 9/11.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Level21DungeonMaster",
                                                                    "body": "At the time it was not clear to the majority of the country. Everyone was all in and I could not talk about it in mixed company. It cost me dearly.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ElEsDi_25",
                                                                            "body": "Both parties and the media were saying it was true. This is why I don’t get people who have nostalgia for those days of 00s Washington consensus… it’s what got us here! It’s similar with Palistine today… both parties agree and the media and so we live is an upside-down world where Israel makes excuses for European far-right and US alt-right Neo-Nazis while the US government calls Jewish anti-Zionists “antisemitic”. Just absurd lies to hide power relationships and state brutality.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Level21DungeonMaster",
                                                                                    "body": "\nI was stationed towards the USS enterprise in the US Atlantic fleet.\n\nDuring Clinton’s presidency, we were doing big circles in the Atlantic, training exercises. As soon as Bush Cheney came in, they redeployed ships to aggressive/threatening stances all around the world. \n\nThis provoked the USS Cole bombing which was the “first shot” in the war. \n\nThen 9/11 happened and it was patriotic fury from see to shining sea.\n\nThe thing was that they always, always wanted a war there. I have neocon politicians in my family. They talked openly about it around the holiday dinner table, wanting to have a continual war in the Middle East.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ElEsDi_25",
                                                                                            "body": "Yeah there was a ton of WW2 nostalgia at that time too about how the country was so united back then (because people thought 90s politics were too polarized lol.) I think it was Condi Rice who basically wrote “we need something like pearl harbor” to really push the neocon aims. (Not saying it was a conspiracy, I don’t think it was - they just seized on an “opportunity” they’d been hoping for and shamelessly used real sadness for what they wanted to do anyway.)",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Equivalent_Sort_8760",
                                                                                            "body": "They weren’t secretive about it.  \n\nNow we have Trump who claims to be peaceful while following every single thing a Putin wants. \n\nWhich is worse?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Level21DungeonMaster",
                                                                                                    "body": "I think you know Trump is worse by far. My expectation is at a minimum, a nuclear attack in the US against a \"liberal\" city, maybe we'll be lucky and it will be limited to drone swarms armed with bio-chem weapons or something.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Equivalent_Sort_8760",
                                                                            "body": "Not everyone but a huge % for sure.  I was always skeptical based on what many were saying.  But basically all politicians except Bernie Sanders including Pelosi and Hillary.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "helikophis",
                                                                                    "body": "It’s weird to me that the retrospective story seems to be “wide consensus”. My experience of that time was huge protests, unrest, and a widespread idea that this was “war for oil” and completely illegitimate. I was in a major urban center so maybe it doesn’t reflect what people were thinking on the suburbs.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Equivalent_Sort_8760",
                                                                                            "body": "Consensus among congress and media.  \n\nYou’re completely right.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ElEsDi_25",
                                            "body": "“Was”? You mean still is and will be again.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sleep_adict",
                                    "body": "That’s when laws used to apply",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "spicy-chull",
                                            "body": "Law has always been fake.\n\nMore people are just noticing now.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Equivalent_Sort_8760",
                                                    "body": "Laws are real people are just always trying to get around them. Some pay the price some don’t",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "spicy-chull",
                                                            "body": "> Some pay the price some don’t\n\nAre there any detectable patterns in who does and does not pay the price?\n\nOr is the Justice/Injustice evenly distributed?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Equivalent_Sort_8760",
                                                                    "body": "Haha. Patterns sure. \n\nFollow the money first then race and religion and other tribal characteristics but money first.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "spicy-chull",
                                                                            "body": "No further questions.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "audaciousmonk",
                                    "body": "That’s a major part of the issue, particularly because El Salvador is under martial law and doesn’t afford such rights to prisoners at this time\n\nSo the US is violating due process and constitutional law by moving individuals in its custody to El Salvador incarceration in this manner\n\nCases aren’t even being adjudicated at this time….   And once they restart adjudication, prisoners will face bulk trials in groups up to 900 individuals\n\nSource: https://ilas.columbia.edu/sites/default/files/content/CeMeCA_Paper12%20FINAL%20(1).pdf",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Glittering_Rain4267",
                                    "body": "Would they since the gangs has been declared a terrorist organization?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LucidLeviathan",
                                            "body": "That doesn't suspend the writ of habeas corpus. The writ is guaranteed by the Constitution.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lancasterbation",
                                                    "body": "That was the whole point of him invoking the Alien Enemies Act against Venezuelan nationals who are 'members' of Tren de Aragua. That does suspend habeas corpus.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LucidLeviathan",
                                                            "body": "Right, but that aspect of the Alien Enemies Act doesn't have a great track record in court. The Supreme Court has said multiple times that it would have blocked Adams' usage of the Alien and Sedition Acts.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Lancasterbation",
                                                                    "body": "Yet here we are, people have been deported* to a nation other than their nation of origin without due process.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Glittering_Rain4267",
                                                    "body": "Isn’t that what the patriot act did? Isn’t that why we’ve been able to hold people in guntanimo not being a dick just curious",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LucidLeviathan",
                                                            "body": "That's a legitimate question, and we honestly don't have the answer. Formally, the PATRIOT Act does not suspend the writ, but limits what courts can hear it. To me, that is functionally suspending the writ, but I'm not the one making the rules. If I *was* the one making the rules, the rules would be a whole hell of a lot different.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Glittering_Rain4267",
                                                                    "body": "Oh for sure it’s just interesting that especially in immigration we see this microcosm of the problem with government right now where things that were done for good intentions  a long time ago stack and conflict with each over time in ways we never intended them to.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "LucidLeviathan",
                                                                            "body": "I don't know that I'd go THAT far about the PATRIOT Act. It was controversial even when it was passed.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Glittering_Rain4267",
                                                                                    "body": "I’m not even talking about the patriot act really . I’m saying the interpretation of the 14th amendment to extend birthright citizenship to illegal aliens or top of the Flores settlement and the change to the asylum system on top of a hundred other minute changes have paralyzed those wanting to reduce illegal migration to the point they elect a man willing to use the sledge hammer of the patriot act to do something.  Idk if that makes sense its just something that been running through my head to explain trump",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "LucidLeviathan",
                                                                                            "body": "Well, I think you have it sort of backwards. Certain people wanted Trump, so they stoked the immigration fires enough so that a large number of voters wouldn't care about him doing this shit.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "FloppedTurtle",
                                            "body": "They weren't gang members. [https://www.miamiherald.com/news/local/immigration/article302251339.html](https://www.miamiherald.com/news/local/immigration/article302251339.html)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Glittering_Rain4267",
                                                    "body": "I mean wasn’t that the whole justification for this? I’m not trying to get into the nitty gritty of was everyone a member of the gang but there were presumably some on the plane. So for those who were on the plane would they have any of the general due process right under current law? Genuinely curious.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "FloppedTurtle",
                                                            "body": "I mean, yes, that's what the administration said. But they didn't provide any evidence for that and none of the men on the plane have criminal convictions. At least one was a legal asylum seeker who had tattoos because he was a tattoo artist seeking asylum because he was facing homophobic violence from the gangs in Venezuela.   \nBut no, now that they're out of the country, they don't actually have due process rights. Their cases are now civil, basically instead of the government having to prove that they were guilty, their lawyers now have to prove that the government made a mistake. And, honestly, even if they prove beyond a shadow of a doubt that all of these men were innocent, it's unlikely the current administration will actually bring them back. Trump has already ignored court orders and called for the impeachment of any judges that rule against him.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Sweaty_Ad4296",
                            "body": "The question is more who is in charge of actually convicting them of a crime, because that hasn't happened. Also, it's rather unbelievable that the US would sentence people to hard labour for indeterminate duration in a notoriously inhumane prison system.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OkPoetry6177",
                            "body": "Exactly. It's a US prison in the same way a privately owned and operated prison is still a US prison. The only difference is the choice of contractor, which here is another nation-state rather than an American company.\n\nIf we're saying we just gave them to El Salvador, we're talking about human trafficking",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dood9123",
                                    "body": "The difference is the inability to access their legal rights through the legal system to challenge their Incarceration without trial",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Pseudoboss11",
                                            "body": "And are likely to be subjected to conditions that would be considered abhorrent to the point of being illegal in US prisons.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "OkPoetry6177",
                                            "body": "So, it's just straight up kidnapping and human trafficking",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sandgrease",
                                                    "body": "Yep.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "changemyview-ModTeam",
                                                            "body": "Your comment has been removed for breaking Rule 3: \n\n> **Refrain from accusing OP or anyone else of being unwilling to change their view, or of arguing in bad faith**. Ask clarifying questions instead (see: socratic method). If you think they are still exhibiting poor behaviour, please message us. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_3).  \n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%203%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Noob_Al3rt",
                                            "body": "Do you have a source for this?  How were the five who filed and got left behind in the USA able to do it but the rest weren't?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sandgrease",
                                    "body": "It is human trafficking, thes people will now be slaves in El Salvador.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hour-Anteater9223",
                            "body": "Can you source the 6million dollars somewhere? I haven’t seen how much per detainee we are paying the Salvadoran government. I’d assume it’s cheaper to detain someone there than it is to detain someone in America at a for profit prison here. I prefer to save money.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TurboKid1997",
                                    "body": "https://www.foxnews.com/politics/us-paid-el-salvador-take-venezuelan-tren-de-aragua-members-pennies-dollar-white-house-says  as well as an article about the conditions https://www.france24.com/en/live-news/20250128-no-way-out-grim-conditions-in-el-salvador-s-mega-prison-for-gangs",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hour-Anteater9223",
                                            "body": "Sweet thanks. Assuming Trumps government isn’t lying about the figures. \n\nSo 6 million divided by 238 is $25,210 Per prisoner. I wonder if that is a yearly payment or a one time payment. \n\n“Spending per prisoner varies more than tenfold across states, from just under $23,000 per person in Arkansas to $307,468 in Massachusetts. Spending in Massachusetts was more than double any other state; the median state spent $64,865 per prisoner for the year.”\n\nhttps://usafacts.org/articles/how-much-do-states-spend-on-prisons/\n\nSo definitely saves the government money to send illegal alien prisoners to El Salvador.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Noob_Al3rt",
                                                    "body": "It's the fee for a one year term",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Hour-Anteater9223",
                                                            "body": "Source? Wonder if we will get a deal based on economies of scale.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Noob_Al3rt",
                                                                    "body": "From the president of El Salvador:\n\n>Today, the first 238 members of the Venezuelan criminal organization, Tren de Aragua, arrived in our country. They were immediately transferred to CECOT, the Terrorism Confinement Center, for a period of one year (renewable).",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Hour-Anteater9223",
                                                                            "body": "Thanks!",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Responsible-Sale-467",
                    "body": "Deportion means returned to home country. That’s not what happened to the Venezuelans in this case. They were disappeared/sent to the gulag.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "destro23",
            "body": "> Trump did not \"deport\" the Venezuelan immigrants\n\n> in this case the people were in the United States\n\nIf you are in a nation, and then ejected by the government of that nation, you have been deported from that nation.",
            "score": 1,
            "replies": [
                {
                    "author": "TyphosTheD",
                    "body": "Deportation is a legal process. A legal process explicitly clarified by the US Immigration and Customs Enforcement agency as \"[...removed from the United States to their countries of origin...](https://www.ice.gov/factsheets/ice-air-operations)\".\n\nShipping presumed immigrants to nations other than their countries of origin is reserved specifically for repatriation efforts of \"aliens who have failed to comply with final orders of removal, security risks, or other risk factors.\".\n\nGiven Rubio's own commentary suggesting they aren't sure the people they kidnapped and shipped to El Salvador are members of TdA, and the lack of any commentary to the effect that these people were deported as part of the Special High-Risk Charter flights program, there is no evidence to suggest they fall into that latter category. QED, they weren't \"deported\", they were kidnapped by government officials and shipped to a country not of their origin as part of an broad sweeping approach to categorically remove brown-skinned people from America under presumption of guilt.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sweaty_Ad4296",
                            "body": "If they were not deported, what happened was human trafficking, and anyone involved (such as Rubio) is subject to severe punishment in most countries.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TyphosTheD",
                                    "body": "I'm reminded of history, as usual, such when America decided to \"fix mental health institutions\" by shipping off the mentally ill to random corners of the country with $20 bills and leaving them. Or more recently, shipping immigrants from Texas to Martha's Vineyard and leaving them.\n\nSame shit, different day, treating humans they don't like as chattel.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WickedlyWitchyWoman",
                                            "body": "Ahhh, not so. Chattels are valuable personal property. They don't treat chattel like that.\n\nWhat these people were treated like was *refuse* \\- in other words, garbage. Something to be thrown away. Because that's how they see them.\n\nNot as fellow human beings, but as filthy rubbish they want to have disappear from their midst.\n\nThey don't even see the ones they're shipping off now as chattel. They're paying El Salvador to take them away rather than enslaving them in prisons here, where they could actually make money off them. El Salvador is just New Jersey and the US is New York City - they're paying them to take out the trash.\n\nWhich just tells you who the real garbage is.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Sweaty_Ad4296",
                            "body": "If they were not deported, what happened was human trafficking, and anyone involved (such as Rubio) is subject to severe punishment in most American countries.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Sweaty_Ad4296",
                            "body": "If they were not deported, what happened was human trafficking, and anyone involved (such as Rubio) is subject to severe punishment in most American countries.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "bifewova234",
                            "body": "Yeah but that is the ICE definition and the dictionary definitions used in common parlance do not distinguish based on where the migrants are being sent to. There is nothing to suggest that OP was using ICE's definition. The plain and ordinary meaning of words apply unless there is a reason to think that they dont.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TyphosTheD",
                                    "body": "There very much is \"something\" suggesting OP is referring to the legal process of deportation: the entire framing of the OP is that the people taken were sent to a prison in another country rather than to their origin countries.\n\nThis sounds like a \"that depends on what the definition of 'is' is\" point utterly irrelevant to the topic instead of engaging with OP's point in a meaningless, and fruitless, attempt at a technicality.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "bifewova234",
                                            "body": "TBH OP didnt make much sense to me. He said \"this is not just deporting\" which suggests that he thinks that it is deporting and more, which isnt consistent with his CMV position which is that Trump isnt deporting.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mortomes",
                    "body": "This is the deportation plus package",
                    "score": 1,
                    "replies": [
                        {
                            "author": "eggs-benedryl",
                            "body": "when you think a Brand New Car! is behind Curtain # 3 but it's indefinite servitude instead",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TurboKid1997",
                    "body": "Trump gave Venezuelan immigrants protected status when they were escaping \"communism\" in his first term. Then last month, revoked it.  Now they are so dangerous that they must be deported immediately despite no conviction of crime?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "destro23",
                            "body": "> Now they are so dangerous that they must be deported immediately despite no conviction of crime?\n\nWhat does this question have to do with your view and my response?\n\nYou said he did not “deport” them. My rebuttal is that any removal from a country of an individual by that country’s government is a deportation. And, now you are indeed saying they were deported. So, how stands your view?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TurboKid1997",
                                    "body": "∆ I think I responded to the wrong comment there, I mean to respond to one who was saying something gangs and criminals.  But you do have a point that if I use the term , there is some truth to it.  Extraordinary Redition was taking people from other countries to a 3rd country.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DeltaBot",
                                            "body": "Confirmed: 1 delta awarded to /u/destro23 ([426∆](/r/changemyview/wiki/user/destro23)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Silly_Stable_",
                    "body": "If we’re to be pedantic, which I’m gonna be, they need to be sent to their country of origin. Otherwise it’s not deportation. \n\nWords mean things.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "destro23",
                            "body": "> Words mean things.\n\nThey do, and “to their country of origin” is not part of the meaning per Oxford:\n\nDeport: to force somebody to leave a country, usually because they have broken the law or because they have no legal right to be there",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Silly_Stable_",
                                    "body": "I’m not talking about dictionaries. I’m talking about US law.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "destro23",
                                            "body": "> If we’re to be pedantic, which I’m gonna be…\n\nYou didn’t specify that. You said words have meaning, so I gave you the meaning of the word.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Silly_Stable_",
                                                    "body": "Uh huh.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "alexisdelg",
                    "body": "the are taking people and shipping them off to a prison in another country, without due process in either country and against this country's court orders",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "alexisdelg",
                                    "body": "there were explicit orders to stop the deportation process even \"turning back the plane\" because due process wasn't followed, it's against the constitution for the executive to craft a del with a foreign nation that states \"we'll just ship all the nationals from a 3rd nation\" everydoby within the US is subject to the constitution be them nationals or not.\n\nWhat you are claiming is that if the president were sign a deal with Cuba to ship all persons using \"throbbin-rinpoche\" as a username in reddit without any recourse then it's legal to do so?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "alexisdelg",
                                                    "body": "where's my constitutionalist people?\n\n> No person shall be held to answer for a capital, or otherwise infamous crime , unless on a presentment or indictment of a grand jury, except in cases arising in the land or naval forces, or in the militia, when in actual service in time of war or public danger; nor shall any person be subject for the same offense to be twice put in jeopardy of life or limb; nor shall be compelled in any criminal case to be a witness against himself, nor be deprived of life, liberty, or property , without due process of law; nor shall private property be taken for public use, without just compensation .",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HadeanBlands",
            "body": "The whole thing that makes it \"extraordinary rendition\" is that forces from one country, operating in a second country, capture somebody and move them to a third country. That is what makes it extraordinary - the people are not doing this in their own country.\n\nIf you arrest somebody in your own country and move them to a second country that is just what deporting is. We usually deport people back to their country of origin. But not always.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweaty_Ad4296",
            "body": "If they were not deported, what happened was human trafficking, and anyone involved (such as Rubio) is subject to severe punishment in most American countries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hefty_Government_915",
            "body": "Yeah. He sent them to an outsourced concentration camp. \n\n\n\nNevermind Trump extended TPS for Venezuelan migrants himself, gotta please the insane racists in the base",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "undercooked_lasagna",
                    "body": "This is a great post but probably pointless. This subreddit has become a place for people to make politically charged rants under the guise of wanting their views changed.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Happinessisawarmbunn",
                    "body": "What he said…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "killdred666",
                    "body": "if they can do it them, they can do it to you and if you think skipping due process is justified at any point then we really don’t have a justice system, now do we? \n\nwho cares who got kidnapped and shipped to a for profit terrorist prison in el salvador? that shouldn’t happen to anyone period. it’s ridiculous to have this conversation at all but here we are i guess",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HalfDongDon",
                            "body": ">if they can do it them, they can do it to you and if you think skipping due process is justified at any point then we really don’t have a justice system, now do we?\n\nIllegal immigrants aren't entitled to due process per the supreme court. \n\n\"ThEy CaN dO it tO YoU!!\" \n\nWhen Trump starts detaining and expelling American citizens then we can talk. No, deporting illegal alien criminals is not the \"slippery slope\" that descends into Naziism. Jesus christ.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "killdred666",
                                    "body": "every single person on u.s. soil is afforded due process. you cannot determine if someone is actually a criminal without due process. that’s the process for determining if a crime has occurred. that’s how it has always been. that’s how the constitution works, whether you like it or not. it applies to EVERYONE most importantly including criminals",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HalfDongDon",
                                            "body": "It doesn't apply to illegal immigrants. You're welcome, and thank you for coming to my lesson.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "killdred666",
                                                    "body": "back up your claim. now. go on.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HalfDongDon",
                                                            "body": "Google specific terms such as \"expedited removal,\" and the law that the trump admin is deporting people under.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "killdred666",
                                                                    "body": "that’s not the question i asked. i asked you to define due process and to explain to me in detail the exact process in this country that is used to determine someone has committed a crime",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cossiander",
                    "body": "\"They're terrorists because they have tattoos\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HalfDongDon",
                            "body": "You should run for office. \n\nDid I say they're terrorists because they have tattoos? No I said they're terrorists because they have terrorist tattoos. You can't just walk into any tattoo shop and get a giant fucking MS13 tattooed on your face, neck, back, and chest.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cossiander",
                                    "body": "If the evidence of them being terrorists were clear, Trump wouldn't be so terrified of airing that evidence in a court of law.\n\nThe fact that they're being extrajudicially disappeared, rather than given a trial, is evidence that they aren't actually terrorists.\n\nBut go on, keep telling everyone that laws shouldn't matter. Hopefully someone who sat out the 2024 elections will see it and get a better idea of how truly evil you people are.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HalfDongDon",
                                            "body": ">Trump wouldn't be so terrified of airing that evidence in a court of law\n\nSource? You mean the same judges who helped Biden let 16 million illegals in the country in 2024?\n\n>  \nThe fact that they're being extrajudicially disappeared\n\nIt's actually public knowledge where they were sent, so \"disappeared\" is disingenuous at best.\n\n>But go on, keep telling everyone that laws shouldn't matter. Hopefully someone who sat out the 2024 elections will see it and get a better idea of how truly evil you people are.\n\nLaws do matter, that's why we're deporting people who are here illegally. Laws don't start where you political agenda does. Evil? Half the US literally voted for this. It's amazing that this all of a sudden now a humanitarian crisis when it was Obama who started \"kids in cages\" and nobody had an issue until Hillary lost the election lmao.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "cossiander",
                                                    "body": ">Source? \n\nThe fact that he's ignoring courts now. Why else would he break the law? Is it a sexual kink?\n\n> You mean the same judges\n\n1. That's whataboutism\n2. It's not even *sensical* whataboutism\n\n>It's actually public knowledge\n\nDenied legal counsel, denied access to friends, to family, to press. That's \"disappearing\" people. Trump is disappearing political dissidents, and you're cheering him on. Some real fascist shit, right there.\n\n> that's why we're deporting people who are here illegally\n\nWrong.\n\n>Half the US literally voted for this. \n\nWrong.\n\n>Obama who started \"kids in cages\"\n\nWrong.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HalfDongDon",
                                                            "body": ">Denied legal counsel, denied access to friends, to family, to press. That's \"disappearing\" people. Trump is disappearing political dissidents, and you're cheering him on. Some real fascist shit, right there.\n\nIllegal aliens are not afforded due process. Political dissidents? Since when has Latin-American cartel and gang members been political dissidents? It's not fascist because you disagree with it, weirdo. Name another civilized country which allows illegal immigrants to remain indefinitely?\n\n>Wrong.\n\nSource on the 300 deported to Venezuela being American citizens? Illegal immigrants are subject to deportation. Period.\n\n>Wrong.\n\nSorry, you're right. He actually won the popular vote, so MORE than 50% of those who voted, voted for this.\n\n>Wrong.\n\nSource?\n\n[https://www.latimes.com/california/story/2020-10-27/presidential-immigration-debate-fact-check-and-who-built-the-cages](https://www.latimes.com/california/story/2020-10-27/presidential-immigration-debate-fact-check-and-who-built-the-cages)\n\n*The Obama administration did build the cages Trump alluded to. The facility Trump mentioned was built with chain-link fencing by the Obama administration in 2014*",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "cossiander",
                                                                    "body": ">Illegal aliens are not afforded due process.\n\nWhataboutism. We aren't talking about illegal aliens.\n\n>Political dissidents? Since when has Latin-American cartel and gang members been political dissidents?\n\nIf they're cartel gang members, prove it in a court of law. I'm not taking Trump's word on this.\n\n> Name another civilized country \n\nYou name another civilized country that shoves its inhabitants onto planes and sends them out to extrajudicial foreign prisons without even a court hearing.\n\n>Source on the 300 deported to Venezuela being American citizens?\n\nI didn't claim that.\n\n>MORE than 50% of those who voted, voted for this.\n\nWrong.\n\n>*The Obama administration did build the cages Trump alluded to.* \n\nShifting goalposts. You didn't say \"Obama built the cages\", you said \"put kids in cages\". This is like saying that people who make baseball bats are guilty of murder if the bat they made gets used to kill someone six years later.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HalfDongDon",
                                                                            "body": ">Whataboutism. We aren't talking about illegal aliens.\n\nWe are. The 300 deportees were American Citizens here legally?\n\n>If they're cartel gang members, prove it in a court of law. I'm not taking Trump's word on this.\n\nIt's not Trump's word. It's the word of the entire federal justice department, and y'all loved it's word when it was shitting on Trump.\n\n>I didn't claim that.\n\nIf they aren't illegal aliens and they aren't American citizens, what are they? If they had legitimate immigration documents they wouldn't be on the plane.\n\n>Wrong.\n\nProve it\n\n>  \nShifting goalposts. You didn't say \"Obama built the cages\", you said \"put kids in cages\". This is like saying that people who make baseball bats are guilty of murder if the bat they made gets used to kill someone six years later.\n\nSo Obama just built the cages and didn't use them? L-O-L. Obama caged more kids than Trump did in 2016-2020.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "cossiander",
                                                                                    "body": ">The 300 deportees were American Citizens\n\nAre you under the impression that everyone who isn't an American citizen is therefore an illegal alien? I cannot for the life of me understand these nonsensical questions.\n\n>It's the word of the entire federal justice department\n\nThen they should be eager to make their case in a court of law.\n\n>If they aren't illegal aliens and they aren't American citizens, what are they?\n\nLegal residents?\n\n>If they had legitimate immigration documents they wouldn't be on the plane.\n\n\"If they didn't break the law, then why did they get arrested?\"\n\n>Prove it\n\nTrump got 77,303,568 votes. There were 155,201,157 cast votes for President. Half of that number is 77,600,578.5. 77,303,568 is less than 77,600,578.5, therefore Trump got less than 50% of cast votes.\n\n>So Obama just built the cages and didn't use them?\n\n[https://apnews.com/article/immigration-north-america-laws-george-w-bush-politics-26b88518310f47018b724e200b28e88f](https://apnews.com/article/immigration-north-america-laws-george-w-bush-politics-26b88518310f47018b724e200b28e88f)\n\nThe child seperation policy was under Trump.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "HalfDongDon",
                                                                                            "body": ">Are you under the impression that everyone who isn't an American citizen is therefore an illegal alien? I cannot for the life of me understand these nonsensical questions.\n\nIf they has a legal right to be here they wouldn't have been deported. Every single piece of documentation, news, or otherwise I can find shows the Trump administration is targeting those who are here illegally. If they weren't here illegally they wouldn't be subject to deportation.\n\n>Legal residents?\n\nProve the Trump administration is targeting legal residents. I've seen no reports that the 300 on the plane were legal residents.\n\n>\"If they didn't break the law, then why did they get arrested?\"\n\nSee above. \n\n>Trump got 77,303,568 votes. There were 155,201,157 cast votes for President. Half of that number is 77,600,578.5. 77,303,568 is less than 77,600,578.5, therefore Trump got less than 50% of cast votes.\n\nOK - Trump won the popular vote. The majority of voters who voted for a party with a chance to win the election elected for this to happen. Those who voted 3rd party threw their votes away and should be discarded in any reasonable discussion.\n\n>The child seperation policy was under Trump.\n\nRed herring. Obama built the cages, and filled the cages with kids, families, others. Kids in cages is either bad or it isn't. I didn't say anything about separation policy. \n\nYou're also missing the that if immigrants came through a designated port of entry they wouldn't be separated, or treated as illegal immigrants. Which is the entire fucking point.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "cossiander",
                                                                                                    "body": ">If they has a legal right to be here they wouldn't have been deported.\n\nHow do you know? There were no hearings, no courts.\n\n> Every single piece of documentation, news, or otherwise I can find shows the Trump administration is targeting those who are here illegally\n\nAs well as some here legally. There's been lots of reporting on this.\n\n>Prove the Trump administration is targeting legal residents.\n\nLegally, there's a presumption of innocence. Anyone disappeared by Trump who wasn't given a legal hearing or a court trial is presumed innocent.\n\nThere are [also](https://www.cato.org/blog/new-discriminatory-arbitrary-legal-immigration-system-coming) a [ton](https://www.themarshallproject.org/2025/03/15/trump-immigration-arrest-mahmoud-khalil) of [examples](https://www.latimes.com/politics/story/2025-02-07/trump-immigration-crackdown-targets-legal-pathways) of Trump [going](https://www.theguardian.com/us-news/2025/jan/30/trump-immigration-deportation) after [legal](https://www.cbsnews.com/news/trump-migrants-crackdown-legal-immigration/) [immigrants](https://www.politico.com/news/2025/03/18/trump-deportation-plans-concerns-00234545).\n\n>I've seen no reports that the 300 on the plane were legal residents\n\nAnd there's no proof there were illegal either. Because ***they were denied legal process***. People can't just go on shooting sprees and then when the cops show up say \"it's okay- everyone I shot is a murderer\". But I guess we can take comfort in the fact that **you** would be okay with that, given your vocal defense of wanton criminality here.\n\n>The majority of voters who voted for a party with a chance to win the election elected for this to happen.\n\nYou're getting closer to reality, but I personally doubt that the overwhelming majority of even Trump voters are in favor of the government rounding up dissidents and shipping them off to foreign prisons without even a court date. Trump won because enough voters were tricked into thinking that Trump cared about things like *affordable groceries* or *fixing the border*. Two things he has done nothing to solve.\n\n>Obama built the cages, and filled the cages with kids, families, others. Kids in cages is either bad or it isn't.\n\nBad faith nonsense. This is like saying \"murder existed under Obama, therefore Obama was just as bad as Trump\". You're making a false equivalency that's a blatant distortion of facts. The humanitarian crisis was created under Trump.\n\n>You're also missing the that if immigrants came through a designated port of entry they wouldn't be separated, or treated as illegal immigrants. Which is the entire fucking point.\n\nNo, that's not the point. People shouldn't be tortured, regardless if they came into the country from a designated port of entry or not.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RandomGuy92x",
                    "body": "They did a propaganda video that showed a handful of people with a lot of tattoos. I'm pretty sure they did not show all of the 250+ people that have been sent to El Salvador in that video. I'm pretty sure that people that looked less like classical gang members probably would not have been shown in the video. \n\nBut either way, having tattoos does not make you guilty of being a gang member. Like apparently one guy was a tattoo artist whose tattoos have been misinterpreted. \n\nEven if just a handful of those people turn out to be innocent that would be a massive violation of human rights. \n\nWhy do you not believe in the Constitution? Why do you think judicial processes should be skipped over and people should be deprived of the right to a fair trial? Do you not understand the three branches of government?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Technical_Scallion_2",
                            "body": "It drives me fucking crazy that the same exact people who hold up \"founding fathers\" and \"constitution\" and \"freedom\" when it suits them just throw all that shit completely out the window when it doesn't suit their particular purpose.\n\nWe have a Constitution for a reason. People are given due process for a reason. It protects EVERYONE. The founding fathers did this to avoid being a monarchy or dictatorship because they had direct experience with how bad those were.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HalfDongDon",
                                    "body": "The supreme court has ruled that illegal aliens are not protected under due process.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "killdred666",
                                            "body": "no they most certainly fucking have not and a supreme court ruling isn’t the same as what the constitution actually says",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HalfDongDon",
                                                    "body": " Yes they have. It's literally the job of the supreme court to interpret the constitution. Read a fucking book.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "killdred666",
                                                            "body": "define due process. how do you think the process of determining if someone has committed a crime, like illegal immigration, works? please describe in detail",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HalfDongDon",
                                                                    "body": "So you think these people were rounded up, carrying us citizen IDs or green cards? LOL.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "killdred666",
                                                                            "body": "as always, a hard pivot because you can’t define it and you don’t actually know how it works but you’ve already made an ass of yourself so you can’t admit you were wrong now!! you’ve got too much skin in the game! better just double down and avoid all questions 👍",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HalfDongDon",
                                                                                    "body": "Explain how they were denied due process? Entering the country illegally is a crime and you are subject to deportation just like in any other country.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "killdred666",
                                                                                            "body": "i’ll give you one last chance to demonstrate your knowledge here. \n\nwhat is due process?\nin the united states, how do you - legally - determine someone has committed a crime?\nhow do you prove someone has entered the country illegally? what’s the legal process? how do you determine someone entered illegally and continued living here afterwards? explain it to me",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ralpher1",
                                                            "body": "No it’s not true. What’s the case called that says illegal aliens in the U.S. have no right to due process?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HalfDongDon",
                            "body": ">Why do you not believe in the Constitution?\n\nIllegal Immigrants are not protected the same as American citizens. \n\n>But either way, having tattoos does not make you guilty of being a gang member. Like apparently one guy was a tattoo artist whose tattoos have been misinterpreted.\n\nDo a little more research into gang tattoos. You can't just walk into any tattoo parlor and get a MS13 tattooed across your fucking neck.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RandomGuy92x",
                                    "body": "Illegal immigrants still have the right to a trial. But either way, some of those people sent to El Salvador may not even be illegal immigrants. Because this was done after Trump invoked the Alien Enemies Act which applies to not only illegal immigrants but also legal immigrants who are lawful residents. \n\nAnd in many cases it may not as easy as identifying a cartel member by a big MS13 tattooed on their neck. The Tren de Aragua cartel apparently uses various symbols and phrases like crowns, trains and roses or phrases like \"hijos de dios\": [https://media.telemundohouston.com/2024/05/34464987837-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675](https://media.telemundohouston.com/2024/05/34464987837-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675)\n\nBut this still has to be proven in court beyond a reasonable doubt. You can't just skip the judicial process. What Trump is doing is a massive violation of the Constitution and a massive violation of basic human rights like the right to a fair trial.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BlAcK_BlAcKiTo",
                    "body": "Actually insane reply \n\nEven if they had tattooed \"yes I kill people for fun\" on their foreheads, due process is there for a reason. \n\nOr do you want justice based on \"they look like criminals\" ? Like what?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HalfDongDon",
                            "body": "Illegal immigrants aren't protected by due process as the very act of being in a country illegally is a crime.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "saltinstiens_monster",
                    "body": "If the first corner cut in the justice system is to detain people that look like criminals without due process, what's the next corner to be cut? \n\nMore importantly than a potential slippery slope, *can THIS specific precedent be weaponized to persecute any out-group deemed to be problematic by the powers that be?*\n\nFudging the law to get rid of obvious criminals has a funny way of making us get used to the law being fudged. If some of us don't get full rights sometimes, none of us are guaranteed any rights any time.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HalfDongDon",
                            "body": ">detain people that look like criminals without due process,\n\nBeing here illegally is a crime, and illegal immigrants are not protected under due process in the same way citizens are.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "saltinstiens_monster",
                                    "body": "Yes, they should be turned loose in their own country. If they're going to be detained indefinitely for [anything], especially in a different country, they should get the same justice system rights as anyone else. \n\nThis is what prevents weaponization of laws. Every person is judged as an independent individual with presumed innocence until proven guilty.\n\nLike, you should have the right to tell someone to leave if they shouldn't be here, and you should have the right to detain convicted criminals or those awaiting trial. You should NOT have a right to detain someone without a trial because they shouldn't be here.\n\nBeing an illegal immigrant isn't some heinous crime that should disallow your access to society's goodwill and standard rights. You're just existing in the wrong place. I can understand deporting illegal immigrants or discouraging them by making it difficult to build a life here, but sending them to an offshore prison with no trial is blood-chilling to me. Let them go or let them get a lawyer.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ExNihilo00",
                    "body": "Because if due process can be so easily tossed aside for them, then it can be tossed aside for the rest of us. Because imprisoning people in a gulag in a foreign country is wrong, and doubly so when they haven't even been charged or convicted of a crime.\n\nThe better question is why don't you give a fuck?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HalfDongDon",
                            "body": "Equating illegal immigrant gang members to functioning American citizens is a giant fucking mental gymnastic leap. Illegal aliens do not have due process rights, as stated by the supreme court. \n\nIt also doesn't take a fucking rocket scientist to see these people are gang/cartel members. We knew who the fucking 9/11 bombers were before they did it and you think we don't know a dude is a part of MS13 with a giant fucking 13 tattooed on his chest?\n\nBiden allowed 16 million illegal immigrants into the country in 2024, and you're worried about deporting 300. This is why you lost the election.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Technical_Scallion_2",
                    "body": "Do you see any issue with having the only way anyone can identify these prisoners is by looking for suspicious tattoos in a video, and then concluding they must be gang and cartel members? Why wouldn't the administration simply tell everyone who they were and what they were convicted of? It would be transparent and convincing to everyone.\n\nThe fact you're still justifying this behavior because you're able to make an argument about how they might be criminals because some of them have suspicious tattoos, with zero other information, and then concluding they are all \"known terrorists\" and foreign gang members on that basis, is a problem.\n\nMaking the assumption you're a white male, if you were walking down the street and got arrested and thrown in prison with a bunch of white supremacists with swastika tattoos, then got sent to an El Salvador prison for the rest of your life without any due process or checking to see if you were in fact a criminal yourself, would you see THAT as a problem? Yes of course, because then it's happening to YOU.\n\nThe fact you're questioning why anyone would give a fuck is because it's not about you...yet.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BatmanxX420X",
                    "body": "> It's actually kind of impressive how quickly the left is imploding itself trying to defend\n\n\nThe right literally defends pedophiles, rapists, and grifters while condemning the left for correctly defending people from being illegally removed from the country due to *checks notes* \"not passing the vibe check\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HalfDongDon",
                            "body": "Being here illegally is justification enough to deport them. Period.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BatmanxX420X",
                                    "body": "No it isn't. It's actually not illegal to be here undocumented, it's a civil violation.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HalfDongDon",
                                            "body": "Look at your woke terminology \"undocumented.\" \n\nThe left is so flustered they have to continually invent new terminology to justify their own existence. \n\nIf you are here illegally, you are subject to deportation. Period.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BatmanxX420X",
                                                    "body": "Flustered? Undocumented is the correct term because as has been stated, being in this country is not in itself illegal, it's a civil violation. So you saying illegals is just letting everyone know you're indoctrinated by right-wing propaganda",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HalfDongDon",
                                                            "body": "\"Entering or re-entering the US without authorization is a federal offense.\" Being \"undocumented\" is not the crime. Entering the country illegally is, which is the entire fucking point and the left's attempts to obfuscate that with terms like \"undocumented\" is why you lost the election.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "BatmanxX420X",
                                                                    "body": "Which is a tiny percentage of people, most people who are here undocumented came here legally and overstayed visas. How do you not know this? Oh because you only listen to people who reinforce your narrow worldview",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Red_Canuck",
                            "body": "You maybe should take better notes",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BatmanxX420X",
                                    "body": "Oh so you have their court transcripts and convictions?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Red_Canuck",
                                            "body": "Do you?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BatmanxX420X",
                                                    "body": "No one does bud, that's the point.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Red_Canuck",
                                                            "body": "Oh, okay. So your thought that these aren't gangbangers but just had the wrong vibes was complete bullshit. Cool",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "BatmanxX420X",
                                                                    "body": "And yet we have information coming out showing that these were not gang bangers, they were people just working here, having committed no crimes whatsoever.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "changemyview-ModTeam",
                    "body": "Comment has been removed for breaking Rule 1:\n\n> **Direct responses to a CMV post must challenge at least one aspect of OP’s stated view (however minor), or ask a clarifying question**. Arguments in favor of the view OP is willing to change must be restricted to replies to other comments. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1).  \n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%201%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FloppedTurtle",
                    "body": "[https://www.miamiherald.com/news/local/immigration/article302251339.html](https://www.miamiherald.com/news/local/immigration/article302251339.html)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HalfDongDon",
                            "body": "I'm sure he was on his way home from church and just stopped to grab a jug of milk, right?\n\nHoly way you people are dense.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FloppedTurtle",
                                    "body": "They kidnapped a ten year old on the way to the hospital to get chemo. [https://www.nbcnews.com/news/latino/deported-family-us-citizen-girl-brain-surgery-alleges-abuse-rcna196705](https://www.nbcnews.com/news/latino/deported-family-us-citizen-girl-brain-surgery-alleges-abuse-rcna196705)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HalfDongDon",
                                            "body": "Ahh  yes, they were all on their way home from church - just stopped to grab a jug of milk.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "FloppedTurtle",
                                                    "body": "About that... [https://www.pbs.org/newshour/politics/migrants-can-now-be-arrested-at-churches-and-schools-after-trump-administration-throws-out-policies](https://www.pbs.org/newshour/politics/migrants-can-now-be-arrested-at-churches-and-schools-after-trump-administration-throws-out-policies)",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HalfDongDon",
                                                            "body": "You're being completely disingenuous to push a political agenda. Who cares. They shouldn't be here in the first place. Immigrate legally and we don't have these problems.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "FloppedTurtle",
                                                                    "body": "\"The person backing up their claims is pushing an agenda\" - MAGA, all day every day.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HalfDongDon",
                                                                            "body": "Your articles don't back up that these people were deported unjustifiably. They are here illegally, thus subject to deportation. Period.\n\nYour sob stories and mothers claiming their babies aren't gang members aren't proof. \n\nThey aren't targeting random fucking people on the street. These are extremely targeted deportations and raids. You don't get designated a latin-american gang member for no fucking reason.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "FloppedTurtle",
                                                                    "body": "Something really interesting about conservatives is that they assert a whole lot of things with no evidence, and refuse to change when confronted with facts.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HalfDongDon",
                                                                            "body": "What facts to this scenario did you provide? Schools and churches shouldn't be illegal immigrant sanctuaries. If you are here illegally, you are subject to deportation. Period.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FloppedTurtle",
                                                                                    "body": "Here, this might help, sport. [https://study.com/learn/lesson/cognitive-dissonance-experiments-festinger-carlsmith.html](https://study.com/learn/lesson/cognitive-dissonance-experiments-festinger-carlsmith.html)",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "justanotherguyhere16",
            "body": "It’s likely both",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sandgrease",
            "body": "He definitely just shipped people off to be slaves, there's already stuff coming out about how some of them weren't even guilty of anything other than being here illegally which Elon himself did for years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character_Term9048",
            "body": "The thing is: because of these moronic Maga fucks, many mistakes will be made..",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSauceeBoss",
            "body": "The Salvadorian government has had kind of a policy of imprison them first, then ask questions later. But they’ve been fairly proactive with releasing people who’ve been falsely imprisoned. About 7,000 (more than 1/12th of the prison population) people so far have been released due to being falsely imprisoned and of course, it’s horrible and they acknowledge the collateral damage that it inflicts. But overall, you cant argue with results. It went from being one of the most dangerous countries in the world to one of the safest in Latin America.\nI know this doesnt respond to your stipulation about deportations, but I thought it was a good tidbit of info.",
            "score": 1,
            "replies": [
                {
                    "author": "Technical_Scallion_2",
                    "body": "I'm not against incarceration of violent criminals - the issue here is that we have no idea if the people sent there are in fact violent criminals. No evidence or personal information of any kind has been provided.\n\nIf the Trump administration said \"here are the arrest and conviction records for these 200 people - here is what they did and why we consider them violent gang members at war with the US\", then I could at least see the basis of their argument. But they haven't and won't, because it doesn't exist. They just rounded up 200 people who COULD be violent gang members or COULD just be random migrants - and for people who say no way, they have to be criminals, then show us the proof that they are in fact criminals instead of just saying they gotta be.\n\nAnd sadly, these 200 are going to turn into thousands, then hundreds of thousands, of people thrown into prison simply for not being US citizens.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Doctor_Loggins",
                    "body": "\\> you can't argue with results\n\nIn fact, a great deal of the United States' legal framework hinges upon the idea that you must argue with results if the method used to obtain those results does not strictly follow proper procedure. This isn't Law and Order, the where Jack McCoy can just monologue his way around Constitutional protections. If the state fails to uphold its obligations (fair and speedy trial, assorted enumerated and judicially interpreted rights, discovery, etc), then \"results\" can be nullified. This does not always happen, and in fact our nation's history is littered with examples of courts failing to protect people from governmental overreach. But it's all there in the foundational documents, and the state should be held accountable when it falls short - even if they know for sure that you did it. The presumption of innocence requires it.\n\nYou can also argue with results on the grounds of - and I hate to do this because it's such a basic-bitch thing to say, but it applies - correlation versus causation. I'm not familiar with El Salvador, or what legal changes they may have implemented lately, but in general it's not sufficient to establish that two things happened concurrently. Is there evidence of a causal link between their particular incarceration strategy and increased safety? And if so, are we sure that's the only way to achieve the intended result? Is it possible that there's another way to achieve the same or better results that causes less \"collateral damage\"?\n\nIn short, yes you absolutely can argue with results.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iuabv",
            "body": "What are you arguing? That this is not equal to a normal legal deportation? That it’s illegal? That it’s totally cool?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spaniardman40",
            "body": "I think people who are not from Latin America cannot comprehend the meaning behind those tattoos. If they had those tattoos then that alone is proof enough to know they were in fact gang members",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweaty_Ad4296",
            "body": "If they were not deported, what happened was human trafficking, and anyone involved (such as Rubio) is subject to severe punishment in most American countries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JoanneMG822",
            "body": "Deportation is removing immigrants to their country of origin. This is not deportation. This is detaining people without due process in a foreign hell hole. This prison is notorious for horrible conditions and human rights abuses. \n\nHow is this possible? How is this acceptable? We know that not all the people detained are Venezuelan gang members. One is an LGBT male who came to the US to escape the gangs in Venezuela. He's a dead man walking, isn't he? Illegal immigration has never been a death penalty offense. It is now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "novembernutjob",
            "body": "Yes, and?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Linvaderdespace",
            "body": "I think the technical definition of “extraordinary rendition” is to retain custody of an individual, and not to extradite them into someone else’s custody.\n\nI get what you mean though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jinladen040",
            "body": "I'm against exploitation of any kind. But these are Tren de Aragua gang members as even identified by the left leaning media. So I don't think there's even a media spin on this story as there usually is. \n\n\nSo if they weren't deported, they would just be exploiting the community in America as they have been caught doing. \n\n\nGood on South America for actually enforcing the law in their countries. Which is half the equation to all the drug and gang violence in that part of the world. \n\n\nI wouldn't be against just locking them up in our prisons if that's what it takes to get them off the street though. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "shosuko",
            "body": "Semantically?  Sure.  But is that what is problematic about this?  Whether its \"deportation\" or some other term?\n\nOr is the problematic part that he flagrantly ignored a legal order to NOT send them yet?\n\nSee here is the thing - I'm actually for getting rid of foreign gangs.  Its long been a problem that Mexican cartels will have connections with illegal immigrants in USA and use them to run drugs, kidnapping, etc.  These cartels are serious and need a serious answer.\n\nBut no due process?  Flagrantly ignoring a judge order?\n\nThis isn't about problems and solutions, its about Trump being on a power trip.  The guy is out of control, and his entire party is complicit.  It doesn't matter what happens during Trump's term b/c there is zero accountability, no checks and balances, we have ZERO democratic power at this point.  Our government has devolved into a republic entirely immune to the will of the people and judicial review.\n\nIf he challenged that judges orders and won the right to send them off, that's fine.  Skipping the judge?  I don't care if its for permission to cross the street, you toss out our legal system then what is the point of having laws?",
            "score": 1,
            "replies": []
        },
        {
            "author": "stephenmw",
            "body": "The term deport to means to remove a foreigner from the country. If you believe that it isn't fully deportation because the US paying for their incarceration implies some control... I somewhat agree. But the law trump is using also allows him to \"apprehend, restrain, secure, or remove\" people without trial. So whether or not it is a \"deportation\" is immaterial to whether he is allowed to do what he is doing.\n\nOfficially, this is restrainment and removal under [50 U.S. Code § 21](https://www.law.cornell.edu/uscode/text/50/21).\n\n[Trump claims](https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/) that Tren de Aragua (TdA) \"operates in conjunction with Cártel de los Soles, the Nicolas Maduro regime-sponsored, narco-terrorism enterprise based in Venezuela\".\n\nNicolas Maduro is the President of Venezuela. So by making this claim he is saying that TdA activies are an incursion by the country of Venezuela.\n\nThe law here doesn't care about what someone has done. The elements of the law that allow Trump to arrest, imprison, or remove/deport them are:\n\n1. The president must declare a \"predatory incursion\" by a \"foreign nation or government\": [Executive order](https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/)\n2. The person must be one of that nation's \"natives, citizens, denizens, or subjects\".\n3. The person must be 14 or older.\n4. The person must not be a US citizen.\n\n> It seems based on some of the articles, that the only thing linking them to a gang is a rose tattoo.\n\nAll Venezuela nationals are now subject to [50 U.S. Code § 21](https://www.law.cornell.edu/uscode/text/50/21) if they are below the age of 14 and not US citizens. While Trump has ordered that only those belonging to TdA are to be sent to El Salvador, the law does not require him to be so specific. He does not need to meet even probable cause standard that they are TdA since he is not required to prove they belong to TdA at all.\n\nI am not trying to change your view that this is wrong to do. I am not even trying to change your view on if it is a correct use of the Alien Enemies act. I am only trying to say that this is a deportation in the dictionary sense and in the legal sense it is some combination of restraining, securing, and removing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "True-Teacher-8408",
            "body": "He dud ehat he should do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "33ITM420",
            "body": "i just cant understand people stumping for violent cartel gangs\n\nsame people voted for the guy who was just lettign them come in and run amok, tho\n\nwhat is their end game?",
            "score": 1,
            "replies": [
                {
                    "author": "RandomGuy92x",
                    "body": "Do you understand the three branches of government? \n\nThose would be the legislative, executive, and judicial branch. The executive branch cannot sentence people to prison. The executive branch only executes the decisions made by the judicial branch. What Trump is doing is completely skipping the judicial branch and sending people to an overseas prison merely based on accusations made by ICE agents or law enforcement officers. \n\nNone of those people have been granted a fair trial. Many of them may be guilty of being cartel members, but some of them may very well be innocent. Apparently ICE classified them as cartel members based on extremely weak and flimsy evidence like tattoos on their body. \n\nSo why do you think it's ok to deprive people of their right to a fair trial? Why is Trump violating the Constitution and acting like the executive branch can take on the role of the judicial branch?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ExNihilo00",
                            "body": "And if they are here illegally, then why not just deport them to their home country? It's disturbing seeing so many Americans defending this kind of crap.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Spiritual-Chameleon",
                                    "body": "A Washington Post [article published today](https://www.washingtonpost.com/immigration/2025/03/18/trump-migrants-venezuelans-deportation-bukele/) says that some of the immigrants sent to El Salvador signed an agreement to be deported back to Venezuela. They thought they were going home. Because there was not a criminal trial, it's not clear if they were bystanders or actual gang members. The legal process is still an important step.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ExNihilo00",
                                            "body": "So basically they were lied to and sent to a freaking slave camp instead. It just keeps getting worse and worse.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FloppedTurtle",
                    "body": "[https://www.miamiherald.com/news/local/immigration/article302251339.html](https://www.miamiherald.com/news/local/immigration/article302251339.html)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mike_Tyson_Lisp",
                    "body": "It's great you assume every person you think getting deported is a violent gang criminal. Do you assume only the POC are that or just every immigrant? A US student is getting deported, but since he's POC I bet you think he's a criminal",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sunflowercompass",
                            "body": "A doctor too, but she's brown and doesn't like Israel so it's ok. Fuck freedom of speech.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BatmanxX420X",
                    "body": "So their tattoos and skin color mean they're violent gang members? How is this supposed to be a rational argument?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "33ITM420",
                            "body": "show me any evidence that that is the sole reason they were deported",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BatmanxX420X",
                                    "body": "So I'm supposed to show you evidence from a court hearing that didn't take place because they were removed without due process? Again, super rational argument there bud 🙄",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skitteringscamper",
            "body": "How else would you describe removal of invaders from ones lands back to their homelands? Seems pretty clear cut deportation to me ",
            "score": 1,
            "replies": [
                {
                    "author": "RandomGuy92x",
                    "body": "The problem is that they are completely circumventing the judicial process. Many of those people who've been sent to El Salvador may in fact be drug cartel members. But others may very well be innocent. They've been sent to an overseas mega prison merely based on accusations by ICE agents. \n\nPeople accused of crimes still have the right to a fair trial. If you're being accused of being a member of a drug cartel you still have the right to a fair trial. The executive branch does not have the power to sentence people to prison. Only the judicial branch has that power. \n\nIf only a handful of those people turn out to be innocent it would be a massive violation of human rights. \n\nWhy are you ok with depriving people of the right to a fair trial? And why does the MAGA crowd not believe in the Constitution and the separation of the three branches of government?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RampScamp1",
                    "body": "What invaders? They weren't given trials and so we don't know their legal status. Trump had also granted Venezuelans temporary protected status, meaning they could all be legal residents. Importantly, they weren't deported. As you say, deportation involves sending people back to their homeland, but they didn't land in Caracas. These Venezuelans of indeterminate legal status are now languishing in a Salvadoran prison.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Marcozy14",
                    "body": "they’re not going back to their homeland…",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TurboKid1997",
                    "body": "The problem is they are being held in a 3rd country.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LegionKarma",
            "body": "It's the beginning of ethnic cleansing America.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chefjono",
            "body": "These were a very special bunch. I would guess that of the 400 or so in this particular gang, there isn't a single individual who has commited LESS THAN one murder, tatoos being awarded for hits on rivals, etc. \n\nEl Salvador suffered for decades from these types and so the President knows what they were doing to \n\npeople in the US.  Trump just knew the American public and law makers don't have the stomach to institute\n\npunishment this harsh.  Its a huge FAFO",
            "score": 1,
            "replies": [
                {
                    "author": "TheBlueHypergiant",
                    "body": "How, exactly, do you know that they're all murderers, when they never had a trial?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chefjono",
            "body": "These were a very special bunch. I would guess that of the 400 or so in this particular gang, there isn't a single individual who has commited LESS THAN one murder, tatoos being awarded for hits on rivals, etc. \n\nEl Salvador suffered for decades from these types and so the President knows what they were doing to \n\npeople in the US.  Trump just knew the American public and law makers don't have the stomach to institute\n\npunishment this harsh.  Its a huge FAFO",
            "score": 1,
            "replies": []
        },
        {
            "author": "Skitteringscamper",
            "body": "If you're this willingly clueless and blind to reality,cim sorry Kate, there isn't much helping you ",
            "score": 1,
            "replies": [
                {
                    "author": "TurboKid1997",
                    "body": "Do explain.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "iuabv",
                    "body": "You mean the guy who confused the Baltics and the Balkans and called Belgium a beautiful city?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sunflowercompass",
                            "body": "The President of Puerto Rico is very dumb",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FaithlessnessFirm968",
                    "body": "Where are all of those transgender mice? ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FloppedTurtle",
                    "body": "Most seven year olds know more about geopolitics than our president does.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ejohnson4",
                            "body": "Most rocks know more about geopolitics than the retard-in-chief does. You know what, it’s not most, it’s all.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "enemawatson",
                    "body": "It's a pretty low bar.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "eloel-",
                    "body": "Honestly, probably",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NewCountry13",
                    "body": "Yes, trump thinks foriegn nations pay tariffs.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Noodles_fluffy",
                    "body": "Ah yes, our president who confused seeking asylum with insane asylum",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Pi6",
                    "body": "Can't tell if you are being sarcastic. A loaf of bread knows more about geopolitics than Trump and his entire cabinet combined. I am sure there are at least few people left in the state department with knowledge, but they sure aren't being listened to.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ButcherPetesWagon",
                    "body": "This is all verifiable and in the news.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MtnDudeNrainbows",
                    "body": "Actually yes. The current administration knows fuck all about geopolitics.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LowKeyBussinFam",
                            "body": "Ok, I’ll make sure to vote a genius like you in next time",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MtnDudeNrainbows",
                                    "body": "I’m not a genius.  You can respond to the OP without using a whataboutism or personal attack.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "changemyview-ModTeam",
                    "body": "Comment has been removed for breaking Rule 1:\n\n> **Direct responses to a CMV post must challenge at least one aspect of OP’s stated view (however minor), or ask a clarifying question**. Arguments in favor of the view OP is willing to change must be restricted to replies to other comments. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1).  \n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%201%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}