{
    "title": "For those of you who are happily married, what are some signs a woman will make a good wife?",
    "author": "Commercial-Nebula-50",
    "subreddit": "AskMen",
    "rank": 10,
    "score": 405,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 99,
    "url": "https://www.reddit.com/r/AskMen/comments/1jdmfr9/for_those_of_you_who_are_happily_married_what_are/",
    "id": "1jdmfr9",
    "selftext": "What are some early indicators of a soulmate?",
    "comments": [
        {
            "author": "Evrydyguy",
            "body": "You’ll need to talk. Learn to communicate. Ask questions. Debate topics. You have to do this often. Almost daily. Have the ability to see her side of things and for her to see your side. You’ll often disagree but it’s the compromise that’s important. One person can’t just win all the time. Be aware. Are you always winning? Can she not get a win ever? Not every topic has to be a war. Not every war has to be won.\n\nYou’re both going to change. You’re going to grow. You each need to love the person for who they are and not what they can provide. They do need to provide their 100%, but not all of us is going to be 100% all the time. Our human battery gets drained from time to time. Becoming their charger is a lesson you need to learn.\n\nTalk. Be each others therapist. Hype them up. Cheer them on. You both are each others coach, therapist, lover, partner, cook, parent, nurse, leader…when they win you both win.\n\nSo find a woman who can talk. That one who looks at you with those big ol’ interested eyes. Nurture that.",
            "score": 441,
            "replies": [
                {
                    "author": "Storyobserver850",
                    "body": "Awh 🥺❤️🙏🏾 great advice!!",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Evrydyguy",
                            "body": "Thank you.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Storyobserver850",
                                    "body": "Of course 😊",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mohawk_Whovian86",
                    "body": "This is quite honestly the most perfect response to this question. Amazing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hermit_warrior",
            "body": "Mature and good communicator.  My wife doesn’t indulge in drama and we rarely fight. When we do we actually listen to each other’s perspective and we don’t try to “win” the argument.  Gratitude is also important. If she’s grateful for the things you do instead of putting expectations on what you SHOULD be doing, that’s huge.\n\nEdit:spelling",
            "score": 722,
            "replies": [
                {
                    "author": "JordyEast101",
                    "body": "Bro the gratitude was awesome. I’d never been treated like that before I found my wife to be",
                    "score": 45,
                    "replies": []
                },
                {
                    "author": "EncikCali",
                    "body": "💯💯💯",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "usernamefoundnot",
                    "body": "Lucky bastard..",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Altruistic_Quail5024",
            "body": "I confessed my darkest secret. She laughed and made me realize that I had been tormenting myself for years over a petty inconsequential event.\n\nShe is supportive, caring  and beautiful… in a moment of vulnerability she showed me that she’d be a solid life partner.\n\nSo far I’ve been right.",
            "score": 630,
            "replies": [
                {
                    "author": "gdbnarov",
                    "body": "Laughing at your darkest secret which you're probably very insecure about is probably not the best reaction for a wife haha",
                    "score": 190,
                    "replies": [
                        {
                            "author": "esperanza2588",
                            "body": "I actually did this too, a long time ago, and it had the same effect. It helped them realize they could put that baggage of guilt and shame down and they finally did. It made them feel fully accepted as they are.\n\nTake note, the laughter in this case was directed at the absurdity of the behavior and the baggage, NOT the person. That is the difference. \n\nThat is what helps the other person see it was not as shameful as they thought and they could finally put it down.",
                            "score": 110,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Stong-and-Silent",
                    "body": "What was your deepest darkest secret? 🤣🤣🤣🤣",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Altruistic_Quail5024",
                            "body": "![gif](giphy|uQXz5206dRmuJc53W8)",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "usernamefoundnot",
                                    "body": "Definitely the insecurity related to dick size 😆",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Altruistic_Quail5024",
                                            "body": "Shhhhh no one else needs to know",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mushrooms_for_the_",
                    "body": "Can I ask more about this??",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Altruistic_Quail5024",
                            "body": "Sure….",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Putrid_Dingo_3859",
                                    "body": "That was his only question lmao",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Stong-and-Silent",
            "body": "Her values match yours. \n\nShe is grateful for things you do for her and don’t act entitled. \n\nShe speaks out openly about things she wants in the relationship and how wants more of something from you. She respectfully disagrees with you. Women who are too agreeable will eventually become resentful. \n\nHer life aspirations do not clash with yours.\n\nShe is sensitive to your feelings and emotions and never is dismissive of them.\n\nShe believes disagreements in the relationship are not to be shared with others.\n\nShe wants to help you achieve your goals and you hers.\n\nThat she believes in sticking with you no matter what.",
            "score": 340,
            "replies": []
        },
        {
            "author": "Due-Assistant9269",
            "body": "I married my best friend. She was the one I wanted to spend time with and be around. From there you invest time and energy into that relationship. Been married for 30 years.",
            "score": 91,
            "replies": []
        },
        {
            "author": "jvargas85296",
            "body": "i was starving one day and I had to work two shifts back to back and she came to my job because i mention I didn't have time to go out and eat.  she did something quick for me and brought me a sandwich with homemade lemonade... I knew right then and there she was the one for me. she took time out of her own schedule to be with me and helped me where i truly needed her. she never had to do something amazing or do something extravagate, but to me she was amazing for the little things she did for me.",
            "score": 179,
            "replies": []
        },
        {
            "author": "apollo_popinski",
            "body": "She doesn't expect you to be a finished product when she marries you. She wants to grow together with you.",
            "score": 75,
            "replies": []
        },
        {
            "author": "mtrbiknut",
            "body": "My wife & I said traditional wedding vows to love, honor, and cherish each other for the rest of our lives. We both meant every word we said to each other, and we knew each other enough to trust what the other person was saying. \n\nThe One is the person who does what they say, no matter how difficult that is. True love is commitment- the person who will commit everything, forever more, and mean it, is The One.",
            "score": 55,
            "replies": [
                {
                    "author": "Stong-and-Silent",
                    "body": "This is very much true! My wife and I made the same commitment and meant it. \n\nSometimes I was giving 100% when she couldn’t. Sometimes she gave 100% when I couldn’t. \n\nIn the end I stood by her in sickness and in death. I was at her bedside every day and there when she died at only 50. It was hard. I wouldn’t trade it for anything. I cherish all the moments I had with her. I feel honored to make the sacrifices I did. \n\nI know without a doubt she would have done the same!",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Dramatic_Attorney147",
                            "body": "❤️❤️❤️",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prestige_001",
            "body": "Find a girl that makes you want to be the best version of yourself. If she has that affect on you, odds are she’ll be pretty great.",
            "score": 35,
            "replies": [
                {
                    "author": "Storyobserver850",
                    "body": "☺️❤️",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BobbyThrowaway6969",
            "body": "You could give her a cool twig you found and she'd appreciate the gesture",
            "score": 117,
            "replies": [
                {
                    "author": "Storyobserver850",
                    "body": "😂😂 awww that is adorable 😭❤️",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "Carcinog3n",
            "body": "She accepts you for who you are and not for who she wants you to be. She is kind, honest and smart. She makes you want to be a better person. She can forgive. You can be vulnerable with her and she won't take advantage of you. You are both sexually compatible with each other. Quality communication comes naturally between you.\n\nAll relationships, even a good one, are hard work that doesn't always feel like work.",
            "score": 32,
            "replies": []
        },
        {
            "author": "codeegan",
            "body": "If they want to go through the changes of life with you.",
            "score": 99,
            "replies": []
        },
        {
            "author": "standardinternetdude",
            "body": "Lot of great answers here, but one other I'll add that you can observe long before considering marriage.\n\nWatch how she treats others of all categories: strangers, acquaintances, close friends, and family. If you find that you both generally deal with others in a similar fashion, you're probably a good match.\n\nHopefully you both deal with others well - I suppose if you're both dickheads to everyone, that would be a bad sign lol",
            "score": 29,
            "replies": []
        },
        {
            "author": "Dj_Ook",
            "body": "Put all my cards on the table.  I was in my 30’s and done playing around.  I knew who I was and what parts of me were not going to change.  Her only condition was that I’d always be completely honest with her and I was.  Also when we argued, and every healthy relationship has conflict, no matter how ugly it got we’d either make up before bed or both apologize in the morning.  Very lucky we found each other can’t imagine doing it with anyone else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prettychilledoutguy",
            "body": "Accountability.\n\nMarriage is not a battle it's a team work but if one person cannot ever admit they are wrong this won't be good. So none of the \"Happy Wife Happy Life, She is always right\". \n\nThis is a sign of toxicity and it's a hard no.",
            "score": 49,
            "replies": []
        },
        {
            "author": "Rams11A",
            "body": "Actually listens when you express your feelings or are upset about something and doesn’t get mad at you for it. \n\nI can’t tell you how amazing that simple thing felt after not having it. My ex-wife would always end up mad at me if I was mad at her for something. It’s terrible not having the comfort to express your feelings and no one should feel that way with their partner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remarkable-Rub-",
            "body": "Beyond the basics like trust and respect, a great partner communicates openly, supports your growth, and works through challenges with you instead of against you. The best early sign? You feel at peace around them, like you can be fully yourself without fear of judgment",
            "score": 11,
            "replies": []
        },
        {
            "author": "-Blixx-",
            "body": "Having been married for 30+ years...\n\nI have no idea.",
            "score": 46,
            "replies": [
                {
                    "author": "Storyobserver850",
                    "body": "😂😂😂",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Troid_00",
                    "body": "Well said",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "GertJacobusOlivier",
            "body": "Empathy is a big deal. If you can' t both be empathetic towards eachother what is th point?",
            "score": 8,
            "replies": []
        },
        {
            "author": "TheCarrier89",
            "body": "You have to be friends first and foremost. If you’re only together because you’re fucking then it’s not going to end well. Being married to someone you legitimately like being around and spending time with is the key to a long, happy marriage imo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "artnodiv",
            "body": "She loves your flaws and has no interest in changing you or criticizing your life choices.",
            "score": 49,
            "replies": [
                {
                    "author": "TonySidmouth",
                    "body": "C/loves/tolerates",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Suspicious-Ad6635",
            "body": "A caring, flexible giver with integrity.",
            "score": 15,
            "replies": []
        },
        {
            "author": "myAltsucksass",
            "body": "Her family treats me like I am family. They trusted me to take care of their daughter, and she trusts me to be a loving partner. It is a great privilege to be able feel love from the whole unit",
            "score": 1,
            "replies": []
        },
        {
            "author": "SneakyBluePenguin",
            "body": "What will make a good wife for someone isn't always a one size fits all, but in my opinion, some things should probably be universal. You and your partner should ideally strive to achieve these things together, but you may both need to work together to get there. When both people approach the relationship knowing that the other person is their own individual with their own thoughts, experiences, ways of doing things and accepts those things, the relationship can deal with a lot of common pitfalls, and the relationship will get stronger over time. \nThe other main thing I think leads to a successful marriage is a good, effective, and open communication style. Be open and honest with each other. So many issues can be solved with communication with each other. Yes everyone says \"good communication is key\", but they never tell you what \"good communication\" is. I see people say that they do \"communicate\", but it's not effective. When talking about something with a partner, try and take yourself out of your own head and view things both in the shoes of your partner, and the shoes of a 3rd party. How would my partner respond to what I want to say? Why would they feel that way? Would a 3rd party listening to this conversation have any opinions, comments, or questions for either of us in this conversation? Stuff like that. Genuinely try to remove your own opinions and try and see things from a different view. You are still your own individual, but you and your partner should be a team who both want what's best for each other and the relationship. Sometimes that means you're wrong, and you might recognize that and accept that outcome by viewing the conversation from someone else's point of view. It's not something that's easy to do or comes naturally, but in my experience, it leads to way less arguing, a more collaborative relationship, and a greater understanding for your partner.\nYou usually marry someone for life, so ideally you're both comfortable talking to each other about anything and everything, and enjoying each other's company. You aren't the same human being, so don't think your partner is going to be a carbon copy of you. Find someone you can talk to openly, work with effectively, and genuinely enjoy being around, otherwise you'll have a bad marriage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exact_Register_4123",
            "body": "That she will stick by you through thick & thin. Doesn’t matter what it could be she is still there right by your side.",
            "score": 15,
            "replies": [
                {
                    "author": "NoNegotiation3521",
                    "body": "Rare to find these days , she's a 💎 if she does ride out the difficult times with you.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "jonschaff",
            "body": "She doesn’t get angry easily",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Cartographer-476",
            "body": "For me its if they werent super materialistic/money oriented. I prefer more family oriented women",
            "score": 22,
            "replies": []
        },
        {
            "author": "dwmoore21",
            "body": "Patience and understanding.",
            "score": 4,
            "replies": []
        },
        {
            "author": "JackJaminson",
            "body": "We managed to 100% Overcooked together.",
            "score": 4,
            "replies": [
                {
                    "author": "Mission_Ad_86",
                    "body": "What about It Takes Two?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoSwordfish6507",
            "body": "If she tells you she'll be a good wife and give you reasons why, she probably won't be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DescriptionNice9426",
            "body": "She was always great with kids and animals",
            "score": 3,
            "replies": []
        },
        {
            "author": "Successful_Job2381",
            "body": "She's crazy about you",
            "score": 1,
            "replies": []
        },
        {
            "author": "SWOCO",
            "body": "She respects that sometimes you need alone time to relax and decompress. \n\nGreat communication\n\nMutual goals",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valkyrie1S",
            "body": "- Doesn't want to change who you are\n- Is willing to compromise\n- Truly accepts your hobbies\n- Gives you your space\n- Financially responsable\n- its a do-er, not a dreamer\n\nOf course, it must go both ways.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManyAreMyNames",
            "body": "She makes you want to be a good partner.  You think things like \"I can't dare risk anything that'll mess this up\" and \"She's so good she deserves better than me, so I need to be better.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExplanationNo8603",
            "body": "Can she cook and clean quickly? That's all you need to know.....ok jokes aside.\n\nYou don't just like you don't know if you'll be a good husband until you are one, but things to look at \n\n-do you have similar life goals \n- how easy does she give up on her goals \n-how hard does she work for what she wants\n-can she talk though problems and work to fix them\n-does she treat you right\n-is she changing you or are you changing to be better for her",
            "score": 13,
            "replies": []
        },
        {
            "author": "masterof-xe",
            "body": "She doesn't bring up relationship problems to her biassed friends. And the seed of doubt / resentment isn't planted.",
            "score": 7,
            "replies": []
        },
        {
            "author": "BlueMountainDace",
            "body": "Since you'll never really know everything about a person, as far as you can tell she should:\n\n1. Respect you. Without respect, there is no good relationship. You can't out-communicate someone who isn't listening.\n2. Loves you for you. How did I identify this with my wife? She was the first person who engaged with all my weirdness and never set expectations for my career, how much money I'd make, etc. She just wanted me to work hard at whatever I wanted to do and be myself. 10 years in, she is still the same way.\n3. Values aligned - there are so many factors that impact your marriage. Do you want kids? Do you share similar values around what a good life looks like? Do you view finances the same way? My wife and I were almost perfectly aligned on all those things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_War",
            "body": "I think you want to marry your best friend. Or as close to it as you can, someone who makes even the mundane more enjoyable. Someone you can be happy with doing nothing.\n\nMarriage should mean a lifetime and a lifetime can be a lot of nothing. A lot of mundane. So if you don't like the person unless you are partying, or fucking, or some criteria, evaluate that. Some of those things won't last forever, and you want someone who is still fun/chill/whatever when those criteria are gone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thenord321",
            "body": "She can admit when she's wrong.\n\n\nShe can compromise and work with you towards joint goals.\n\n\nShe has her own support group but that includes you in her trust group.",
            "score": 1,
            "replies": []
        },
        {
            "author": "micmacpattyz",
            "body": "Some really good ones in here. I’ll add. Isn’t always sick and not working. (Excludes mother)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asleep_Emotion9769",
            "body": "How you feel about her. That’s all that matters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alexxx5754",
            "body": "She doesn't have a penis",
            "score": 7,
            "replies": [
                {
                    "author": "readead",
                    "body": "Could work for some though lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheBooneyBunes",
                    "body": "Sadly not a given anymore",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "bigfatcanofbeans",
            "body": "Good relationship with her father. \n\n\nGood with money / good credit score. \n\n\nHas long term female friends. \n\n\nTalks well about people behind their back / avoids gossip. \n\n\nFollows through on commitments. \n\n\n Her relationships don't all end in hatred.\n\n\nHow does she treat people who have nothing to offer her? Waitresses, cashiers, custodians, etc.",
            "score": 7,
            "replies": [
                {
                    "author": "Wonderful_Analyst719",
                    "body": "I agree with most of this, but just want to point out that some of us have bad relationships with our fathers because they are unpleasant or toxic (and that's no fault of ours or necessarily makes us bad candidates for relationships). \n\nI find the whole 'daddy issues' trope to be unfairly damning and shaming (not that this is what you were trying to do here) when there are a lot of unhappy men out there not engaging with self-work and inevitably passing issues on to their kids. \n\nWhat matters is that we do the work to heal those wounds and come out with a healed relationship to men and masculinity. Which in my case has enabled me to have much healthier relationships than some of my friends who have a 'good' relationship with their dads. \n\nI say all of this in an effort for guys not to always see a poor relationship with our fathers as a red flag ❤️",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bigfatcanofbeans",
                    "body": "Replying to my own comment to laugh at people downvoting this. Reddit is not a healthy place.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IT_ServiceDesk",
            "body": "To be a good soulmate, that you enjoy spending all your time with them and can do everything together.\n\nTo be a good wife, if she doesn't hate kids and can cook.",
            "score": 0,
            "replies": [
                {
                    "author": "GreedyWarlord",
                    "body": "You don't have to have kids... I'm very happily married and we both hate the idea of kids.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Electrical_Gas_517",
            "body": "She was a Swedish masseuse that knew how to party, didn't take crap from anyone, was (and is) an excellent match in bed and she was (and is) totally capable of living her own life independently in joyful ways.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Terrible-Conference4",
            "body": "If you guys get along.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kostros",
            "body": "Her parents are happily married for 30+ years ",
            "score": 1,
            "replies": []
        },
        {
            "author": "KindIndependence2003",
            "body": "The feeling of effortlessness like you don't have to try around her and be anything other than yourself, whilst simultaneously wanting to do things for each other. How you and your wife treat each other should reflect on each other. It's not just about finding a woman to be a good wife, you have to be as equally a good husband and find someone that appreciates that also. It's no good having the best wife in the world if you're going to be the problem and make her unhappy, you need someone that you can keep happy. \n\nSomeone you can be content with, open, honest, if you feel like she would make a good wife then that's pretty much your answer there. If she's full of drama and you don't want drama in your life then that's not for you, there's generally a lot of the same qualities everyone looks for in a partner, but you need to fit into one another's lives without tooo much compromise and sacrifice",
            "score": 1,
            "replies": []
        },
        {
            "author": "Forgot2Catfish",
            "body": "On our 4th date, I needed to stop to get gas. My wife got out of the car, paid for it, and pumped it herself with zero provocation from me. It was an hour drive for me to see her and she wanted to show her appreciation. I knew right then she was wife material.\n\nPlus she gives really great blowjobs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "geenideewatikdoe",
            "body": "She will take better care of you then yourself",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrilliantAd5665",
            "body": "Watch the episode of family guy were peter shows meg how to date. He locks her in the car with him and farts. Then tells her learn to the love the smell. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nasty5727",
            "body": "They will go out of their way for you and will put you first, the same way you would do for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CautiousRice",
            "body": "She cooks. The drama is bearable. No fights or accusations when shit hits the fan.\n\nLooking back, I think it's more about the lack of red flags than everything else. The cooking part may not work for everyone but worked for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea-Special9850",
            "body": "Knowing how to read a room, and learn more about each personality type.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cactus2711",
            "body": "Never married, but I can say for sure someone with empathy and who shows you appreciation. Those two are absolutely what I look for in someone I could see being my 'soulmate'",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medical_Tutor_7749",
            "body": "Marry a plain jane with good morals given to her by decent parents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lokken136",
            "body": "My grandpa gave me the 1st rule of any relationship.  If you can't hang out sober and non-sexual, and enjoy their company don't bother going forward.\n\nIt's a great first filter and mandatory for long-term.\n\nBut 22 years of marriage....does she bring you peace? Does she give you space for your interests? Does she bring positive things to your life.  We have lots of overlap, but the things I suck st she's great and the inverse is true.\n\nIf I want to spend all day reading, playing video games, sleeping, or hang out with my brother she does not care.  I do 90% of the cooking but happily hops in if I'm tired or busy. She doesn't nag when I get home.\n\nIt's cliche but she's my best friend that I also get to do physical things with. Long-term you're looking for a best friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lokken136",
            "body": "My grandpa gave me the 1st rule of any relationship.  If you can't hang out sober and non-sexual, and enjoy their company don't bother going forward.\n\nIt's a great first filter and mandatory for long-term.\n\nBut 22 years of marriage....does she bring you peace? Does she give you space for your interests? Does she bring positive things to your life.  We have lots of overlap, but the things I suck st she's great and the inverse is true.\n\nIf I want to spend all day reading, playing video games, sleeping, or hang out with my brother she does not care.  I do 90% of the cooking but happily hops in if I'm tired or busy. She doesn't nag when I get home.\n\nIt's cliche but she's my best friend that I also get to do physical things with. Long-term you're looking for a best friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Late_night_pizzas",
            "body": "Have lunch several times with her mother.  That is who she will become….",
            "score": 0,
            "replies": []
        },
        {
            "author": "OneThree_FiveZero",
            "body": "High sex drive. If she's not enthusiastic in bed before you get married things are going to be grim after the NRE wears off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Construction4527",
            "body": "Feminine.\n\nCooperative.\n\nSubmissive. \n\nNon-combative. \n\nGood decision maker.\n\nI’m married and yes it was very hard to find a girl like this. At most 5% of the female population.",
            "score": -30,
            "replies": []
        },
        {
            "author": "DisgruntledWarrior",
            "body": "She hasn’t been ran through",
            "score": -15,
            "replies": []
        }
    ]
}