{
    "title": "What sort of non-sexual, non-vulnerable interactions do you find intimate?",
    "author": "Hustons_problem",
    "subreddit": "AskMen",
    "rank": 18,
    "score": 15,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 74,
    "url": "https://www.reddit.com/r/AskMen/comments/1je0myx/what_sort_of_nonsexual_nonvulnerable_interactions/",
    "id": "1je0myx",
    "selftext": "I am a female asking this question. For a long while I was convinced that it was rare for a partner to enjoy reading to each other. I'm curious if anyone else enjoys this, and what other similar activities bring about feelings of closeness and intimacy.",
    "comments": [
        {
            "author": "JJQuantum",
            "body": "One of the best things my wife does, and something I sometimes even enjoy more than sex, is when she lets me put my head in her lap and just rubs my face and hair.  As a guy you never fully relax because you are always on the alert to be able to handle any emergency that may come up but this is the closest I get to completely letting go.",
            "score": 1,
            "replies": [
                {
                    "author": "kelevra206",
                    "body": "Dude.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "phat79pat1985",
                    "body": "I just got a chub reading that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hustons_problem",
                    "body": "🧡🧡🧡",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "findingbezu",
                    "body": "Bliss",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sustainable_Twat",
            "body": "Doing an activity/ hobby together.",
            "score": 21,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "I would love to know if this is a shared hobby, or if you're sharing a hobby / engaging in a hobby shared with you?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Morty-B007",
                            "body": "Both honestly. Would be nice to play video games together or go ride 4 wheelers to even being in the same room doing different hobbies on our own",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "noctmortis",
            "body": "Deep conversations, sitting side by side with shoulders touching, or an arm over the back",
            "score": 1,
            "replies": []
        },
        {
            "author": "IrregularBastard",
            "body": "Sharing experiences. It’s how men bond with each other. So sharing an experience with a woman feels like binding to us. \n\nUnrestrained random touches are the best way to build intimacy for me. It’s not about sex. It’s that she wants me in her personal space, or she wants to be in mine. So running her hand up my back as she walks by, scratching the back of my neck for a moment, biting my shoulder randomly. It’s little things that she’s the only person on the planet allowed to do them. So it’s nice when she does.",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "😁💥 it's the very small details that somebody does that tend to mean the most. The small details, are never that small. Even if you are the only one that feels it, it is uniquely between the two of you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Random_Girl_0",
            "body": "Just starring at each other in silence. I can't hold eye contact with anyone except for him",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "I love this, although it be slightly dark.. I think that you found somebody you're allowing yourself to look at while they look at you. My current partner has great difficulty for several reasons making eye contact, but the very few moments when we are sitting still and he looks in my eyes even for a moment when I glance over, there is a very deep sharing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PresentImmediate1910",
            "body": "Female here, I just want to let you know that I found and married a man who enjoys reading with/to me, and considers it part of our intimate time. It could be rare but it’s not impossible ❤️",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "I love this. It's definitely not the most common thing I've encountered, but I know it's not impossible. Happy reading. 🧡",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Successful_Job2381",
            "body": "I live in the midwest so my wife & i sometimes like to pick a small downtown nearby and go to lunch and then walk up and down the street and look at the shops",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "Yes! I love when such small pleasures such as meandering through sleepy small towns, can bring out closeness and intimacy in the most unexpected simple ways. I hope that this tradition continues between the two of you, and if you ever have children, consider passing it along to them. My dad and I used to go for walks in our sleepy town after everyone was home and the shops were closed. It was very interesting to see glimpses of photos on the wall of the home that didn't pull their shades right after sunset. Without being creepy and invasive, just walking by and seeing literally through a window into somebody's life, brought about a closeness to who we are as people and how we individually express ourselves. Even though I obviously didn't have a romantic relationship with my father, we still got to hypothesize and imagine what people's lives looked like based on the illuminated wall behind the forgotten shade that we passed by with a normal gate in the evening...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Phillimon",
            "body": "My girl loves to paint, like flowers and forests or whatever. I enjoy painting models. \n\nSo we paint together.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NonNewtonianResponse",
            "body": "Personally, \"intimate\" and \"non-vulnerable\" are mutually incompatible. Letting someone be close to you is inherently a vulnerable position, whether you lean into that aspect or not.",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "I definitely respect that that is the case for most people, however I do believe that there are ways to be intimate with somebody without being vulnerable ie if you feel comfortable with somebody and certain Acts create intimacy between you, you sometimes might not have the feeling of vulnerability if safety is prevalent",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sadpepper2015",
                            "body": "I see the two being mutually exclusive.  Can you give an example of a situation with intimacy without vulnerability?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hustons_problem",
                                    "body": "Okay, I can give a few.  let's say that I reacted inappropriately at work in conversation because I have been under stress. Since I am trying to be self aware and take accountability for my shortcomings, I am going to go into work and apologize to my coworkers and sincerity. It will be a moment vulnerability, especially when it is not easy to admit wrongdoing and that we are not perfect but trying to improve. It's a humbling experience, you have to shatter your ego, and be willing to expose the weak points to others in order to move forward and grow. Now with that scenario I do not feel that there is any intimacy involved whatsoever. I don't feel like I have to intimately know anybody before I am vulnerable with them. \nHere is another example. I have just started to fall in love with somebody, let's call it the honeymoon phase. At this point in the relationship I feel as if I can share intimate conversation or moments of touch without feeling as if I am vulnerable. Even though sometimes with some people this could be different.... I would be happy to share more examples if you still need clarification. However, I don't think that anything I can say about how my experience with partnership love and security is, will be satisfactory enough for you to agree that it is possible for some people to have intimacy without vulnerability and for you to require both of those things.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hustons_problem",
                                            "body": "I would like to point out that I am constantly feeling vulnerable and doing very uncomfortable things in order to be better understood or understand others on a deeper level but I do not feel that there is intimacy in the majority of my vulnerable moments. I could be one of those rare people that just does vulnerable uncomfortable shit all the time, and I'm grateful that there are no intimate ties involved with almost all of those moments...",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sadpepper2015",
                                                    "body": "You definitely are rare.  Most people aren't ok with being vulnerable except in the presence of a few trusted people in their lives.   It seems it would carry great risk but also conversely could have great rewards. \n\nMost people also don't understand there is no real growth without discomfort and/or risk.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Hustons_problem",
                                                            "body": "Oh definitely, it is a very painful process a lot of the time. But every time I catch myself wishing to be more detached, I immediately say never mind I would so much rather have the good with the bad then just mediocre or creating sadness before there's actual sadness. Somebody must have dropped me on my head as a child and it happened to work out in my favor... I also am a very skeptical observant person, so before I even spark a friendship or some sort of relationship with anybody I've already spent a long time observing their integrity in other aspects of life. . So being a trusting person without fear of what \"could happen\", isn't a naive one.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AnAnonyMooose",
                                            "body": "It feels though that these same things, if done with a partner, then can become intimate. It happens in a different context.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hustons_problem",
                                                    "body": "Yes absolutely. I have no problem acknowledging that these things do intertwine with each other. However my question was specifically about the ways in which they do not. I am appreciative of every comment that makes me think a little bit more about what these concepts mean to me personally.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Sadpepper2015",
                                            "body": "I think the first example is good.  However, I think in the second example the devil is in the details.  What are talking about?  Is it something you'd be ok telling a complete stranger?  If so, I don't see that as being an intimate conversation.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hustons_problem",
                                                    "body": "Well there are a couple of things going on here, so I will do my best to address them both. First I would like to say, that if I am talking about one thing and you are talking about another, then nobody could be right or wrong, right? To answer the second question, I am very comfortable sharing intimate details about my life; for example I will talk to you complete strangers about my experience being assaulted as a child... Obviously I don't just walk around telling people this, but if it happens to come up in conversation I can share my experience with others that I normally wouldn't tell somebody at the check stand. That is an intimate part of my life because it is something that has shaped me and I hold close. However I do not feel vulnerable when I share this. To be vulnerable would mean that I would feel as if this information could be used to harm me or against me in any fashion. I know that if somebody tried to weaponize this information, I would give it absolutely no second thought. There are certain things that we are vulnerable about because of insecurity or past wounds. I certainly have plenty of these. I also have many things that no longer feel vulnerable, even though they are not commonly known.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sadpepper2015",
                                                            "body": "You have phenomenal insight and great emotional intelligence.  And I'm not surprised you experienced abuse as a child.  I did too.  Once I was able to own that,  I began to feel as though nothing (of much fewer things) could hurt me.  It was strange and freeing at the same time.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "NonNewtonianResponse",
                            "body": ">you sometimes might not have the feeling of vulnerability if safety is prevalent\n\n\nThe fact that you think feelings of vulnerability and safety are opposed to each other tells me that we have very different understandings of the meaning of the word vulnerability. I feel like what you're describing as \"vulnerability\" is more like what I'd call \"insecurity\" (no offense intended)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hustons_problem",
                                    "body": "Well, I will not argue with that. I absolutely believe that we have different views on what vulnerability means to us individually. But I do not feel vulnerable if I have trust in certain aspects. Sharing my authentic self has not been a moment of vulnerability for me for a long time with people that I trust. I do however feel vulnerable in other aspects of a relationship, for example if I do not self betray and hold boundaries, I feel incredibly vulnerable. Because in that sense I have something to lose. So, our experiences in life have very much shaped our definition of vulnerability very different than one another.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Hustons_problem",
                                    "body": "As a side note: I would like to acknowledge that regardless of opinion, this conversation has been for the most part enjoyable and non-offensive. It's hard to take offense if you are not looking to be offended. So I appreciate your candid and honest conversation.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ForeverFinancial5602",
            "body": "Building anything together.  Fixing a car, ikea bookshelf, or painting a room.  Anything that's gonna last a little bit of time that I built with someone makes me closer to that person.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cheap-Conflict1148",
            "body": "My partner and I like legos, share nuggets of information with each other about hopes and dreams, past experiences, we cook together, and sleep while touching some part of each other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whiskeybridge",
            "body": "dining.  a quiet drink.  talking about a shared subject of interest.  making our bed.  planning meals/grocery shopping.  reviewing our budget.  \n\nnot reading to each other.  that sounds like a chore.  i do like reading our own things, beside each other, and sharing the good parts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "storyteller4311",
            "body": "Reading to each other is hot. Preparing a meal or dessert together is also intimate for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HadesOfYVR",
            "body": "the other day, a female colleague rested her head on my arm while we were standing side by side. I stilled. I calmed. I was the Quiet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrongAd3078",
            "body": "Driving with spouse specially at night time or in mountains\n\nWatching a movie with her",
            "score": 1,
            "replies": []
        },
        {
            "author": "GandalfTheJaded",
            "body": "I absolutely love reading to someone. I also feel just being able to enjoy each other's presence, even if you're both concentrating on something else, is a great thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "False_Hair_6261",
            "body": "\\-A hug\n\n\\-A kiss (Yes, a kiss is non-sexual unless you do it while having sex.)\n\n\\-Cooking toghether\n\n\\-Watching a movie together\n\n\\-Making fun of eachother or listenting to the samea playlist next to one another.\n\nIdk i never had a partner so i don't know what im yapping about but this feels 'bout right.",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "You definitely know what you're yapping about, and I think it's absolutely suited for this thread.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "False_Hair_6261",
                            "body": "Well thank's that's nice to hear.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hinden-burger",
            "body": "I always enjoyed time when we were quietly in each other’s company: reading in bed, going on long car trips, going on long walks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DFWPunk",
            "body": "Dining out.\n\nEver since lockdown I have found it uncomfortable to eat out, so when I do it with someone it's a bigger deal than it probably should be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBooneyBunes",
            "body": "I just want a hug",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElegantMankey",
            "body": "Travailing together.",
            "score": 2,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "If you don't mind, can you elaborate on what about this makes you feel a shared intimacy?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ElegantMankey",
                            "body": "Sure, its experiencing new things together, learning of new cultures, going to do things she likes or I like, its also basically saying \"hey I finally have some time to do whatever I want and I choose to do it with you\".\n\nIts not only romantic, I find it also intimate with friends. Its a good bonding experience.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hustons_problem",
                                    "body": "Thank you for elaborating. Your response captured the meaning in my question to a t, even though I did a lackluster job conveying my intended interest.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ElegantMankey",
                                            "body": "No problem mate.\nI don't think your question was lackluster. English is not my native language and I understood it so I'd say you did well.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ColdCamel7",
            "body": "The most intimate thing you can do is open up about something you wouldn't tell anybody else",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "Yes I definitely agree. I was hoping to get more intimate things that didn't require so much of the vulnerability aspect. I'm trying to see what intimacy looks like to others when vulnerability or sexuality is taken out of the equation.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ColdCamel7",
                            "body": "Can you really be intimate without being vulnerable?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hustons_problem",
                                    "body": "Yes, if I'm just responding to your question about being able to be intimate without being vulnerable... I fortunately have security in places where I do not feel as if I am vulnerable to any sort of misgiving. So, when I am seeking closeness and intimacy with somebody, I do believe I can do so without those being mutually ways of being. However, I definitely experience a lot of situations that require my vulnerability, and willingness to be open, in order to establish intimacy. So hopefully that clarifies my ability to see both sides of the fence.... My question however, was specific in stating times that you experience intimacy with a partner with out vulnerability or sexuality. I am grateful to hear everybody's perspective. It's just as important to understand that some people do not share my same experience, as it is to hear from people that do.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hustons_problem",
                                            "body": "*mutually exclusive ways of being*",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hustons_problem",
                                                    "body": "Yes if you take only part of the sentence that is what you get. But if you are trying to understand rather than argue, you will have to look at my whole sentence that says both of those things do not have to be mutually exclusive states of being. Kind of like saying blood is thicker than water, when the whole of the statement is the blood of the covenant is thicker than the water of the womb. There are always ways to make your metric work if you are simply trying to be right or seeking to prove something. However, my intention is to hear everybody's perspective regardless of whether or not I agree I am simply curious and my intention is to gain perspectives that I may not have myself. It is possible to see how other people relate in life without it taking away from our personal experiences. As a matter of fact I believe that nobody has the right to take away how you feel and what your relations look like.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Barefootmaker",
            "body": "Hmmm. I think this is very individual. For me, intimate implies something I would only do with someone I loved - platonically or not.  So I’d say things that involve physical touch, being emotionally vulnerable or really unfiltered, doing things together that require a lot of trust etc.  reading to each other is super lovely. I like that but wouldn’t call it intimate unless perhaps snuggled up in bed.  Grooming each other (hair, skin etc), sharing quiet moments watching a fireplace.",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "This type of response is exactly what I'm looking for. I am well aware that we all have different ideas of vulnerability or intimacy, and I am not disappointed in any of the responses.... I'm more curious as to what different things people find intimate without being vulnerable, or if those two things have to coincide.  I guess I could have specified, what things are typically not considered vulnerable that you find intimacy in with a partner. I tend to only find myself feeling exposed if I'm reading out loud, and I have no problem with public speaking whatsoever. There is just something about reading to another or being read to that brings an intimacy around sharing intellect and deeper understanding of one another's interests I suppose... Obviously there is no right answer to this question, so I hope I continue to get more candid answers such as yours.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Barefootmaker",
                            "body": "I love this question, especially because I expect many people might have surprising and varied answers.  I also feel like adding that we equate touch and nudity and intimacy and sex with each other, and of course that can all be simultaneously connected, but they can also all be seperate, and there can be lovely connected moments that can also be totally non sexual that are intimate. I think it’s a lovely thing for couples or even the right friends to create space for.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hustons_problem",
                                    "body": "I agree. I was expecting a wide variety of responses and I really appreciate everybody giving their individual definitions of what vulnerability and intimacy mean to them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "InsightJ15",
            "body": "Good conversation, cuddling",
            "score": 1,
            "replies": []
        },
        {
            "author": "im_trying_so_hard",
            "body": "Singing a harmony.",
            "score": 1,
            "replies": [
                {
                    "author": "Hustons_problem",
                    "body": "\"Sweet Judy Blue eyes\" anyone? ;) I'm 100% back this. I definitely don't think that I can harmonize but I can be pretty damn synchronized LOL",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TwoGroundbreaking770",
            "body": "Massaging my wife's feet",
            "score": 1,
            "replies": [
                {
                    "author": "_JahWobble_",
                    "body": "I too find it intimate to massage this man's wife's feet",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Natet18",
            "body": "Getting my haircut by my partner. Weirdly intimate and relaxing. \n\nI also like knowing I’m saving $25-$30 a month to get a buzz cut",
            "score": 1,
            "replies": []
        },
        {
            "author": "CyberneticMidnight",
            "body": "Head and back scratches. Letting me push some hair behind her ear. Her fixing my collar or something with my clothes.\n\n\nGenerally, any action which might qualify as caressing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GreenForThanksgiving",
            "body": "Aside from a real good hug like your parent would give you it has to be learning one another’s hobbies and genuinely trying to be apart of them to some level.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StreetSea9588",
            "body": "I would love it if someone read to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "miraclepickle",
            "body": "Im not a man but my boyfriend said he finds it intimate to go for walks at night, when its cold and theres barely anyone on the streets, its just the 2 of us, walking, talking. He also likes to cook with me, specially when we make everything from scratch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Astarla-Rein",
            "body": "Forehead kisses, back tickles whilst laying in bed, cooking together, going for a walk together after a meal, making and holding eye contact across a busy room (makes me feel like we are the only 2 people there), laying my head in their lap whilst watching TV and them idly playing with my hair, playing board games together, sharing a new experience/food/movie..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lightning_Reverie",
            "body": "For me, sharing a two-person sleeping bag inside a tent while out camping in the wild.\n\nYou smell each other's natural odours. You get each other's breaths on your necks. You feel each other's body heat. Your every movement is felt by the other party. Even when no sex is planned, the physical proximity and closeness makes it feel very intimate.",
            "score": 1,
            "replies": []
        }
    ]
}