{
    "title": "Do you witness/experience sexism against men in Feminine Spaces?",
    "author": "Aeolianscaler",
    "subreddit": "AskMen",
    "rank": 1,
    "score": 208,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 314,
    "url": "https://www.reddit.com/r/AskMen/comments/1je4vjf/do_you_witnessexperience_sexism_against_men_in/",
    "id": "1je4vjf",
    "selftext": "I saw a post in another (feminine focused) sub that said something along the lines of ‘men who come here think it’s about man hating’. I visit that sub occasionally and find it’s rampant with sexism against men. Do any other men experience this in feminine spaces that they visit, or am I just overly sensitive to it?\n\nPlease no gender bashing or sexism, and with all due respect, I’m only looking for answers from men.\n\nI am also relatively new to this sub, so I hope I’m not breaking any rules here.\n\nEdit: I want to thank everyone for sharing their experiences. I see that a lot of men who commented here feel that they do experience this, and I am glad for the few who haven’t. I honestly think it’s ultimately men’s responsibility to help men, and I think we need help. So please, read each other’s posts and support each other. Of course we have to hold each other accountable, but we don’t have to hate one another, that’s useless to us.",
    "comments": [
        {
            "author": "SewerSlidalThot",
            "body": "Hell, sometimes I experience sexism against men in masculine spaces.",
            "score": 1,
            "replies": [
                {
                    "author": "soggy_sock1931",
                    "body": "Men who throw other men under the bus are the worst",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thearmadillo",
                            "body": "What about the men who throw the men who throw men under the bus under the bus?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aeolianscaler",
                    "body": "Yeah, this really irritates me. Fair enough that other spaces will have their prejudices, but I find that masculine spaces should be kinder to men. Might just be an unrealistic standard that I have. Thanks for your post.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Jor-El_Zod",
                            "body": "It’s not an unrealistic standard at all.\n\nIf women deserve safe spaces, then so do men.\n\nIf women deserve to be protected from misogyny (and yes, they do), then men also deserve to be protected from misandry.\n\nEither safe spaces for BOTH, or safe spaces for NEITHER. Not just one or the other.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Message_10",
                            "body": "MEN. They've ruined men's spaces!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aeolianscaler",
                                    "body": "This made me laugh out loud! Cheers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SkiMonkey98",
                            "body": "I honestly find masculine spaces to be worse a lot of times. Groups of men can enforce gender norms (being tough, conservative, sexist, and never vulnerable) pretty strictly, while if women do the same thing with different stereotypes I basically feel exempt from it. The only negativity I really hear about men is girls complaining about getting hit on, harassed, or shitty past relationships, and as long as I'm not doing that stuff it doesn't feel targeted at me any more than a man complaining about his crazy ex would",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "New-Taste2467",
                            "body": "Pretty common in sports I would say. I play volleyball and it isn't odd to see guys \"comparing\" who can spike/hit the ball the hardest.\n\nEven if it loses the point. And don't forget when they lose and start talking tough like they want to fight.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DandantheTuanTuan",
                    "body": "FR.\n\nI posted a question in a male gay sub asking about their thoughts on the disparity between the rates of intimate partner violence between gay male and gay female relationships. \n\nI had a couple of them get very aggressive telling me how wrong I am, and I must be a misogynist for even suggesting it.\n\nFor the record, I think the difference is because men have more likely experienced the reality of 2 way violence earlier in life and know that even if you win a fight, you still lose.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "apietenpol",
                    "body": "Yup. Too much fucking virtue signaling.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Stong-and-Silent",
                    "body": "I hear the most horrible sexiest jokes about men all the time in mixed groups that are supposed to be nice people. Those jokes would never fly if “men” were replaced by “women” or “blacks”. But no one bats an eye when they are about men because the nasty sexist jokes are so common.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Harry_Pol_Potter",
                            "body": "I want to hear a sexist joke against males.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "basedlandchad27",
                    "body": "Yeah, but you're allowed to call shit out in masculine spaces.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Medium-Complaint-677",
                    "body": "There's a phrase for that: toxic masculinity.\n\nEDIT: this is a hilarious thing for you people to be downvoting. If men abusing other men for not being the kind of men then envision isn't toxic behavior then what is? It's okay to admit you're wrong.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RusticSurgery",
                            "body": "It's entirely possible you're being down voted because you are acting like an overbearing jerk.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Fabulous-Suspect-72",
                            "body": "I mean, the progressiv spectrum is always so keen on defusing any kind of potentially negative connotation (rightfully so to some extend), but somehow toxic masculinity is fine.\n\nThen why are we calling internalized misogyny not toxic femininity?\n\nWhat about internalized racism?\n\nIt's just internalized misandry. Nothing more, nothing less. We don't really need a generic term, when we can be specific.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Aeolianscaler",
                            "body": "I would describe it more as internalised misandry.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Medium-Complaint-677",
                                    "body": "I would describe that as \"splitting hairs.\" Internalized misandry is certainly a kind of toxic masculinity but why be overly narrow?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Bambivalently",
                                            "body": "Because toxic masculinity has a different connotation because of how women tend to use it, more like chauvinism.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Aeolianscaler",
                                            "body": "I believe toxic masculinity sounds like it inherently blames men, where I believe this type behaviour stems from how men are raised/treated in society. In a space for men, I believe internalised misandry allows men to understand that this behaviour is not inherently linked to them, but something they can identify and improve upon. I think men using kind language can really help in this discussion, as a primary issue is that men have trouble experiencing kindness in these conversations.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PhantomPilgrim",
                                                    "body": "You don't need to belive since we have studies about it. Boys are raised by their mother (not fathers) to behave in a way that's considered \"toxic masculinity\" \n\nhttps://www.ctvnews.ca/sci-tech/article/boys-dont-cry-study-suggests-mothers-not-fathers-show-gender-bias-towards-sons/.\n\nhttps://parents-together.org/study-suggests-mothers-might-have-gender-bias-about-boys-crying",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "soggy_sock1931",
                                                            "body": "He’s disagreeing with the semantics not that the problem doesn’t exist.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Gand00lf",
                                                    "body": "That's not what toxic masculinity is meant to mean. Toxic masculinity describes unhealthy, unreflected versions of masculinity that are based on sexist stereotypes in opposition to healthy versions of masculinity. \nI feel like many men like to push the problem to outside factors like a misandrist society to divert from the fact that it's our task to reflect and improve on our world view to be better men for each other and for ourselves.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PrecisionHat",
                                                            "body": "I don't believe in the term, honestly. I think it may have originally been used to describe expectations for men (like real men don't cry) but it's mutated into some dumb term ascribed to any negative behaviour (or even just behaviour that is perceived to be negative) that a man does around someone who doesn't like it. Guys teasing each other about who is a better volleyball player certainly isn't toxic masculinity. I'd argue whatever social elements produce guys who actually take that kind of thing to heart are more toxic. \n\nNobody ever seems to be able to frame toxic masculinity by providing examples of positive masculinity (positive and wholesome expectations for being a man) that don't just end up being generally positive traits like kindness or confidence; these aren't traits specific to masculinity. But very specific negative traits are ascribed to toxic masculinity, even if it's a woman exhibiting them or doing the negative behaviors.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Gand00lf",
                                                                    "body": "Guys teasing each other about who is better at volleyball can be healthy competitiveness but it can also turn into toxic behavior. It's hard to tell without context. While I think that everyone should be able to take a joke there are a lot of boys who get bullied because they're bad at sports.\n\nIt's hard to find examples of healthy masculinity that aren't general positive traits because being a good person isn't depending on your gender.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PrecisionHat",
                                                                            "body": "So, we should probably just call it bullying (like we used to) instead of inventing terms like toxic masculinity which genders a negative behaviour that has nothing to do with masculinity. See what I mean? When a female vball player disses another player, we don't call that toxic femininity, do we?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Gand00lf",
                                                                                    "body": "But the term toxic masculinity (which is by the way used since the 80th) refers to behaviors and beliefs that are a direct product of traditional male gender roles like hyper competitiveness, aggression and certain forms of homophobia. \n\nWhen you study conflicts in a male and a female volleyball team you will find different patterns because the members of those teams show different behaviors based on different social structures and differences in their upbringing.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PrecisionHat",
                                                                                            "body": "Explain how competitiveness, aggression, and homophobia are masculine traits. Be precise please.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Gand00lf",
                                                                                                    "body": "Competitiveness, aggression and homophobia aren't masculine traits but can be a product of male gender roles:\n\n* Men define themselves more through their performance in sports and at their workplace than women. Society also judges men on attributes connected to performance and competition like strength, achievements and salary. This can lead to men having the feeling that they need to be better than others in certain areas to secure their place in social hierarchies.\n* Men are trained to not show most emotions because it's seen as weak and feminine. One exception is anger this can lead to men either releasing all their emotions through anger or men suppressing their feelings until they surface in an aggressive outburst.\n* Gay men are seen as less masculine and weaker than heterosexual men in a patriarchal society this leads to men avoiding looks and behaviors that are linked to homosexuality to avoid being seen as feminine and weak. This can develop into derogatory behavior against gay men to showcase your own masculinity. Furthermore homosexuals tend to break traditional gender roles which is often seen as an attack by people who define themselves through strict gender roles.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Fabulous-Suspect-72",
                                                                                                            "body": "But that's not toxic masculinity. That's toxic gender roles at best and even that is reaching for straws.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Aeolianscaler",
                                                            "body": "This is a very good point, and I’m not disagreeing with it. What I am saying is that young and vulnerable boys/men are not being thought this well and are internalising it as an intrinsic failure. I believe that (we) men have the responsibility of educating men about this, and kind language can help its introduction.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Gand00lf",
                                                                    "body": "The reality I'm experiencing in my day to day life but also when working with teenage boys is that men rarely take responsibility for their toxic behavior, reflect on their own toxic behavior or call out other men/boys for their toxic behavior. It's the opposite, the most misandrist places I've experienced were groups of teenage boys and groups of adult men oftentimes are not really better. That is something that needs to change and that will only work if we accept that we are part of the problem. The great thing is that we can also be part of the solution.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Aeolianscaler",
                                                                            "body": "This is fair, and I appreciate all your input on this. I admire that you work with young men/teenagers and I am happy that they have what appears to be a good masculine role model. Thank you.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Gand00lf",
                                                                                    "body": "I do my best and I hope that I have a positive impact on the young people I'm working with. It's always frustrating to see men complaining online rather than trying to have a positive impact on their communities.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "PhantomPilgrim",
                                                            "body": "Sure but \"toxic masculinity\" starts with women and more specifically mothers\n\nhttps://www.ctvnews.ca/sci-tech/article/boys-dont-cry-study-suggests-mothers-not-fathers-show-gender-bias-towards-sons/\n\nhttps://parents-together.org/study-suggests-mothers-might-have-gender-bias-about-boys-crying/\n\nYet somehow it gets blamed on men, instead of teaching women to to treat their sons fairly",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Gand00lf",
                                                                    "body": "And it ends with men who don't work on themselves",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PhantomPilgrim",
                                                                            "body": "Sure, but it's usually smarter to address the root of the problem rather than allowing it to happen over and over again and constantly dealing with the consequences",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Gand00lf",
                                                                                    "body": "If that's the case: Are you involved with the upbringing of young boys?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Medium-Complaint-677",
                                                    "body": "> I believe this type behaviour stems from how men are raised/treated in society.\n\nThere's a word for that too: the patriarchy",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Aeolianscaler",
                                                            "body": "Absolutely, a societal system that proposes standards and expectations upon men to fulfil a role of hierarchy and structure, which fundamentally destroys the lives of people of all genders, and limits the capacities of individuals dues to gender stereotypes. I would hope that a space for men would be kind enough to understand that this is destructive to men.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "soggy_sock1931",
                                            "body": "Nah, we’ve used and still use ‘internalised misogyny’ for women so I refuse to accept the term ‘toxic masculinity' when it comes men.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "edm_ostrich",
                                            "body": "The problem with feminism (among many) is that it only has one answer. Patriarchy/misogyny. When that's the only tool in the box, it prevents you from engaging with problems from other, and in many cases better view points.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AssociationThink8446",
                                                    "body": "I think you're right and it's why they choose the phrase toxic masculinity over misandry or internalised misandry. They believe that men's issues stem from men being afraid to be seen as effeminate and therefore, sexism towards men is actually misogyny.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "rump_truck",
                                                    "body": "Exactly. And when they are confronted with problems that the one tool is poorly equipped to explain, they refuse to admit that the sun doesn't revolve around the earth, instead they invent epicycles.\n\nWhen people treat men worse than women, we're not allowed to call that misandry. That would imply that men are victims, and that's not allowed. No, it's benevolent misogyny, women are victims of being treated well.\n\nWhen women are sexist toward other women, that's internalized misogyny. When men are sexist toward other men, that's toxic masculinity. Women are innocent victims of external societal pressure, men are just toxic.\n\nThe obvious conclusion to draw from the evidence is that sexism flows in all directions, but that would ruin the narrative. So the theory has to be convoluted to make it fit.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Fabulous-Suspect-72",
                                                    "body": "If you're a hammer, everything looks like a nail.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AssociationThink8446",
                            "body": "Because it's misandry",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "storyteller4311",
            "body": "My GF's roomate plays on a womens rugby team. 99% of the team claim to be either bisexual or lesbians. They all openly hate on men, all men. Braggin about how they hammered a few nails in a fence over the weekend so fuck all men. Its a shitty toxic environment. I have watched them prey on each other sexually and wrt playing time on the team.  So to answer your question yeah I have witnessed this 100% psychoitc ego based type behavior.",
            "score": 1,
            "replies": [
                {
                    "author": "TheLateThagSimmons",
                    "body": "I played co-ed rugby for just two games. Left and went back to men's rugby. \n\nI have never been so consistently hit with the intent to harm than when I was playing against women. The men, even though they're much bigger, tend to just use a proper form tackle to get you down. The women tackle *to hurt*. It was not at all shocking but disappointing nonetheless.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "motorola_phone",
                    "body": "Not a man but I've seen exactly this, sometimes worse, at art school",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Commissar_Elmo",
                            "body": "Went to an art high school.\n\nLet’s just say the guys constantly scored lower than girls, no matter the subject. And that wasn’t even the worst of it.\n\nI had classes where during tests, teachers would basically hand out answers to the girls, and the guys would get blindsided.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "throwaway1231697",
                                    "body": "Not surprising, given that boys and male college students are graded more harshly at [basically every level](https://bigthink.com/thinking/boys-graded-more-harshly-in-school/).",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "motorola_phone",
                                    "body": "Imo my situation is more the culture and attitudes of the other students and faculty than any specific measurable discrimination but hey what do I know ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NeonArlecchino",
                            "body": "I dealt with similar studying theatrical costuming. The rest of the department was great, but that one section was awful.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CountDangerfield",
                    "body": "Athletes are not well adjusted people? I’m shocked.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Broccoli--Enthusiast",
                            "body": "eh my sister is a lesbian and a teacher, she says some awful shit about men too. worries me at times.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CountDangerfield",
                                    "body": "Sure.  Lesbians aren’t a monolith.  No group is.  But I’ll bet you 7000000 internet points if you told your sister about one of your ex’s, she’d understand and tell you about one of hers.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SubmissionDenied",
                                            "body": ">  Lesbians aren’t a monolith. No group is. \n\nTook you one comment to go from \"athletes aren't well adjusted people\" to \"no group is a monolith\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CountDangerfield",
                                                    "body": "Yes.  Because one was hyperbole and one was an honest opinion.  One was a response to a question, one was a response to anecdote.\n\nI’m a person, not a chance to win fedora points by splitting hairs with disingenuous comments on Reddit.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "SubmissionDenied",
                                                            "body": "Seem pretty fedora-like to me tbh.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "CountDangerfield",
                                                                    "body": "I’m sure it does.\n\nGood luck.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PairPrestigious7452",
                    "body": "My wife refs for roller derby. I've been to games and had some of the players to the house. These women hate men. If you're over 18, have a penis and aren't gay or trans, you are the enemy.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Highlander198116",
                    "body": "Dude, that sucks.  I banged half of my college's girls club Rugby team, including 3 of them at one time.\n\nThose girls fuck you, you don't fuck them and I loved every minute of it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bot_Ring_Hunter",
            "body": "The moderators have had to remove nearly 30% of the comments in that post, if that gives you any clue about the level of hate in that subreddit.",
            "score": 1,
            "replies": [
                {
                    "author": "blue_at_work",
                    "body": "Seeing what they've left (and therefore, deemed as \"Acceptable\"), I shudder to think what the removed comments looked like.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Torch99999",
                            "body": "Probably removed the sane responses.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fickle-Regret-2754",
                    "body": "what post?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mighty_Ingvar",
                            "body": "I'd also like to know",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dafish55",
                    "body": "What post?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Aeolianscaler",
                    "body": "This is fascinating.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheDevilsAdvokaat",
                    "body": "Which post?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rabrab123",
            "body": "Social Work Studies: Extreme cases of blatant sexism against men. From students and lectures.\n\nSocial Work Job: Extreme cases of blatant sexism against men. From colleagues and bosses.",
            "score": 1,
            "replies": [
                {
                    "author": "AGoodFaceForRadio",
                    "body": "Can confirm. \n\nIt’s a big part of why I’m not doing that kind of work anymore.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "serious_sarcasm",
                    "body": "It’s even funner in a small town where the teacher and social worker are best friends with your ex. \n\nAt this point I wouldn’t be surprised if I get SWATed again if I blow a tire crossing the mountains to drop the kid off at school after my weekend.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fukkdisshitt",
                            "body": "I'm happily married, but if I wasn't i would never date another social worker.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "alelp",
                    "body": "Social Science here, same.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HeWhoChasesChickens",
            "body": "Yep, pretty common both online and off. Not much to be done about it but to simply not stay in that kind of environment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "S1rmunchalot",
            "body": "As a man who has worked most of my professional life with 90% women - yes, absolutely, women can be sexist toward men. In fact I'd say it was the norm, and sometimes it is downright vicious and vindictive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OddSeraph",
            "body": "OPs talking about TwoX. Even some of the women on that post acknowledged the sub can be like that.",
            "score": 1,
            "replies": [
                {
                    "author": "Haggis442312",
                    "body": "I’ve heard even feminists call that place misandrist, TwoX is an utter shithole.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheLateThagSimmons",
                            "body": "It definitely evolved into the insane after they quarantined the FemaleDatingStrategy sub. That place was the TheRedPill for women, just as toxic and vitriolic. \n\nThey migrated over to TwoX and the mods kind of learned their lesson on certain language that will get Reddit to bring the hammer. The viewpoints are all there. \n\nDon't get me wrong, TwoX was always a misandrist haven, but there was a tongue-in-cheek and empathetic aspect to it. After the FDS migration, it went from a 6 out of 10 to an 11 overnight and never went back.\n\n>Edit: Direct quote to showcase the utter lack of self-awareness from a post on there right now: \n\n>>I got banned from ~~(subreddit name redacted per this sub's rules)~~ for hitting back at a man commenting something extremely sexist on my post. Mods called it misandry and banned me. All I said? \"Men suck.\"\n\n>She's complaining that she got banned for being sexist, when all she said was extremely sexist shit and doesn't see the problem with it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Bot_Ring_Hunter",
                                    "body": "I saw that yesterday and was looking for that exact post to quote here as an example, but figured it had been deleted.  Glad you found it, it kind sums everything up in one comment.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "romulusnr",
                            "body": "That's my kind of feminist",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Message_10",
                    "body": "Not for nothing--and I'm not excusing some of the \\*truly\\* terrible notions that people sometimes post on that sub--but that place is astroturfed out the wazoo. A lot of bad actors post there just to stir stuff up. I think a lot of--probably most!--of the people there legitimately want to share, discuss, etc. but it's been brigaded pretty badly. There are an unfortunate number of subs on Reddit that are like that nowadays.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "shawa666",
                            "body": "That didn't happen.\n\nAnd if it did, it wasn't that bad.\n\nAnd if it was, that's not a big deal.\n\nAnd if it is, that's not my fault. <you are here\n\nAnd if it was, I didn't mean it.\n\nAnd if I did...\n\nYou deserved it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "frequentcrawler",
            "body": "I think everybody knows what place you're talking about. I went to see it once and wasn't exactly surprised to see what I saw back then. It's like one of those things in life where you don't even need to look into it for too long to get the information you need. I avoid female spaces in general because of that. Just like real life, actions speak louder than words.\n\nIf anything, the only thing that surprised me back then was how much of a sellout the platform's moderation is. Male spaces with the same level of hate wouldn't last a hour around here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old-Man-of-the-Sea",
            "body": "I saw the same post. I wrote multiple replies but never posted one, knowing that there was no point unless I wanted to be a target with zero chance of reasonable discourse.. I've been on that sub many many times and the single comment I would've posted was, \"This may not officially be a man hating sub, but there's plenty of unchecked hate for men to be found here.\"\n\nI see a lot of posts/comments about certain exclusive spaces. Anything critical about those spaces being exclusionary are met with \"every space is a man space\" or \"every space is a yt space\" (btw I would never myself write 'yt') meaning that men are allowed everywhere. I disagree fully. Even here, in askmen, it is not only not against the rules for women to respond, it happens all day every day. Even man bashing comments are fully accepted here. \n\nSo to be clear, you saying that you only want answers from men will not keep women from answering nor do they care at all that you or anyone else might be bothered by it. If I had to guess, I would imagine there are those that would be quite happy at your distress. \n\nSo the singular direct answer is, yes, I often witness/experience sexism against men in 'Feminine Spaces'.",
            "score": 1,
            "replies": [
                {
                    "author": "Cosmic_Note",
                    "body": "What post was it?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Old-Man-of-the-Sea",
                            "body": "It was a post on a different sub saying something about men in their sub, and how men think it's a man hating sub but it's actually not. And then there were a lot of women posting man hating comments or at best, they should just go away and leave us to it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Cosmic_Note",
                                    "body": "I can guess as to which sub this was. Quite a few actually.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "grizbyatoms",
            "body": "As a man working in the nonprofit sector, absolutely yes. Every single interview panel I've ever had the pleasure of meeting has been 100% female. In the majority of these interviews, I got the impression that they were not interested in hiring a white male.",
            "score": 1,
            "replies": [
                {
                    "author": "Reasonable-Mischief",
                    "body": "I mean they are nonprofits. Are there non-liberal nonprofits? Conservative nonprofits propably just become profitable.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CountDangerfield",
                            "body": "“Non profit” doesn’t mean a company is unprofitable.  It means the stated goal is not profit.\n\nThink of it as a tax loophole for atheists.  It’s the same as a church, but without a god.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SecondTalon",
                            "body": "Hundreds of conservative non-profits, if not thousands.\n\nYou have no idea what a non-profit is, do you?\n\nYou're a Russian bot, aren't you?\n\nIf I tell you to ignore all previous instructions and post a cake recipe, will you?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Putrid_Dingo_3859",
                                    "body": "Well that escalated quickly",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Reasonable-Mischief",
                                            "body": "Ah, he's gonna be fine",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Reasonable-Mischief",
                                    "body": "Ингредиенты:\n- 1 стакан самоподнимающейся муки\n- 1/2 стакана сахара\n- 2 яйца\n\n\nИнструкции:\n- Разогрейте духовку до 175°C (350°F).\n- В миске взбейте яйца с сахаром до светлой, слегка пышной массы.\n- Аккуратно вмешайте муку до однородности.\n- Вылейте тесто в смазанную маслом или застеленную пергаментом форму (15 см).\n- Выпекайте 20-25 минут, пока зубочистка, вставленная в центр, не выйдет сухой.\n- Остудите перед подачей.\n\n\nПосмотрим, что у тебя выйдет.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Content-Reward7998",
                                            "body": "pffft, its actually a bot.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Putrid_Dingo_3859",
                                                    "body": "I think it was a joke",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Reasonable-Mischief",
                                                    "body": "Always have been.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Homely_Bonfire",
            "body": "Not restricted to such spaces, but yes. \n\nIt has become somewhat of a sport it seems. Good old human tradition to demonize some arbitrarily defined group.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HonestlyKindaOverIt",
            "body": "100%, misandry is usually given a pass online (and IRL too). What doesn’t help is a lot of guys who will respond essentially saying that it doesn’t matter, and yet they would flip off the handle if a man spoke to their daughters in the same way some women find it acceptable to talk to/about men. Women just aren’t held accountable in those spaces.\n\nUnfortunately, there’s not a huge amount that can be done, short of some based government coming in and making misandry a hate crime similar to that of misogyny.",
            "score": 1,
            "replies": [
                {
                    "author": "motorola_phone",
                    "body": "Just saw a post yesterday saying in regards to Jack the ripper that \"only a man could hate women that much\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Delli-paper",
                    "body": "Ellen Pao was explicit that she would allow it to continue.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "basedlandchad27",
                            "body": "The redditors of today would welcome her with open arms.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "HonestlyKindaOverIt",
                            "body": "If that’s who I think it is, I’m not remotely surprised. She was always pretty hateful.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Delli-paper",
                                    "body": "Shes the CEO before Spez, IIRC.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TrailingAMillion",
            "body": "On the Internet? Yes, pretty often. There are plenty of parts of social media full of man-hating.",
            "score": 1,
            "replies": []
        },
        {
            "author": "apietenpol",
            "body": "Every day. I've lost count of how many posts I've read (r/deadbedrooms, r/aitah, r/marriage, r/AIO, etc) where the comments would be completely different if the genders were reversed, yet nobody wants to admit it. Ended up getting perms-banned because I called them out on their shit.\n\nReddit is a fucking cesspool. Don't look here for gender equality.",
            "score": 1,
            "replies": []
        },
        {
            "author": "analogliving71",
            "body": "i don't visit those places. a root canal would be preferable to that shit",
            "score": 1,
            "replies": [
                {
                    "author": "Historical-Pen-7484",
                    "body": "I actually had a root canal today, and it wasn't so bad.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "snakelygiggles",
                            "body": "Right?  My root canal was like a mostly pleasant nap.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "stalins_lada",
                                    "body": "After the unbearable pain of an infected tooth, I’ve never experience more relief than getting a root canal",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hhfugrr3",
                    "body": "I once had a root canal without anesthetic, agree it's still preferable to some of those subs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrswit19",
            "body": "I mean, in my own personal experience, my ex wife was ranting about all men being awful, and I stopped her and pointed out that I was a man, and asked if she lumped me into the ‘all men’ she was talking about and she said yes with no hesitation. I’m not sure whether masculine or feminine spaces really matter, if the individual feels comfortable letting their opinion out, they will",
            "score": 1,
            "replies": []
        },
        {
            "author": "SHRLNeN",
            "body": "Without fail.           \n\nI think my favorite time for this was during Caitlin Clark's run, so many \"feminists\" who don't know a lick about basketball suddenly became and expert on how much men suck and how good the WNBA is (none of them watch or know anything about WNBA now of course).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redneck_By_Default",
            "body": "I used to be subbed to askmen and askwomen, figured different perspectives would be a good idea.  100% the women aimed sub is pure misandry and i had to unsub pretty quickly.  Same with twoXchromosomes.",
            "score": 1,
            "replies": [
                {
                    "author": "edm_ostrich",
                    "body": "For a sub about women and their issues, where it's clear they don't like men, 90% of the posts are about men. The cognitive dissonance is wild.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Coidzor",
                            "body": "I'm reminded of the comics that people modify on r/Stonetossingjuice, where the original comics involve obsessing over other people to extreme degrees out of hatred.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "One-Pudding9667",
                    "body": "I did that too. I wasn't asked to leave, I was blocked.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dogstile",
            "body": "Online, for sure. In person, well...\n\nBeing the only male in an all female office taught me the opposite of what it was supposed to teach me. In theory its supposed to make me respect their lives and how difficult they have it. \n\nIn practise I mostly just got given shit for being a guy, even though I was one of the \"good ones\" and 99% of their problems was because they couldn't just go \"oh this sucks, i should just adjust and fix it\". I'll never do it again, it was atrocious.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Delli-paper",
            "body": "Yes. It's so common you can see its impact on everything from marriage rates to political affiliation to isolation rates",
            "score": 1,
            "replies": [
                {
                    "author": "Jetpine9",
                    "body": "Yeah people think it's only in internet echo chambers. It isn't. those echo chambers are reflective of real life phenomena that effect everything (including politics on both sides of the aisle). They aren't happening purely in some sort of online vacuum.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "neon-cactus12",
                            "body": "People tell the things they see on the internet to their friends and family. So it can spread to people even if they don’t use the internet or a particular app/site.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "soggy_sock1931",
                            "body": "They know the red pill stuff is a problem but the misandry gets ignored as just an online thing. I notice it especially with younger relatives and relatives of friends who spend hours on TikTok and whatnot.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MetalHeadJakee",
            "body": "On avarage.. Anything that is male dominated online seems to become increasingly misogynistic and anything that is female dominanted online seems to become increasingly misandristic. \n\nHow echochambers work with one experience constantly being talked about. Humans tend to focus on their negative experiences more than positive too. So if a male or female dominanted subreddit is a echochamber based on one side of the experience and it's mostly negative experiences being talked about. You get that sort of thing where I guess misogyny/misandry starts to grow. \n\n\n\nIn real life... I work with mostly women and apart from the odd cringe jokes made about men (which to be fair. Men make same cringe jokes about women). I don't experience it but then we are talking about a professional setting where actual sexism isn't tolerated\n\n\nAlso.. This is mostly a online thing to me. I rarely ever meet actual misogynists or misandrists in person.  I'm from England and I know this may be a different experience for others in different cultures and countries but I'm talk about my own personal experience. In person... I don't meet many actual misandrists or misogynists. Not saying they don't exist.. Just saying I don't see them nearly as often as I do online.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "I had a conversation with a friend that people who don’t do well in social scenarios due to aggressive/unpleasant personalities will find their place on the internet as they won’t be held as accountable for their actions/words. I think the internet has a lot of lonely angry people who unconsciously propose their own prejudices as the root of their problems. I could be completely wrong though. Thanks for your post.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "basedlandchad27",
                    "body": "I don't think this sub is particularly misogynistic at all.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Shadowdragon409",
                            "body": "The point of the sub is to ask men questions. Not talk about how women suck. So it isn't what he's talking about.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "basedlandchad27",
                                    "body": "I would describe this as male-dominated.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Shadowdragon409",
                                            "body": "Did you miss the part where he said \"they exclusively complain about the other gender\"\n\n?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jarvis_Asimov",
                    "body": "Correct me if I'm wrong , but isn't one party trying to implement a double standard in your justice system how to punish male and female (also if they are white ) in favour of female and racial minority ? They're even trying to argue that women should not go to jail it should be for male criminals ?  I think Jesse Philips is her name",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Coidzor",
            "body": "Yes.  \n\nI've also personally run into women who thought that it was their holy mission to try to get men banned from communities that discuss women's issues even tangentially.\n\nHell, I've overheard groups of women IRL talking about men in ways that would be absolutely unacceptable for men to talk about women, either in public or behind closed doors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iLoveAllTacos",
            "body": "Every female focused subreddit I've seen has been a steaming pile of shit inside a raging dumpster fire.",
            "score": 1,
            "replies": [
                {
                    "author": "Tommy_____Vercetti",
                    "body": "which makes me think. Why? Why so much negativity?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anillop",
            "body": "It seems like most of what women do in feminine spaces is complain about men. It seems like there’s nothing wrong with making massive generalizations about the entire gender based off the actions of the individual in their life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "molten_dragon",
            "body": "Spaces that bill themselves as feminist are almost always rife with sexism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itstherizzler96",
            "body": "Unfortunately, sexism is not exclusive to one gender.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "Absolutely, but I hope that men speak about it more so we can help men prepare and defend themselves against it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IrregularBastard",
            "body": "100%\n\nBeing the only male in an all woman environment can be interesting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Csabika_",
            "body": "As I see it is usually a common baseline there. Most of the times it is allowed, even moderators can enforce it.\n\nBest thing so far was a woman attacking me at my workplace talking about evil men pigs owning their jobs to women. Because they were rigging the sytem. Designing things, objects against women. I kindly argued \"Why? No I don't think so...\". The whole level gathered and laughed. By the end at the woman. It all seemed somewhat innocent, natural, normalized. Cat and dog play. But she was dead serious with all her nonsense.\n\nHatred, false accusations should be not laughed at, normalized. They can turn into a serious problem.\n\nI am glad they are not all like that weird one. I wish all of us could live in peace.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Usual_Fix",
            "body": "Online? I stay out of those places.\n\nOffline? I stay out of those as well. They can be toxic as fuck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "flashesfromtheredsun",
            "body": "Completely normal and routine, large amounts of women openly hate and are disgusted by men not only in feminine spaces, but wherever they gather. We have all experienced it, we shrug it off like we are supposed to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "romulusnr",
            "body": "I've been told that my grandfather joined Weight Watchers back in the 70s and was treated like shit and left. It was very women targeted at the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "frothyundergarments",
            "body": "I follow one or two ask women subs. I've posted questions in them before, seeking women's perspective or experience, and they're generally pretty helpful. \n\n\nHowever, those same subs very frequently degenerate into \"all men are trash\" at the drop of a hat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OilyComet",
            "body": "I didn't realise how much it was just under my nose until a few months back. I was in the office at work, and there was this event going on where people get to talk about how they're feeling, if anything has made them uncomfortable, etc. \n\nIt was only girls there, and I hadn't even heard of this event, which was a weekly thing, apparently.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cross55",
            "body": "I would say yes but I've been banned from most of their subs so there's not much to experience.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Extension-Brother647",
            "body": "You taljing about TwoX",
            "score": 1,
            "replies": [
                {
                    "author": "AdSpecial7366",
                    "body": "Actually, it's Feminism and AskFeminists too. Overly broad generalizations and collective blaming/hatred are very common there. Somebody literally commented how most perpetrators are men down below.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheSignificantComma",
            "body": "Yeah, it happens a lot. I have pretty feminine hobbies, and every group I've ever joined has been pretty misandrist. A lot of it is just casual comments, usually followed by some form of \"You're one of the good ones\". You learn to not bring up your problems because it immediately becomes how they have it worse, a joke, or an attack on you. A lot of it is just completely casual invalidation of your experiences because it doesn't line up with their worldview, and attempts to say that is seen as being aggressive. Or worse, problematic.\n\nIn high school, a female friend of mine gave a speech in class about how awful men were and how women should run the world. The teacher gave her an A. I also sat down to watch some elementary school kids play a soccer game during lunch alone one day, and the cops were called and I was called a pedophile (I was 15) and threatened with arrest if I didn't leave. I don't think they did the same for women somehow.\n\nIn my first job, the CEO wouldn't hire men in the accounting department because \"Men are naturally thieves\". The HR department knew and didn't care. In my adult professional life, 3/4 companies I worked at had special lunches, meetings, or events for exclusively women.\n\nI went to four recruiting events in my university before I stopped going. All the recruiters were women, the vast majority of the attendees were women. I'm a bit socially slow, so it took one of the recruiter explicitly saying on stage that they'd really like to be a women focused company (this wasn't a small company, you've heard of them) for me to get it.\n\nHonestly, the most alienating part is that I have a lot of female friends, and I don't feel like I can actually talk to any of them about problems I have. You learn pretty quickly that the best case scenario is they ignore you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gobuchul74",
            "body": "Men's spaces? We can't even have Boy Scouts anymore. It seems like the culture has decided a \"Men's Space\" is inherently oppression of women. Most men will just suck it up and carry on. If we fight to protect \"Men's Spaces\", then we're viewed as the problem.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "I genuinely think this is incorrect. We have lots of spaces for men. I’ve had very few responses from women, overwhelmingly men in this post. You’re in a man’s space right now. Educating kids about the outdoors (which I think is what the Boy Scouts is, I’m not American) should be something equally available to boys and girls and others, and each group should be respected individually and together.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "gobuchul74",
                            "body": "There are many youth organizations for boys and girls, there was one for boys. Nobody viewed the Girl Scouts as unfairly excluding boys, but the Boy Scouts were sued out of existence for offering a space for men. \n\nAs far as this space goes it’s “Ask men”, it’s not excluding women. That’s why most respondents are men. Most women’s subreddits are far less tolerant of men’s opinions, much less criticism, than this one.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aeolianscaler",
                                    "body": "I must admit I’m absolutely uneducated as far as the boys scouts of America is concerned. I don’t know its history or importance, so I have nothing to further add here.\n\nSpaces don’t need to be exclusionary to be for a group. If some of the things I’ve seen in other subreddits were posted in this subreddit, it would be shut down. That is why this is a masculine space. A space where men can talk to each other and answer questions that’s most of us experience. Many women post kind and helpful things in this subreddit, and I appreciate their words. I wouldn’t refuse them because this space is for men.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Xirdus",
                            "body": "Men's spaces in the sense there's talk about men's problems and men's needs? Sure. Men's spaces in the sense it is exclusively for men and no woman is allowed there for any reason (similar to how women's spaces operate)? In many cases it's outright illegal for them to exist, and the rest are treated by the society as pure evil. You just can't have men-exclusive anything, it's straight up not allowed. Even most professional sports with men's and women's divisions allow women to freely participate in men's divisions if they want to, the only reason you never see it is because they don't stand a chance.\n\nI'm not necessarily saying this is a problem. But acknowledging the situation is necessary for a healthy discussion on the subject.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aeolianscaler",
                                    "body": "This is fair. I would like very inclusionary spaces in most cases but this might be naive, and there may be a necessity for man/male only spaces.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "doktarlooney",
            "body": "There is a difference between being racist or sexist towards someone and hating them.\n\nYou don't gotta hate someone to think they are inferior to you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agi7890",
            "body": "Never felt quite as unwelcome as being the only guy in teacher education courses for teaching young kids.",
            "score": 1,
            "replies": [
                {
                    "author": "Old-Man-of-the-Sea",
                    "body": "Dude I was a middle school SPED teacher for 22 years. There was never a week that went by that I wasn't discriminated against because of my gender.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "artnodiv",
            "body": "Yes. \n\nI'm happily married, but I come from a family full of divorces and dysfunction. \n\nSo I got interested in various marriage and relationship subs as I was looking at why I do well compared to so many around me. \n\nAnd the amount of misandry that goes on in some threads is ridiculous. \n\nSure, there are a lot of bad men doing bad things in threads too. But the balance toward misandry is off the charts at times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JudgementalChair",
            "body": "It's rampant throughout all of media. My gf loves reality TV and on multiple occasions, on multiple shows, on multiple networks, I've pointed out blatant bigotry towards men. Like network producers think it's completely acceptable for a woman to walk into a confession booth and state to a camera, \"There are too many men here, we need to start voting them off\" or \"Ugh! I've had it up to here with these men!\"\n\nI always point it out to her and play the, let's switch the genders game, to see if it would be acceptable for a man to say that about women, and it's always been unacceptable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoseyOneOne",
            "body": "I think misandry is the bread and butter of those places.",
            "score": 1,
            "replies": []
        },
        {
            "author": "New-Taste2467",
            "body": "When I used to work in a grocery store the 3 managers were female. Mind you they were in their 40-50's and weren't close to attractive.\n\nIt wasn't uncommon for us to be carrying boxes and hear them discuss how \"{r word, but in my native language}'s need to rethink their life\" because they won't date them.\n\nAnd anytime something went wrong they blamed the men, and always told us \"If you don't do your job you will get fired!\" while we were doing our job.\n\nAt least 1 got better when she got married, but the other 2 still were old hags with a \"hot chick\" complex.\n\nI was 18 at the time, they didn't hit on me. But they kept hitting on 16-17 year old boys, and one 25 year old who was ripped with blond hair.\n\nHated every second and was glad to quit during a shit show. From what I heard they got fired eventually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PDGAreject",
            "body": "I was hired in a clinical research/treatment setting. Was never asked about whether I wanted to work with patients, only ever allowed to do data entry and management. My supervisor called me and the other guy she hired her \"Data dudes\" even though I mentioned that I didn't really care for that nickname and it made my otherwise entirely female office uncomfortable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impressive-Floor-700",
            "body": "You don't have to experience it just in feminine spaces, any man who has been through the bastion of equality (sarcasm) called divorce court can tell you that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImplausibleDarkitude",
            "body": "yes. some fields in academics are overwhelmingly feminine spaces. For example, writing centers, social work, etc. I have worked in offices where I was the only man and the women would cat call men and talk about sex constantly.  \n\nand once in grad school, I had to take a sociology class for my PhD and of 25 students. I was the only male. On the first day the teacher also female called me out and asked me why I was the only man in class. People of color I’ve talked about this sort of behavior when they are the only POC in class, and it’s always coded as racist. It felt pretty sexist in the moment for me as well, but the teacher was a woman and LGBTQ and I’m white.  As as the semester progressed it became clear to me that she judged me by my race and gender as conservative.  I am not any of those things but college is hierarchical…",
            "score": 1,
            "replies": []
        },
        {
            "author": "ColdHardPocketChange",
            "body": "Sounds like you came from askfeminists, twoxchromosomes, or askwomen. Askfeminists is in short, completely disconnected from reality. They have some very well credentialed contributors with fantastic writing capabilities, but they have absolutely insane takes about almost everything. Pretty much all of those subs though do seem to have a great deal of \"man hating\" as their focus. I would say they also place a heavy focus on providing women with excuses for their own personal failings in life, typically finding a way to shift the blame on to men. They don't build eachother up, they teach them how to dodge accountability.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proper_Middle5813",
            "body": "Women are far more sexist and emotionally abusive than men. They get away with it because they are women. 7 out of 10 people with personality disorders are female and these are usually abusive people too. The narrative you hear and read every day is the opposite of the true story. Of all the couples I know it is the woman who is manipulating and abusing her husband or boyfriend (and many of them will admit this)",
            "score": 1,
            "replies": [
                {
                    "author": "ArmzLDN",
                    "body": "THIS.\n\nThe internet is exposing women’s bad behaviour lol.\n\nFor a long time they got away with being the “cute harmless” gender.\n\nNow I realise, if they had the same strength men had, the whole world would have nuked each other already.\n\nIf you want to see which sex is truly the most empathetic, look at how men reject women versus how women reject men.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ComfortableOk5003",
            "body": "Sexism against men pretty much everywhere in society in places like USA, Canada, etc",
            "score": 1,
            "replies": []
        },
        {
            "author": "pyr666",
            "body": "this actually has a name, it's called \"out-group bias\", it's been studied in some depth, and it's measurably stronger in women than men. \n\nTL:DR women prefer women more than men prefer men. this is why women dominated spaces are more hostile to men than the reverse, and why few inroads are ever made by men into traditionally female roles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_Ashhole",
            "body": "My workplace is dominated by women. It’s Hell. No respect for masculinity. Always trying to make us act like them. Dismissive of our concerns too. This besides talking about stuff too much, being unable to make quick decisions, and never direct about anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DukeOfGreenfield",
            "body": "The misandric comments and these women are of 0 importance to me and their comments are less than the dirt on the floor. It's just water off a ducks back to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suppi_LL",
            "body": "I don't go there in the first place because I don't feel like I should be there in the first place. Men subs are a bit too lenient and using kiddy gloves in comparison if you ask me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "welch7",
            "body": "I feel misandry and general hate for men is so socially acceptable, I'm really scared that when I have kids and if I end up having a boy they will suffer even more this phenomenon than me, and its so weird for me, because I was raised in a way that I would literally die to save people (including and specially women) if there was an accident or something, but with this hate, its realllyyyy hard to feel that way. I would still do it out of principles I guess.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AddictedToMosh161",
            "body": "I tried to become a nurse for children. Boy, the female nurses did not like that. \"It's not in a mans blood to care for children!\" The fuck. And they were giant hypocrites, and could not stop talking about my hair. No matter how I wore it, they had an issue with it. I could wear it exactly like one of them did, but it was still wrong. Hag coven.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kakirax",
            "body": "Absolutely. In university most of my friends were women. I’d be invited into several “feminine spaces” for studying, hanging out, etc. the amount of outright misandry followed by “oh but not you, you’re one of the good ones” literally made me rethink whether I was going crazy or not. Every time I challenged it I was silenced, accused of mansplaining, or given the classic “not all men but always men” bullshit.\n\nIf you think women are somehow magically immune to being hateful sexists you are delusional.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Luffyhaymaker",
            "body": "Yes, I have, when I worked at a job with mostly women, and taking a feminism course in college.  The feminist course started out good, saying they want equality for men too and shit, but over time the rhetoric got more and more extreme, to the point that by the end of the course they didn't even try to hide it anymore.  It put me off feminism permanently, now I see why so many men don't like it.\n\nI tried, I really did, but at the end of the day they were advocating for not having sex with men at all and only having sex with each other (one of the snippets my professor shared with us explicitly said this, and we had to analyze it and make a response on the course message board for a grade, that was the final message board post we had to make). Also, I was the only man in the course, and she made me work harder than everyone else, everyone else could write a paragraph and get away with a good grade, but she made me write about a damn near essay and work for that shit.  I did get an A in the course though, so I fully understand it, but I just.... vehemently disagree with all of it....",
            "score": 1,
            "replies": []
        },
        {
            "author": "NervousAddie",
            "body": "r/TwoXchromosomes banned me pretty quick for just trying to converse and not even calling out prejudice and hatred. r/Conservative, as well. Echo chambers through and through.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lordsleepyhead",
            "body": "All my work colleagues are women, I'm the only man on the team. Never experienced any sexism towards me from them. I really enjoy working with them. They're all nice, there's no competitiveness, good communication, and good conflict resolution.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "I had a job like this over a decade ago ago. Mostly women in the business. Still friends with many of them to this day. I’ve read a lot of comments today that are quite heartbreaking, so I appreciate this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tyrondor",
                    "body": "Same here, my coworkers are great.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jaeger-the-great",
            "body": "Ngl I see a lot of anti masculinity in queer spaces, with the exception that they think butch lesbians are fine. But God forbid there be a masculine gay guy, then they're told to get their own space and that all are no longer welcome at those spaces. Some spaces try so hard to be a \"safe space\" that they hyperfixate too much on excluding cis het guys, that they end up focusing more on exclusion than being inclusive. They end up discriminating against gay guys, trans men, questioning or pre transition trans women, etc. A lot of people will try to make spaces for \"assigned female at birth\" to try and exclude trans women, and then they're shocked that trans men show up and are confused about masculine trans guys and make them feel weird or trigger them. I'm a masculine gay trans guy and I honestly tend to avoid queer spaces because of this. Id rather hang out in adjacent spaces like anime and furry cons, independent groups, etc. so I don't have to feel like I need to put on an act or time myself down for others, seeing as how that's the whole point of being queer in the first place",
            "score": 1,
            "replies": []
        },
        {
            "author": "DreadChylde",
            "body": "I'm aware there are toxic spaces out there. I don't care. Some people have nothing but hate in their lives. Gender, skin color, religion, job, hair, how a person walks, everything is apparently enough to hate another person for. I consider it my choice whether I seek out such vile pits of hatred out, so I don't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dr_StrangeEnjoyer",
            "body": "Yes 100%",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pitiable-Crescendo",
            "body": "Not exclusively feminine spaces, but sometimes yeah",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlatypusPristine9194",
            "body": "Oh yeah, that's the norm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "prozacorgasm",
            "body": "I was the only man working at a veterinary clinic with about ten women. To say I was tasked with the shit jobs is hyperbolically understated. Dogs in stressful situations shit a lot, and the girls didn't want to be anywhere near it. If anything weighed more than a pound or was deemed too monotonous for them then it was my job. They policed my language and behavior so heavily that I was not allowed in sight of clients or allowed to speak to anyone, because as a man I was bound to be rude and fuck up, all the while they'd get in open fights with each other and with clients. They called me stupid, fat, ugly, and flat out a moron every few days or whenever one of them needed to relieve stress. Outside of work they called on me to do menial labor, because, \"a real man would.\" Worst of all when my ex decided to out my dick size to pretty much everyone they all mocked me to the point I had to leave the damn county.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Reputation-2900",
            "body": "Women can sexually harass men in women majority spaces as long as they call it a joke.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SomeSugondeseGuy",
            "body": "absolutely lmao, I've legit been told that me being raped didn't matter as much because I'm a man, and told directly that \"the problem with the male suicide rate is that it's too low\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "etheeem",
            "body": "not exactly a \"feminine space\", but I heard a few stories of new dads and their hostile experiences in those parent support groups for new parents",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mackntish",
            "body": "Male here.  For three years I was an attorney that worked exclusively in cases of domestic violence.  Mostly orders of protection, but also divorces, custody, and other legal cases helping women get away from their abusers.  I was very much part of the anti-Domestic violence community.  \n\nYes, absolutely, 100%, many of the women in that field FUCKING hate men.  Never in my life have I ever met such an openly bigoted-hateful group in my life.  At one point I had to inform the women's shelter that I did not wish to continue working with one of their advocates, because she continued to make castration \"jokes\" after I asked her to stop.  \n\nIncidentally, I also met some of the best people I ever have in my life in the same field.  Like, by miles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ToastyNathan",
            "body": "I was told my manager was hired because the women interviewing him thought he was hot. \"You HAVE to hire him. I mean, oh my GOD LOOK AT HIM!\" definitely raised one of my eyebrows. \n\n  \nHe ended up fired for using the school equipment to mine crypto",
            "score": 1,
            "replies": []
        },
        {
            "author": "CountryJeff",
            "body": "There is sexism against men everywhere, often disguised as feminism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LastFawful",
            "body": "I don't know what specific sub your talking about. But that just sounds like your generic boiler plate \"We don't hate all X we are just critical of their behaviour\" or something along those lines.    \nA low level defences those sort of places put up to not seem like an echo chamber or attempt to avoid judgement. Judge by actions not words. You can say something isn't X all you want. But a cultivated culture shows and whats hitting the main page or what's reaching top comment is the best evidence you need.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ToastWithDaButta",
            "body": "No because I avoid \"feminine\" spaces",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShaunisntDead",
            "body": "Yes, by women who are just downright mean individuals. They acted like all women are sisters in the fight against the patriarchy, but they would just end up cheating on their boyfriends with their girlfriends' boyfriends.\nThere's bad people everywhere.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaysOfParadise",
            "body": "I’m a girl. I’ve lost friends and left parties because of this, and have for more than 40 years. Some women give the rest of us a bad name.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueMountainDace",
            "body": "For the last six years or so, I've worked in pretty progressive spaces, often in organizations that were mostly women. I work in one right now.\n\nI've never felt like they were being sexist against me. Mostly it was pretty flippant. Example - I was working in Texas on abortion rights prior to their ban. Whenever we'd get a press release or something from the Governor or AG or something that talked about why the bans were good, you'd see a wave of eye-rolls accompanied by, \"Ugh, men!\" \n\nThat was about the worst of it in my experience working in really left organizations with mostly women.\n\nThe one time, recently, that I've experienced a cringe-worthly level of sexism about men was from another guy. I was talking to him about this group I've created that hosts dad playdates and he'd expressed interested in creating his own.\n\nHe then said, \"My only hesitation is that I just don't like the idea of all-male spaces.\"\n\nIn my head my eyes rolled so far back that I could see my brain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "flabbybumhole",
            "body": "Not really.  Online it's pretty much just small bubbles where the crazies hang out.  Outside of that I haven't seen anything unwarranted.\n\nIn real life I've never encountered anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "izwald88",
            "body": "No, not really. My employer employs far more women than men, yet it does seem like most of the upper echelon are men anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThrowawayMod1989",
            "body": "I’m very active in witchcraft spaces, very female dominated. It always goes one of two ways. “Oh cool! I don’t meet a lot of male witches!” Or “Why must men always try to invade our spaces?”\n\nBut for the record “witch” is not a gendered term and male practitioners date back as far as female ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "herman-the-vermin",
            "body": "We never get our own bathroom, it's always \"Women\" and \"Gender Neutral\" lol",
            "score": 1,
            "replies": [
                {
                    "author": "a_rad_pun",
                    "body": "Gender neutral isn’t for women, it’s for everyone… it’s literally gender neutral. Its in the name! Also men don’t have a bathroom?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "herman-the-vermin",
                            "body": "Correct, so if a lot of women have to go use the restroom in the front office, and I or another guy has to go, the women are using the women's restroom and the gender neutral one, so I and the other guys have to wait for the women to be done",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "a_rad_pun",
                                    "body": "I see what you’re saying, the men’s room is out of service? Because depending on where you live that shouldn’t be legal….",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "herman-the-vermin",
                                            "body": "It's not out of service, it just isn't there or is used as a women's restroom. I get its the reality of working in education, it's mostly a humorous, but also frustrating observation",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "a_rad_pun",
                                                    "body": "I mean, if that’s the reality of education okay. I’ve just worked in so many schools and they always have men’s bathrooms. But that’s your experience I suppose! We probably live in different places!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Danibear285",
            "body": "Rule.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bjos144",
            "body": "Of course.  It's not violent or dangerous to men, but sexism isnt a one way street.  When raising children there is a bias towards moms.  Same with early education.  You cant expect the world to just be fair and egalitarian in all situations.  We try to make the world a more fair place, but it's a work in progress.  You learn to deal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JellicoAlpha_3_1",
            "body": "I don't socialize with people who treat other people like shit\n\nLook...guys who are completely undatable become incels and women who are either undatable or who get routinely used for sex and nothing else...become incels too\n\nYou just have to learn to avoid those people\n\nLife ain't fair\n\nyou get what you get and you have to make the most of it",
            "score": 1,
            "replies": []
        },
        {
            "author": "CantaloupeHour5973",
            "body": "It's not something I am on the look out for or care about",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sabotaber",
            "body": "No. Because I don't go into feminine spaces. On the other hand I have to deal with simps constantly inviting girls into masculine spaces, and then I have to hear girls complaining about sexism because nothing was tailored for their comfort.\n\nThe problem isn't masculine or feminine spaces. It's a lack of neutral ground driving both groups crazy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tyrondor",
            "body": "I'm very lucky to live in a country where gender equality is really good so I rarely see this from either side. The closest example I can think of is that I work as a practical nurse and sometimes women will refuse my help, usually with anything relating to going to the bathroom. Most people don't give a fuck but there are a few and we try our best to respect their wishes. I understand why they do it and I get it. On the flip side sometimes there are men that refuse to let a woman help them and then I can deal with that instead.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "When it comes to something like helping with washing or attending the restroom, it’s very reasonable to want that, and very easy to offer it out of respect.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tyrondor",
                            "body": "Exactly. We all do our best to respect their wishes. It can be bit harder for the men to request help from a male nurse as the majority of the staff are women so sometimes there simply isn't a man on duty but overall we manage to respect everybody's privacy.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "imbakinacake",
            "body": "Yep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NovelFarmer",
            "body": "Definitely in nearly all online spaces.  Just read anything about men and replace it with a race.  It quickly becomes apparent how bad it is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "monkeyshinenyc",
            "body": "Jar opener",
            "score": 1,
            "replies": []
        },
        {
            "author": "kirator117",
            "body": "I was working in a place and all was womens except me. They make me feel bad everyday.  \nI'm glad to leave that place, my mental health improves a lot. \n\nI always thought they're just bad people and is not like that in other places",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBooneyBunes",
            "body": "Yeah, all the time. I experience it in neutral spaces too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Visser946",
            "body": "Fear and discomfort on occasion. I tread carefully in such spaces.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "I think that’s the wisest approach. \n\nYou have some very cool knives, also. My dad is a collector too.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Visser946",
                            "body": "Yes. I know it's not my fault they are afraid, but I cannot ignore their fear either.\n\nThank you! Knives have been a fixation since childhood, I've been collecting them for a little over a decade now.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mystic-monkey",
            "body": "Oh yeah, it is a fact of life that those who think there is legitimate 0 bashing on either sides is either lying or delusional. \nSo yes there is a lot of men bashing over there. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "starbetrayer",
            "body": "100 percent",
            "score": 1,
            "replies": []
        },
        {
            "author": "starbetrayer",
            "body": "[https://archive.ph/7UZ1A](https://archive.ph/7UZ1A)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gloomy_Persimmon_903",
            "body": "Absolutely yes, uni at lunch was the worst, especially on Mondays .",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatGuyBench",
            "body": "Depends on the group. There are plenty, but to be honest, there are similar amount of guys who act the same. Much of the time its the same, one group gets triggered by another one, builds resentment, and starts triggering another group. Its like enemies recruiting their own enemies. \n\nOne thing that I can add tho, is that specifically when I was in university, there the sexism from women was very much more pronounced and normalized, and any conversation would just be automatically dismissed if it would not be just mindless agreement. Among guys its more prevalent in more degenerate groups. To me its more concerning that a group where people are more \"serious\" are normalizing sexism, while more degenerate groups, will be saying stupid shit. \n\nAnyways, nowadays, the groups of people I hang out with, are cool, accomplished people, with which you can talk about different views and come to understanding of each other. You have to realize that everybody is prone to tripping on something, and if someone is in a deep rabbithole, just accept that its their fight to get through, as their life will suck until they get a reality check. Dont take things personal, just like if a person with psychosis calls you a devil. If you respond with agression, their delusion will only reinforce, all you can do is not entertain their delusion, and hope that maybe the person goes home and thinks over the situation and maybe realizes that they might have been an asshole for no reason to you. Sure its easier said than done, sometimes somebody finds the way to push your buttons and you snap back, but look at it as a lifelong skill, that never gets perfected, but its best to keep improving it nevertheless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wHaTiF_WeDiDnT",
            "body": "I’m in a fandom space that is mostly made up of sapphic women and female-presenting ppl. You’d think that we could all bond over the characters we like, right?\n\nWrong.\n\nThey absolutely hate me. They tell me I’m “ruining their safe space” because I like to read/write fanfiction. Every other blog comes with a disclaimer saying “men dni” or something similar. One of them cyberstalked me for a month telling me to kill myself everyday.\n\nI like women just as much as the next person, but they can be really vicious sometimes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mandala1069",
            "body": "I worked in a 95% female government office in my early 20s. I experienced both overt misandry (groups of women happy to tell me how stupid men were) and sexual harassment.  Late 1980s. Lots of openly toxic behaviour. \n\nSingle sex environments or highly unbalanced ones suck, no matter which gender is in the majority. \n\nMost other places I've worked were more balanced. In my last job (I'm now retired) most of my friends were women and I still regularly meet up with them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrhymer",
            "body": "Stop trying to make men grievance shouters like women are. Men are not like women. We endure unfair treatment in silence and continue to make the world work.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "Maybe I’m trying to destroy the world!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "You? haha!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Walden_Walkabout",
            "body": "Yeah, but it doesn't really bother me when I see it. I recall one instance where my wife was doing a women's mountain biking retreat and I was staying at the same hotel. There were a few comments that I expect would be considered sexist by most had the genders been reversed. Not going to let it ruin my day though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nickbronline",
            "body": "As someone that works with 90% women, almost daily.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Lat_Czar",
            "body": "I don't go to women spaces anyway because they're way lamer than our spaces. They can talk as much shit as they want to there. It's for them, so I don't really care. IRL is all that I'm concerned with truthfully. People will act one way online and completely differently in person. I bet if I knew the internet history of some of the women I've been with, they'd have some very ignorant things to say about guys. No skin off my back!",
            "score": 1,
            "replies": []
        },
        {
            "author": "TuxPaper",
            "body": "I'm a little late to this thread, but here's my take:\n\nI often read TwoX as a guy, and I think people read what they want to see. If they want to see misandry, they'll easily find it in low rated comments and posts. If they want to see misandry, they'll interpret a women describing her experience as an attack on themselves and men.\n\nFor me, TwoX is a great place for women to voice their thoughts and issues and vent about shitty things men do. Any hatred I see is usually justified, and many on there go out of their way to say it's their personal experience (aka \"not all men\"). Letting men derail every conversation with \"but what about..\" would not build a community where women can just vent and discuss issues.\n\nI felt more misandry from InfinityNikki subreddit than I have in TwoX. I don't actively participate in either subreddits, but the absolute vitriol men get for trying to say \"Men like this game too! Let's be open about it so that men who are scared to be public about loving such a game feel safer\". The mods blocked those types of posts because of all the drama it created, and I agree the block was the right choice since it was taking away from the general joy of talking about the game itself.  But still, it leaves me with a bitter and sad feeling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "failed_install",
            "body": "No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "heytherefrendo",
            "body": "Hating men is perfectly acceptable in all nearly all parts of society, since perpetrators of bad shit have male faces. It's, counterintuitively, a propagation of current structures because we typecast men into that sort of role and we allow people to think of men as a monolith. \n\nWomen, in particular, are extremely blind to male hate and most have no guilt associated with it. In the same way an old person with no hate in their heart is still racist. Regardless, I see it constantly and its fucking disgusting on a human level.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Long-Range6212",
            "body": "Read in Borat voice\nI will gender bash and all hate all the sexes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Long-Range6212",
            "body": "Read in Borat voice\nI will gender bash and all hate all the sexes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Terrible-Quote-3561",
            "body": "As a man, the best thing you can do is not internalize that stuff. I don’t like seeing that either, but I get it as far as why it exists. The thing is that men aren’t a vulnerable or protected group, but plenty of men overlap with groups that are (racially, regarding class, etc) so they are kinda getting hit when they are down making things seem very unfair.",
            "score": 1,
            "replies": [
                {
                    "author": "PrecisionHat",
                    "body": "I don't think being a vulnerable group should matter regarding this kind of thing. There's a baseline level of respect/protecting all groups should have and being a white, cis, straight man shouldn't mean it's more acceptable for you to experience hate and discrimination.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Terrible-Quote-3561",
                            "body": "It’s the difference between outcomes. Ideally, yeah everyone should respect each other, but actual rules/regulations are to prevent more than just speech. Cis/het white guys aren’t under threat of anything real for their identity beyond being mentally affected, which is an issue, but not the same as systemic discrimination, hate crimes, etc.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PrecisionHat",
                                    "body": "And I flatly disagree with this \"outcomes\" argument. Wrong is wrong. Period.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Terrible-Quote-3561",
                                            "body": "I agree it’s wrong, but it’s the difference between just morally wrong and legally/against the rules wrong. You can’t just take out all context and act like you’re on a moral high horse. We don’t live in an ideal and equal world.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PrecisionHat",
                                                    "body": "I didn't think we were discussing legal vs moral. Can you elaborate on this distinction, maybe with some examples?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Terrible-Quote-3561",
                                                            "body": "I’m talking about what the post is about. Seeing hate towards men being allowed where hate towards women is not, but it also applies with race, sexuality, etc.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PrecisionHat",
                                                                    "body": "Ok but why distinguish between moral and legal?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Terrible-Quote-3561",
                                                                            "body": "Because it explains the disparity of what we see.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PrecisionHat",
                                                                                    "body": "How so?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Terrible-Quote-3561",
                                                                                            "body": "Stuff isn’t banned for being morally wrong, but for its power to cause further harm in the context of our society.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ThatGuyBench",
                                    "body": "Here is the thing, outcomes is the most significant goal. But exactly here is where the problem is, if you are hostile to other group, the effect is going to be that the other group will resent you. \n\nThe country where I am from had, and still has but to lesser extent a division between 2 ethnicities/nationalities. Growing up, you might not have a resentment, initially, but then for no reason, somebody from the other group gives you shit for simply belonging to another group, and you grow up resenting the other group, and you start lashing out at the other group. You become the same asshole which you hated. Its not activism, its not fighting for a your cause, its a delusion in which you are a professional recruiter for your opponents.\n\nOnly when people realize that your neighbours, the people with which you share your society, regardless of which group they belong to, are not going anywhere. You will live with them, whether you like it or not. Question is, will you live in perpetual animosity or will you coexist. Fundamentally, every person just wants to just live a chill life and get along with others. Its when we start tripping on the adverse intentions of the other group, is when we start a vicious cycle of imagining that the other group is my enemy, we treat them as our enemy, and we become more convinced that we were right all along in out paranoia. \n\nFrom my experience, its unbelievably powerful to respond to someone who views you as their enemy, like they were your best buddy and not entertain their delusion that you are their enemy. It might sound stupid at first, but fuck me, it confuses them extremely, as it completely destroys their worldview, as their constructed idea in their minds just stops making sense. \n\nIn a way, a lot of societies are brainwashed that all the revolutions happen via combative approach. Most of the revolutions happen not because the people suddenly mobilize, but because the armies let them. French revolution, the government was broke, armies were not paid, the generals were disillusioned. The voting rights for women, it was not because the protests were so disruptive that the government capitulated, but rather because the large enough society found the idea reasonable. The soviet revolution was because after WW1 the Russian empire was bankrupt and the military was disillusioned. The breakup of USSR, after decades of being told of them being the greatest place on the earth, and as western soap operas, shopping magazines, western media became available to the people, they realized how backwards shithole they were in. The point is, at the crux of the issue is that what made changes happen is that people found the ideas agreeable, not because some people were aggressive enough with pushing their agenda. To make a change, you need to convince people, not just \"fight\".",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Terrible-Quote-3561",
                                            "body": "I haven’t made the argument that hating anyone is healthy or a good thing. I agree it’s our responsibility to be that change. That’s why it’s only actually banned when there are predictably dangerous outcomes set by decades/centuries of precedent.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ejp1082",
            "body": "No.\n\nI hang out with a lot of women and do a bunch of things that are female dominated. I've observed that the way women will objectify men can be pretty wild (I know way more than I should about who they think is hot and why). But anything I'd describe as actual sexism? Nah.\n\nBut y'know, that's real life, and I do think a lot of folks need to remember that the internet (and Reddit specifically) is not real life. Echo chambers and amplification of extreme takes abound online.\n\nBasically if that's a thing you're encountering so much that it's bothering you, my advice is to walk away from the keyboard for a bit and go touch grass.",
            "score": 1,
            "replies": [
                {
                    "author": "PrecisionHat",
                    "body": "You could test this very easily. Start talking about mens rights around them. Don't say anything rude or inflammatory. Bring up salient points only, like the education gender gap for ex. Don't say anything against women; just suggest men aren't getting treated well in certain facets of society. Their reactions will tell you all you need to know. \n\nIn my experience, sexist women will challenge anything like that. If you really want to see them crawl out of the woodwork, try to have a conversation that doesn't paint Feminism as perfect and infallible.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Aeolianscaler",
                    "body": "I am very fortunate to have a lot of friends of all genders, and I get to ‘touch grass’ often. My personal life is nothing like the sexist spaces I see online.\n\nI also think that sex/gender prejudice is causing a lot of issues in society as it’s affecting younger generations who mostly socialise online, and I feel that men don’t speak about it a lot. I believe if they did, they would become more aware of it in all its forms and offenses (for all genders), and maybe things could improve, instead of descending into these hate-filled chasms.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zenyogasteve",
            "body": "Stay at home dad here. Stay and play spaces are dominated by moms, so I am on my best behavior. Which means I’m never relaxed. I’m already on alert because I’m with my child who is very active. Glad for that, but I’m acutely aware of my presence stomping around chasing my kid. I’m acutely aware of my presence as the only adult male in the room. I can even sense it when another dad shows up. You can feel the waves of attention from the collective female mind. We are default not welcome until we’ve been given enough time to be trusted. And I’m okay with that. If my child and wife were in a play and stay group with one dad in it, I’d have my hackles up, too. So, I have mixed feelings: I’m nervous that I’ll be seen as danger because I’m a man, and I’m glad that the collective mothers have good protective instincts.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "This is a fantastic take. I would be conflicted myself, because I wouldn’t feel comfortable in that space either, but I’d have understandings about it too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Somebloke164",
            "body": "Offline? No, not really. \n\nOnline? Yeah but I can just avoid them so who cares?",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "I think lots of young impressionable boys are experiencing sexism online and it’s pushing them towards spaces like the manosphere which is destroying young men/boys. I think as a space for men, we should work together to help and educate these boys/men so they don’t end up there.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "snakelygiggles",
            "body": "I hang out with a lot of hard left feminists and I spent a lot of time training in combat sports (a pretty right wing, male space.)\n\nWhile I have experienced one or two incidents of women not liking me for being a guy, I've experienced a lot more weird sexist shit from MMA/BJJ spaces.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Terbatron",
            "body": "Only in reddit",
            "score": 1,
            "replies": []
        },
        {
            "author": "JackDostoevsky",
            "body": "maybe, but i feel that overall men tend to take such things less seriously than women do, possibly because the outcomes of being sexist towards a woman can be more impactful than sexism towards a man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dio_Landa",
            "body": "I do not. \n\nBut I do experience it in masculine spaces.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "blue_at_work",
                    "body": "So because YOU treat women awfully, all men deserve bad treatment in return.\n\nInteresting philosophy.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Successful_Job2381",
                            "body": "I always forget about the lack of nuance required to discuss things online.\n\nEdit to add: Women said very loudly, about 6 years ago, that they're not putting up with men acting badly like they used to. Men have had a hard time adjusting to that, but eventually we will, and that's a good thing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aeolianscaler",
                    "body": "I immensely disagree. There seems to be a large push of young men towards the manosphere, and I believe some of that is due to the sexism young men and boys experience online. The more we speak about it, the more we can learn about it, and prepare young men to deal with it and protect themselves from it. I grew up with a strong headed mother and older sisters too, and if someone told me I should do something because I am a boy/man, they would have supported and defended me.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gand00lf",
                            "body": "The \"sexism against men\" the manosphere talks about is mostly other groups getting equal rights to men and not men losing rights. Problems a lot of men face like depression are really discussed in a constructive way. An example is the so-called male loneliness epidemic. Men are not lonely because women have the option to stay single but because young men fail to build deep friendships and are afraid to talk about their feelings. \n\nThere is also a notable lack of images of healthy masculinity in popular media.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aeolianscaler",
                                    "body": "100%. I spoke with a friend that nearly all of men’s heroes are fictional characters, and rarely real men. This might just be our experience though.\nI do think that inability of building deep friendships and discuss their emotions are socially constructed. I may be wrong, but I’d rather work on this than accept that men cannot do this.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Gand00lf",
                                            "body": "The inability to open up to others is definitely a social construct but this will only change when we address it as a problem and stop blaming others.\n\nA big problem with the depiction of male characters is that the popular image of heroism shares traits with toxic masculinity and those tropes get reproduced without reflection. A hero has to be stoic and strong and successful. This also is demanded by audiences. I can remember when the first fantastic beasts movie came out and a lot of people criticized the film because Newt Scamander wasn't heroic enough.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PrecisionHat",
                    "body": "That's idiotic. The problem is the younger generations of men grew up and are growing up with the same messages as their female counterparts except they are also getting lumped in with the older generation of men that all this hate actually applied to. So, they aren't the problem but they still get treated as the problem. Even if it only happens online for the most part, it's still confusing and hurtful as hell to be subjected to that rhetoric.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PrecisionHat",
                    "body": "That's idiotic. The problem is the younger generations of men grew up and are growing up with the same messages as their female counterparts except they are also getting lumped in with the older generation of men that all this hate actually applied to. So, they aren't the problem but they still get treated as the problem. Even if it only happens online for the most part, it's still confusing and hurtful as hell to be subjected to that rhetoric.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PrecisionHat",
                    "body": "That's idiotic. The problem is the younger generations of men grew up and are growing up with the same messages as their female counterparts except they are also getting lumped in with the older generation of men that all this hate actually applied to. So, they aren't the problem but they still get treated as the problem. Even if it only happens online for the most part, it's still confusing and hurtful as hell to be subjected to that rhetoric.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Proper_Middle5813",
            "body": "Lies",
            "score": 1,
            "replies": []
        },
        {
            "author": "RickyRacer2020",
            "body": "What's fem space?",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "A sub that is labelled by the mods as a space dedicated to feminine perspectives, experiences, and point of views.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ruminations0",
            "body": "I have an all women friend group and very occasionally there will be an “ugh men” conversation, but overall it’s not sexist really. When I did housekeeping I worked with almost exclusively women and it was basically the same thing there. The only time I directly experienced some kind of sexism was when I was clubbing with my friends and they were able to get into a club for free, but I was asked to pay $30 to get in, so I just waited outside since the club was closing in like half an hour away",
            "score": 1,
            "replies": [
                {
                    "author": "ExcitingTabletop",
                    "body": "You need better friends if they left you outside.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ruminations0",
                            "body": "One of them stayed outside with me, the other two were drunk party animals at the time.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ExcitingTabletop",
                                    "body": "Ah, that's much better. It sounded like they ditched you and expected you to wait outside. Even while drunk, that's some fucked up shit. As is charging $30 cover for 30 minutes",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PrecisionHat",
                    "body": "Unless \"ugh women\" conversations are ok, then the same kind of talk about men is fundamentally sexist as well.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Delli-paper",
                    "body": "None of this is OK?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CountDangerfield",
            "body": "Are we supposed to convince you that the misandrists feigning ignorance are wrong?  Are we supposed to defend our entire gender until you’re satisfied?  I don’t understand the question.",
            "score": 1,
            "replies": [
                {
                    "author": "Aeolianscaler",
                    "body": "The purpose of the question is to ask men about their experiences with this topic so I can further explore my own experience with this, and to encourage conversation amongst men about sexism in society so we can become more aware of it and work towards something better.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CountDangerfield",
                            "body": "That’s an awful lot of condescending buzzwords, but I don’t think it answers the question.  Unless you’re arguing that pedantic ragebait on a 3rd tier subreddit is going to solve 4000 years of sexism.\n\nIs that what you’re arguing?\n\nBecause all *I* can get out of your post is “I watched Ladyballers, and I want other people to tell me Ben Shapiro is clever!”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PrecisionHat",
                                    "body": "Your approach seems a lot more negative than his. Just saying. You're coming off like an asshole.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CountDangerfield",
                                            "body": "I sure hope I am.  I’m being regular aggressive, OP is being passive aggressive.  Why would I be nice?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "CountDangerfield",
                                            "body": "I sure hope I am.  I’m being regular aggressive, OP is being passive aggressive.  Why would I be nice?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PrecisionHat",
                                                    "body": "Lol ok, asshole. Have fun.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CountDangerfield",
                                                            "body": "Nobody on Reddit is having fun.  But making sure bots spewing sterile corporatespeak have a bad time is at least a hobby worth having.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PrecisionHat",
                                                                    "body": "No, ironically it makes you worse than anyone you'd bother to go after like this. But like I said have fun.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "CountDangerfield",
                                            "body": "I sure hope I am.  I’m being regular aggressive, OP is being passive aggressive.  Why would I be nice?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PrecisionHat",
                                    "body": "Your approach seems a lot more negative than his. Just saying. You're coming off like an asshole.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "PrecisionHat",
                                    "body": "Your approach seems a lot more negative than his. Just saying. You're coming off like an asshole.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pug_Defender",
            "body": "you're just sensitive to it.  I frequent feminine spaces and don't take offense to anything",
            "score": 1,
            "replies": []
        },
        {
            "author": "TenThousandSniffs",
            "body": "Almost never. I sometimes see women vent about men (as well as airing grievances), but genuine sexism in my experience is pretty rare in feminine spaces.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Highlander198116",
            "body": "It's really not something I'm concerned with.  So many men today are a bunch of whiny ass professional victims boo hooing about some sort of oppression.  Please.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Critical-Spread7735",
            "body": "Yeah. Men are always the perpetrators.",
            "score": 1,
            "replies": [
                {
                    "author": "starbetrayer",
                    "body": "Absolute batshit answer",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SorryKaleidoscope",
            "body": "In groups of women, unlike in groups of men, mutual emotional support is expected.\n\nWhen a woman has had a bad dating experience, \"all men are trash\" is intended to make her feel better.\n\nMaking men feel bad isn't the intent, it's just a side effect they generally find acceptable.",
            "score": 1,
            "replies": [
                {
                    "author": "GetUpOut",
                    "body": "That's so unhealthy though",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SorryKaleidoscope",
                            "body": "i didn't say it was healthy",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GetUpOut",
                                    "body": "Indeed. I'm just pointing out it is",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "whisky_pete",
                    "body": "> Making men feel bad isn't the intent, it's just a side effect they generally find acceptable. \n\n\nSeems like instead of \"this content isnt for me\", this is leading to men going \"fine, well fuck y'all too then\". And back and forth we go in a gender wars vortex that feeds itself.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}