{
    "title": "How do hardcore lifters feel about complete newbies in the gym?",
    "author": "blickadelphia",
    "subreddit": "AskMen",
    "rank": 3,
    "score": 69,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 160,
    "url": "https://www.reddit.com/r/AskMen/comments/1jeapwq/how_do_hardcore_lifters_feel_about_complete/",
    "id": "1jeapwq",
    "selftext": "I'm pretty new the fitness world. I'm not morbidly obese or anything but I have quite a bit of weight to lose and don't have a background in strength training.\n\nThe only non-Planet Fitness gym convenient to me is an old-school \"meathead\" gym that's known in the area as a hardcore powerlifting gym. It's also super cheap at $35 a month. My question is would I be super out of place at this gym as a total noob? My concern is not so much being intimidated per se as it is just being in the way and preventing more serious lifter bros from getting their workouts in. I have big time social anxiety about these things and when I go to gyms I find myself constantly comparing myself and feeling physically inferior to other guys there. Which in practice usually means I don't make it too far outside of the cardio area.\n\nI'm not opposed to going to PF but do want to use free weights which my local PF doesn't have apart from dumbbells. This other gym is within easy walking distance which I feel makes it more likely that I would actually go.\n\n**EDIT:** I can't respond individually to every comment but thank you guys so much! Wasn't expecting so many replies. I'm going to sign up for a membership tomorrow. ",
    "comments": [
        {
            "author": "sistertwister2929292",
            "body": "We don't care. At all.",
            "score": 1,
            "replies": [
                {
                    "author": "jscummy",
                    "body": "The more serious gyms usually have a way more supportive and friendly group of members ime",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "comicsnerd",
                    "body": "Actually, you be better of in the \"meathead\" gym, with all the real lifters, than in the tiktok PF.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Resident-Cattle9427",
                            "body": "The so-called “meathead” gym and/or the “gym rats” will give you actual advice, support, and spot you. \n \nThe TikTok PF crowd will yell at you for getting in their video shot.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sephresx",
                                    "body": "I'm waiting for a PF tiktoker to tell at me in their shot. I need to test my camera kicking strength.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Expensive-Track4002",
                                    "body": "I love it when they get mad about walking into their shot. I just tell them to fuck off.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Resident-Cattle9427",
                                            "body": "Oh absolutely you should.  \n\nThey suffer from the delusion known as main character syndrome.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gdbnarov",
                    "body": "This, so much this",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tacoshortage",
                            "body": "AT ALL...in fact I wish you luck and success....just please don't film in the gym.  And put your weights up when you're done.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Resident-Cattle9427",
                                    "body": "I’ve never seen so many people filming themselves as I did when I lived in Vegas. I didn’t realize that many people were influencers I mean checking their form.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "1morepl8",
                                    "body": "I don't know a single successful lifter not filming top sets.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Igno-ranter",
                                    "body": "And don't hoard the weights and equipment.  Pet peeve of mine at the gym I go to, people will grab 4 or 5 sets of weights, drop them by a bench, do a set, play on their phone for ten minutes, use a second set of weights and on and on.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "basedlandchad27",
                    "body": "Only as far as we care about anyone following basic etiquette. The etiquette a newbie is most likely to break is understanding that squat racks are in high demand and you should only use them for exercises that require them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "numbersthen0987431",
                    "body": "Just don't do curls in the squat rack.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mackntish",
                    "body": ">We don't care. At all.\n\nSurround a bunch of narcissists with mirrors, and they all have the gym to themselves.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "commit-to-the-bit",
            "body": "Lift.  Make yourself better.  Ask if you need help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikess314",
            "body": "Don’t worry, as long as you are adhering to basic gym etiquette, everybody there will be quietly rooting for you. Don’t take up more than one station. Re-rack your weights. Don’t record anyone. If it’s busy, don’t just hang out on your phone for 10 minutes between sets. Be receptive to others asking how many sets you have left or to possibly work in. And if you’re sweaty, wipe down your equipment after you’re done. Do that, and after a while, you’ll probably get some compliments on your progress.",
            "score": 1,
            "replies": [
                {
                    "author": "CountDangerfield",
                    "body": "I’d add that it’s a million times less creepy to just ask the damn question than try to figure it out from across the gym with embarrassed glances.\n\nI will happily explain how and why I’m doing something to a complete stranger, but by the third time we make eye contact and you pretend we didn’t, I’m going to assume my balls fell out and nobody wants to tell me.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BoyWhoSoldTheWorld",
                    "body": "This basically. Hogging equipment to swipe on your phone is my biggest pet peeve. \n\nYou’d also make someone’s day by saying “hey you look like you know what you’re doing, could you give me some tips on this movement?”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WKD52",
            "body": "Relax. 😊 Every single face you see in there was, at one point, the new guy… and they all remember what that was like. 💁‍♂️",
            "score": 1,
            "replies": [
                {
                    "author": "yungingr",
                    "body": "I will never forget the first time I went in.  Guy ahead of me on the squat rack hadn't re-racked his weights, and I want to say he was set up for a 405 lift.  I started pulling 45's off, knowing that was too much for me.....but not realizing I needed to strip the weights evenly.  Pulled one too many off the right side....and launched the bar clean off the left side of the rack.  Made a HELL of a noise, probably lucky I didn't hurt anyone.\n\nSomeone came over and helped me finish racking the weights...I left....and didn't set foot in the room for another 6 months.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "just_another_toolbag",
                            "body": "That’s not on you at all bro, the doofus before you should have put the weight away. Anyone who can squat 405 should know that.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "WKD52",
                            "body": "Hey, shit happens right? 🤷‍♂️🤣🤣🤣 Sometimes we learn by doing, and sometimes learning ain’t pretty lol… but we learn, and that’s the important part. 👍",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "yungingr",
                                    "body": "Learn from mistakes, right?  Granted, it's better when you can learn from SOMEONE ELSE's mistakes, but sometimes you gotta be the guy.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "nuhouse",
                            "body": "Also, never try to unrack others weights out of your scope. If the person ahead of you already left, please ask at the reception. They will more than happy to unrack them for you. Its much easier for them to do that over managing some nasty accidents that could've been 200 percent avoided.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "nuhouse",
                            "body": "Also, never try to unrack others weights out of your scope. If the person ahead of you already left, please ask at the reception. They will more than happy to unrack them for you. Its much easier for them to do that over managing some nasty accidents that could've been 200 percent avoided.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "yungingr",
                                    "body": "Well, that assumes there is a reception desk to begin with, and that there is someone there.  Not all gyms that I've been to have that.  Heck, my community rec center right now, IF it's staffed is only one person, and much of the staff is retired or borderline physically disabled - they couldn't rack weights if their lives depended on it.  And then, they have a 24 hour access membership that gets you in during the non-staffed hours.\n\nSomeone like my wife, who has never been around weights in her life but wants to start lifting...doesn't have the benefit of that knowledge.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Punk_Rock_Beta",
            "body": "If you’re paying for the gym and using proper gym etiquette no one’s going to care. Working on yourself is not being in anyone’s way and you have just as much right as anyone else to be there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JackSucks",
            "body": "Buddy. No one cares about you the way you care about you.\n\nAs long as you aren’t very clearly going to really hurt yourself and you aren’t being rude, no one gives a shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pikkdogs",
            "body": "Don't be a jerk and nobody will care.  Just obey the rules of the gym.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Delli-paper",
            "body": "Like I had 700mg of caffeine and I would shit my pants if I had anything else inside me",
            "score": 1,
            "replies": [
                {
                    "author": "Thiscantbemyceiling",
                    "body": "I’m sorry what?!?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Delli-paper",
                            "body": "It's called stimulant abuse, sweaty. I am barely seeing anything at all",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Thiscantbemyceiling",
                                    "body": "I’m perplexed and intrigued. May I ask why?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Delli-paper",
                                            "body": "Move more weights with more heavy more faster, then do cardio till the bugs are no longer in my skin",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kelevra206",
                                                    "body": "I'm putting this on a shirt.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Delli-paper",
                                                            "body": "Call it tweak chique",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Thiscantbemyceiling",
                                                    "body": "Ah, okay see I’m very sensitive to caffeine and I’m also starting to work out for the first time. The bugs in the skin feeling definitely sounds like me when I’ve had too much caffeine.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Delli-paper",
                                                            "body": "I'd ease into it and be sure not to kill yourself, but it definitely helps you get a longer, more productive workout.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "trowawHHHay",
                                                            "body": "Solid preworkout supplement with a good dose of betaine, then you get the “betaine itch.”",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brutact",
            "body": "No one cares at all about you..... and I don't mean that as an insult. We just want to work out, not be filmed randomly changing, and go about our day. You're there to better yourself? Hell yeah and respect. \n\nIt's like saying do you hate fat people when you walk around? That takes so much energy to just think about and waste my thoughts on.\n\nBe respectful ( like any good person in any public space) and hit your goals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlwaysWork2bBetter",
            "body": "Everyone is there to better themselves, new or not. I try and be nice to people who are obviously in the beginning - if it wasn't for nice people to me when I started i probably would have quit. It should be an inviting place to everybody.\n\nJust be aware of gym etiquette and being in a shared space. There's many non new gym people that are just in their own world and IN THE WAY constantly.",
            "score": 1,
            "replies": [
                {
                    "author": "CountDangerfield",
                    "body": "Speak for yourself, *I’m* there because it’s the last place anyone would look for me and it’s been a long day.  I’ll be over here walking on a treadmill pretending none of you are in the room…",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AlwaysWork2bBetter",
                            "body": "And thats good! That's your perogative and still welcoming. You're there bettering yourself",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yungingr",
            "body": "I don't currently fit into the 'hardcore lifter' group, but I used to - back in high school, it was almost religion for me.  Every morning, 6:30 AM, and some days I was late for class because I was still down the hall in the weight room getting my reps in.\n\nI loved new people coming in.  Loved helping them get started on their journey.  And if they were using a bench I needed for my workout.... I helped them finish out their set.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FerretAres",
            "body": "Most people mind their own business. Anyone who would be a dick about it wouldn’t respond here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuantumSpaceEntity",
            "body": "Don't care at all- but sometimes I give a sharp exhale for .2 seconds when someone is doing something like curling in the squat rack",
            "score": 1,
            "replies": [
                {
                    "author": "CountDangerfield",
                    "body": "Where in the Midwest are you from?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hungry_james",
            "body": "I think \"Good for them.\"\n\nOr if I'm sad, I'll think \"I wish my morbidly obese loved ones would do that.\"\n\nOr if you hog the squat rack doing wrist curls or something, I'll think... other thoughts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dalineman78",
            "body": "Nobody cares. Just clean when you are done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dalineman78",
            "body": "Nobody cares. Just clean when you are done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dinkinflicka43",
            "body": "I don’t care, just don’t camp out on the equipment",
            "score": 1,
            "replies": []
        },
        {
            "author": "portuguesetheman",
            "body": "Everyone was a newbie at one point",
            "score": 1,
            "replies": []
        },
        {
            "author": "dwarven11",
            "body": "Planet Fitness is great, especially for a beginner. You don’t need free weight barbells to get in shape.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HavingALittleFit",
            "body": "If I owned a gym on the door as you walked in would be a sign that says \"no one care that you are here. What matters is that you care that you're here\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "GargantuChet",
            "body": "Everyone starts somewhere.\n\nI used to be Facebook friends with a power lifter. One day he posted about a lightweight who had started coming to the gym.\n\nHe said that he and his gym buddies were quietly rooting for the newbie. They were excited because he was focused on getting his form dialed in rather than trying to go heavy too quickly. I think they were excited to see his progress.\n\nThe vibe was: “This guy’s going to be massive faster than he expects. I really hope he keeps it up.”\n\nSo don’t try to be flashy, don’t try to keep up with people that are more experienced. Just go in, be respectful, and take your time to figure it out. There’s a chance someone there will be silently rooting for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "red_hair_lover",
            "body": "I was once a newbie. Its great to see people doing something active. More power to you, ask for help if you need it, I am always willing to share experience's",
            "score": 1,
            "replies": []
        },
        {
            "author": "DataGOGO",
            "body": "Welcome! Let me know if you want any help or need a spot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CountDangerfield",
            "body": "Everyone you will ever see in any gym doing literally anything had to start somewhere, sometime.\n\nNobody is going to judge you for starting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheThinker21",
            "body": "As an experienced lifter, I am thoroughly envious of the newbie gains you’re about to get.",
            "score": 1,
            "replies": [
                {
                    "author": "blickadelphia",
                    "body": "I'll keep ya posted 💪🏽",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HookerHenry",
            "body": "If they’re men, always nod in approval and love to give them encouragement. Always good to see a man trying to build himself physically.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Twizzify",
            "body": "Everyone I’ve encountered at the gym that was a “hardcore lifter” was pleasant and super helpful if needed. There’s obviously gonna be shitty folks too, but most don’t care about your presence and will absolutely assist if you need guidance or a spotter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LYossarian13",
            "body": "Happy to see new people; just don't talk to me unless you're asking how to use something or what a random equipment piece is for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwthrowthrow529",
            "body": "I wish they’d ask for help rather than watching videos.",
            "score": 1,
            "replies": []
        },
        {
            "author": "De-Kipgamer",
            "body": "As long as you come to actually workout we don’t really care lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "TXOgre09",
            "body": "They’ll be happy for you that you are prioritizing your health.  They will get annoyed if you aren’t following good etiquette.  Make sure someone else isn’t using something before you start.  When you’re using something don’t mess around.  Get your reps and sets in and move on.  It’s OK (and good) to take a brief break between sets.  It’s not OK to take selfies.  If you don’t know how to use something, ask.",
            "score": 1,
            "replies": []
        },
        {
            "author": "K_N0RRIS",
            "body": "Not a hardcore lifter, but I have been exercising in a commercial gym for the past 15 years regularly.\n\nI promise you, nobody is thinking about you. At all. \n\nIf anything, they probably feel happy to see you TRY to be in shape, because for a lot of us, we used to be you. Ask for help if you need it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BaconBombThief",
            "body": "Seeing someone work on their fitness always makes me a little happy.  Long as someone isn’t hogging a machine I want for 15 minutes, lifting for 5 minutes and fucking around on their phone for 10, I’m either happy or indifferent for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "korevis",
            "body": "I don’t care. If they have horrendous form, I’ll give them a tip.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OhioIsNuts",
            "body": "Gyms are usually the most welcoming place on the fuckin planet, you’ll be fine. Everyone started from 0 my guy if anything we’re proud to see another person put in the work towards greatness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pumpkin_Pie",
            "body": "I don't give a shit what shape any one is in.  Just don't hog equipment while playing with your phone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rebornxshiznat",
            "body": "The hardcore gym bros that are on the sauce are the nicest dudes in the gym\n\n\nIt’s the broccoli haired fuck boys that don’t take shit seriously that are assholes. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "appalachianoperator",
            "body": "Chances are we don’t even notice that you’re a newbie. And if you happen to have a question, please reach out. We’re more than happy to help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hasuchobe",
            "body": "Personally I'm too busy gathering myself for my heaviest set to worry about what others are doing. Everyone's kinda in their zone despite being in close proximity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient_Cod1948",
            "body": "Re-rack your weights, don’t curl in the squat rack, and don’t hog the equipment.  Beyond that, nobody cares.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PowerWisdomCourage",
            "body": "I wouldn't say I'm hardcore but am absolutely dedicated and I love the newbies. Everyone starts somewhere.  I started out benching about 60lbs total on the Smith machine (2x 25lb plates and a 10lb bar).  Mostly because I had undiagnosed Grave's Disease but I got it under control and have kept up with training for over a decade.",
            "score": 1,
            "replies": [
                {
                    "author": "LongRest",
                    "body": "Grave’s disease sounds a little on the nose.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DanDamage12",
            "body": "You’ll be fine. Just focus on your form and exercise. Most people are in their own little worlds and plenty are glad to help out and give advice. Most gyms are very positive environments.\n\nI’ve always told people that are nervous about the gym. If anyone there is judging you as you’re trying to improve yourself, then they suck, it’s their problem, and aren’t worth your consideration.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alchemis7",
            "body": "Who the fuck cares who thinks what. \n\nYou do what is most convenient for you, what aligns with your wants and needs and along the way you can support a local shop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alchemis7",
            "body": "Who the fuck cares who thinks what. \n\nYou do what is most convenient for you, what aligns with your wants and needs and along the way you can support a local shop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "00000000000",
            "body": "Doesn’t cross my mind. \n\nCleanup after yourself, be respectful of others, and treat others the way you want to be treated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alchemis7",
            "body": "Who the fuck cares who thinks what. \n\nYou do what is most convenient for you, what aligns with your wants and needs and along the way you can support a local shop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForYourAuralPleasure",
            "body": "Been going to my gym for a couple years now, but only recently shifted my focus to strength training. I had a noob moment with a squat machine (basically, my height felt incompatible with it because I didn’t notice the lever to adjust it so I was just getting on and off it awkwardly) that a hardcore guy noticed, and he came over to show it to me and mentioned he did the exact same thing when he started here on account of his height, so this was something he was sure I’d want to know. \n\nI really appreciated it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BasketLeft295",
            "body": "Probably don’t care as they are not using a lot of the same equipment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chasesrabbits",
            "body": "In my experience, \"hardcore\" gyms are friendlier and more welcoming to newcomers than regular gyms. At regular gyms, there are a lot of people who really don't want to be there and don't know what they're doing (and the most judgmental people are usually the ones who don't know what they're doing). At a powerlifting gym, you'll run into a bunch of people for whom powerlifting is a hobby and who like nothing more than to see other people getting interested.",
            "score": 1,
            "replies": []
        },
        {
            "author": "maguel92",
            "body": "Complete newbie pov. They don’t care about you at all as long as you don’t come in between them and their next set. If you do… well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "abee02",
            "body": "We're all there for the same reason. To better ourselves.\n\nI will help anybody who asks or looks like they're lost, if it makes the gym/ fitness a positive experience for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMufasa",
            "body": "More power to ya brother! fFeel free to ask us for any tips/advice, it makes us feel like we’re doing something right! Just put back your weights is all we ask.",
            "score": 1,
            "replies": []
        },
        {
            "author": "acu101",
            "body": "Why not go to the planet fitness?",
            "score": 1,
            "replies": [
                {
                    "author": "blickadelphia",
                    "body": "I can and do go there, it's just further out of the way (15 minute drive vs. 8-10 minute walk) and can get extremely crowded. I will probably keep the membership anyway because it's 24 hrs and a lot of the Black Card perks are kinda nice",
                    "score": 1,
                    "replies": [
                        {
                            "author": "acu101",
                            "body": "I work at different locations in my city so I like that I can go to various locations plus the black card stuff is cool. I also like that I can take my grandson with me.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Yakker65",
            "body": "We are all there to get better. Personally I don’t care unless you’re just wasting time and space playing on your phone and getting in the way.  Don’t sit on the bench screwing around, unless you’re resting between sets.  We are there to workout, not socialize. \n\nIf you need help, just ask.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Gap_2700",
            "body": "No one at the gym gives a shit about anyone else, unless they prevent them from getting a set in.  My honest opinion, go to PF and learn the muscle groups/exercises. Once you're comfortable with what you're doing, go the meathead gym.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sc0ttiShDUdE",
            "body": "I went to the gym a few times. I’m skinny, and mr muscle kept tapping their buddies on the shoulder, pointing at me, and laughing at my expense. I never went back.  \n\nI’m sure most of you are fine, but there are definitely guys out there with more steroids than brain cells, who have no empathy for newbies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Gap_2700",
            "body": "No one at the gym gives a shit about anyone else, unless they prevent them from getting a set in.  My honest opinion, go to PF and learn the muscle groups/exercises. Once you're comfortable with what you're doing, go the meathead gym.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dmc1972",
            "body": "Everybody started from the same place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrooklynDoug",
            "body": "A regular gym goer with a dad bod here, not a hardcore lifter. \n\nThose beefy bullies are really only in the movies. Lifting is very much an individual competition of you vs. gravity. So no one has to be better than you to win, or visa versa. \n\nFrom what I've experienced, those beefier guys like sharing their hobby as much as anyone. So long as they're not locked in the zone, they're happy to talk to you about what they know. They'll share tips, show you how to use a machine, etc. It's what they enjoy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrooklynDoug",
            "body": "A regular gym goer with a dad bod here, not a hardcore lifter. \n\nThose beefy bullies are really only in the movies. Lifting is very much an individual competition of you vs. gravity. So no one has to be better than you to win, or visa versa. \n\nFrom what I've experienced, those beefier guys like sharing their hobby as much as anyone. So long as they're not locked in the zone, they're happy to talk to you about what they know. They'll share tips, show you how to use a machine, etc. It's what they enjoy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "apietenpol",
            "body": "In my limited experience, as long as I didn't take too long using any equipment and clean up after myself nobody seems to care.",
            "score": 1,
            "replies": []
        },
        {
            "author": "apietenpol",
            "body": "In my limited experience, as long as I didn't take too long using any equipment and clean up after myself nobody seems to care.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Equivalent-South2631",
            "body": "As long as your not on your phone or talking so you friends while hogging a machine. I don’t care I’m happy you came to get a lift but just put in work and let the next guy use the equipment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ninasymone44",
            "body": "We are really not thinking about you at all tbh. We’re too busy working on our progress.",
            "score": 1,
            "replies": []
        },
        {
            "author": "joshteacher123",
            "body": "Honestly you'd be surprised by how happy some meatheads would be if you asked them for tips or technique. It means that we gym goers have ascended and is a huge compliment. I think you will actually make more friends and connections if you looked for something more hardcore (unless you curl in the squat rack or superset with 3 machines at peak hours)",
            "score": 1,
            "replies": []
        },
        {
            "author": "italianmike17",
            "body": "I love people who get into the gym and put in work. Helps add to the gyms culture.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deepthought515",
            "body": "So I’ve been to all types of gyms and fitness classes over the last 9 years. From; hot power yoga, to cross fit, to PF, big box gyms, etc. every community is very welcoming and accepting regardless of what you look like. **(don’t be a creep if you’re one of the only dudes in a fitness environment with primarily women)** everyone is there for the same reason! I always try to acknowledge new people and am always willing to answer questions! Go to whatever gym that will keep you going, it’s as simple as that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Terragar",
            "body": "Everyone starts somewhere. \n\nDoesn’t matter skill level, what matters is you showed up to improve yourself",
            "score": 1,
            "replies": []
        },
        {
            "author": "Knautical_J",
            "body": "I’m 6’5”, 240 pounds, and I’m what you’d call the meat head in the gym. I can assure you that no one actually cares, and the few people who do are losers. \n\nAt one point every single person in the gym was the newest person there. I remember when I was a scrawny freshman in high school going to football lifts for the first time during 2-a-days. My first time ever benching, I could barely bench 5 pound plates in each side (55 pounds total). Now I can bench 415, crazy how far I’ve come. \n\nI’d even say the hardcore gym would be better. The lifters in there will be legit, and would be more likely to help you out if you have questions. The only thing they will care about is gym etiquette. Meaning rack your weights and attachments when done, don’t be sitting on your phone the entire time, and be respectful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "goated95",
            "body": "Well.. they were once newbies too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dabomb2012",
            "body": "We don’t even think you. You are invisible in my world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_lie_on_reddit_alot",
            "body": "There is a very similar gym beat me. No.\n\nNobody cares. Nobody will remember you. \n\nYou will only be noticed as being out of place if you do something dangerous or wear something out of place (jeans and flip flops while squatting etc.)\n\nStop comparing yourself to people who have been doing this consistently for years.\n\nFocus on being active",
            "score": 1,
            "replies": []
        },
        {
            "author": "CalGoldenBear55",
            "body": "Zero judgment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoredAccountant",
            "body": "Everyone has to start somewhere, so long as they're open to learning, it's always good to see new people starting the iron journey.\n\nAlso, \"hardcore powerlifting gym\" sounds like a pejorative. It just means they specialize in powerlifting, so don't expect to be taking a Zumba or Pilates class there (though don't be surprised if you see a reformer in a back corner, because powerlifters are known to try anything for better lifts).",
            "score": 1,
            "replies": []
        },
        {
            "author": "iLoveAllTacos",
            "body": "As long as you follow good gym etiquette, I'm happy for you and your goal to be in better shape. I'll be the first one to give you a spot or give you advice/show you proper form if you ask for help.\n\nIf you're a jackass just taking up space, not re-racking your weights, standing 2 feet from my bench because you want to squeeze in and look in the mirror (or step in front of me while I'm using the mirror), you forgot to put on deodorant or brush your teeth and smell like shit, etc., then I'll have disdain for you and hope you leave to never come back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "huuaaang",
            "body": "I'm not \"hardcore\" but I've been lifting on and off for years. I envy your beginner gains. No plateaus. Enjoy it while it lasts!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elbiotcho",
            "body": "Love to see it and hope they stick to it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrMeesesPieces",
            "body": "I say get bro!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hcmofo13",
            "body": "Use them to your benefit. Ask questions. They will love to share the tricks of the trade with you. AND you make some new friends while youre at it. Its a win win.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lerandomanon",
            "body": "While bad apples exist, my experience is that hardcore lifters either do not care about newbies or they are actually helpful and supportive where you can take their help. \n\nYou just follow the basic gym etiquette, and you will find that you actually enjoy being at a meathead gym more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LongRest",
            "body": "Nobody did squats in the womb my dude. Most people you’ll find are friendly and helpful. That’s what swole society is all about. When I was recovering from an illness and had dropped from 170 to 120 and looked like a weird little skeleton the lifters at my gym were some of my favorite give-a-fucks. Spotting, nutrition tips, help reracking, genuine curiosity about how I was doing and feeling, form, etc. Just be humble, respect their time and expertise, and you’ll be good. And if you don’t have a clue what you’re doing remember heavy shit is dangerous to you and potentially others so if you take a look at your situation and you feel like it has the potential to create some noisy danger, stop for a minute, ask, don’t just wing it. \n\nThink of it like an obsessive hobby anyone else might have. Like, go to wherever the hell they have model trains and ask the guy wearing the old timey conductor uniform where you should begin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "numbersthen0987431",
            "body": "Go to the \"meat head gym\", and you'll be fine. You might even make some friends if you ask questions about what they're doing or how to do certain things.\n\nJust don't do curls in the squat rack, and you'll be fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "warfighter187",
            "body": "Only if you don’t know how to shower or do laundry\n\nNo one cares if the person next to them in the gym is fat or fit\n\nEveryone cares if you smell bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "jon_targareyan",
            "body": "I’ve found the hardcore lifters are generally very chill and happy to help you out if you ask. No ones gonna judge you negatively",
            "score": 1,
            "replies": []
        },
        {
            "author": "scottwax",
            "body": "Rerack your weights, don't stand in front of the dumbbell racks and work out, don't camp on equipment and you'll be fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Potential_Till_1376",
            "body": "I agree with all of the comments telling you to go for it. Also, most serious lifters would be more than happy to show you an exercise or talk about what they're doing",
            "score": 1,
            "replies": []
        },
        {
            "author": "JerryOD",
            "body": "I don't care as long as you are in there to work. I don't like it when new people screw around, talk on the phone, scroll on the phone,  take pictures/videos or act like a jackasses. Otherwise, I love seeing new people in the gym that are there to better themselves. Every community loves having people around that are trying to get better. For me personally,  It is motivating for me. I was there too. I started at 460 lbs 6 years ago. Everyone had a starting point. If you are there to put in the work and not screw around, great to have you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "maintrain5",
            "body": "We don’t care. Only thing I recommend is put away your weights and clean the equipment because that’s super annoying. But usually newbies aren’t guilty of those things lol. \n\nDon’t be afraid to ask for a spot or form tips either. They can be a wealth of knowledge. Good luck",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glittering_Virus8397",
            "body": "I’m focusing on not dying idgaf what y’all are doing",
            "score": 1,
            "replies": []
        },
        {
            "author": "soxfan15203",
            "body": "Everyone starts somewhere. Good for them on getting started and hope they continue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ColdHardPocketChange",
            "body": "You're practically invisible till you're stronger then me. The exception is if you start doing something I find really entertaining and I'm watching with the hopes of a train wreck happening. Example: squatting on a full Bosu ball.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ApatheticRart",
            "body": "The vast majority of people at the gym only care about getting their workout in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bdua",
            "body": "We're rooting for you",
            "score": 1,
            "replies": []
        },
        {
            "author": "fredsiphone19",
            "body": "We understand better than anyone how brutal the gym is and want you to succeed more than you do, probably.\n\nIt’s just hard to look friendly when I’ve got 700mgs of caffeine burning my veins into raw battery acid and I’m battling demons in the form of iron bars and rubber-coated plates.\n\n99/10 the gym bros want the best for you.  That being said avoid teenagers.  Teenagers in the gym are annoying to everyone, even other teenagers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TehPunishment",
            "body": "In high school my buddy on the football team invited me to the gym while their team was in there working out. I was expecting to be made fun of or ridiculed as a first time lifter.\n\nInstead, they were the MOST supportive group I’ve ever worked out with. They’d always be willing to spot me, even if the weight was negligent. They’d teach me form, or give recommendations for a circuit/routine. \n\nSometimes I felt like I was imposing on them, because they’d let me join in on their set (even if they’d have to take off most of the weights when it was their turn), but they NEVER made me feel less than them for being there. They made me feel welcome, and encouraged me past what I thought my limits were. I think most of all they were excited to share their passion with someone else- and made me excited to work out for the stretch of time that I was there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JeebusChristBalls",
            "body": "I will say, there is nothing wrong with planet fitness for the most part. It's cheap and they have weights. Also, nobody cares who does what at the gym as long as they aren't being dicks. People that would care are just dicks anyway whether they lift or not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GainsUndGames07",
            "body": "As a meathead, I love seeing newbies in the Gym trying to get their health in order. It makes my smile, especially if it’s an overweight person actively trying to make a change.\n\nNever feel bad about asking the big dudes questions or asking for a spot. We’re teddy bears and love to help out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "phatdragon451",
            "body": "Welcome, we were all new once. High 5s for PRs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_chewtoy",
            "body": "I'm more of an ex-lifter since age is taking its toll on my joints, but . . . I like seeing newbies and also fat people at the gym.  It's a place to improve yourself--maybe some need it more than others, but they're there and putting in the work.  Mad respect.  Need a spot?  I've got your back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sovereign_fury",
            "body": "Welcome! There was a point in time when we walked into the gym for the first time. Make it fun, make it yours. You already did one of the hardest parts -- showing up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lividcreationz",
            "body": "You won’t be out of place, and you have just as much of a right to be there. They can get their own gym if it bothers them. In my experience, the most dedicated lifters are often super nice and down to earth. Good luck on your fitness journey. You got this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "innit2winnit",
            "body": "Too focused on myself to give a shit about anything or anyone else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dfiggsmeister",
            "body": "I don’t mind them as long as they’re not stupid and/or doing glory lifts that they have no business doing. Even more annoying are the group of teenage boys crowding around a rack or bench and fucking around. If they want tips, I don’t mind pausing my workout to give them the proper way to do something. I’d rather stop what I’m doing to train someone properly than for them to assume they know what they’re doing, hurting themselves or someone else. \n\nUnless I look like I’m actually struggling or specifically ask for a spot, don’t grab my bar in an attempt to spot me or stand behind me to attempt a spot on my back squat. That’s a good way to startle me and get both of us injured. That goes doubly for women at the gym. Ask if they need a spot if you think they need it, otherwise keep your hands to yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darkstar1031",
            "body": "People go to PF to get video of themselves in the gym. People go to the meat head gyms to lift. You'll find the meat head places are friendly, accommodating, and will be happy to give advice and spot you. PF your likely to be met with hostility for getting in someone's shot or glancing accidentally at the wrong person. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordDeathScum",
            "body": "10 years experience 🤷 don’t care",
            "score": 1,
            "replies": []
        },
        {
            "author": "iaccomplished0",
            "body": "Been lifting for years and can tell you that the \"hardcore\" gyms are the best place to go. Big commercial gyms (PF) is where you get the BS like girls taking selfie or video recording and you can get kicked out if you grunt or yell while lifting.  The hardcore gyms will teach you proper form and technique, and they will push you to be better than you were the day before. Show them you are serious and you want to do it and they will be more than willing to help",
            "score": 1,
            "replies": []
        },
        {
            "author": "pheret87",
            "body": "As long as you're being safe, no one will care. If you're not sure if you're being safe, ask someone for assistance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nola_mike",
            "body": "I've trained at powerlifting gyms and I've trained at commercial gyms like Planet Fitness. I never once had any issue walking in and doing my own thing. If you go to a gym long enough you'll eventually get to know the regulars and possibly end up with a lifting partner from time to time. Don't sweat it, show up and get to work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaveinOakland",
            "body": "We don't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThotBubble",
            "body": "We don’t give a flying fuck we are in there seeing stars, hyperventilating and so focused that we couldn’t notice you I promise we do not see you only people on the couch and that don’t go much will have an opinion on this",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheAltOption",
            "body": "Others have already answered but tossing you a story to reinforce everyone else:  \n  \nI was at the Arnold Sport Festival a couple weeks ago.  Over a quarter million people over the course of 3 days in the convention center.  I'm standing in line for an autograph and the line is a bit rough since both the guys were an hour late getting to their sessions.  I was bullshitting with the worker watching the line and he said that he loves working The Arnold because it's the best people to deal with.  He talked about Comic Con and how shitty the people are for that one, and how even when dealing with standing in line forever the \"meat heads\" are the chillest people.\n\nWe all work out to better ourselves, not to put others down.  Lift weights, and lift up your brothers in iron!",
            "score": 1,
            "replies": []
        },
        {
            "author": "xDUVAL_BRODOWNx",
            "body": "Just have decent gym etiquette. All these new MFs in my gym take up like 2 benches and multiple machines simultaneously, all the while wearing jorts and a collared shirt. Just do your exercises and move on, don't linger for 45 min at one station and you're fine bro",
            "score": 1,
            "replies": []
        },
        {
            "author": "beer_me_that_cd",
            "body": "We like to see people come and work hard and improve themselves. We cheer for you and are glad that you’re there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElegantMankey",
            "body": "I think they're awesome. \nKeeping a habit is easy.\nBuilding a new one is hard.\n\nI'd also gladly help if they would ask me for help, I would never however offer it to not sound condescending unless they seem like they're about to hurt themselves bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "broth_snob",
            "body": "I feel great about them if they practice good gym etitiquette. I go to a high end and gym and it’s packed with new members and thee gym has really gone downhill in recent months. What the hell is wrong with people!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "jakin89",
            "body": "Just hope they don’t kill themselves or injure themselves. Just do your thing,be consistent and avoid injuries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MacSteele13",
            "body": "As long as you're not doing curls at the squat rack, we're good. \n\nLet me know if you have any questions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DauntlessBadger",
            "body": "I commend people for working out. The only time I’ll call someone out is if they are taking up a bench and they are on their phone. Ohhhh the talkers are the worst. If you can spend 5-10 talking I assume your workout is over, please move out the way.\n\nI don’t care what they lift just don’t occupy a space unnecessarily and waste other people’s time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Delta6ixs",
            "body": "A lot, I pull my phone out and start recording",
            "score": 1,
            "replies": []
        },
        {
            "author": "dadude123456789",
            "body": "You don't exist, you plebs!!",
            "score": 1,
            "replies": []
        }
    ]
}