{
    "title": "I never thought of libertarianism as being anti-democracy until I encountered this sub. What alternative do libertarians propose?",
    "author": "greenpeas1q84",
    "subreddit": "Libertarian",
    "rank": 20,
    "score": 106,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 100,
    "url": "https://www.reddit.com/r/Libertarian/comments/1in39q7/i_never_thought_of_libertarianism_as_being/",
    "id": "1in39q7",
    "selftext": "I'm not saying there's no flaws in democracy,  I'm just having a hard time imagining a libertarian system of government that doesn't involve a formal system where the people choose who gets to be in the government.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Democracy is tyranny of the majority. Read Hoppes [Democracy: The God That Failed](https://www.riosmauricio.com/wp-content/uploads/2013/04/Hoppe_Democracy_The_God_That_Failed.pdf), or other works by libertarians such as [Rothbard](https://mises.org/library/book/anatomy-state), [Spooner](https://oll-resources.s3.us-east-2.amazonaws.com/oll3/store/titles/2194/Spooner_1485_Bk.pdf), or [Hoppe](https://www.youtube.com/watch?v=qrl8YorTa1U) to learn about why so many libertarians [oppose democracy](https://www.youtube.com/watch?v=qrl8YorTa1U). Also check out r/EndDemocracy\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JamminBabyLu",
            "body": "Libertarians are generally in favor of limiting the government. \n\nDemocratic consensus, by itself, isn’t enough to overcome our skepticism for the legitimacy of government action.",
            "score": 81,
            "replies": [
                {
                    "author": "LarryFalwell",
                    "body": "Well said!",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "elmhire",
                    "body": "Do really small dictatorships count?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Anen-o-me",
                            "body": "Eff all dictatorship.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "cluskillz",
                            "body": "\"What else floats on water?\"\n\n\"Very small rocks?\"\n\n\\~Monty Python and the Holy Grail",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "JamminBabyLu",
                            "body": "Count as what?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Brwright11",
                            "body": "What are you but the dictator of your own life?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "eddington_limit",
            "body": "Theoretically, in a direct democracy, 51% of the population could vote to slaughter the other 49%. That being said, libertarianism is a large umbrella and it is mainly ancaps who tend to be anti democracy as they believe the state is not really even needed as market forces act as a structure of sorts. I like ancap philosophy a lot but I consider myself more of a minarchist in practice (much like Javier Milei). So I tend to lean more toward a representative democracy like what we have in the US, despite its flaws. Because I do agree that a direct democracy can be very dangerous and allows the majority too much oppressive authority.\n\n\"Democracy is just two wolves and a sheep deciding on what to have for dinner\" Ben Franklin",
            "score": 67,
            "replies": [
                {
                    "author": "speeperr",
                    "body": "Well said bro.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "BlockLevel",
                    "body": "Representative democracy is just as bad in different ways, particularly in the perverse economic incentives that are inherent in such a system. People vote according to self-interest, and representatives also act according to self-interest, which is more often than not, at odds with the self-interest of those who voted for them. Also, with term-limits and no real stake in the long-term prosperity of the nation/region that they represent, there's no incentive at all to do things that benefit the nation, the incentive is 100% to extract as much as possible from it before your term is up. This short-term, \"consequences be damned\" mentality is called \"high time preference\" behavior in economic terms, and leads to destructive tendencies and the breakdown of social fabric. Democracy is the primary reason for almost all of the social ills that you see today.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "eddington_limit",
                            "body": "I don't disagree. But as long as statism is a significant part of our lives, representative democracy is probably the best option on the table. Remember that the majority of people err on the side of statism, not liberty. As things currently stand, getting rid of democracy would much more likely result in despotism rather than anarchism.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SteveBlakesButtPlug",
            "body": "I'm definitely against pure democracy, where a simple majority vote is enough to enact something that 49% of the population would not be in agreement with.  \n\nThe easiest answer is to repeal the 17th, send more power back to state legislature, and strip powers from the federal government.  We can keep the representative democracy that was in place prior to 1913, as it seemed to work for the most part. \n\nYou'd probably need to strengthen the judicial branch though, since there will always be disputes between states and there has to be some power that steps in to settle the disputes without war.",
            "score": 45,
            "replies": []
        },
        {
            "author": "t0rnAsundr",
            "body": "I want liberty, not democracy. It just seems that democracy is the best vehicle for achieving liberty. Believe it or not, I don't care about your or anyone else's vote. I simply care about my freedom.",
            "score": 41,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "liberty is what a sailor gets when the ship ports and they have land leave.  I think you mean freedom but still, how do you have freedom without anarchy? If you want anarachy that's fine, just say so.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "nom3at",
                            "body": "While they are often used interchangeably, liberty emphasizes individual rights and limitations of government power, while freedom focuses on the ability of individuals to pursue their own interests.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "gfunk5299",
                            "body": "Anarchy isn’t freedom as you need some form of law to have true freedom.  Otherwise “freedom” turns into oppression by whoever has the most might.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "t0rnAsundr",
                            "body": "I meant my exact words squid-lover. The Navy will always be second best.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Mead_and_You",
                                    "body": "Yankee doodle went to town - to join the US navy.\n\nThey asked him for his asvab score - so he drank a jar of gravy.\n\nYankee doodle bust a nut - Yankee doodle dandy\n\nYankee doodle fuck my butt - and I'll give you a handy.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Emergency_Accident36",
                                    "body": "what's the first best?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "t0rnAsundr",
                                            "body": "Army of course. I should know...",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "cyrusthemarginal",
                                                    "body": "Not a single decent golf course on any Army base, terrible.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cdhofer",
            "body": "I don't think anyone here offers a serious alternative. Plenty of complaints about federalism, big government, direct democracy, mob rule, etc, sure. I have yet to hear an alternative to democratically elected government that isn't anarchy or tyranny.",
            "score": 12,
            "replies": [
                {
                    "author": "gfunk5299",
                    "body": "I am sure the progressive wing of our population would suggest some form of communism/socialism defending it that we are more enlightened and with technological improvements, a socialist state should be able to be self supportive with minimal work from the population.  Or at least I’ve seen arguments on other subs stating the above.\n\nTo be clear I don’t agree with any of that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BIGSTANKDICKDADDY",
                    "body": "There are some compelling *theoretical* alternatives, but I don’t know that Yarvin’s patchwork would be considered a “serious” idea.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "saul_soprano",
            "body": "We have fifty states. Strip power from the federal government and give more to the states. You now have a choice of fifty states to live in, each running under its own accord. This would (in theory) minimize the side effects you receive from the decisions of people across the country.",
            "score": 49,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "that's still a democracy. Or republic... Just a smaller one",
                    "score": 38,
                    "replies": [
                        {
                            "author": "saul_soprano",
                            "body": "Sure. But people in Vermont for example would have more control over themselves instead of Texas voting in 20x the political power to go against them. To me that’s the main issue with democracy.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Emergency_Accident36",
                                    "body": "so what alternative do you propose? No federal government?  Then what's to stop Texas from claiming the territory of Vermont? Or rather New York from claiming that specific territory..",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "saul_soprano",
                                            "body": "There should still be a federal government, just with limited power to what it can do to the states. If a law must be passed to tell everyone what they can’t do, it should have enough federal support to become an amendment, not a 51/49 vote on a bill.",
                                            "score": 29,
                                            "replies": []
                                        },
                                        {
                                            "author": "Behemoth92",
                                            "body": "The feds deal with foreign affairs, protecting human rights from tyranny of the majority, military, supreme court system etc. Everything else is handled by the state. This will be a system where a citizen has about 50 choices for how they live.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "MengerianMango",
                                            "body": "You still don't really need a federal government to stop one state from claiming another state. Aggression from one state would be a threat to all, because there's no guarantee they'd stop, and it's conceivable that the others would send their own state troops to help out, a sort of NATO alliance type of institution. If anything, I would like to see us broken much smaller than states. The smaller, the better. I want 1000 county-states. The idea of having many states is that it greatly lowers the friction of changing states, which makes governments function kinda like sellers in a market -- they're selling law to citizens. Don't like your local laws, your tax rate, whatever? I want you to have 4 different options, 20 or 30 miles, in any cardinal direction. Now imagine one of these city states get aggressive. Wouldn't be hard for the surrounding 4+ to handle them. Think Germany or Italy or Greece pre-unification. All of those city state eras became historical advancements in human society. Greece gave us the foundation of philosophy and math. Italy gave us the Renaissance. Germany gave us art, modern philosophy, modern math, Aus Econ, etc etc. They were all also almost untouchable from outside aggression.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Commercial-Wrap8277",
                                            "body": "The voters of the states would vote on wither to join some of the territory of the state next to them",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Living-Fill-8819",
                                    "body": "The senate is sort of a firewall to that, but without filibuster on all appointments and legislation it's minimal.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "stosolus",
                            "body": "Libertarians should always push for more localized control. Federal to state to city to neighborhood and ultimately to the individual",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Commercial-Wrap8277",
                            "body": "Yes but with less collateral damage",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "arushus",
                    "body": "Repealing the 17th amendment would be an incredible start. That was an absolute disaster of an amendment. I still don't know why the states themselves voted for it. I mean I know it led to corruption, but, IMO, that would have been preferable to the mess it has led to",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "greenpeas1q84",
                    "body": "How should state governments function without democracy? Anti-federalism is not anti-democracy.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "saul_soprano",
                            "body": "My point is that people should vote for their state when it comes to issues, not federally. If Texas for example really wants abortion banned, and they vote federals into power to enact that belief, why are people in Vermont who (in this example) really want abortion suffering for them?\n\nTo me that is the main problem with democracy and separation between state and federal governments is how it can be fixed. Each state should be its own democracy entirely.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "greenpeas1q84",
                                    "body": "Okay. I assumed the idea of \"end democracy\"  applied to states as well as fed. The slogan feels misleading to me.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "OpinionStunning6236",
                                            "body": "The idea of ending democracy can apply to states too because state power can also infringe on individual freedoms. But if the Constitution was upheld as it was originally written and the federal government was only allowed to exercise its power in a limited scope of areas then it would allow states to benefit more from the democratic process and tailor their laws to more directly address the needs of its people. \n\nUnder a decentralized system focused on states rights you would have 50 options of places to live in that would all be different and it would be much easier to escape from one state’s tyranny by moving to another one. Also by having laws enacted on a state level rather than the federal level it would create competition between states to make their policies more appealing to people to attract more investment in their state. If a federal law infringes on rights then there is no such easy escape.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Commercial-Wrap8277",
                                                    "body": "Some libertarians preferred the article of confederation over the constitution I for one think both the article of confederation and the constitution have good ideas of keeping government limited",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "embarrassed_error365",
                    "body": "I disagree. When it comes to protecting individual rights, the federal government should not allow states to decide. That's what the Civil War was fought over. The State's \"right\" to continue slavery.\n\nHowever, I understand that it doesn't always work that way. Sometimes the federal government wants to deny individual rights, and then states have to fight to protect individual rights. Most often, rights start at the state level, then make its way up to the federal level, but at least in that direction the federal government does step in to acknowledge those rights.\n\n(to be clear, when I say rights, I mean constitutional rights, of course, but I also mean civil rights and liberties.. Too many people think \"rights\" only pertains to constitutional rights. There are more rights than just that. The constitution, itself, acknowledges that, but so many people don't. [Ninth Amendment](https://www.reaganlibrary.gov/constitutional-amendments-amendment-9-enumerated-rights-people) \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\")",
                    "score": 4,
                    "replies": [
                        {
                            "author": "sovietonion123977",
                            "body": "In theory the “state” is not an entity. It’s a representation of the states residents. One that follows their orders and acts on their behalf (this is why I put more of my time into researching town/county level officials). So I imagine that the downsizing of the federal government would put more power into the hands of the people. If California wants to be a liberal utopia, that’s fine. But they shouldn’t be allowed to tell me in central Pennsylvania what to do with my life from the other side of the country with their 54 against our 17. All that said, in theory. In theory the federal government has our best interests in mind. But at this point I’ll take a theoretical step in that direction.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "embarrassed_error365",
                                    "body": "What do Californians tell you to do with your life?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "sovietonion123977",
                                            "body": "Not anything specifically right now. It’s just a possibility that their representation can bulldoze our vote 3 times over on the federal level. Which I guess could also be attributed to federal legislation climbing too far down the ladder onto my front door.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "yogi4peace",
                    "body": "It's a nice academic idea but ...\n\nIsn't this the context that led to the civil war?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Commercial-Wrap8277",
                    "body": "Thank goodness somebody gets it cheer cheer genuinely",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "patbagger",
            "body": "Are you referring to direct Democracy, \"Three wolves and Sheep deciding what's for dinner\"? - This type of Democracy promotes big Government and the corruption that comes with it.",
            "score": 10,
            "replies": []
        },
        {
            "author": "grendev",
            "body": "This seem fitting:  \n“Remember, democracy never lasts long. It soon wastes, exhausts, and murders itself. There never was a democracy yet that did not commit suicide.”  \n—John Adams",
            "score": 8,
            "replies": []
        },
        {
            "author": "WindBehindTheStars",
            "body": "Democratic elements to the government are fine, such as voting on government officials, but pure democracy just allows 51% of a given population to run roughshod over the other 49%.",
            "score": 3,
            "replies": [
                {
                    "author": "greenpeas1q84",
                    "body": "I agree with that. The USA is a republic, but that still has elements of democracy (voting for representatives). Am I wrong in assuming the slogan \"end democracy\" means end the system where I get to vote for my representatives in the government?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnappyDogDays",
            "body": "I'd like to get back to the original constitution.  Repeal the 16th and 17th amendments.   \n\n16th allowed the feds to collect income tax, the 17th allowed for direct election of senators.  Those two items have virtually destroyed the 9th and 10th amendments.\n\nThe framers of the constitution were vehemently anti-democracy.",
            "score": 6,
            "replies": []
        },
        {
            "author": "chmendez",
            "body": "The system in the US and the west is supposed to be really \"liberal democracy\"\n\nProblem is that the democracy part has gained much more importance while the liberal part(in the classical liberal sense)has lost it.\n\nSo, for many libertarians  western countries have become illiberal democracies.",
            "score": 5,
            "replies": []
        },
        {
            "author": "bethechaoticgood21",
            "body": "Democracy is literally the majority rules. This is not a Democracy. It is a Republic. A Constitutional Republic at that. This is what the education system has done to the people. Tear it down.",
            "score": 4,
            "replies": []
        },
        {
            "author": "speeperr",
            "body": "The end game should be no state at all. Voluntarism through and through.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Free_Mixture_682",
            "body": "Repeating what I wrote in response to a similar question yesterday:\n\nDo you think that other people should have a say in your choices?\n\nOr let me ask you another way. Why do you think we have a bill of rights? Is it not to protect certain specified and unspecified rights from being infringed upon by the will of a democratic majority?\n\nThe Bill of Rights is therefore a recognition that democracy can lead to an infringement on rights and liberties and therefore, it must be curtailed.\n\nThe two are not necessarily at odds with one another at all times but if given the opportunity do you want it decided whether you can say and speak what you wish by others? Do you want it decided by others what means you use to protect your life? Do you want it decided by others when you should be afforded a trial by jury? I merely pulled these examples to illustrate the point.\n\nBecause I think we all know that there are for example strong indications that certain speech would be made illegal if various groups or political parties had their way on the question of speech.\n\nUnfortunately, the Bill of Rights did not extend itself to the protections of economic liberty and as a result, I contend the property and thus the individual rights of people are threatened by the will of the majority which would seek to engage in plunder and redistribute property.\n\nYou already get that to a limited degree but the only restriction against that is political rather than constitutional. Do you think it is a good idea to allow that to be the only dam holding back the proverbial river?\n\nA couple of shorter articles worth reading:\n\nhttps://jimbovard.com/blog/2013/03/26/democracy-vs-liberty-2006/\n\nhttps://fee.org/articles/democracy-is-war-by-other-means/\n\nAnd of course, Hans-Hermann Hoppe’s Democracy: The God that Failed\n\nAddendum: you ask for alternatives.\n\nThe libertarian movement is a broad spectrum that includes alternative ideas that include anarchism, voluntaryism, minarchism and even monarchism. Each of these provides alternative ideas to follow down a rabbit hole, if you wish.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mrblades12",
            "body": "In United States case we aren't really a democracy we are a republic which is a little different for a lot of people they just want the states to actually have generally more rights allowing them to properly govern independently. A lot of European countries is wonderful models for a functional democracy and how small countries generally govern better than large countries.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Snipermann02",
            "body": "Modern American Politics has led most to Believe that America's voting system is a Democracy. So when Libertarians say they hate Democracy, people think we're authoritarian.\n\nNo, Modern American \"Democracy\" isn't Democracy. It's a Constitutional Republic. A system of voting that Guarantees rights no matter how the vote is swayed. This is what Libertarians prefer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cyrusthemarginal",
            "body": "The problem with democracy is the majority has figured out they can vote thier way into the pockets of the rest of the people.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HereForaRefund",
            "body": "Democracy is two starving wolves and a rabbit deciding what's for dinner. I'm in full support for a Republic though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "golsol",
            "body": "Libertarians don't have a problem with a small representative republic that protects the rights of every individual. Libertarians have a problem with democracy because it results in the tyranny of the majority. Look at California and you'll see all the evidence you need. \n\nThe current iteration of \"protecting democracy\" is a huge psyop to force people to be ok with a shift to democracy because our representatives know that a tyranny of the majority is much easier to manipulate than the current system. If you are concerned about \"our democracy\" you have fallen for it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stiks-n-Bones",
            "body": "Anti big government does not mean anti Democracy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "Who cares? A powerless government's form isn't of much concern.",
            "score": 3,
            "replies": [
                {
                    "author": "Gre-er",
                    "body": "Yep, could be a monarchy for all I care, as long as they don't have enough power to intrude on my life or property.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AbolishtheDraft",
            "body": "What do you replace a tumor with?",
            "score": 2,
            "replies": [
                {
                    "author": "greenpeas1q84",
                    "body": "Are you saying we should abolish government entirely? If that's what you really think, why not call yourself an anarchist?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "BlockLevel",
                            "body": "He probably does call himself that. I certainly do. Anarchism is a subset of libertarianism, so it's not a contradiction for an anarchist to refer to themselves as libertarian.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AbolishtheDraft",
                            "body": "Anarcho capitalism is a subset of libertarianism. Saying \"you're not a libertarian, you're an anarchist\" is like saying \"you're not a mammal, you're a human\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Talesfromthesysadmin",
                            "body": "I am an anarchist",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "speeperr",
                            "body": "Yes. Libertarianism logically leads to Anarcho-Capitalism. That doesn't mean there will be no governing bodies, but that those bodies would have to be voluntary, just like everything else in the free market.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ihatebiana",
                    "body": "I mean hopefully something cool like wings or claws that would be cool",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dmpdulux3",
            "body": "Freedom, you silly goose.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mead_and_You",
            "body": "We don't have to get rid of democracy. I'd be happy with stripping them of any and all power they hold, and also not stealing people's income to pay them.\n\nThey can still call themselves senators or whatever, meet up in a building and yell at each other if they want to though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bagain",
            "body": "Democracy is clearly open to wild abuses. I don’t think it’s that we hate democracy as much as we hate that the state has assumed so much power that “democracy” is just a ruse to oppress the freedoms of the citizens living under its thumb. If the feds only had the power they were designed to have, not a lot of people would be complaining about how it’s mob rule or tyranny of the majority, which it currently 100% is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NichS144",
            "body": "As the name should imply, Libertarian are primarily concerned with liberty, specifically personal liberty. Just because everyone else voted to do something doesn't mean I should be forced to do it too. Consent as opposed to the use of force is how communities should be organized and democracy invalidates the freedom of the minority.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pgsimon77",
            "body": "It seems like the classic libertarian ideal is still individual liberty, everyone's right to determine their own destiny, free markets and limited government  / in a truly free society everyone would be better off rich poor or those somewhere in between 🤩",
            "score": 1,
            "replies": []
        },
        {
            "author": "HumanMan_007",
            "body": "Well, while some like the Hoppeans are more directly opposed to democracy I just view it as justifying in the eyes of the people the unjust power of the government, so while some might have correctly criticized authoritarian power in the hands of a monarch it being the mob controlling that power, or at least giving that appearance, legitimizes it. The problem for me I guess is democracy-as-a-principle.\n\nReplace? Well not so much replace as limit, the majority (or often a minority but as a dedicated interest group) willing something should not give the government the right to infringe upon you but as far as who gets to be in power, sure, with again that power being limited.",
            "score": 1,
            "replies": []
        },
        {
            "author": "arushus",
            "body": "It depends on what you mean by democracy. A pure democracy is a disaster. The best comparison I've ever heard is \"democracy is two wolves and a sheep voting on what's for dinner\". But I think all libertarians believe in democracy to some degree. Such as representative democracy. IMO, the constitution as ot was originally written, especially before the 17th amendment, was about as close to perfect as you can get. It is absurd that other countries have official representation in DC through their ambassadors,  while state legislatures have no official representation. This took away one of the key pillars of our way of government. This made it so that senators had a big reason to want to curb the scope and power of the federal govt. The 17th amendment took away all incentive to do so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PM_ME_DNA",
            "body": "Individualism and consent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HatredInfinite",
            "body": "I don't mind limited-democracy. Democracy where there is an unwavering inability to vote away someone else's rights, no matter how many people want to. And a *very* limited government, ideally state-level or smaller, no federal. Anarcho-Capitalism relies too much on believing no one able to amass wealth and power will ever use it to harm others for their own benefit. Some form of Minarchism seems much preferable to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TigerWon",
            "body": "Well we're a republic so....",
            "score": 1,
            "replies": []
        },
        {
            "author": "em_washington",
            "body": "Constitutional Republic",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anen-o-me",
            "body": "Individual choice.\n\nr/unacracy",
            "score": 1,
            "replies": []
        },
        {
            "author": "natermer",
            "body": "USA is a Republic, not a Democracy. \n\nThis means rule of law overrides the rule of the people or the rule of the government.\n\nUnfortunately this concept doesn't have much teeth anymore because people think that \"The Law\" is something written on pieces of paper and signed by some government official.\n\nPro Tip:\n\nIn the quote from the Declaration of Independence:\n\n“We hold these Truths to be self-evident, that all Men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty, and the Pursuit of Happiness…” \n\nThe \"pursuit of happiness\" isn't referring to a \"right to be happy\" or comfortable or protected. It is a reference to private property rights.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Certain-Lie-5118",
            "body": "The end goal is liberty, not democracy. Since when does a majority have a right to vote away your natural rights? People have voted themselves democratically into socialism, eg Venezuela. Should we accept socialism because it was chosen “democratically?” How would that be consistent with libertarianism?",
            "score": 1,
            "replies": []
        },
        {
            "author": "wkwork",
            "body": "Libertarians don't want to create a new kind of government. If you want a government, go right ahead. Just don't force me to take part.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stoggie-Monster",
            "body": "Gang rape is a democratic process. Just sayin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Neighborhood-2203",
            "body": "Keep it simple: Generally speaking, libertarianism is not anti-democracy. Libertarianism seeks to maximize individual freedom and limit the use of force and coercion on others. So, as long as Democracy isn't stepping on individual freedom, all good. Having a democracy with limits on what government can do, so as to maximize individual freedom, is a good aim.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cosmekian_Wanderer",
            "body": "I've heard a lot about this being a democracy but I was always under the impression that we are a constitutional republic. We vote for representatives (republic) to uphold and enforce the constitution. The only type of direct democracy I see going on is when voters vote on one or two local government laws being introduced in their city to raise school or property taxes or for some housing initiative. As far as I can tell, just voting for the president or governor is not what makes a \"democracy\" \n\nAm I more or less on the right track?",
            "score": 1,
            "replies": []
        },
        {
            "author": "JonnyDoeDoe",
            "body": "First, there are no nations that exist as Democracies... \n\nSecond, everyone acts in self interest the vast majority of the time... \n\nThird, the masses, for the most part, really are ignorant... If they weren't, they would understand points one and two... \n\nThe republic gets you as close to democracy as any nation should dare get... And the truth is not everyone should get to vote... Anyone who does not support a level of government through the primary method of its funding, should not be allowed to vote for representation in that level of government... Which in the US is almost half the vote eligible population as they do not pay income tax... \n\n\"Democracy\" was the rallying cry for the direct election of Senators... But leftists understood that it would rebalance power in their favor... Without the 17th amendment, the Senate would be consistently a conservative leaning governing body... Not that Team Red is a great team for libertarians, but on the whole it is certainly better than Team Blue... \n\nand regardless of your feelings for the duopoly, that is the current and foreseeable future of the US... There are two options, work from within or revolution... We are simply too small in numbers for revolution...",
            "score": 1,
            "replies": []
        },
        {
            "author": "CanadaMoose47",
            "body": "Free markets are often at odds with democratic decisions.\n\n\nA democracy deciding what you should have for lunch is not as good as you personally deciding what to have.\n\n\nBrain Caplan has a good book, \"myth of the rational voter\" where he shows that voters are systematically biased against free markets, so democracy will consistently have anti-market outcomes.\n\n\nThat being said, I am not convinced that true democracy (random sortition-based representation) would be worse than what we have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "djentropyhardcore",
            "body": "Democracy is achieved by either voting for Representatives to reduce government or to pass laws, OR by voting with your wallet in the free market.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aura_Raineer",
            "body": "What’s your definition of democracy? While I do agree that there are some good criticisms of democracy, I also don’t see a lot of truly anti democratic sentiment in libertarianism.\n\nHowever I also see that especially from the left the definition of democracy has morphed into something that I would not consider very democratic.\n\nSo I really can’t answer until I know your definition of democracy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "uknolickface",
            "body": "Freedom is the alternative",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlockLevel",
            "body": "Free market anarchy is the ideal. Democracy is one of the worst systems of governance ever conceived of by mankind. Worse than even monarchy. I'd recommend reading some Hoppe for more info on this perspective.",
            "score": -1,
            "replies": []
        }
    ]
}