{
    "title": "Ending Social Security",
    "author": "txeagle24",
    "subreddit": "Libertarian",
    "rank": 31,
    "score": 0,
    "upvote_ratio": 0.3,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Libertarian/comments/1inh8zp/ending_social_security/",
    "id": "1inh8zp",
    "selftext": "I haven't really done the math on this, but I wonder if it's a way to sundown Social Security. Using a small sample, here goes: Stop paying my parents Social Security now, & return the money I've paid into SS to me as a tax credit over their remaining lives while allowing me to opt out of paying into and receiving SS in perpetuity. Let's say between the 2 of them they receive $40k/year, & the live another 20 years. That's $800k that isn't paid out. I've paid in $125k which would be a tax credit of $6,250/yr. But the govt would lose the $8k I pay in each year which would be reduced contributions of $160k over the next 20 years which is about when I'll retire. The net benefit to SS is a savings of $515k, but the govt also avoids paying me $48k/year for 25 years, saving another $1.2M bringing the total net savings to $1.735M. \n\nNow, my parents have no retirement savings so they'd have to sell their home, & I would need to help pay for their expenses which would be difficult. Is this a totally insane concept? ",
    "comments": [
        {
            "author": "mike1097",
            "body": "I rarely see any analysis take into account survivor benefits for children and spouses and disability benefits.\n\nIt’s not just a simple pension program, there are more pieces. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "TrustmeIreddit",
            "body": "It's funny that people think that because they're going to gut social security that means they'll stop taking it out of our checks. The program will just get renamed ,nobody will get payouts, and it'll go into a fund that only Elon, Trump, and those they deem worthy have access to. Like they'll ever give up free money.",
            "score": 3,
            "replies": []
        }
    ]
}