{
    "title": "Shoot it straight into my veins",
    "author": "Shavenyak",
    "subreddit": "Libertarian",
    "rank": 15,
    "score": 21,
    "upvote_ratio": 0.59,
    "num_comments (reported by reddit)": 57,
    "url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-works-to-remake-americas-federal-workforce/",
    "id": "1ini31p",
    "selftext": "",
    "comments": [
        {
            "author": "LeavesOfOneTree",
            "body": "“No one knows exactly how many federal agencies exist”\n\nImagine defending that",
            "score": 113,
            "replies": [
                {
                    "author": "tomtomtom7",
                    "body": "Most likely the answer is a just bit more nuanced than a number. \"Depends on whether you count X and Y as agencies\" or \"depends on whether A and B count as separate agencies or as one\".\n\n\"No one knows\" sounds like a dishonest translation of such answer because obviously many people do know.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "WardenOfChaos",
                            "body": "I don't think the answer is more nuanced. I think the statement is actually saying that there is no person in the government who can answer that question directly. If you wanted to know the answer, someone would have to go through 100+ years of laws and executive orders passed by Congress and signed by the president and identify every agency created by those laws.\n\nThere is likely no single location that stores that information in a way where you could provide an answer in a reasonable amount of time.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "saggywitchtits",
                    "body": "I'm gonna say somewhere between 3 and 300 million, that should narrow it down a little bit, right?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Fuck_The_Rocketss",
                    "body": "Ha ha literally commented the same thing",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "GalaxyRanger_",
                    "body": "Imagine believing that",
                    "score": 3,
                    "replies": [
                        {
                            "author": "sic_parvis_magna_",
                            "body": "Found the statist. Granted, we should know how many exist and what they do. 0 referendums for the American people on any of these \"Departments\"",
                            "score": -12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "arcbeam",
            "body": "If anyone is interested in actual [facts](https://federalnewsnetwork.com/wp-content/uploads/2024/08/OMB-Report-to-Congress-on-Telework-and-Real-Property.pdf)",
            "score": 76,
            "replies": [
                {
                    "author": "austinh120",
                    "body": "These people in this sub are seriously naive.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Push_Dose",
                            "body": "Don’t worry pal, you’re a self described left leaning socialist. Everyone in this sub thinks you’re equally as naive.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "\nLibertarian socialism is an oxymoron. The core tenet of libertarianism is private property beginning with the recognition of ownership of self and your own body and extending to ownership of that which is self-acquired and self-produced with that body.\n\nSocialism and communism deny private property rights, and the right of ownership of what is self-acquired and self-produced.\n\nThis means they deny the ownership of self, and someone who does not own themselves is a slave.\n\nSocialism and communism are totally incompatible with libertarianism, and are nothing more than forms of chattel slavery dressed up in pretty words to serve collective masters. Wealth robbery by the collective is just as immoral and unjust as much being robbed at gunpoint by an individual.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "inanimate_animation",
                                                    "body": "Good mod",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Appleshaush",
                                                            "body": "Why is it good to stifle discussion by removing a comment the mod doesn't agree with? ",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "inanimate_animation",
                                                                    "body": "My “good mod” comment had nothing to do with the person’s comment being removed as I’m just  now seeing that it was removed based off of your comment.\n\nI was saying “good mod” to the mod’s comment about “libertarian socialism,” and for that reason only. When I left my comment, the original comment was still there. I have no idea why the original comment was removed, or when it was removed. Was it the poster who deleted their own comment or a mod? Also, I disagree with it being removed if it was by a mod.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Appleshaush",
                                                                            "body": "Fair enough about your comment. And regarding the original comment, the note I see is that it was removed by a mod, which I also disagree with ",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "inanimate_animation",
                                                                                    "body": "Too trigger happy of a mod then. We’re in agreement.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "AutoModerator",
                                                                            "body": "\nLibertarian socialism is an oxymoron. The core tenet of libertarianism is private property beginning with the recognition of ownership of self and your own body and extending to ownership of that which is self-acquired and self-produced with that body.\n\nSocialism and communism deny private property rights, and the right of ownership of what is self-acquired and self-produced.\n\nThis means they deny the ownership of self, and someone who does not own themselves is a slave.\n\nSocialism and communism are totally incompatible with libertarianism, and are nothing more than forms of chattel slavery dressed up in pretty words to serve collective masters. Wealth robbery by the collective is just as immoral and unjust as much being robbed at gunpoint by an individual.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "AutoModerator",
                                                                                            "body": "\nLibertarian socialism is an oxymoron. The core tenet of libertarianism is private property beginning with the recognition of ownership of self and your own body and extending to ownership of that which is self-acquired and self-produced with that body.\n\nSocialism and communism deny private property rights, and the right of ownership of what is self-acquired and self-produced.\n\nThis means they deny the ownership of self, and someone who does not own themselves is a slave.\n\nSocialism and communism are totally incompatible with libertarianism, and are nothing more than forms of chattel slavery dressed up in pretty words to serve collective masters. Wealth robbery by the collective is just as immoral and unjust as much being robbed at gunpoint by an individual.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "AlphaTangoFoxtrt",
                                                                                            "body": "> Socialism does not deny self ownership or private property\n\nIt literally does, that's the point. To collectivize private property.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "austinh120",
                                                            "body": "I strongly disagree with this characterization of the ideology. Bot seems pretty politically biased. I guess I can draw my conclusions about how this echo chamber is being formed. Sad case for the libertarian ideology.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "inanimate_animation",
                                                                    "body": "Libertarianism is literally boiled down to private property rights and self ownership. If you disagree with “that characterization of the ideology” then you’re not talking about libertarianism. You’re talking about something else.",
                                                                    "score": 8,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fuck_The_Rocketss",
            "body": "Absolutely buck fucking wild that: “Nobody knows exactly how many federal agencies exist” is explicitly stated in an official White House communication.",
            "score": 63,
            "replies": [
                {
                    "author": "ecleipsis",
                    "body": "Yeah it’s absolutely insane.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "grendev",
                    "body": "And it's not like he and his minions just got there. They did the job for 4 years.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "dakarion",
            "body": "While this is directionally exciting, I found [this opposing perspective](https://www.astralcodexten.com/p/bureaucracy-isnt-measured-in-bureaucrats) to be worth a read.",
            "score": 31,
            "replies": [
                {
                    "author": "nocommentacct",
                    "body": "That’s a great article. The part about not being able to approve the interpreters citizenship fast enough is heartbreaking. Strange how some kind of exception couldn’t have quickly been made to save their lives. \n\nAll that stuff being said about the government agencies like the FDA, I’d still rather the entire thing be scrapped and pay 10% less in taxes. I’m eating farm food and deer meat either way.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cdhofer",
            "body": "While I fully support a smaller, leaner government, I’m wary of gutting the workforce while all the same regulations are still in place (which the executive branch cannot as easily disassemble). This kind of layoff/buyout strategy will probably leave us with only the less competent employees. If everyone is still required by law to work with these agencies, a less competent workforce won’t make that easier.",
            "score": 5,
            "replies": [
                {
                    "author": "c0eus",
                    "body": "Well duh. The intent here is isn’t to neuter the government, it’s to consolidate power in the Executive.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fuck-Mountain",
            "body": "![gif](giphy|l378plFwSe6x8JGbS|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "tldrthestoryofmylife",
            "body": "Trump admin not looking so bad anymore, is it?",
            "score": -26,
            "replies": [
                {
                    "author": "cloudywithanopinion",
                    "body": "They’re just as bad as the rest",
                    "score": 17,
                    "replies": [
                        {
                            "author": "tldrthestoryofmylife",
                            "body": "They're the ones who want transparency and smaller government, you idiot.\n\nYou'd think someone on r/libertarian would be happy about that, but I guess you can't miss an opportunity to virtue signal. You're the one who's just as bad as the Woke Left.",
                            "score": -44,
                            "replies": [
                                {
                                    "author": "cloudywithanopinion",
                                    "body": "Smaller government how? They just made a faith based office, they’re increasing defence funding, starting trade wars. Delusional",
                                    "score": 53,
                                    "replies": [
                                        {
                                            "author": "Lurchthedude",
                                            "body": "They are also ignoring the processes put into place to legally reduce the size of the government work force. through a reduction in force, voluntay early retirmenet agreements, voluntary incentive seperation payments. Every one of these executive orders is political theater that  will fail in the courtroom and waste more tax dollars.\n\nThere are 438 government agencies as of january 30th (which is obsurd). It isn't a hard number to find. It's just language that can be quoted during a news story that will generate outrage, clicks, and ad revenue.",
                                            "score": 27,
                                            "replies": []
                                        },
                                        {
                                            "author": "tldrthestoryofmylife",
                                            "body": "Cutting billions of dollars of gov waste?\n\nI don't have a problem if they increase military funding as long as:\n1. Gov gets altogether smaller and cheaper to maintain\n2. The military money goes to fighting wars on our continent that are relevant to us instead of ones on the other side of the world that we shouldn't care about\n  a. Perfectly happy if military money goes towards enforcing the borders and getting rid of the Mexican cartels\n\nAs for trade wars, he's using tariffs as a negotiation tactic, and it's proving successful b/c Canada, Mexico, and Latin America have all folded in negotiations and agreed to pay their fair share.\n\nTariffs aren't strictly libertarian, but I'd far prefer having other countries' money coming to me rather than the other way around; mind you, the tariffs are usually more harmful to the other countries' people than to our people, which is why they're used for negotiation, so they end up not being actually needed most of the time anyway.",
                                            "score": -13,
                                            "replies": [
                                                {
                                                    "author": "IamFrank69",
                                                    "body": "I agree with you for the most part, but I have to insist that it'd be damn near impossible to cut the total federal budget in any meaningful way if the defense budget is increased.\n\nThe DoD is probably the most wasteful part of the federal government... and that's really saying something. It is absolutely essential to drastically cut its budget.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "tldrthestoryofmylife",
                                                            "body": "They're not even necessarily increasing the budget. The first thing they're talking about is auditing the Pentagon and making sure the budget goes to good use. They might not even need a greater budget.\n\nWith that said, government waste is literally everywhere, and there's no one place if you wanna cut it. USAID is plenty of evidence in that direction.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Fuck_The_Rocketss",
                                            "body": "That office is gutting all the other offices! That’s the only thing it’s doing! And yeah the Trump administration is royally fucking up in other areas. But that doesn’t mean this DOGE stuff is bad. It’s great. It’s fucking great.",
                                            "score": -6,
                                            "replies": []
                                        },
                                        {
                                            "author": "UCBCats23",
                                            "body": "But look at what they’re already aiming to cut, complete or mostly enormous, useless departments, education, usaid, for example. Increasing defense spending isn’t necessarily bad if it’s efficient, and if they can actually eliminate massive waste from other sectors of the federal budget, then increasing defense will still be a net savings. Also, people hate America, we will be under attack for the remainder of our existence.",
                                            "score": -15,
                                            "replies": [
                                                {
                                                    "author": "Kin-ethra",
                                                    "body": "The defense budget is almost $1 trillion a year. We have, and have almost always had, the largest budget for military its insanely bloated and if we were going to cut ANYTHING first, this is what it should be. Cut it by 2/3rds.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "cloudywithanopinion",
                                                    "body": "I mean to be honest the DOD and Space likely has the biggest waste. Also transparency isnt really key when you mess up Gaza and Gaza, Mozambique.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "UCBCats23",
                                                            "body": "I hope every cent gets audited, everywhere. Which is why I mentioned efficiency. No doubt your examples will find massive waste. If they say hey, we found all this junk spending in DOD, and we’re going to reroute it or maximize it..so be it. But we do need a military",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "izza123",
                                    "body": "Didn’t they just spend something like 95,000 a minute for trump to watch fucking football? 20 million dollars to visit the superbowl?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "EngagedInConvexation",
                                    "body": "You lost me at transparency.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "tldrthestoryofmylife",
                                            "body": "- Audit the Pentagon\n- Audit the DoE\n- Audit the Fed and IRS (planned)\n\nJust talking about this shit is HUGE, but it's crazy impressive that they've already gotten the ball rolling",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Fuck_The_Rocketss",
                                    "body": "Dude this sub has been brigaded by I don’t know who, but they’re so focused on how DOGE is not authorized by congress or whatever, that they’re completely discounting the objective positives being done. \n\nIt’s like yeah I’m not a fan of the brazen wielding of executive power but the results (in this case) are undeniably amenable to our philosophy. Congress was never gonna fucking pass legislation to get this shit done. \n\nSure the purists here can point to the awful shit this administration is doing. I don’t disagree. Trump ain’t a libertarian. He’s doing some really terrible horrible no good very bad stuff. But this DOGE stuff is fan fucking tastic.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "tldrthestoryofmylife",
                                            "body": "> the purists here\n\nYou said it all right there.\n\nThese days, it's popular to hate religion and believe that God is a social construct used by the Powers That Be to control people, but the elephant in the room is the God-shaped hole that we're all desperately trying to fill.\n\nEvery movement has purists that would rather maintain their purity than accept legit progress. The Woke movement is full of that kind; people who hate the Dems almost as much as they do the GOP and kinda just wish death and destruction on basically everyone.\n\nAt the center of it all is Messiah-complex. Most people are looking for something to agree on in these discussions, but these people look for something to DISagree on so that they can continue to feel like a martyr.\n\nReligion is supposed to teach you to look inwards and be honest with yourself about your own limitations so that you can then accept imperfection in the presence of forward progress. Purism in politics does the opposite, where you deny and disparage all honest efforts at progress b/c you're perfect and it's the rest of the world's fault that they're not exactly like you.\n\nI'm not a Christian (grew up orthodox Hindu; now a heterodox Hindu), but the Christians call this \"blaspheming the Holy Ghost\"; it's the one sin that Jesus can't forgive, b/c the sinner doesn't _want_ forgiveness as they think they're already perfect.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Fuck_The_Rocketss",
                                                    "body": "Amen brother.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "idkumjosh",
            "body": "6% of federal employees regularly come in to work…",
            "score": -14,
            "replies": [
                {
                    "author": "IamFrank69",
                    "body": "That's not what it said. It said 6% come into work on a full-time basis. That means the remaining 94% consists of some combination of:\n\n1. People who work part time,\n\n2. People who work a hybrid schedule of onsite and telework, and\n\n3. People who work fully remote.\n\nYou seem to be under the impression that 94% of the workforce falls under category 3. In reality, a very large portion falls under some combination of categories 1 and 2. In fact, many of the people in category 1 conduct all of their work onsite, but are part-time workers, so they don't count as a \"worker who comes into work on a full time basis.\" This stat is quite misleading.\n\nWith that said, I fully support firing a huge portion of the useless federal government. I just think we should avoid arguing against strawmen because all that does is give our opponents excuses to discredit us.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "intothefryingpan",
                    "body": "I heard it’s 1%. What’s private sector?",
                    "score": -7,
                    "replies": []
                }
            ]
        }
    ]
}