{
    "title": "My boyfriends laziness is killing our relationship",
    "author": "Careless_Plane_456",
    "subreddit": "TwoHotTakes",
    "rank": 19,
    "score": 175,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 295,
    "url": "https://www.reddit.com/r/TwoHotTakes/comments/1jdcbm5/my_boyfriends_laziness_is_killing_our_relationship/",
    "id": "1jdcbm5",
    "selftext": "My (22F) long term boyfriend (23M) is slowly pushing me away because of his laziness and uncleanliness. \n\nLong story short we’ve been together since we were in high school about 6 years. I’ve never seen him sweep the floors, use the washer/dryer, fold clothes, take out trash, wash dishes, or clean a surface. But what he will do is leave his dinner plate out, open water bottles everywhere dirty clothes on the floor, jackets are thrown where ever he takes them off, anything he comes home with is thrown where ever he pleases. His office is beyond disgusting and filthy, he can’t even keep his car clean. And with all of this we split bills 50/50. and I feel like more of a mother than anything at this point and it’s really turning me off. I’ve tried everything, said everything that can be said. I’m starting to wonder if it’s some sort of mental issue , he’s not depressed so idek. Or if he is one of those who thinks taking care of the house is a “woman’s job”. I truly love him we’ve been through so much together, we have 3 cats and we rent a home down the street from my family. I cannot afford this home on my own and loosing it would kill me.but I can’t keep playing maid it’s starting to really affect my mental health. What do I even do at this point? \n\nUpdates/ frequently asked questions: \n\nYes I’ve discussed this with him. He cannot provide me with a straight forward answer as to why he doesn’t help around the house or clean his own mess. When asked about the messes in his personal areas (office, car etc) he downplays the situations and says they’re hardly messy/not a big deal. He just doesn’t seem to comprehend on why this is such a huge deal.\n\nI’ve showed him this post and claims I’m making him out to be a “horrible person” and has created a huge problem spreading false/ made up information which does make me think mental issue \n\nThere were no men in his life for his mom to play maid for and his mom never did anything for him (didn’t clean his room, do laundry etc)\n\nI also have adhd, bipolar, and depression so yea mental illness isn’t really an excuse here ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for submitting to the Two Hot Takes Podcast Subreddit! We'd like to remind you that all posts are subject to being featured in an episode of the Two Hot Takes Podcast. If your story is featured you'll\nget a nifty flair change to let you know and we'll drop a link so you can see our host's take on your story.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "res06myi",
            "body": "Do not make the mistake many women make in this situation: getting married, having kids, doing absolutely all of the work to care for the entire family for 10 years, then finally leaving.",
            "score": 341,
            "replies": [
                {
                    "author": "Ginger630",
                    "body": "That’s when he’ll end up cheating on her because she’s “changed.”",
                    "score": 115,
                    "replies": [
                        {
                            "author": "candaceelise",
                            "body": "Yup. Dude expects her to be his mom and clean up after him while making excuses for being a slob and refusing to acknowledge he lives in filth.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "BigFatBlackCat",
                                    "body": "A tale as old as time",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Electronic_Charge_96",
                    "body": "Leave now. It is killing the relationship - it should. This is worth leaving over NOW. YWBTA - to yourself, if you stay, commit further or bear live young with this child in a man body.",
                    "score": 80,
                    "replies": []
                },
                {
                    "author": "hilltopj",
                    "body": "It's such a popular theme there are[ songs about it](https://youtu.be/jvU4xWsN7-A?si=sVsluMjdWCprXBfa)",
                    "score": 12,
                    "replies": [
                        {
                            "author": "res06myi",
                            "body": "I am so bummed I missed her tour. The cacophony version is the anthem of generations of women.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dragongirlv83",
                    "body": "Yup was gonna say it’ll never change . Trust me I have lived this .",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "PatentlyRidiculous",
            "body": "He has told you who he is for years now.  Either accept it and stop complaining or get rid of him.  This is on you at this point",
            "score": 398,
            "replies": [
                {
                    "author": "GrandWrangler8302",
                    "body": "Pretty much. He’s had six years to step up, and he refuses. At this point, staying just means accepting that this is your life unless you leave.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "ModelChef4000",
                    "body": "Right? At this point are we supposed to feel bad for her?",
                    "score": 18,
                    "replies": [
                        {
                            "author": "PatentlyRidiculous",
                            "body": "I think she just needs the push to realize she needs to move on because he isn’t changing",
                            "score": 55,
                            "replies": []
                        },
                        {
                            "author": "hydraulic0",
                            "body": "Well yeah, because it’s still a shitty situation. It’s easy for us to say that she should leave because sure it’s obvious, but we’re outside the problem. But when you’re in the midst of it with the emotions that come with it and the potential changes to her living situation and way of life, it’s a lot harder to think as clearly about it.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Subject-Regret-3846",
                            "body": "Yes, she’s done nothing wrong and is asking for help and support.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Outside_Memory5703",
                                    "body": "Putting up with it is why it keeps happening",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Certain_Mobile1088",
            "body": "You have sex with him, right, so you are a bangmaid. Not just a maid. Does that make it better? \n\nI don’t think so. He is a man child and won’t change for you, bc you won’t make him. He might for a while but he’s seen you tolerate this for years—why should he take your ultimatums seriously? \n\nTime to move on. Let him fester in his own fifth.",
            "score": 171,
            "replies": [
                {
                    "author": "Thereapergengar",
                    "body": "Terrible advice. You\nKnow nothing of this man and you then go to relegate his gf as just a fuck maid? She should sit down with him and explain her feelings and then tell him if stuff dosent change in 30 days I’ll need to leave. They’re both pretty young.  Ppl change all the time.",
                    "score": -148,
                    "replies": [
                        {
                            "author": "ReginaPhilangee",
                            "body": "It does appear from the text that she had told him several times. She can see how important he thinks her needs are.",
                            "score": 111,
                            "replies": []
                        },
                        {
                            "author": "suhhhrena",
                            "body": "We don’t know nothing about this man—we know he has zero home training. Why must women sit men down like children and explain to them that a home must be cleaned? That dishes must be washed and trash must be thrown away? If you have to hold someone’s hand and explain that type of stuff, then perhaps you don’t need to be in a relationship with them. It’s bare minimum to do household chores.",
                            "score": 74,
                            "replies": []
                        },
                        {
                            "author": "VFTM",
                            "body": "Ahhh explain “communicate” “he’s not a mind reader” “you have to use your words” - this is the trap soooo many women fall into. \n\nHaving to explain to a grown man that he needs to clean his own house is … gross.",
                            "score": 66,
                            "replies": [
                                {
                                    "author": "hilltopj",
                                    "body": "Next they'll be telling her to \"just make a list for him to follow\"",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "VFTM",
                                            "body": "Hahah I love the “I don’t wanna make a list” song",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Thereapergengar",
                                    "body": "By legal standard”s (he’s a man) but no 23 year old is really a man.",
                                    "score": -39,
                                    "replies": [
                                        {
                                            "author": "VFTM",
                                            "body": "But she, who is younger than him, has to parent him into growing up???",
                                            "score": 42,
                                            "replies": [
                                                {
                                                    "author": "Thereapergengar",
                                                    "body": "Having a conversation about house hold\nDuties with your significant other, isn’t called parenting them, it’s called communication and expressing feelings, it’s a real common thing to do in non toxic relationships.",
                                                    "score": -28,
                                                    "replies": [
                                                        {
                                                            "author": "hilltopj",
                                                            "body": "Having a conversation about \"household duties\" is a reasonable expectation in a relationship. Having to tell someone that they need to pick up their discarded clothes, not leave dirty dishes everywhere, and generally tidy up after themselves is something you do with children. His parents failed to teach him these life lessons and it's not on OP to play both girlfriend and mommy.",
                                                            "score": 34,
                                                            "replies": [
                                                                {
                                                                    "author": "Thereapergengar",
                                                                    "body": "They obviously grew up in too different home environments. No where did I suggest that she goes behind him and keeps telling him and I didn’t suggest, she take away his Xbox or PlayStation ether. So I don’t understand what this fixation you ppl have with labeling her as his mother.",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hilltopj",
                                                                            "body": "So how many times do you think she needs to have this conversation with him about basic adulting before she's allowed to cut her losses?",
                                                                            "score": 23,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "cakebatterchapstick",
                                                                            "body": "Go clean your room dude",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Skydiving_Sus",
                                                                            "body": "I’ve had this same conversation with a roommmate. Made him the lists, told him he had to clean up after himself cause I wasn’t going to do it… bugs infested the apartment, and bags of garbage piled up, I eventually left and when I did, the apartment managers checked out the place and gave him an ultimatum to have the place clean in a week or he’d lose the apartment. \n\nHe got his act in gear and got the apartment clean enough to not lose it. The bugs did infest the building though, took a lot of effort to get them out. That’s literally what it takes to snap these dudes out of their delusions that they don’t have to do household chores… they’ve gotta risk homelessness before after spending hours a day on YouTube finally watching a video on how to quickly tackle dishes, most efficient ways to clean and vacuum…\n\nMost women aren’t going to go through that to teach a man a lesson. I still have nightmares about the bugs.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "VFTM",
                                                            "body": "Having to urge your live in bf to do ANY chores is definitely falling on the side of parenting.",
                                                            "score": 29,
                                                            "replies": [
                                                                {
                                                                    "author": "Thereapergengar",
                                                                    "body": "You just want to label it as something horrible to give yourself the excuse to leave.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "VFTM",
                                                                            "body": "Yeah!! I hope she leaves him!! Enough of woman having to gently tell their loser bfs to grow the hell up.",
                                                                            "score": 31,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "SockPuppyMax",
                                                                            "body": "If you're not happy in a relationship after trying to communicate (she has), you *should* leave, full stop. You think she should stay to keep telling him he needs to pick up after himself just to pick up after him when he doesn't listen *again*? That's mental abuse. He's telling her with his actions that he doesn't care about her mental health. This will just lead to misery for both of them. You're not very bright for relationships, it seems",
                                                                            "score": 22,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "bbbbears",
                                                                            "body": "Nah, no one needs an excuse to leave, anyone is free to do so at any time. Poor OP has talked to him til she’s blue in the face, he’s had his “last” chance many times. \n\nGrow up.",
                                                                            "score": 17,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "rolyfuckingdiscopoly",
                                                            "body": "What are repeated conversations about household duties where one person refuses to do anything like a child called?",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Thereapergengar",
                                                    "body": "Parent him into growing up? Just curious how do you deal with things in your own relationship? When you want your significant other to do somthing or to change what they’re doing, how do you tell them? Since according to your comment earlier it’s degrading to you, to even have to tell a man that he isn’t doing what you want him to do in the first place? Or do you just leave the relationship when they do somthing you don’t approve of?",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "VFTM",
                                                            "body": "When I was younger, I’d beg a loser to participate in household chores - nowadays I asses who someone is before even considering a relationship with them. \n\nAnd she HAS spoken with him. Which is even amazing that men need to be spoken to about doing the barest of minimums.",
                                                            "score": 27,
                                                            "replies": [
                                                                {
                                                                    "author": "Thereapergengar",
                                                                    "body": "That’s why I said in my original comment sit him down and explain that this is a deal breaker for you and he needs to start helping, and give it like 30 days to see what happens.",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "VFTM",
                                                                            "body": "Hahahaha no. Let the next girl tell him nicely how much he sucks.",
                                                                            "score": 20,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Thereapergengar",
                                                                    "body": "So your saying that if your with someone and they don’t just do what you think should be done, you just up and leave? Without ever making the problem known?",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "VFTM",
                                                                            "body": "If the issue is that he never once cleaned anything, left his shit all over the place and was a filthy pig? Yeah that’s not a convo. That’s a pack my shit scenario.",
                                                                            "score": 22,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "hilltopj",
                                                            "body": "OP said she's talked to him about it and nothing has changed. How many times do you think is enough before she's justified in leaving the relationship?",
                                                            "score": 17,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Shot-Hotel46",
                                                            "body": "You know this is not a conversation in a real relationship because a real responsible human being knows how to clean up after themselves. I'm sorry you've never experienced this",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fuggreddit69",
                            "body": "We know he's a loser who can't clean up after himself, what else do we need to know lmao \n\nIf you are an adult and need to be told to clean up after yourself you cannot be emotionally developed enough to be in a relationship. This is literally the bare minimum of being an adult let alone  someone likeable enough to get laid.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "Open-Memory2017",
                            "body": "Did you not read what she wrote? She said she has discussed this with him many times and it’s not a problem for him. If he doesn’t see it as a problem he’s not going to change and her only two choices are live with it or leave.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "AlokFluff",
                            "body": "We know enough.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Successful-Doubt5478",
                            "body": "Bla bla bla he is depressed she should just shut up and clean and bang him, bla bla bla she should just tell him and he will magically change bla bla bla\n\nHaha. No.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Shot-Hotel46",
                            "body": "If she needs to give him a \"you change or I will leave\" ultimatum, shit has already hit the fan",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "_corbae_",
                            "body": "All day, every day, therapist, mother, maid\n\nNymph then a virgin, nurse then a servant\n\nJust an appendage, live to attend him\n\nSo that he never lifts a finger\n\n-Paris Paloma, Labour",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Maddie_Herrin",
                            "body": "She has told him exactly how she feels, she should not issue a final ultimatum. He will change, not because he finally knows hes hurting her, he knew that, but because he will finally feel the consequences of his inactions. She will be dissuaded, and when he feels safe like he has her trapped he will continue being who he is.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "SeikoAki",
                            "body": "did yo slow ass even read the post lol",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "lxzgxz",
                            "body": "Oh no, we know something of this man because this particular type of man is very common. Most women have dated or married a man like this, they’re a dime a dozen. In fact it’s SO common for men to be this way towards their female partners that there are whole songs and books dedicated to the shit. \n\nMy children’s father was this way. It’s one of the main reasons we broke up. He didn’t think he should have to do shit to lift a finger for our relationship but pay half of the bills. Yes I talked to him, yes I cried, yes I asked for counseling. He wasn’t interested in any of that and told me that if I wanted help around the house or with the kids then I needed to contribute more to the bills (of which I already paid half). It was so bad he had me cleaning cat shit off of the floor while heavily pregnant (which is very dangerous for pregnant women) because he couldn’t even handle scooping the litter box during my pregnancies. It was so bad I tore my stitches after a c-section giving birth to HIS son because even immediately post birth he refused to help with anything at all.\n\nGuess when he suddenly wanted to work on things?? When I told him I was leaving. \n\nThe reason women can speak definitively on this even if we don’t personally know the men in these posts is because we’ve all dated one or several of the same type of man. We’ve all seen how this goes. This man is like all the rest of them that think women live to serve them and that they shouldn’t ever have to put forth any effort.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Subject-Regret-3846",
                            "body": "How many times? She’s already done this more than she should have to. \n\nShe’s already mentioned that she feels like she’s turning into his mother because of his weaponized incompetence.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yellow_lemon2",
            "body": "I’m in a similar situation except married with multiple kids and owning a home, not renting. I plan to leave as soon as financially it is possible. Once you’ve begged and pleaded and nothing has changed, it’s time to either accept it or move on. There is no third option. We cannot force people to change. It sounds like you’ve already tried talking to him. A lot of men in these scenarios have no reason to change if you aren’t going to hold a firm line. Maid service AND half the bills? They have it made… we have to be the ones to stand up and say no more.",
            "score": 68,
            "replies": [
                {
                    "author": "Skydiving_Sus",
                    "body": "Don’t know where you are, but if you’re in the states, make sure your state isn’t looking to remove no fault divorce. You’ll want to leave before they do.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rogue_bae",
            "body": "Just so you know, this is one of the leading reasons of divorce",
            "score": 93,
            "replies": [
                {
                    "author": "Skydiving_Sus",
                    "body": "Also why these men are trying to get rid of “no fault divorce.”\n\nAlso possibly related to why they considered living with a man not your husband a problem. They call it a sin, but it could be the women realize who their husband is behind the mask and might not want to be chained to him for life…",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "StressedTurnip",
            "body": "I too was a single mother of a 260 month old once.\n\nIt didn’t matter how much I begged or cried for him to help around the house. He’d say “I’ll do it later” never would. Then he’d start saying “if you don’t like it then leave”.\nHe would leave cereal bowls on his bedroom night stand and let them pile up until the remaining milk was rotting. He’d leave his laundry all over the floor and you couldn’t walk into the bedroom without stepping on them. If I didn’t do the dishes they would pile up on the sink and fill the countertop until I’d give in from the smell of rot. He never cleaned the bathroom or living room.\nAnd yet he was UPSET I wasn’t having sex with him hardly at all, would only give in when he’d be nagging so much it would cause fights (I now recognize that as coercion, not consent). BREAKING NEWS- most women aren’t attracted to children so they don’t want to sleep with their partners who are behaving like a helpless child!\n\nThe amount of mental relief I got immediately after the breakup is indescribable, I had cried enough during the relationship- breaking up with him didn’t phase me one bit! I immediately stopped taking birth control, I started going to the gym daily, I dropped 20 lbs in 8 weeks, I was living with my mom who was only charging me $250 for rent so I was saving a lot of money, I could buy things I wanted without getting questioned about it, I got my tubes tied, I started diving into my career and doing clinics… I was SO much happier.",
            "score": 41,
            "replies": []
        },
        {
            "author": "crazycatlady22715",
            "body": "Stop doing the work. Make your own dinner and don't make any for him. Tell him until he starts cleaning up after himself. You won't do it anymore. And if that doesn't work, it's time to look for a new place to live. Even if you love the house, it's time to go.",
            "score": 66,
            "replies": [
                {
                    "author": "StressedTurnip",
                    "body": "I tried that for one week, the dishes stacking in the kitchen were rotting, the trash overflowing with a full bag right next to it.\n\nYou just have to leave them, it’s not worth your sanity. They don’t get their live-in maid-sexdoll-mommy",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "sosophox",
                    "body": "What does that achieve? Petty only gets you petty. If you get to that point, just leave. It's over accept it. Playing games is not going to get you anything but resentment.",
                    "score": -20,
                    "replies": [
                        {
                            "author": "Due_Half_5316",
                            "body": "It’s not playing games if he’s capable of doing those things himself, which he very likely is. It’s giving him a chance to see the consequences of his behavior and a chance for him to grow up and make a change.",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "suhhhrena",
                            "body": "You might think it’s petty, but sometimes, the nuclear approach DOES work. And like they said, if it doesn’t, it’s time to move on without him.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "sosophox",
                                    "body": "It doesn't work. That's just punishment for the act. Just move on. If you(both of you) can't communicate, pettiness will just create a hostile environment last longer and make the breakup even bitter. Just say 'this is not working for me' and leave.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "SaiyanPrincess28",
                                            "body": "I don’t see how that’s being petty. If she leaves he’ll have no choice but to cook his own food, do his own laundry, and clean up after himself, and he’ll be on the hook for 100% of food and bills. So how’s it petty to make him grow tf up?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Roguebets",
            "body": "He’s a lazy slob…it’s really up to you at this point…leave or accept it.",
            "score": 29,
            "replies": []
        },
        {
            "author": "MooseHonest3380",
            "body": "This isn't a mental issue. This is a misogyny issue. If you weren't there or if he lived alone, he would HAVE TO take care of himself and his home. But you are there, AND you are taking care of the domestic labor and parts of the bills. \n\nHe sees it as something only women should do. That's it is beneath him. That is misogyny not mental.\n\nYou can always have a roommate rather than him. If your place is a 1 bedroom, no place is worth keeping if you have to stay with someone who sees you as less than him. Beneath him. \n\nBreak up with him.",
            "score": 66,
            "replies": [
                {
                    "author": "SectumsempraBoiii",
                    "body": "Hey just FYI it doesn’t have to be misogyny cause he might let those things pile up even if he was living alone. For example I live alone and end up letting things get messy also but it’s mainly cause of depression and chronic pain.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "MooseHonest3380",
                            "body": "He literally stated, \"it's a woman's job.\" when she asked for help. That's how he views domestic labor. If he views it in that light... then it is misogyny. He sees that it is her duty to do it for him. He has no responsibility to do it because a man doesn't do those kinds of things... just women. That is a misogynistic mindset. Period.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "SectumsempraBoiii",
                                    "body": "Sorry I missed that part of the post. Silly guy he is.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "EngineerGreedy3611",
                                    "body": "The post doesn't say he said \"it's a woman's job\". She says that in the post. It doesn't say he said that. You are wrong friend.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Pizzaisbae13",
                            "body": "It states in the OP that the Bum says to her face that those chores are \"women's work\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -7,
                    "replies": [
                        {
                            "author": "Storage_Entire",
                            "body": "If he can keep his weed plants alive and thriving, then his slovenly way of life is a CHOICE",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Pretty_Station_3119",
                                    "body": "You could be right, but also he fails, I’ve had to start buying weed from the dispensary, that’s just the only thing he shows care about in his life.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MrsMorley",
                            "body": "Diagnosis isn’t the point. Behavior is. ",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "MrsMorley",
                                            "body": "He’s shown no signs of investigating why. She can’t make him care. So the hypothetical diagnosis is not the point. ",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "MrsMorley",
                                                            "body": "She’s said she’s asked and begged and nothing’s changed. \n\nNow you’re saying it’s on her to look for a solution because he isn’t. \n\nBut it’s not on her. ",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MrsMorley",
                                                                            "body": "Sure, mental illness or executive dysfunction might underlie his messiness. \n\nMy point, which you don’t seem to grasp, is that you’re centering his hypothetical reasons, rather than her expressed distress.\n\nCentering his entirely hypothetical issues, that he’s shown no sign of wanting to investigate, is asking her to do more work. \n\nIf you’re JAQ, that’s not helpful to the OP",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MooseHonest3380",
                            "body": "Your friend is like the exception and not the rule. And he also sounds like a mix of his parents never taught him how to care for himself.... which he should've figured out how to do on his own. That's what you do as an adult. And mental health... which is his responsibility to get control of and fix.\n\nYour friend has made no effort to change. No effort to learn. No effort to get ahold of this. That is on him. \n\nOP boyfriend LITERALLY STATED it's for a woman to do. Thus, this is something he views as something he shouldn't do but women do.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "MooseHonest3380",
                            "body": "Your friend is like the exception and not the rule. And he also sounds like a mix of his parents never taught him how to care for himself.... which he should've figured out how to do on his own. That's what you do as an adult. And mental health... which is his responsibility to get control of and fix.\n\nYour friend has made no effort to change. No effort to learn. No effort to get ahold of this. That is on him. \n\nOP boyfriend LITERALLY STATED it's for a woman to do. Thus, this is something he views as something he shouldn't do but women do.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "mnth241",
                            "body": "There could be some truth to this since OP said get partners office and cast are both disgusting.   \n\nMaybe, IF she really loves him for other reasons, it would be worth getting household service once a week to keep up. \n\nOP can’t be expected to tolerate all this.  It isn’t fair, too much of her time every week handling chores that should be at best shared.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Pretty_Station_3119",
                                    "body": "Exactly, it’s pretty simple, either help around the house and don’t be an asshole or if you physically cannot bring yourself to do the basic things like cleaning, then go seek help. (Speaking to OP’s spouse and people like them ofc)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Iwentforalongwalk",
            "body": "You're his bang maid. He's happy with how things are and will never change so life with it or get out. ",
            "score": 19,
            "replies": []
        },
        {
            "author": "ExistentialApathy8",
            "body": "Ya he needs a mother not a wife. Good luck changing that.",
            "score": 65,
            "replies": [
                {
                    "author": "AZBreezy",
                    "body": "Why would he want a mother or a wife when he has his live-in bangmaid? He's living the dream",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ExistentialApathy8",
                            "body": "I doubt they are having much sex",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Desert_Fairy",
            "body": "The first person you date at the age of 16 is so statistically unlikely to be the right person for you as an adult. \n\nSunken cost fallacy: I’ve put so much into this relationship, if I leave it now, it will all have been for nothing.  It doesn’t matter how much you’ve been through together, if you stay you are just putting good years that you could be happy into a relationship that makes you unhappy. \n\nLove isn’t as magical or rare as the movies make it out to be.  The truth is that love can and will develop between two mutually compatible people who respect each other and can develop trust. \n\nLove or rather that feeling of love is a chemical cocktail that makes you feel great when you are with someone. It isn’t actual compatibility. \n\nThe longer you stay with someone who isn’t your future, the longer it will take you to find the person who is. \n\nIt may sound like I have zero romance, but I believe that where trust, respect, and compatible morals and beliefs exist, love will always bloom. \n\nYour boyfriend doesn’t respect you. So how can love exist between you?  You feel like a parent to this person, that is a common emotion in failed relationships. One party feels like the other is a chore or responsibility. Once you start feeling like the parent, sex becomes less desired because why would you sexually want someone who is like a child to you?\n\nYou know this relationship has run its course. Decide which pets are yours and which are his, talk to your parents about staying with them while you get back on your feet, and work with your landlord to end the lease. \n\nYou have a whole life ahead of you. Don’t let this person keep you from that.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Glassesmyasses",
            "body": "He has a free maid who pays half his bills and sleeps with him. Why on earth do you think he has any problems with the current set up?",
            "score": 11,
            "replies": []
        },
        {
            "author": "Careless_Plane_456",
            "body": "Update- I decided to just send him the link to this Reddit",
            "score": 12,
            "replies": [
                {
                    "author": "Outside_Memory5703",
                    "body": "He’s not gonna change, sis. Men know they can get away with it, so they will keep doing it",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "hilltopj",
                    "body": ">I’ve showed him this post and claims I’m making him out to be a “horrible person” and has created a huge problem\n\nAs the saying goes: ***If an accurate retelling of his behavior makes him seem horrible, the retelling isn't the problem.*** \n\nNotice how he just reflected on how it made him look while taking no responsibility nor giving any valid reason for his actions? Remember that. It will likely come up again and again.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "bopperbopper",
                            "body": "He may not be a horrible person, but he’s acting like one",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aromatic-Arugula-896",
                    "body": "He should be embarrassed. \n\nGirl find a backbone and some standards and walk away",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "No_Upstairs_5192",
                    "body": "You're not \"making him out to be a horrible person\", if he is how you've described, he is doing a wonderful job doing that on his own.\n\n\nIt sounds like you're dating an immature manbaby.\n\n\nDont be his mommy, he is an adult and *should* take care of himself. You should be in a relationship with an adult. Not one pretending to be one, while not showing any responsibility for his own living space.\n\n\nIf this is truly negatively affecting your mental health, you need to strongly reconsider if this is what you wany yo deal with for the years to come. Because it *wont* get better. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "galactic_cosmos_412",
                    "body": "It's one thing if he can't create a mental list and do house work on his own but if he argues with you when asked to help that's definitely an issue. \n\nMy fiance has executive dysfunction because of ADHD so I make him a list to complete by the end of each week. This has worked so well with our situation but your partner has to be willing to help for this to work. This method has saved us so many unnecessary fights.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "hilltopj",
                            "body": "I don't even think it's reasonable to have to create a recurrent list of chores for him; that's exhausting and makes it even more like she's his mommy. I have ADHD and yet I can still see what needs to be done around the house to be an equal partner to my spouse. Sure, for one-time or infrequent things I need a list, I create it myself or I ask my spouse to help me add to it. If he needs a list they can make one together the first time but after that look at the list, look around, do the work.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Aromatic-Arugula-896",
                                    "body": "Thank you omg.\n\nLike you're making him a chore chart? Does he get a little star like a toddler when he completes his chores? Jfc",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Skydiving_Sus",
                                            "body": "I mean, it does take a little work to figure out how to get your ADHD mind to work… and whether or not you’ve ever been given the tools, or found the tools, to make it work. I certainly wasn’t, I was just drugged and had to figure out coping mechanisms after I stopped being medicated. \nNow I’ve got a few tricks to create some artificial motivations, frequently artificial urgency, like, needing to get all the dishes in the sink finished before the end of a song. Sometimes there’s a reward involved but frequently that just derails me so I just get a new song and more dishes or move on to the next task. \n\nIf someone with ADHD cares about the problem they’re causing their partner they will work on solutions to the problem. It may not happen immediately, but you’ll see effort. Or the attempt at effort if our brain really gets stuck on motivation bridge…",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "UniqueAlps2355",
                                    "body": "Absolutely,  this. My partner has ADHD and he is a functioning adult who cleans his place. And very attentive towards me as well. It's a choice.\n\nTo OP- run. I was in a marriage that didn't start like that,  but turned into your situation. I was working full time while doing all the cleaning, child rearing, washing,  cooking and yard work plus all the mental load. It's very lonely and sad. He will not change. \nFind someone who will actually care about you and share the load equally.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Aromatic-Arugula-896",
                            "body": "So you have to make him a chore chart...? Wow",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "galactic_cosmos_412",
                                    "body": "I mean if you wanna look it like that, sure. If I want stuff done I ask for it to get done. It's wild what communication can do.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kind-Stranger-2507",
            "body": "He is showing you who he really is, are you ok to live like this for next years to come? Or you want to get out before it gets to a point of divorce? \nI think you know the answer.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Ginger630",
            "body": "You need to talk to him and tell him if he doesn’t start cleaning and doing 50% of the chores (correctly not half assing it), then you’re done. Yeah you don’t want to lose the house, but you’re already losing part of yourself by staying with him. You’re his bang maid. That’s it.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Fickle-Secretary681",
            "body": "Stop being his mommy ",
            "score": 9,
            "replies": []
        },
        {
            "author": "DrAunty",
            "body": "Dump him, then get a house mate to cover the expenses and keep the house. If you've got enough rooms you can even get additional house mates, save money and split the cleaning between you. Just make sure you get house mates that are better at cleaning than your ex, which shouldn't be hard.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Airyfairyx",
            "body": "OP, please for the love of god, stooop allowing this man baby to use and abuse you. You aren’t his mommy, he can look after himself. If he hasn’t taken anything on board after all this time, he definitely won’t start now. \n\nNot all men are like this, you could do a billion times better.",
            "score": 6,
            "replies": []
        },
        {
            "author": "OctoDeb",
            "body": "Take a 5 minute perusal of the sub AskWomenOver30 and you’ll quickly realize that you need to walk away now. These are very clearly red flags.🚩",
            "score": 4,
            "replies": []
        },
        {
            "author": "TomatoFeta",
            "body": "We can love someone, and yet still realize they aren't a person we can live with.  \nAccept that as a truth, and consider your options. Start with communication.\n\n>I’m starting to wonder if it’s some sort of mental issue , he’s not depressed so idek. Or if he is one of those who thinks taking care of the house is a “woman’s job”.\n\n\\^\\^ If you don't know, then ask.",
            "score": 5,
            "replies": []
        },
        {
            "author": "venturebirdday",
            "body": "Get rid of the filthy animal and get a regular person for a roommate to help pay the bills. \n\nHe is who he is.  There is 0 chance that he will be someone clean tomorrow. What are you waiting for?",
            "score": 5,
            "replies": []
        },
        {
            "author": "reginaqueenofgreen",
            "body": "Nope nope nope get the fuck out now. Don't waste another 5 minutes trying to fix a boy who can't and won't clean up after himself. My 12 year old cleans up after himself, does his own laundry, loads and unloads the dishwasher, cooks for himself, etc. There's absolutely no excuse for an adult man to NOT be clean. He sees you as his mother.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SoftwareMaintenance",
            "body": "Oh no. Don't live with a slob. You will spend your life cleaning and picking up after him. This guy is not going to change his habits. There has got to be better guys out there.",
            "score": 5,
            "replies": []
        },
        {
            "author": "forgiveprecipitation",
            "body": "He’s not a partner… he’s a (bad) roommate that uses you for sex.",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "It’s taken you six years to get to this point? You have the patience of Job.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Successful-Doubt5478",
            "body": "So by now, you are exhausted, he is laying around, asking why you don't want to hsmave sex with him ecery day (becsuse he is filthy  and while you are running around cleaning for two, he rests and fantasizes of sex  and watches porn, that is why).\n\nPoor cats.\n\nJust leave. There is nothing for you here.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Careless_Plane_456",
            "body": "Ive discussed this with him hundreds of times. I should have added he grew up with just his mother who taught him zero life skills",
            "score": 15,
            "replies": [
                {
                    "author": "Fairmount1955",
                    "body": "Even if she didn't teach him these skills, he is capable of having eyes and having hands.\n\nPls believe him when he shows you who he is, and ask yourself if this is what you want forever. ",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Vegetable-Cod-2340",
                            "body": "This… there are people who grew up like that and become neat freaks. \n\nHe’s made a choice to remain ignorant.",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Empoweress10",
                    "body": ">Ive discussed this with him hundreds of times.\n\nThis is the red flag, hon and the reason so many women are advising you to leave. \n\nA man who hears you beg and plead for something to change and does nothing is SHOWING you how much respect he has for you, your time, and your feelings.  Believe him. Always believe them when they show you who they are.\n\nSo many of us ignored this red flag and ended up married to men who said things like, \"If you're so unhappy,  just leave.\" \n\nIt is SO MUCH HARDER to leave when there are children and mortgages and marriage contracts involved.  Every woman on here who has been a mommy bang maid in her life is telling you to run before you have any of these three things to deal with. We are telling you to run because this does not get better!! It gets worse. \n\nWork with your landlord to break the lease and look for a roommate situation. You will be so much happier.  \n\nLeaving my marital home and beautiful gardens was heartbreaking.... but it was so freeing to no longer be living in a toxic situation. Living each day felt easier, even though I had to do that living away from the beautiful house I had made a home.  \n\nPlease do not throw more bad years at this relationship.  I'm sure it was beautiful while it was good but now it seems it's run its course.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "bbbbears",
                            "body": "Enter my ex who tried “washing” dishes with cold water and no soap. So since I’m sooooo much better at it, I should just do it. Same with laundry, turned every white I owned gray. Better I just do it from then on! Fucking barf. THEY KNOW.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Skydiving_Sus",
                                    "body": "Yeah, I caught a male roommate using Jetdry to wash the dishes. Because he couldn’t be bothered to read the label. Wasted the whole bottle. And I was wondering why I had to rewash things.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Iwentforalongwalk",
                    "body": "Most women I know taught themselves how to do chores. He's perfectly capable of learning. He just doesn't want to. Stop making excuses for his sorry ass. ",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Careless-Image-885",
                    "body": "He will never learn to do anything for himself until he is left alone to manage himself.  Move out and away from this boy.  He needs to learn responsibility for himself.  \n\nIf you remain in this relationship, you will always be his made and mother figure.  You will grow older being angry and resentful because he will never help.  If you have children, you will be the one that is 100% responsible for the housework, child-rearing and finances.  You will be the one working 40+ hours to juggle paying for everything.\n\nYou will slowly die emotionally, mentally and physically.  Stress and disappointment will be your daily companions.\n\nAs someone else said, either leave or stay and stop complaining.  You have the power of that decision.  Don't be a fool.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Outside_Memory5703",
                    "body": "I had zero life skills, until i learned them on my own. With no nagging from others",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "hilltopj",
                    "body": "The husband of one of my best friends grew up in a household where his mom did everything. Cooking, cleaning, schedules, doctors appointments, everything short of wiping his ass. Yet theirs is one of the most egalitarian relationships I know. She jokes that she had to train him at first, but it took very little time for him to change because he was motivated to be a functional adult and good partner.\n\nI'm sorry but it seems pretty clear your partner values his own laziness over your comfort or happiness. Chalk this up to a life lesson and move on. Hopefully he also learns from the experience but it's unlikely.\n\nedit: spelling",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Djcnote",
                    "body": "Omg my fiancés car is basically at a hoarders status. I actually called off our wedding hecause I know I cannot spend my life with this guy. There’s definitely something mentally wrong with people like that. He’s also a total slob and doesn’t see any problem with it. He could live in complete disarray and mess and trash and dirty dishes and not even care. We just had a kid so breaking up quickly isn’t an option at the time",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Open-Memory2017",
                    "body": "How long are you going to make excuses for him? These are life skills that are very easy to learn on your own. How hard is it to put dishes in the sink, some dish soap and run hot water?  You think picking up dirty clothes and hanging wet towels up is a skill that has to be taught? really??",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Yankees1600",
                    "body": "This is one thing I was going to ask, because these are things that are instilled at a young age. \n\nI understand the frustration COMPLETELY, and as a guy who was never THAT bad but definitely had my “bachelor” phase for a bit after college, it’s a matter of him growing up and recognizing that the world will not cater to someone that doesn’t give a shit about anyone else but themselves. Does he love you? Very likely. Do you love him? Very likely too. But these things already have created some deep resentments and that will either tear you apart personally or destroy any semblance of a relationship. \n\nIf you want to salvage this, it’s time to put away the kid gloves and really get him to understand what he’s doing. Tell him outright, you will not be his domestic servant. Don’t clean ANYTHING of his, not a single dish, jacket, clothing, nothing. Stop making him dinner. Stop grocery shopping for him. Make him put his big boy pants on and understand that he’s not 16 living with mommy anymore. Tough love is the only way this will work and at that point if he doesn’t fix it and grow up, he can’t blame anybody but himself. \n\nI really feel for you here as a man in my 30’s because this probably feels like such a pivotal time in life (and rightfully so!) and he’s actually giving negative contributions to the relationship and your happiness.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CommonDoor",
                    "body": "How has he responded? ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Skydiving_Sus",
                    "body": "There’s YouTube videos for that. Theres even YouTube videos for how to cope with the lack of motivation that impacts people with ADHD if he wants to claim that’s his issue. There are answers, but he’s not going to be inclined to seek them out until he’s got a reason to, and while you do it all, he has no reason to change.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spiritual_Oil_7411",
            "body": "It's been 6 years, and hundreds of discussions.  He's not going to change. Is this how you want to live the rest of your life? Do you think he's going to be more helpful with kids? \n\nSo you love him? Is this how you want to be loved back? This is your first relationship. There's so much out there for you! Please don't tie yourself to this guy. Go out and have fun with your friends. Taste freedom. Enjoy not spending your days working and your nights cleaning up someone else's mess.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JohnExcrement",
            "body": "He has trained you to be the house servant. He has no reason to change. \n\nIf you tell him you’re leaving and he suddenly makes lots of promises to change, he will be lying.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_Vacation_3210",
            "body": "Girl. SIX. YEARS. \n\nThere are good men out there. Leave this one.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Apprehensive_Look94",
            "body": "This is the tale as old as time. Unfortunately, our society has never even considered the idea of raising boys in a way where they don’t end up relying on their future partners to manage their lives for them, emotionally and domestically. This is extremely common. \n\nI’ve been single for a few years but lived with my last boyfriend. It got to the point where I couldn’t take it anymore so I very gently (with the caveat that I wasn’t patronizing him, just trying to help him understand where I’m coming from) took him around our apartment and showed him how I clean and manage everything. So I tell him to load knives in the dishwasher blade side DOWN. The next day I reach into the dishwasher and I get stabbed by a steak knife loaded blade side up. I start to cry, mostly out of frustration, and all he can say is “you didn’t tell me not to load them that way.” No remorse, no apology. He also “cleaned” the bathroom by pouring bleach everywhere, so much so that we had to leave the apartment for a few hours while we let it air out. My boyfriend before that, I had a hysterectomy and was told not to lift ANYTHING for 6 weeks so I asked him just to take out the trash. That’s it. The pile got to 6 bags before I caved, and after reminding him over and over again. \n\nSo trying to teach them didn’t work, begging didn’t work, and letting them live in filth didn’t work. I’ll never try to teach a man how to do these things again so all I have for you is encouragement to break up.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dagalmighty",
            "body": "He doesn't have the maturity to understand that taking care of his living space is something he actually needs to do. His mom didn't teach him and you have enabled him so far. It would probably take an irate male roommate who gets in his face and tells him how disgusting he is, multiple times, possibly multiple roommates, to start to sink in.\n\n\nRight now the life lesson of You Can't Change People applies. You can't change this boy. He would have to be genuinely, for real, on every level, bought in and want to start improving himself before he will be capable of it. He's not there. That's why all the other times you've talked to him about it, he just said whatever it would take to get you to stop talking about it in that moment, whether it was a fully conscious lie that he'll do better or even if he thought he sort of meant it at the time. But he didn't. Actions following those conversations are telling you this change, that you need to be happy, is not important to him, and as long as you keep putting up with it, it'll never happen. \n\n\nYou started as a teen dating a boy, and now you need to leave because you are an adult who cannot be dating someone who's still a child. Leave, let him go on his hero's journey or whatever, and if it's meant to be, maybe you reunite in a few years after he's had time to learn the lessons he needs to learn and grow as a person into an adult who can be a partner. But he ain't there yet, and he'll never get there if you stick around.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rhunter99",
            "body": "Stop being his mom. Sit him down and explain that he needs to get a grip and stop being a slob or the relationship will have to come to an end. Give him the boot and find someone who’s an adult",
            "score": 2,
            "replies": []
        },
        {
            "author": "adamdreaming",
            "body": "He’s ignoring all the work that is unnoticed when it’s done right because that is the definition of maintenance \n\nThe book/podcast Fair Play tackles this problem and has some resources for it",
            "score": 2,
            "replies": []
        },
        {
            "author": "FelineSoLazy",
            "body": "I’ve dated similar before & they went to counseling & took medicine for depression & he was better with cleaning & his habits for a few months but then he stopped therapy & meds (to save money) and it all went backwards. Breaking up was the best thing for my mental health and my future!! I’m happier & know you can be too without this anchor in your life!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Icy_Education_7783",
            "body": "My brother lives with me, he is 30 & I've just had this problem. I tried screaming and shouting, I tried asking politely asking, I tried talking it over with him. And nothing worked. He made a comment, making it seem like I was overreacting. For almost a year, I was doing everything.. making sure my home was clean, doing all of the cooking and cleaning. I already have a toddler and a 17-year-old. I wasn't trying to do everything for a grown man, too. So this week, I changed tactics, I refused to clean up after him, do any more cooking, and refuse to wash his clothes.... This actually worked. Now he cleans up after himself. I'm still working on the washing & and cooking, but I got him to finally clean up after himself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Specialist_Victory_5",
            "body": "Get out. I was married to someone like that for 15 years. It just got worse after we got married.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lola_the_Showgirl",
            "body": "He is lazy because he knows that he can get away with it - you'll clear up after him. He will never change. Go on bedroom strike until he does his share. Is his mum around? What would her take be? I'm guessing she would either think your place is to take over the raising of her son, or she'd be disgusted. If it's the latter, get her involved! She failed to bring him up right, after all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Francl27",
            "body": "He just doesn't care enough to do it. You have to move out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Autodidact2",
            "body": "Well, clearly he's not going to change so you'll just have to leave him and find an actual grown up. You could get a roommate for your house.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Autodidact2",
            "body": "I guess you could make one last ditch effort by showing him this thread?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mollzor",
            "body": "Living alone is paradise compared to this, I swear. Ask him to leave for a week and you'll see how much easier your life would be. Do you want to spend the rest of your life cleaning up after a man who won't clean up after you? Why?",
            "score": 2,
            "replies": []
        },
        {
            "author": "JJC02466",
            "body": "Sorry, OP, he is very very unlikely to change..If you don’t want to do this forever, move on. Make room in your life for someone who has similar housekeeping standards to yours and doesn’t expect you to do it all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "majnbuddha",
            "body": "I know a bunch of dudes like this. You leaving him might actually make him change for the better. Best of luck",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Backup of the post's body: My (22F) long term boyfriend (23M) is slowly pushing me away because of his laziness and uncleanliness. \n\nLong story short we’ve been together since we were in high school about 6 years. I’ve never seen him sweep the floors, use the washer/dryer, fold clothes, take out trash, wash dishes, or clean a surface. But what he will do is leave his dinner plate out, open water bottles everywhere dirty clothes on the floor, jackets are thrown where ever he takes them off, anything he comes home with is thrown where ever he pleases. His office is beyond disgusting and filthy, he can’t even keep his car clean. And with all of this we split bills 50/50. and I feel like more of a mother than anything at this point and it’s really turning me off. I’ve tried everything, said everything that can be said. I’m starting to wonder if it’s some sort of mental issue , he’s not depressed so idek. Or if he is one of those who thinks taking care of the house is a “woman’s job”. I truly love him we’ve been through so much together, we have 3 cats and we rent a home down the street from my family. I cannot afford this home on my own and loosing it would kill me.but I can’t keep playing maid it’s starting to really affect my mental health. What do I even do at this point? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "normandy42",
            "body": "It comes down to what you’re willing to tolerate. Do you see yourself being ok with picking up after this man forever? Even more with kids involved? If not, you have two options. \n\nYou need to sit him down and have a heart to heart with him. Chores must be divvied up appropriately and completed WITHOUT BEING TOLD. Basic things that need to be done like laundry folded and hung, toilets and tubs scrubbed, floors vacuumed, etc. You can’t threaten him with not doing anything because he’s more than likely ok living like a slob. You have to hit him where he can understand what’s at stake. Either he contributes to the household beyond financial means or he will have that house to himself because you will be leaving. That’s really all you can do. \n\nYeah it’ll suck losing the house, but not as much as living in your own prison of being a bang maid and caring for this man child. You think your mental health is bad now? Imagine being legally stuck with him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gnd_flpd",
            "body": "OK, so you can't afford the home on your own, have you considered a roommate situation.  Naw, I don't mean the boyfriend that I presume you still have sex with, but an actual non-platonic person to help go half on the bills, rent, etc.  I'd venture to say at least you could agree with them doing chores and keeping the place cleaner than your slob of a boyfriend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Particular-Try5584",
            "body": "So… you want to be his maid and mother for the rest of your life. \n\nPlease work out how to afford to live without him… and do NOT get pregnant to him. \n\nWhen you are independent of him… *then start making up your mind*… (your post says it’s half made up already)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrickyDesigner7488",
            "body": "Why you still holding on? Time to move on and grow up without him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eastern_Presence_984",
            "body": "Sounds like someone who never had to do chores as a kid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "simplyexistingnow",
            "body": "Honestly you have to look at the person he is currently and not the potential you see from them because that's not who they are. Ultimately they're lazy as fuck and using you. I think there's a lot of things that could be happening here. Some of them might be a little bit of societal expectations and you just taking over the housework because you thought it was expected when it's really not. In this situation what I would do is start planning some sort of exit strategy. Start unmeshing your life. While you're doing this I would also stop doing things like their laundry and see how they act. There's hundreds of videos on YouTube and even accounts that specifically teach you how to be an adult. It takes all of 2 minutes to Google how to use your specific laundry machine if he doesn't know how to use it. While you're separating your finances and hopefully planning some sort of Exit Plan strategy you can see how he acts when there's any sort of push back like you not doing his laundry. Could you imagine if you had children with this person you would literally be doing everything. I definitely think you should break up again you don't have to break up right away you can put plans in place but if you do stay together you still need to protect yourself and your finances.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Egbert_64",
            "body": "Unless you want to spend your life with an immature frat boy, it is time to move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cautious-Choice-3501",
            "body": "Tell him exactly what you've written here, you have become more of a mother to him than a gf. If and when kids arrive it will be worse for you.\n\nTell him to SHAPE UP OR SHIP OUT.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BamaTony64",
            "body": "stop cleaning after him.  when all his clothes are dirty and he has no dishes to eat on he will figure it out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vegetable-Cod-2340",
            "body": "Op, he made is very clear who is he , but give him one last chance. Have a very hard conversation and tell him your at your limit and if he doesn’t become a true partner capable of cleaning and contributing to the upkeep and maintenance of the home .  That this current situation isn’t working for you, it has been stressful and has honestly made you think less of him and has you rethinking your relationship.\n\nOp, you will have to make a decision about this situation, he will either try or he won’t. You need to decide if you’re willing to continue to if he says he’s not interested in changing the status quo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Classic-Delivery3875",
            "body": "He may not see it. Not defending but men are weird. Which is why I taught my boys to clean from very young ages. Literally sat in their bed and told them what to pick up and put back in place. Sounds awful but they are grown and their girlfriends don’t hate me. So maybe just have a convo with him. If he doesn’t change the habit that’s on him.  \nThe other option is ask him if he *ucks his mother. Cause the more you act like his mom Cleaning up after him the less you feel inclined to well ya know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "love_no_more2279",
            "body": "You have to stop doing everything.  You're not his mother and if his mother did/ will do everything for him then let him go home to her.  You will be miserable if you continue this way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooPets8873",
            "body": "The whole point of dating and not being married is that when you find out things about them that you can’t stand and they won’t change - you can leave.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Everything-is-a-Jawn",
            "body": "Echoing everyone saying you have to either accept that you’re his mommy or move on and make space in your life for a man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sanglar1",
            "body": "Reread the story of Lysistrata!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tricinctus01",
            "body": "His other characteristics must be so over the top that these behavioral and emotionally stunted deficiencies pale in comparison.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeeHarperLewis",
            "body": "Make him pay for a housekeeper or move out. Don’t lift a finger for him. He doesn’t deserve it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spectaphile",
            "body": "What you have here is a manchild. And when you leave him, he won’t change. Well, he will, but it won’t be for the positive - he’s almost assured to morph into a hobosexual.\n\nLife is too short, OP. The house you live in isn’t worth your sanity and dignity. Find a smaller place you can afford on your own and live in peace and cleanliness. Hopefully some day you will find a grown man who knows what a partnership is and can and will pull his own weight across the board. Until then, enjoy the lack of filth and conflict. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "MsARumphius",
            "body": "You leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "New-Bird-8705",
            "body": "Dump the pig",
            "score": 1,
            "replies": []
        },
        {
            "author": "FullGrownHip",
            "body": "Not to sound harsh but he hasn’t had a reason to not be messy with you. You clean up everything! Isn’t that nice! \n\nTell him he has X amount of time to start cleaning up after himself - doing all his own chores, or you’re leaving. I’d start looking for apartments you can afford now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TraditionalPayment20",
            "body": "You'll hate your life if you stay. It only gets worse and then you'll be stuck with kids -- and then you'll be in hell.",
            "score": 1,
            "replies": []
        },
        {
            "author": "coolestuzername",
            "body": "I wish I had a solution -- I came here to look for advice in the comments. My son is in the same situation, but with the roles reversed. His GF, fiance, mother of his child, is a SAHM. He works a dangerous job out of town and is gone for 4 days a week. He pays all the bills, and when he gets home, he takes over FT parenting their 6 month old baby so she can rest, sleep at night, etc. She doesn't clean, she doesn't cook, laundry, nothing. Not while he's gone, not while he's home. He does everything, even though she agreed & promised to take care of the house if she was to get to be a SAHM. He's had many conversations with her begging her to help keep the house clean. He's to the point if, of she doesn't start pulling her weight, he's going to leave. Idk what else someone could do.",
            "score": 1,
            "replies": [
                {
                    "author": "Skydiving_Sus",
                    "body": "Has she been checked for postpartum depression? Just, maybe before he leaves, make sure it’s not a brain issue from bearing his child… if she was a functional adult before the kid and is now not.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Skydiving_Sus",
                            "body": "If she wasn’t a functioning adult before he knocked her up, that’s a whole other discussion as to why anyone thought that childbirth would improve that particular trait.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "coolestuzername",
                                    "body": "She's been checked for depression and, no, it's not that. She had a little PP depression and anxiety the first few weeks, like most of us do, while your hormones level out, but her & her doctor said she was all good at around 8 weeks PP. She was also like that the entire time she was pregnant  but wasn't like that before. They're both young (early 20s) and both my son & I thought she'd grow up some after the baby was born. I think it's just a matter of immaturity. She still has to call her mom every time she has a question (not Google, not her fiance... Her mom). Her bank called her a couple months ago to verify transactions to make sure there wasn't fraud on her account. She legit turned to my son in a panic and said, \"They said someone spent $22 at Walmart and they want to know if it was me -- what do I tell them!?!?\" \n\nIDK -- I think it's somewhat due to immaturity, but also, she wasn't like this before she got pregnant. It makes me wonder if she was doing what she thought she needed to get my son to marry her (pregnancy accidentally came first) or if there's something else going on. She told him a couple of weeks ago that sometimes she makes bigger messes on the house and doesn't clean them up on purpose because \"she's tired of hearing him nagging and b-tching.\" Like she does it for spite.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Skydiving_Sus",
                                            "body": "Yeah, I’m not sure why you thought having a baby would mature her. I’ve never had a baby, but from watching my friends go through that BS, it scatters their brains. For awhile. (Part of why asking them to immediately return to work is just bonkers, beyond the whole bonding with your child thing…) but if it’s causing resentment to build up, might should talk to a marriage counselor before that resentment sours the whole relationship. And if she’s acting out of spite due to his nagging, it’s already starting…",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Acrobatic_Camp9609",
                                                    "body": "I mean, must people *do* mature when they're suddenly responsible for a whole other live human being, being 100% solely responsible for maintaining the life of another person. Like if you don't do what you're supposed to, they won't live. That usually has the effect of causing one to acquire more responsibility, accountability and maturity. \n\nI think a marriage counselor would be a good idea also. Sounds like neither of them recognize the resentment that's building.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Skydiving_Sus",
                                                            "body": "I would argue they have the maturity already, even if they’re not focused on having a baby. The mothers who aren’t mature don’t suddenly mature because they’ve had babies. I’ve known plenty of immature parents who barely have their act together. There’s definitely not some chemical reaction that happens that makes responsibility happen. I don’t even know if it is a choice. But if it did just happen that way, there wouldn’t be so many kids in the foster care system. Like, only based on what you’ve said here, being fully limited to your views on the subject and all the biases that come with it… best case scenario is that she’s struggling with focus and getting everything done as a new mom and that’s straining their relationship. Worst case she’s baby trapped him as a hard working man and she wants a place to live and food to eat with only the responsibilities sort of taking care of the baby. The reality is likely far more nuanced.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Acrobatic_Camp9609",
                                                                    "body": "I'm not the person that made the comments you are replying to. Just threw in my opinion.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Correct-Sprinkles-21",
            "body": "You can't fix him or change him. You have to stop playing maid/mommy for him and if you do that may ultimately mean you have to leave the home. It sucks, but you have to have some limit to what you'll tolerate. \n\nHave you actually had a thorough, frank discussion about this with him? If assume so, given you've been together 6 years. But sometimes people have difficulty with communication so if that hasn't happened yet, make sure it does.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Which-Pin515",
            "body": "I get you don’t want to give up yet. Maybe this is an idea: go 25 on the rent and Bills because if he treats you like a maid you should have the salary/benefits as well.\n\nUnfortunately his mom didn’t raise him to be a partner. A lot of women deal with this. They do what they used to do as house wives but work full time on top of that while the men still wait to be served. You want a partner in life and in your house, a teamplayer….\n\nIf you don’t feel respected for what you do you loose respect for him as well….that’s hard to get  back…It would take him to see the light (himself not forced bc it won’t stick) and do a 180",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chay_Charles",
            "body": "He has shown you he is not going to change. Accept him as he is or move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Critical-Advisor8616",
            "body": "You are not his girlfriend you’re his replacement mother. And this is your future if you stay with him. Bitching about him on Reddit is not going to change him or anything else for that matter. You have a choice either accept that this is what your life has become or get out and move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xnatey",
            "body": "Ask him what his issue is if he says I think it's a woman's job then you know. If he says no one ever taught him he can learn. If he says he's exhausted or he wants to but just can't make himself you're looking at something like depression or ADHD but regardless you don't have to stay with him if you don't want to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "00somethingsomething",
            "body": "It doesn’t get better. Your resentment will grow stronger.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MotorCityDude",
            "body": "I've come to realize some people are just like that..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ahoykatieee",
            "body": "Have some self respect and leave him. You are not his mother. Kick him out and get some clean female roommates to help cover rent. Don’t live with another man until you’ve seen proof that they are clean and self sufficient.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gdognoseit",
            "body": "This is who he is. He won’t get better, he’ll just get worse.\n\nIs this how you want to live for the rest of your life?\n\nBreak up and move on. He doesn’t respect you or care about you.\n\nYou’re his bangmaid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Excellent-Remote480",
            "body": "Pay for a maid charge him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItJustWontDo242",
            "body": "Get out now. Don't cling to this relationship because you feel you have to due to the amount of time you've been together. He's not going to change and way too many women fall into the trap of having to take care of man-cbildren like this. Go see what else is out there. Never settle on the first guy you date in high school. Especially when he's a lazy ass like this one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrsMorley",
            "body": "Your boyfriend is like the man in letter 507. Please leave. \n\nhttps://captainawkward.com/2013/08/22/506-507-it-is-2fucking0fucking1fucking3-so-why-is-it-so-hard-to-divide-up-household-chores/",
            "score": 1,
            "replies": []
        },
        {
            "author": "TelevisionMelodic340",
            "body": "Have you talked to him about it? I'm guessing yes, and that he still hasn't changed.\n\n\nAt this point, he has shown you who he is, so believe him. He wants a mother to look after him, not a partner, because he doesn't want to have to adult. \n\n\nStop doing anything for him. Do your own laundry, make your own meals, wash the dishes you use - but nothing for him. Don't pick up a single sock. Tell him, very clearly, that you are not willing to live like this for the rest of your life, so he has 30 days to demonstrate some effort. No change, you leave. \n\n\nDon't make the mistake of thinking you can make him change if you just keep trying. He has to do it. If he doesn't, that tells you everything you need to know about whether he values your relationship or not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Miggumsoohg",
            "body": "Nope. Be done",
            "score": 1,
            "replies": []
        },
        {
            "author": "Original_Kangaroo131",
            "body": "Smack his face and say bitch clean after you or your out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kairiste",
            "body": "KICK HIM OUT, get a roommate.\n\nor...\n\nMOVE OUT.  Take the cats.\n\nEnough of catering to a manbaby.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RevolutionaryPool118",
            "body": "Being with someone since high school keeps y’all from growing up as your own people. He’s still a high schooler and you’re more of an adult - women also mature faster. High school relationships do not often last for this and a myriad other reasons. You’re so young! Don’t you want to explore yourself and live your own life not picking up for a a grown child?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adee53",
            "body": "Get rid of him! He’s a lazy man and he is using you as a free housemaid and bang maid. All the work you’re doing for free he would have to pay a housemaid real money for all those. Leave his lazy ass and find a better man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "same0same0",
            "body": "What’s the most f’d up common comment in these threads is saying to stop being his “mommy” bc had he actually been parented correctly he’d have much better hygiene habits :| I’m so sick of these GenX/millennial mothers raising absolute slobs who have to be reminded to do basic chores. After a certain age (I’d say 12/13) your kids DONT need reminders to do their chores they should just do them and be expected to. Half assed parenting is the root issue here his mom likely did do everything for him up until now. It’s embarrassing and sad how low standards are for (mostly men) when it comes to basic house manners.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ill_Fix3959",
            "body": "Please take your cats and leave, don’t leave them with him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Reasonable_Gas7676",
            "body": "Do you want to deal with that for the rest of your life?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlucky-Captain1431",
            "body": "Wake up to the fact that you’re incompatible. This will be your life forever if you stay together.",
            "score": 1,
            "replies": []
        },
        {
            "author": "writekindofnonsense",
            "body": "Post a big sign that says if it's on the floor it's trash. then throw all his clothes away. Now you don't have to do laundry. Same with dishes, leave his there. Wash the stuff you want to use and let him figure it out. Stop begging for him to be an adult, just let him live with the consequences of his own actions. Will it start a fight, yes. But that's where this is headed anyway. Don't continue to be angry about having to do everything when you can just stop. If it gets really bad crash on your parents couch. Buy him a vacuum for his next birthday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PassComprehensive425",
            "body": "He traded his mom for you.  She took care of all this stuff before and he doesn't feel he has to change because his dad didn't. Why should he? Unless you want to add the burden of raising your kids by yourself, run already.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beneficial-Nimitz68",
            "body": "Not cutting down his family, but I bet mom did it all for him and he does not know how or does not want to because he knows someone else will do it for him",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Beneficial-Nimitz68",
                            "body": "Now I am unsure who is answering lol..\n\n23M should clean up after himself or hire a maid.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PlasticDangerous1493",
                                            "body": "OP should definitely leave you. From the sounds of it you need mental counseling",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "VFTM",
            "body": "You break up. Or resign yourself to the life of being his maid. \n\nThere aren’t magical words that are going to change who he is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fearless-Wall7077",
            "body": "Break up with your boyfriend",
            "score": 1,
            "replies": []
        },
        {
            "author": "Helpful-Guest-1890",
            "body": "You should get a maid and use his money to pay for it. When he sees you're not going to do all the housework and he's paying for it either way maybe he'll wake up. Either way it's not on you to do it anymore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few_Celebration3148",
            "body": "So, i’d like to say, I was similar to this but not as bad from the sounds of it. I grew up in a family of 11. It was always so chaotic around the house. On certain days we had chores. Growing up I had to cook dinner once a week. Dishes twice a week. And regular household chores varied from day to day. Being raised this way it set me in a habit of just waiting for chore day. I moved out when I was 17 and lived with friends till I was 22. When I finally got my own place I was working around 50-60 hours a week and doing laundry or dishes after work just never worked for me. I would go all week without doing the dishes or laundry. I wouldn’t leave my plates or bowls around the house I would always bring them to the kitchen. But forget wiping down the counters or anything like that till Saturday came around.  Fast forward to 25 my girlfriend moved in with me. We have a child together and I make good money so she is a stay at home mom. We clashed heads on my ideology of waiting till the weekend to do chores. We had several arguments about said subject. It took me a long while to break the habit of leaving my dirty clothes in the bathroom and not rinsing my dishes after I’m done with them. I always figured. “Well I make the money so she can handle the chores” absolutely not. It took almost losing her for me to wake up and realize I’m not a child anymore and putting things off for another day is just setting yourself up for failure. Fast forward to me being almost 27 I can’t imagine going back to living like that. Having a made bed to crawl into and a clean kitchen to cook breakfast and prepare my lunch in makes all the difference. She still handles a lot of the day to day but I definitely make an effort to help out as much as I can. We sat down together and talked about it several times. Went through all our bad habits and came up with solutions for them. It took us about a month to find a routine and stick to it. My point being. If you really love him you’ll bring this to his attention, talk it out, and compromise on a solution. If he doesn’t get himself together and make an effort. Just leave. You’ll waste so much time and energy trying to get him to take care of the house with you. If he can’t change then he isn’t who you should be with. If he can’t clean up after himself what do you think will happen when you want help with a project around the house? Find yourself a man. Not a little boy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outside_Memory5703",
            "body": "You know what you need to do but you’re too comfortable to do it\n\nThis situation is so common as to be laughable",
            "score": 1,
            "replies": []
        },
        {
            "author": "chippy-alley",
            "body": "You've got 6 years of being a bangmaid behind you, and youre only 22. \n\nDont waste any more time. Dont play head games of only doing your half of the work. Ive never seen or heard of a single story where tactics worked long term or lead to happiness where total slobbery was the problem\n\nIn my case, I saw very short term change that inevitably backslid to exactly the same. I was made to feel my unstable emotions were the problem 'but you stopped being in a bad mood'",
            "score": 1,
            "replies": []
        },
        {
            "author": "verucka-salt",
            "body": "Why are you with him? This is on you; he has proven to be slovenly, lazy person.  Ugh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Yellow-6576",
            "body": "He’s lazy af! I don’t know why you’re still there?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarsupialMaven",
            "body": "Unless you want to be his mommy, you leave and find a grown up man. If you marry and have kids you will be a single mom with one big expensive baby who will never grow up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lonly25",
            "body": "Stop doing his laundry, Stop cooking his meals. Stop having sex with him.  Let it all crash and burn.   If he doesn’t get it.  Move on. \n\nIt’s now or never",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpecialModusOperandi",
            "body": "Have you had a serious discussion  about his level of hygiene and lack of life skills?  What has his response been?\n\n\nAdded: Consider not living together - you got together when you were quite young. Take some time to find out who you are without him and what you want from a partner.  It sounds like he needs to think about this as well, but also learn to be a responsible adult.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeniedAppeal1",
            "body": "It sounds like you're realizing one of the many reasons why a lot of high school relationships fail.\n\nIf you've said everything there is to be said (telling him to clean up his messes), then it's time to let him go because you're not compatible (or, rather, he's incapable of taking care of basic household necessities, which makes the two of you incompatible).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Echo-Azure",
            "body": "Lots of relationships and marriages end this way, OP, men refuse to do their share of chores, because they think it's \"not my job\".  Which makes it their partner's job.\n\nIn relationships like this, the old question \"Are you better off with him or without him\" is painfully easy to answer, because with a partner who won't lift a finger around the house, you're infinitely better off on your own!  Hours of work less to do, source of stress removed, no hard work of yours undone by a slob...",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigredroyaloak",
            "body": "This is why many women get a good career going so they don’t have to depend on a man child.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kelleehh",
            "body": "This guy will never change and sorry but you’ve enabled it even further. Just leave. I was in a similar relationship in the past and my life improved immensely after leaving. I actually get angry with myself sometimes when I think of how I let it happen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FishermanLeft1546",
            "body": "His only mental problem is his immaturity and sense of entitlement. He’s shown that he’s unwilling to evolve. He’s going to keep on being a slob, he’s not interested in helping you make your house into a home. \n\nTime to cut him loose. You’ve spent enough of your youth with him, now go concentrate on improving yourself and your own life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarialeegRVT",
            "body": "He may want to get evaluated for ADHD. It's extremely difficult for us to perform basic tasks like cleaning and hygiene because it can cause executive functioning challenges. For me specifically, it is sometimes next to impossible for me to do basic tasks like cleaning up or organizing. He may not be simply a \"lazy person.\"",
            "score": 1,
            "replies": [
                {
                    "author": "Skydiving_Sus",
                    "body": "There are still strategies to employ. I’ve got a whole laundry list of things like ADHD, Dyslexia/Dyscalculia, there’s one with too many symbols about ordered listed and I’m just like why would you name it that when I’m gonna have zero chance of remembering it…\n\nGamifying your dull tasks is one of the biggest ones. Race a song to finish a task, or race someone else who’s doing a similar task (if you have two ADHD people… “I can finish the kitchen before you fold that massive laundry pile.” Suddenly you’re each researching techniques on how to speed up the tasks in hopes of winning.) scheduling everything seems to help a bit because I don’t form natural routines, everything is a conscious effort so if something’s not consciously present, I’ve gotta make an effort to make it present. Alarms can work for awhile, but I will get alarm fatigue and start missing them… or the act of using my phone for the alarm causes me to get distracted on my phone instead of doing the task… there are challenges that come with these disorders, but there are ways to overcome them if you make an effort… though that gets harder when it’s compounded with depression… gamifying can sometimes help with that, but sometimes you just need meds…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "stinkyminky7",
            "body": "Picture your life with this man for the next 10 years, if you see yourself loving your life then try to work it out, but if you see yourself being drained by this man.. perhaps leave. You never need a reason to break up with someone and you only have one life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cautious_Beyond_4084",
            "body": "Fuck this relationship. Eventually his blatant sloppiest and laziness will kill you. Save yourself, child, and leave. Your not his personal servant. Fucking LEAVE.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Open-Memory2017",
            "body": "He’s been like this for six years. He has no interest in changing. You can either live with it or leave. If you choose to stay with him and build a life with him, you will have no help when you have children. It will only get worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Something-funny-26",
            "body": "Expecting someone else to clean up your mess isn't just disrespectful it's downright insulting. Get rid of this AH.",
            "score": 1,
            "replies": []
        },
        {
            "author": "katz1264",
            "body": "you are his mama. move on",
            "score": 1,
            "replies": []
        },
        {
            "author": "karmic_stardust",
            "body": "This is exactly why I ended up kicking my bd out of my house. They don’t change.",
            "score": 1,
            "replies": []
        },
        {
            "author": "elizacandle",
            "body": "So.... One thing you should learn now...\n\nYou can only *DO* what  *YOU* can do",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aromatic-Arugula-896",
            "body": "Girl stop wasting your time??? Do not marry this lazy dude and have kids with him. \n\nYou marry the person, not his potential...",
            "score": 1,
            "replies": []
        },
        {
            "author": "witchbrew7",
            "body": "What keeps you coming back for more from him? What do you get out of this relationship? There is a sunk cost fallacy you may be dealing with. “We’ve been together for years! We live together! It would be so devastating to break up!” \n\nNo it wouldn’t. You would live a life more peaceful and content. You would have room and space to let someone in your life who acts like an adult.",
            "score": 1,
            "replies": []
        },
        {
            "author": "swiggityswirls",
            "body": "You have to stop talking and you have to stop accepting answers instead of action.\n\nIf words between you two were not possible, what would you do? What would you do to convey that you are DONE picking up after him?\nAnd what should a good partner do in response?\n\nBasically, translate your actions and his actions into words. You are signaling that you are unhappy but by your actions of cleaning up after him you are telling him you will fuss but you’ll still take care of him. Like it’s quirky fun. You’ll just bend over and keep taking care of him, sometimes more angry. Maybe someday you’ll stop badgering him and just quietly clean up.\nMeanwhile he is telling you through his actions that it doesn’t matter what you say, feel, want, or need, and he gets to be as messy and disgusting as he wants and the process he pays is to just tolerate some verbal chiding sometimes.\n\nYou’ll understand that actions HAVE to back up words? Stop talking and make some actions. Make actions that communicate that you are done. Grow a backbone and stick to your guns. THIS IS UNACCEPTABLE and this is it. This is the consequence of him choosing to disrespect you.\n\nPlease please open your eyes. Don’t let the love feelings trick you into servitude and an unhappy life. You can find fun feelings again one day either with this one when he shapes up, or another one who will not behave in this way. \n\nBut talking is done. Nothing happens when you talk. You know it. He knows it. Nothing you can say can convince him to change, so now let action show that he must do or be done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HarleyDaisy",
            "body": "Why are YOU dating a slob??",
            "score": 1,
            "replies": []
        },
        {
            "author": "reefered_beans",
            "body": "It will never get better. Choose what you want to do with that information.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordGreybies",
            "body": "If you're like me, the resentment will eat at you until you dump him/meet someone else who just makes things *easy* and you'll be mad at yourself for wasting 6 years with a slob. Ask me how I know",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bulky-Inevitable2613",
            "body": "You will absolutely regret it if you stay with this man. Thousands if not millions of women before you are begging you to leave. He has shown you he will not change for you. Unfortunately this is not a lesson you can teach him by staying. You have to leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cool_Relative7359",
            "body": "Don't stay with this man. You will be miserable. If it bothers you now it will build up untill all you feel is resentment and you wont even have the memory of the love you once had.  I should know. I can't even think of my wasband or hear his name (which is sadly relatively common) without feeling a bone-deep sense of overwhelming  disgust. \n\nGet a friend who can afford to be your roommate and wants to if you want to keep the lease and talk to the landlord about how to go about transferring it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bigtgamer_1",
            "body": "I have issues with this, maybe not to his extent of uncleanliness, because I'm fucking depressed as shit all the time, and life feels absolutely meaningless. That being said, I don't have a partner, and haven't for around 13 years because I don't think it would be fair to them. Not that I could get a partner if I tried.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InflationQuiet8349",
            "body": "Reinstate your boundaries.  \nTell him you love him, give him that extra reassurance, because hes absolutely expecting you to react negatively, thus is more ready to be defensive. \nBy opening the door with a compliment/ mental support, he's going to be more willing to hear criticism and  process it as much less of a threat.\nFollow up the problem with how you relate, maybe what issues you struggle with or know might bother him. \nThis way you're not coming off as 'better' , as clearly he knows this isn't right, but you're doing it anyways, therefore being called out is \"getting caught\" which no one likes that feeling. 'Getting caught being a crappy/lazy person 'as an adult just reinstates the parenting style relationship you want to avoid.\n\nMention fixing your issue to help him (even if the issue isn't a real issue, just something that might even mildly bother him) and either do said thing within the next two days to give him some competition, or straight up offer a deal with him that you'll do better if he does. Maybe even make it real with an embarrassing punishment for whoever fails the plan first. \n\n Men love competition; it makes things register in their brains as active priority. It will retrain his brain for empathy .\n\nDon't forget to give him those compliments when he does start cleaning- thankful impressed ones, not sarcasm :) \n\nThis is purely a suggestion, not a solution, everyone is different. My credentials are that Ive been with my guy 10+ years. This was the only way my husband finally clicked one day that I don't like to throw away his wrappers as much as he hates my bathroom countertop morning mess. \n Relationships come with weird focus changes and communication growth. Sometimes, especially with typical male brain, repetition becomes comfort and the empathy or drive to adult just simply disappears .  \n\nEveryone here is right, he and most every guy I know, should be able to just do adulting stuff and clean up after themselves. But we also know how brains all work differently, and a lot of man-style brain is so wired around habit and \"the next new thing to distract the brain\", sometimes the important information and priorities get pushed and need a little dusting off with emotional support fueled with competition.  Simple thoughts.\n\nApologies if this comes off as sexist in any way, just speaking from experience.😭🥲❤️\n\n\nMy example:\n\"You're such a good man, Im so grateful to have you in my life! The only thing id change is how long you let your dishes and trash sit. I love you, but I do not love your mess. Babe, absolutely I can't keep cleaning up after you (specific issue here). It's a make it or break it for me, seriously, I need to stress on this fact that I'm absolutely over doing this.\n\nTell you what, I know my bedroom clothes pile bothers you; I'll try to be better at my upkeep with that if you can maybe promise to pick up after yourself better? We can make it a fun competition if you like, you can even pick the punishment for the loser!   \n That could be really fun.  I just know having a cleaner place will help with both of our anxiety and we can have people over without feeling weird about our mess, because there won't be much of one! I could see you showing off this place to your friends more, too. Do you think we could do something like that ? \"\n\nIf its a positive response, chances are itll stick longer than the typical discussion about how crappy it is to adult .\n\nBest of luck!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ghjkl098",
            "body": "He isn’t going to change, because he doesn’t want to. You have grown up but he hasn’t needed to because you are mothering him. What you need or want simply isn’t important to him. Please have some self respect and move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedditMiniMinion",
            "body": "What do I even do at this point?\n\nBreak up! Why? He doesn't see his filth and uncleaniness as a problem. He is unwilling to change as there is no problem for him. It's as easy as that. He's not going to change. You thus either have to put up with his sh$t or dump his a$$. There's no miracle solution I'm afraid...",
            "score": 1,
            "replies": []
        },
        {
            "author": "SingaporeSlim1",
            "body": "You’re young. Move on and find an adult to date. It’s not that big of a deal to break up",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pizzaisbae13",
            "body": "He thinks cleaning is a woman's job???? Is he Archie Bunker??\n\n\nIf he honestly thinks that, I'm curious what his response will be when the crew of Hoarders or a Hazmat team comes by to condemn the house.",
            "score": 1,
            "replies": []
        },
        {
            "author": "trippysushi",
            "body": "How does he get clean clothes if he never washes or dries them? Is it because you are doing all of it for him? Has he ever had to deal with the consequences of not having any clean clothes?",
            "score": 1,
            "replies": []
        },
        {
            "author": "WaterWatch8",
            "body": "This will be your life forever. He's not incapable.... he just doesn't want to. He doesn't care about the same things as you or YOU enough to chance his behaviors. Dump him. Find someone who has the same standards as you, or cares enough about you to keep up with your standards.",
            "score": 1,
            "replies": []
        },
        {
            "author": "k-boots",
            "body": "If you stay with him, get married & have kids then you will be doing EVERYTHING by yourself. I’ve seen this happen too many times now. He won’t change and you will waste your life being upset that you married a child.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brief-Bend-8605",
            "body": "He is content on being a pig in a pigsty and has shown you that for years. \n\nBelieve him. \n\nYou will forever be the maid. I’d dip. Let go of your high school romance already. \n\nDate a man who can clean up after himself; do basic chores —-not an irresponsible and disgusting man child.",
            "score": 1,
            "replies": []
        },
        {
            "author": "adiboxer",
            "body": "My wife always says it's sexy when she sees me do house chores. Especially mopping lol. I've always been a clean person and kept my homes clean. When she first met me and saw my apt for the first time she thought a female lived there because of how clean and nice it was lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "garde_coo_ea24",
            "body": "I gave birth to one of those. We aren't slobs, he was taught to clean after himself. Once he hit the teens, it was like pulling teeth to get him to pick up after himself. He's almost 30 and hasn't changed. It's a mental disorder I'm sure and a whole lot of lazy too.\n\nA few times Id kick start the clean, and a month later it's back to the same old. I don't know how you met yours but mine will never marry like this. This makes me sad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seamon3y",
            "body": "Give him an ultimatum",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaiderNationBG3",
            "body": "Taking responsibility for your side.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Organic_Cobbler8012",
            "body": "If taking care of the house is the “woman’s job” then paying the bills is the “man’s job”. He wants you to do everything while he barely does anything. Even if he wasn’t raised with someone who will do everything for him, he found someone who will and likes it. You can try to appeal to his senses and if he loves you and he’s interested in doing better for you, then he will. But if he’s not, there’s no reason to stay trapped in this relationship. You’re young. I understand you’ve been together for a long time and it feels like a shock to move on, but you don’t want to get trapped in this kind of relationship. If he won’t change now, he definitely won’t change later once you have kids. Like many others have said, DO NOT GET TRAPPED. the more intertwined your life is with his, the worse it will get and the harder it will be to leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "pookapotomus2",
            "body": "Leave. They don’t get better. My first husband and I dated in high school and got married prior to living together. If we’d lived together even a month I would have dumped him immediately because he was like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "norfnorf832",
            "body": "It doesnt get better girl leave now and enjoy your 20s",
            "score": 1,
            "replies": []
        },
        {
            "author": "bopperbopper",
            "body": "Idea\n\n1get a big giant Rubbermaid bin and anything he lies leaves lying around be it coats  or cups you just throw in that bin… or just throw everything in a big garbage bag and put it in his office.\n\nBecause you have to make this, his problem, not your problem .\n\n“ I’m not saying you’re a horrible person. I’m saying you’re acting like a horrible person. It seems that you weren’t raised to clean up after yourself, but I assure you if it’s not me the next person you want to be in a relationship we have this exact same expectations. Ask some of your friends if they wash dishes once in a while or put their stuff away.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "L0rdH4mmer",
            "body": "Man needs to live alone for a few years to learn that. I'd say tell him you'll walk away unless he learns to get his shit together within the next two weeks or sth.\n\nThat being said, I myself am kind of shit at keeping things tidy. What did I do? Got a half-shitty robot vacuum, set it on a daily schedule. This mf will choke on cables, tissues, socks, whatever. So you'll have to keep the floor tidy every day and while you're at it, it's easier to also keep the rest clean. Tzat being said, it requires a will to change things and it doesn't seem your man has that. Don't pick up after him, lets\n him clean his own stuff up himself (be annoying af in doing so) and if he can't even do that, find someone who can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReasonableCard1",
            "body": "I've been really lazy",
            "score": 1,
            "replies": []
        },
        {
            "author": "whatweworked4",
            "body": "Omg break up! Dont marry the person you liked when you were a child in school. It'll be a divorce by 25.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting_Note_937",
            "body": "If you marry this man it’s no one else’s fault but your own",
            "score": 1,
            "replies": []
        },
        {
            "author": "Martha90815",
            "body": "He is showing you exactly what you can expect if you spend a long amount of time in a relationship with him. He is lazy and does not contribute to the upkeep of the home, and he's not going to start it either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WildBlue2525Potato",
            "body": "At this point, the relationship dynamic is set. He knows he can get away with not carrying his weight and you tolerate it. So he has no motivation to change, to put the effort into being a better partner. \n\nHe's all hat and no boots and is going to stay that way. He has made that more than abundantly clear. \n\nI'm afraid that your only choice at this point is to walk away. Make your exit plan. Rehome your kitties if you must. Set up new bank accounts if you need to. Get your name removed from any existing credit cards and open new accounts in your name only. Save your money. Separate finances. Begin packing up things and put them in a storage unit if you have to. Look for accommodation you can afford. Perform all the maintenance on your vehicle so it's in the best shape before you leave. Then leave. And be sure to let the landlord know to remove you from the lease if you are on it. \n\nYou will have a hard time at first, especially emotionally.  He's probably going to be really upset, say he'll change and so on. Be aware that any change he makes will be highly temporary and an insincere gesture to ensure his own comfort having his \"mommy\" and bang-maid back. \n\nGood luck 🍀 and there are better and happier days ahead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Mix-6550",
            "body": "You'd be better off to find a roommate to help share expenses and get rid of him",
            "score": 1,
            "replies": []
        },
        {
            "author": "BenedictineBaby",
            "body": "I'm confused, does he just buy new clothes and eat take out?",
            "score": 1,
            "replies": []
        },
        {
            "author": "cozkim",
            "body": "As someone who put up with ridiculous relationships when I was young I can unequivocally say this: \nIf you stay in this relationship, when you get older, you will wonder why on earth you put up with such an unequitable relationship. You will look back and feel both compassion and sadness for the younger you, and a little bit of anger too that you didn't value yourself more, that you didn't feel you deserved more, and that you wasted so much precious time with someone like that.  When we are young we put such a high priority on being in relationship, but there are so many things that make a happy life. And, the reality is, you get what you put up with. Value yourself more, expect more, and demand more and you will get more. Men don't fully respect women that let them run over them, or that do not require equality.  They value women that value themselves. You putting up with his behavior for so many years has taught him that he does not have to treat you as an equal. While it is true he may have learned that growing up, you have in reinforced it.  You are so young  And, you have the vast majority of your life ahead of you.  If this guy doesn't straighten up dump him and find someone who will treat you the way deserved to be treated.  The future you will be so grateful that you smartened up when you were young.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FragrantOpportunity3",
            "body": "You don't help around the house when you live there.  You share responsibilities taking care of your home.  I don't know how you've put up with this slob for 6 years. Don't marry him and don't stay with him just because you like the house you live in and can't afford it by yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkHistory3944",
            "body": "I'm married to *this guy* in his mid-40's.  It doesn't change just because he got older.  It also doesn't change because you have kids, more free time due to career growth, or buying a really nice home we should have pride in.  If he's a nightmare to live with at 23, he will still be a nightmare at 43.  This knowledge is my gift to you.  Please use it wisely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReginaPhilangee",
            "body": "So. Some men really don't see things like that. This is true. Especially if mom always took care of them and now girlfriend is. My husband didn't at first and he's a really good man. This is normal for any adult just learning how to be on their own. \n\nBut. Men (just like any human) can be taught. If shown things and told things, he should be able to change. Of course, it won't be immediate, but you should see a real, true effort. No one is perfect, but you should be able to tell that it is important to him. If you have spoken to him and he is capable of understanding what you are saying, then the bigger issue is how responds to you and your needs. He is showing you right now how he will respond to any need you have in the future. If he told you something that was important to him, even if you didn't care about it at all, would you make an effort to meet that need? This man clearly does not see your needs as important. \n\nWhen I met my husband, I was a bit more mature. I had an 8 year old and had been living on my own for years. He was my age, but had only been on his own for a little while and had no children. We had a lot of conversations about things like this. If I cook and plan the meal, I appreciate not needing to do the dishes. If I have to make you list, I might as well just do it on my own, since it's still my chore. But whenever I talked to him, he listened. There was a lot of \"i didn't realize all of that went into it.\" Of course, it wasn't perfect. And he has a hard time generalizing so it felt like I had to tell him things that were obvious to me. And there were a lot of things done wrong (by both of us, I was still learning, too). But I could tell he was making an effort. This has been true for other things in our relationship, as well.",
            "score": 1,
            "replies": [
                {
                    "author": "MrsMorley",
                    "body": "“Men (just like any human) can be taught. If shown things and told things, he should be able to change”\n\nBut it’s not on a 22 year old girlfriend to teach her 22 year old boyfriend. They’re the same age. ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ReginaPhilangee",
                            "body": "No. It shouldn't be. But the way most of society raises boys does not prepare them for life as an equal partner to a woman. We don't really prepare our girls for equal partnership, either. We just prepare them to do all of it. That's why so many women get into this kind of relationship and stay for long periods of time. How many women are on this sub asking this question because they have been raised to think this was normal and can't tell if expecting a grown ass adult to act like a grown ass adult is overreacting? \n\nWe don't know what we don't know. \n\nOf course, op is not obligated train him. She could choose not to and that's completely OK.  Op sounded like she wanted to fix things, but now that I re read it, that may just be because she doesn't want to lose the house.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MrsMorley",
                                    "body": "“Boys are raised that way” doesn’t really help the OP.\n\nShe wants out",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ReginaPhilangee",
                                            "body": "Yeah. After rereading, it looks like the only thing she'll miss is the house. For some reason, I thought she didn't want to leave him, but it sounds like she won't miss him at all. And rightfully so, as it seems that the only thing he brings to her life is half the bills.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TicoSoon",
            "body": "You created the problem, you fix the problem. \n\nYou've taught him that you're his bang maid. Stop doing his laundry. Put dirty dishes on his side of the bed. Throw out anything left on the floor. (If that's too far for you, dump it in trash bags and leave it outside.\n\nBut do not lift a single finger for him. No cooking, no cleaning, nothing.\n\nNOR/NTA unless you continue this pattern.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FewSplit4424",
            "body": "Rather than rushing to end it, you may be able to give the “either you change the messiness by being responsible for your messed or I change it by leaving.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "sezit",
            "body": "What's missing here is what he says when you point out this problem. Does he say he will get better? Does he throw a fit or pout? Does he say \"this is me\"? \n\nOr have you never discussed this? \n\nWhat I bet is that you have addressed it, and he has *lied* about improving. \n\nPay attention to what he **does** more than what he **says**. \n\n\nThe fact is that he knows you are unhappy, and he doesn't care. He will not change. \n\nDump him, and don't go 6 years with the next guy who lies about what he will do and takes advantage of you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slight-Mechanic-6147",
            "body": "I mean, you could try, you know… talking to him about his slovenly ways. You haven’t indicated you’ve spoken to him - just speculating on what’s going on. \n\nRelationship pro-tip:  always try communicating with your partner before bringing it before Reddit. You’ll get better information straight from the source.",
            "score": 0,
            "replies": []
        },
        {
            "author": "kitsunegarden",
            "body": "Hey ! I’m the guy she’s talking about , what OP doesn’t want to tell you is that I recently lost my job and fell into a bit of slum looking for another job , yes I was feeling horrific the whole time and yes I let stuff pile up , but what she doesn’t want to tell you is how verbally abusive she is on a daily basis ! She threatens to cheat and that she should go f*ck other guys at work , ext , this is exactly why I do nothing , beside what I need done , I’ve tried to leave her multiple times and she refuses , threatening to cut , threatening to blackmail me , even to the point she blocked me from leaving by sitting in front of our door , she slams , breaks , and destroys so much stuff , I now found a much better job that has the potential of making over 6 figures easily and plan on paying my remainder of the lease and going elsewhere , but the problem is , she can’t afford the house by herself !!! , i work 55+ hours a week trying to provide so we BOTH can have a better life , she talks about my family like there trash , meanwhile my grandmother let us live with her while we got out of high school , she’s incredibly two faced & insecure like I’m cheating on her , meanwhile I’m more focused with work then anything \n\nShe wonders why I got her nothing for Christmas , it’s because I literally seen texts of her degrading and bashing me to people and her family ! , when I’d never do that to someone I care about \n\nThen she wonders why I don’t take her out on dates , she’s incredibly embarrassing in public !!! \n\nI’m iterating trapped in my own home with a girl who plays victim , any insight anybody ?",
            "score": 0,
            "replies": []
        },
        {
            "author": "meverygoodboy",
            "body": "Have you tried discussing it with him?",
            "score": -5,
            "replies": [
                {
                    "author": "nallaonreddit",
                    "body": ">I’ve tried everything, said everything that can be said.\n\nI think she covered that..",
                    "score": 9,
                    "replies": [
                        {
                            "author": "meverygoodboy",
                            "body": "I mean no, if she discussed it she'd at least have whatever he thinks his answer to the situation is. She says she has no idea why he does what he does, so obviously there's been no discussion",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "nallaonreddit",
                                    "body": "That's a lot of assuming you're doing there...I've met people like OP's boyfriend and they never have an answer to give because they don't want to take responsibility. Not everyone opens up when talked to, some people are like a brick wall for their whole life.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "meverygoodboy",
                                            "body": "Well my first step to resolution would be discussing it, if that doesn't work then it's obviously not compatible. She clearly seems like she wants to resolve it so I would attempt to discuss it as a first step",
                                            "score": -6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Iwentforalongwalk",
                                    "body": "The why is irrelevant. It doesn't matter. ",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "meverygoodboy",
                                            "body": "If she wants to try and fix it then yes it matters, if she doesn't want to fix it then obviously it's irrelevant because she's already made the decision to leave. \n\nIf she had made the decision to leave she wouldn't be here talking about it, so obviously the why does matter since it's the first step to finding out how to fix it",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Iwentforalongwalk",
                                                    "body": "She's not a psychologist. It's not her job to fix his problems.  Get that through your head.  Its putting the responsibility on her. I repeat. It's not her job to fix his problems. ",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "meverygoodboy",
                                                            "body": "Good Lord people are so aggressive here lol, calm down\n\nShe came asking what to do next and I suggested she discuss it, don't put whatever past trauma you have on me for typing a comment",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Empoweress10",
                                                                    "body": "It's a societal trauma for women because we have ALL been in a situation where we have been asked to do the emotional labor required to \"fix\" men's problems....usually unsuccessfully.  \n\nIf she's talked to him about how unfair his behavior is and how unhappy it makes her and he still makes no effort to change it, then it really does not matter WHY he's doing it! \n\nThe only thing that truly matters is that he doesn't care enough about her feelings to make behavior adjustments.",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Iwentforalongwalk",
                                                                            "body": "Right? That guy has no clue. What a doofus ",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Empoweress10",
                                                                                    "body": "He doesn't have a clue. He doesn't have the lived experiences of women.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Iwentforalongwalk",
                                                                    "body": "Good lord.  People are dismissive and mansplainy here. Calm down lol and try to understand your point of view is very different than that of women who are always held responsible for fixing men rather than them fixing themselves. ",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Automatic_Bed4591",
            "body": "Dude lives a life I can only dream of !",
            "score": -4,
            "replies": []
        }
    ]
}