{
    "title": "Over my marriage 22F 42M",
    "author": "Secure_Rock_3834",
    "subreddit": "TwoHotTakes",
    "rank": 15,
    "score": 472,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 499,
    "url": "https://www.reddit.com/gallery/1jdiu3q",
    "id": "1jdiu3q",
    "selftext": "Hello, I’m exhausted by my marriage and all of the things that have transpired. I’ve pleaded with my husbands to adjust or to compromise to find a resolution. He would agree, then go right back to doing it. Not honoring our agreement, this lead to our fights, and they became physical at some point and he even blamed me for his actions. His family continues tell him it isn’t his fault, and I doubt I’ll ever get an apology for his behavior ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for submitting to the Two Hot Takes Podcast Subreddit! We'd like to remind you that all posts are subject to being featured in an episode of the Two Hot Takes Podcast. If your story is featured you'll\nget a nifty flair change to let you know and we'll drop a link so you can see our host's take on your story.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "luella27",
            "body": "You’re giving him WAY too much information. He’s a manipulator, he’ll use anything you give him against you. Stop engaging and get away from this man.",
            "score": 940,
            "replies": [
                {
                    "author": "Cisco-NintendoSwitch",
                    "body": "I wish somebody had told me this when I was in a toxic marriage. I never understood that being detailed when defending myself just gave them things to twist.",
                    "score": 230,
                    "replies": [
                        {
                            "author": "TheLoneliestGhost",
                            "body": "It took me a while to figure out that’s what was going on, too. He changed so drastically after being together for 2 years that I honestly thought he was going through some kind of medical issue. Nope.",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "BergenHoney",
                                    "body": "How are those things related?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Cisco-NintendoSwitch",
                                                    "body": "I am indeed a male DV victim.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CoffeeChocolateBoth",
                    "body": "OP... STFU with him! NC, none, be quiet! You want to play with his emotions as he's played with  yours, but you're playing a very dangerous game with a man who may likely come after you and either beat you half to death, or all the way to death! THINK!!!! You don't have to win a fight with him, you've won simply by getting out of this mess you're in!",
                    "score": 101,
                    "replies": []
                },
                {
                    "author": "DreadPriratesBooty",
                    "body": "Runnnnnnnnnnn and never look back. This isn’t love. It’s manipulating and abusive. Get that annulment, hell file a restraining order while you’re at it!! Things like this escalate all too quickly, with things like isolation and physical abuse.",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "laydeebug1678",
                    "body": "Yep. \n\nGray rock, gray rock, gray rock. \n\nThen GTFOT.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "mf_dcap",
                    "body": "This. Good luck lady. Better times are ahead ❤️",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JulieWriter",
            "body": "He's 19 years older than you are and he's abusive. He's love bombing you right now. I think you know what you need to do. What do I need to say to encourage you to get out?\n\nAlso, stop telling him your plans. Don't threaten divorce - it's not a negotiating tactic. Get your ducks in a row, get some money that he can't access, lock down your credit, and get your personal documents and keepsakes somewhere safe. Get a lawyer. Make an exit plan.\n\nTell your friends and family what is happening. Be honest with them.",
            "score": 2357,
            "replies": [
                {
                    "author": "Vegoia2",
                    "body": "wonder how old she was when she met him? groomed?",
                    "score": 518,
                    "replies": [
                        {
                            "author": "hhamzarn",
                            "body": "Likely he couldn’t change his ways but he could change his audience to one that was more impressionable and tolerant of his bullshit.",
                            "score": 244,
                            "replies": [
                                {
                                    "author": "hhamzarn",
                                    "body": "You are in a very unsafe situation and it will only escalate from here. In fact, one of the most dangerous times for a woman to leave an abusive relationship is when she’s finally ready to leave. Statistically speaking, I believe the only situation that makes it more dire for the one enduring abuse is when she gets pregnant. The abuser automatically gains a sense of “locked in” control but also fights with feeling a sense of competition with the unborn child. Do NOT get pregnant. A lot of these people, with enough advanced warning, will do everything in their power to start a pregnancy so you feel like leaving is impossible. \n\nAbusers also have a cycle they adhere to. First they lure you in with an over-the-top honeymoon phase. Jewelry, fancy dinners, flowers. All of this is to distract you from who they really are and to how they are slowly isolating you from your core support system. Then, once you’re alone and more vulnerable, they start showing their true colors. They mock you, they gaslight you, they cross every reasonable boundary you have set… when it finally reaches a boiling over point and you start maneuvering your way toward an exit, they relaunch the honeymoon cycle and rope you back in. \n\nThe age disparity here is also alarming and most definitely by design. This man’s tricks stopped working on his peers so he found a younger person who would be easier for him to manipulate. Less love experience. Also still used to “adults” guiding your actions since you just entered adulthood. How quickly did you two get married? Likely it was a whirlwind pace so you wouldn’t have time to figure out who he really was while it would have been easier to disengage with. \n\nPlease, OP, leave and don’t look back. And stop telegraphing your next moves. Let your lawyers speak for you. Turn off your location on any apps that he can use to track you. Set up a private bank account and funnel any small amounts you can to endorse you leaving. Buy gift cards for grocery stores and other staple locations that you can do without raising his suspicions. You are a survivor. Start thinking like one.",
                                    "score": 196,
                                    "replies": [
                                        {
                                            "author": "Soft-Following5711",
                                            "body": "Exactly.  Stop telling him what you are going yo do. This is very dangerous.",
                                            "score": 80,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ok-Report-1917",
                                            "body": "I wish I could upvote this 1000 times more!!!!",
                                            "score": 32,
                                            "replies": []
                                        },
                                        {
                                            "author": "rocket_racoon180",
                                            "body": "THIS!!!",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "AdEuphoric5144",
                                            "body": "Read this over and over!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CoffeeChocolateBoth",
                                    "body": "YEP!!!! Those his age would have nothing to do with him. If she doesn't think he's always  been a douchebag, she needs to speak to his exes!",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bhimtu",
                            "body": "His use of language is so immature, you would never know he's over 40 yrs old.",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "Significant_Meal_630",
                                    "body": "He talks like a teenager who thinks he sounds cool . \n\nBaby ! Baby !!\n\nGag !",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Bhimtu",
                                            "body": "Has no intention of changing & if you notice, ends with the typical weaponized incompetence of, \"you don't love me\". No, that's not the point, but now he's gonna blame her for their problems.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bunny_bard",
                            "body": "One does not need to be underage to be groomed, so long as there is a power imbalance. Without knowing more about how they met and his treatment of her initially it is hard to say, but it is possible, even likely given the love bombing noted here.",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "Rogue_bae",
                            "body": "Shes 22 now. She’s still being groomed.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "its_ash_14",
                            "body": "I didnt even read the texts. I saw the ages and thought the same thing!!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "JulieWriter",
                            "body": "Me too. Ugh.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Nicholeleta",
                            "body": "Wondering the same thing",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CoffeeChocolateBoth",
                    "body": "I think OP is wanting the upper hand because she's never had it, but she is putting  herself in a very dangerous situation by telling him any of her plans! She needs to go NC with him. No text, no phone calls, no late night visits where he'll beat the hell out of her and maybe even kill her!",
                    "score": 75,
                    "replies": []
                },
                {
                    "author": "crazykim79",
                    "body": "Op — When people show you who they are - especially over & over again - believe them!!!!  Words are just his way of dismissing his actions.  You’ve seen his actions, they repeat & repeat. Now believe what you see and act on it. \n\nBecause let me tell you, the reason he keeps talking is because he believes what he sees from you - you keep letting him get by with it. So he keeps talking until you comply. He has absolutely no reason to change. Rinse and repeat. \n\nSo believe it, act on it….or just keep taking it. Make a CHOICE.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "CanadianJediCouncil",
                    "body": "Honestly, telling someone like this “I’m going to divorce you *tomorrow*” is (in their abusive mind) making the, think “I have 24 hours to ‘stop’ a divorce from happening, *however I can*.”",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "jamestiberousjlkirk",
                    "body": "Great advice! \nTake it from a mature male he wont change..",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "No_Housing2722",
                    "body": "I agree with this. Stop making idol threats and get out. \n\nYou've put him notice by telling him and he could get worse.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "ShoddyButterscotch59",
                    "body": "Yup.... usually that type of age gap equals someone wanting someone they can easily manipulate and control.  There's exceptions to everything, but she's getting what seems to be the norm in massive age gap situations.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "JulieWriter",
                    "body": "And thanks for the award!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "nazuswahs",
                    "body": "This is the best advice. ⬆️. Take care of yourself.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Sweet_Bitch_Pie",
                    "body": "I wish someone had shared this advice with me.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ScaredVacation33",
                    "body": "Can agree with this 100% having survived an abusive narcissistic idiot. Move in silence and stay the course of the break up. He ain’t worth it and you deserve better",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Individual-Contest54",
                    "body": "He is a flaming NARCISSIST! Run!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IMAGINARIAN_photos",
            "body": "There’s a reason he doesn’t date women his own age: they’re onto him and his immature/violent behavior. Grown up women have far less tolerance for wasting years of their lives on these hopeless losers. Just quietly disappear. Do not discuss it with him. If he raised his fists to you already, imagine what he’ll do to prevent you from leaving!",
            "score": 252,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 26,
                    "replies": [
                        {
                            "author": "CoffeeChocolateBoth",
                            "body": "He will always pick #3!!!!",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 371,
            "replies": [
                {
                    "author": "toadstoolberry",
                    "body": "it’s very much gotten to the point where as soon as i see the age gap like that in a post i just don’t bother reading the rest of the context. like that right there is the problem, i don’t even need to read anything else to be sure",
                    "score": 114,
                    "replies": [
                        {
                            "author": "CoffeeChocolateBoth",
                            "body": "Yep, my former sister in law was 13 and going out with a 23 year old, at 14 she got pregnant by him, lost that baby, at 15, she got pregnant again, they got married. At 17 she had another baby! He was horrible to her and the kids, never once hit any of them but would get so drunk he'd destroy the home he'd remodeled more times than I can count! And the kids, they were terrified, they'd hide under their beds when dad came home drunk, screaming he'd kill all of them, punching holes in the walls, taking hammers to things he'd beautifully built!  She stayed! They got divorced! She moved out! She got pregnant by a married man, she went back to her ex husband when the married man told her he wanted nothing to do with her or HER kid! The ex helped raise that child as his own, treated that one better than his other 4, yes four, he was married with children at the time when he was messing with her at age 13!!   \n\n\nThey're still together, not remarried, he doesn't drink as much, the grown kids still hate him, the affair baby is so emotionally messed up, they all are, and they don't like her much either for staying with that abusive A.H!\n\n Here they are, him 76, her 66, in the same house, but never together. Relationship made from abuse and the grooming of a 13 yr old girl! It's sickening!",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Purple-Warning-2161",
                                    "body": "Just to be clear- your 13 year old sister was not dating a 23 year old, she was being groomed by him.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "CoffeeChocolateBoth",
                                    "body": "Nope, that's still too young for a 50 year old!",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Puzzled_History7265",
                    "body": "YES!",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Vegoia2",
                    "body": "she trying to teach an old dog a new trick, aint happening, he married someone too young for this reason...he thought.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "CoffeeChocolateBoth",
                            "body": "Let's hope she figured this out and stops talking to him, causing him anger which will in turn be unleashed on her! She's not as mature as she thinks she is if she doesn't know she needs to STFU now!!!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CoffeeChocolateBoth",
                    "body": "When a young person says, they're mature for their age, I say, just wait, you'll realize you were not mature for your age, when you finally reach maturity! She is trying to get there but will she? Or will she stay with him and end up another statistic?",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Mysterious-Coyote442",
                            "body": "No one over the age of 25 ever has to justify anything by saying “but I’m mature for my age!” And no one is telling people 25 and older that they’re “mature for their age.” That phrase is literally only to manipulate children and inexperienced (and likely immature) young adults.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DokCrimson",
                    "body": "Well, I would say they probably have the same level of emotional maturity butttttttt she’s obviously surpassed him by a significant margin…",
                    "score": 5,
                    "replies": [
                        {
                            "author": "CoffeeChocolateBoth",
                            "body": "Or trying!!! I hope she goes and stops antagonizing him, he's going to go off the deep end and her life will be held in his hands around her throat. She really needs to wake up!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MajorYou9692",
            "body": "WTF are you even talking to this creep for he's old enough to be your bloody father, leave this relationship and find someone age appropriate that will love you and treat you with the respect you deserve ,I wish you well...",
            "score": 158,
            "replies": []
        },
        {
            "author": "ChannelEffective6114",
            "body": "He is pushing for children so you can never fully leave. He is abusive and double your age. Your therapist's one and only advice for you was \"leave\". Run.",
            "score": 63,
            "replies": [
                {
                    "author": "Rogue_bae",
                    "body": "Yep, men baby trap women more than women baby trap men",
                    "score": 14,
                    "replies": [
                        {
                            "author": "ChannelEffective6114",
                            "body": "Actually yes. Because men don't have to go through pregrancy, give birth to a child or take care of it. It is enough to have sex once, and they gain access to someone's life for 18 years.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Remarkable_Ebb_8340",
            "body": "Life advice for women from a man- when you're young and he's a lot older, it isn't some fairytale fantasy. He's older and single and targeting someone younger because he's narcissistic and none of the women his age want to deal with him. There isn't one well intentioned dude on the planet that goes after a girl who could be his daughter. Date and marry in your own age bracket. If you're 22, you shouldn't even look twice at a guy who's 30+, let alone 40+. All it means is women their own age can see through the bullshit you can't yet.",
            "score": 121,
            "replies": [
                {
                    "author": "HappyTangerine1853",
                    "body": "100% facts! I'm a 32F who has most recently dated men who are 10-12 years older than me but I've attracted older men since I was 10 (whole other story!) \nThese older men were by far the worst relationships that I've had: bitter, critical, insecure, stuck in their ways and controlling. And somehow I was the emotionally mature one with each of them. There's a reason these men are single at their age and the more experienced older women know it. \nI cannot express enough how much I do not recommend younger women to date much older men! 38 and emotionally healed is my ceiling now lol.",
                    "score": 30,
                    "replies": []
                }
            ]
        },
        {
            "author": "Poop__y",
            "body": "The age gap is alarming. I'm glad you're leaving.",
            "score": 137,
            "replies": [
                {
                    "author": "suhhhrena",
                    "body": "Oh my god I thought it said 22 and 24 for some reason. I am now realizing this is a 42 year old man treating OP like this. Yuck yuck yuck. That makes this infinitely worse 🤢🤢",
                    "score": 36,
                    "replies": []
                }
            ]
        },
        {
            "author": "TallTacoTuesdayz",
            "body": "Didn’t read the texts. Don’t marry old men at 20.",
            "score": 131,
            "replies": [
                {
                    "author": "froggaholic",
                    "body": "Especially when they're 20 YEARS OLDER THAN YOU",
                    "score": 41,
                    "replies": [
                        {
                            "author": "suhhhrena",
                            "body": "I can’t imagine being married to a 40 something year old man when only two years ago I wasn’t legally allowed to drink 😭 like girl he’s old enough to be your dad!!! That’s not sexy!! One day you’ll look back and be so embarrassed you married this man :(",
                            "score": 27,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DrSnidely",
            "body": "I don't have much to say about the situation. I couldn't follow it because I couldn't figure out what order the screenshots were supposed to be in.",
            "score": 59,
            "replies": [
                {
                    "author": "cscottrun233",
                    "body": "The age difference immediately put me off",
                    "score": 26,
                    "replies": [
                        {
                            "author": "DrSnidely",
                            "body": "Yeah I saw that and figured I didn't really need to read it anyway.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SmallMortgage9946",
                    "body": "dude exactly i was so confused , but there’s definitely a lot being left out",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "fire_ice23",
            "body": "Leave him. He doesn’t have to agree with you for you to end the marriage. He will never change and if you keep forgiving him all you are telling him is that even when his behavior is unacceptable all he has to do is wear you down until you forgive him then he can go back to his poor behavior. If he’s gotten physical with you and his family is still condoning his behavior then there are demons in his familial closet that you don’t want to be a part of. Could you imagine having a daughter with this man or worse your future kids ending up with a man like him? \n\nYou are 22 and he is 42 (not even gonna go into what a big red flag that is)you shouldn’t be more mature than he is.",
            "score": 28,
            "replies": []
        },
        {
            "author": "rototheros",
            "body": "Oh lordy, in 20 years you’ll see how outrageous it is that a 40-something would be with a 20-something for the right reasons. These should be the best years of your life and you will never get them back, don’t let this guy steal them away.",
            "score": 26,
            "replies": []
        },
        {
            "author": "heirbagger",
            "body": "**Baaaaaabe. No. Run. All the red flags.**\n\nAnyone that can’t take accountability after the fact is not someone to be in a relationship with. \n\n#**ANY RELATIONSHIP THAT HAS DV IS NOT WORTH HAVING**",
            "score": 29,
            "replies": []
        },
        {
            "author": "JackieRogers34810",
            "body": "Well, that’s gross",
            "score": 21,
            "replies": []
        },
        {
            "author": "juliaSTL",
            "body": "men like this pick young girls because they have less life experience and are easier to manipulate. women their own age can see the signs a lot faster. good on you for recognizing what's really going on here before you were stuck with a few kids. now get the hell outta there!",
            "score": 21,
            "replies": []
        },
        {
            "author": "Next-Drummer-9280",
            "body": "There is a REASON men like him go after women half their age.\n\nIt's because 40-something women won't put up with his shit.\n\nDO NOT procreate with this fool.\n\nTake the advice you were given and stop giving him more chances.\n\nLEAVE.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Pretty_Goblin11",
            "body": "For fuck sake this has to be rage bait because you can’t be this… naive and easily manipulated?   \n\nHe’s 42 can’t regulate his emotions, is insecure, violent and begging to impregnate you despite you very clearly stating how unhappy you are. His argument is he likes dogs so he can be a good dad? And then the cherry on top is that you’re basically a child in comparison.   Like you’re barely legal…. Grossss age gaps are gross for a reason.   Now mentally he does seem about 17 but is that really what you want out of your husband who is due for a midlife crisis any minute… like…  please leave and get some therapy for what ever insecurity or issues led you to be with an old abusive man.  \n\nOver your marriage ? How old were you when you got married to already “be over it”.",
            "score": 47,
            "replies": [
                {
                    "author": "LadyGlitterTryhard",
                    "body": "Yeesh, let’s add insult to injury in the name of “helping”.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Secure_Rock_3834",
                    "body": "21",
                    "score": -22,
                    "replies": [
                        {
                            "author": "Pretty_Goblin11",
                            "body": "That is so very sad to me.   You are young and have a whole life ahead of you. Love and marriage shouldn’t be like this.  Please please please don’t get pregnant he is trying to trap you",
                            "score": 38,
                            "replies": []
                        },
                        {
                            "author": "ItJustWontDo242",
                            "body": "I'm guessing you fell into his arms because you did not have a good childhood and were looking for a way out. I wish girls like you would consider an education and a career as an escape plan rather than marrying a creep.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "No-Silver-8968",
                                    "body": "THERAPY, an education, and a career plan as an escape plan",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "bornbylightning",
                                    "body": "Abuse doesn’t just happen to people who have had bad childhoods. It can happen to anyone. \n\nOP, get out now. You already have a career and you have your whole life ahead of you. Please leave him. It will not get better. I’m so sorry you’re going through this, but you don’t have to live like this. Leave. Make a plan to get him out of your house and have someone stay with you. Keep yourself safe and get away from this man before he ruins your life. I know from experience how hard it is to leave and how much you want to believe he can change. He won’t. It’s just words to keep you trapped. \n\nI wish you the very best and I hope that you find the strength and power you have within you to save yourself from this man. You can do it. You will look back and thank yourself for getting out. You do not want to have kids with this man.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Mean-Divide1079",
                                    "body": "oh!! what a take. what an interesting thing to respond to this post. Your perspective is sooooooo great :)) WOW!! let me guessss, you’re a victim blamer? coool cool cool cool. OP ignore this\ndipsh!t.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "Secure_Rock_3834",
                                    "body": "What? I have a career, I literally hold a bachelors and I’m currently getting my master. I own a home, I didn’t need him.",
                                    "score": -42,
                                    "replies": [
                                        {
                                            "author": "BookishBitching",
                                            "body": "You will understand when you're older. That's not patronising, it's just the truth. Every woman who was with a much older guy when they were 18-25 looks back when they reach the age of the older guy with absolute revulsion and disgust. If you don't need him, leave. Leave, leave, leave. He's a loser.",
                                            "score": 59,
                                            "replies": []
                                        },
                                        {
                                            "author": "Pretty_Goblin11",
                                            "body": "That’s all fine and good but SOMETHING was missing for you to fall prey to this man.",
                                            "score": 35,
                                            "replies": []
                                        },
                                        {
                                            "author": "ItJustWontDo242",
                                            "body": "Then why are you still entertaining him? Just block him and move on if you don't need him. There's a reason why you're chasing daddy.",
                                            "score": 43,
                                            "replies": []
                                        },
                                        {
                                            "author": "kaldaka16",
                                            "body": "So why did you marry him and why are you staying with him? What benefit does he bring to your life? Is anything he adds to your life actually positive enough to outweigh the total bullshit?",
                                            "score": 17,
                                            "replies": []
                                        },
                                        {
                                            "author": "SunShineShady",
                                            "body": "Absolutely leave him and get a divorce. Stop giving him attention with all the texting. Ignore and block him. He’s just feeding you BS. He’s never going to change, he will say anything and everything just to get you to stick around for more abuse. \n\nThere’s nothing wrong with being divorced, in fact I’ll bet you will find it a lot more peaceful than being married to that abusive asshole. You should have done it a while ago, but today is a great day to start. Get a lawyer.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "beaglemomma2Dutchy",
                                            "body": "But you married him!",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "Late-Champion8678",
                                            "body": "So why stay? What’s the plus side here?",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "ReaditSpecialist",
                                            "body": "No offense, but how do you have enough money own a home at only 22 years old?😅",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Secure_Rock_3834",
                                                    "body": "My mother gave me the money for the down payment",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Efficient-Plant8279",
                                            "body": "Girl you should stay with him.\n\nOtherwise his next prey may be 19 years old, and we would 't want that would we. At least YOU have a job and a degree, surely you can see right through his BS.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "cscottrun233",
                                            "body": "You own a home because of your mommy. Not because of any of your own hard work.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Secure_Rock_3834",
                                                    "body": "Yes, I’m absolutely thankful.. so..",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "cscottrun233",
                                                            "body": "That’s good! But it’s not really brag-worthy. Getting your own place on your own accord is. I mean what 42-year-old man is going to feel comfortable moving into his 22-year-old girlfriend’s house that her mom bought her.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Mean-Divide1079",
                                                                    "body": "Ummmmmm. weird that you felt the need to comment this out of everything you heard… but really really great points :))? \n\nI also hate when someone tells me a fact or provides context, and I can’t help but feel weird about it bc how dare they?? and just neeeeed to remind them how inferior they are because that’s the most important thing!!! You ate, TOTALLY!! I bet you are really really smart and kind !! \n\n(OP ignore this guy, the two brain cells being used are not reliable source)",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cscottrun233",
                                                                            "body": "I’m not a guy but your tantrum is noted✨",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Mean-Divide1079",
                                                            "body": "That is amazing!!! Not being financially dependent is great and makes this divorce much much easier. Getting support from your family to build your future is amazing and not something people should be shaming you for??? You don’t need him! GREAT!! The right person will be someone you don’t need, but want to spend your days with. THAT is a sign of a secure and healthy relationship. \n\nIf you didn’t have a house they would say “you just went for him for his money or blah blah blah” and say you should’ve not try to take “the easy route by marrying an older man”… it’s all the same misogynistic rhetoric being regurgitated in different fonts. \n\nITS ALL A BS! If you were a man, and it was your dad helping you out (lol small loan of a million dollars) they would say that was great way to build family wealth and a great kickstart for YOU to expand on. It would be a pat on the back for getting property already. \n\nHonestly, you seem like a great woman with a kind and genuine soul and assume the best of people. Lovely trait that people WILL take advantage of. \n\nDon’t loose that but also DO NOT ignore when your assumption is proven wrong. consistently. Now it’s time to trust yourself, your gut, the voice in your head. SHE is your person. Do not ignore that voice, you will always regret it. That’s your intuition and your ancestors SCREAMING the answer. Listen🫶🏼",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Technical_Ball_8095",
                                            "body": "It would be really weird if you were totally healthy and happy when you married a much older abusive man at 20 when all your peers are still partying. Perhaps strong religious influences? ",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Organic-Willow2835",
                            "body": "Friend, please stop allowing him to manipulate you and just get out of the marriage. Speak with an attorney and file for divorce. Move on with your life. Stop communicating with him. Mute his texts. Just because he texts does not mean you must respond.\n\nHowever, DO tell your family, your friends and everyone around you that you are leaving your abusive marriage and you need them to help you get out.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Inevitable_Block_144",
            "body": "Yeah. I'm 39. He lost me at his second text. \n\nOne day, you'll regret those precious minutes you waisted replying to his texts. He's not going to see reason.",
            "score": 13,
            "replies": [
                {
                    "author": "MeetObvious8164",
                    "body": "Exactly. I left an abusive relationship 6 years too late. Get out NOW OP. You're still so young and have so many years ahead of you. Don't waste them on this POS.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BzhizhkMard",
            "body": "You may not be safe. Leave now.",
            "score": 11,
            "replies": []
        },
        {
            "author": "VFTM",
            "body": "A 42 year old woman would laugh in his face and give him ZERO further chances. \n\nHes only pulling this with you because you are half his age.",
            "score": 12,
            "replies": []
        },
        {
            "author": "No_Respond_3488",
            "body": "He’s 42 and still doesn’t have a family and going after girls 20 years younger? It’s a sign that something is wrong with him",
            "score": 11,
            "replies": []
        },
        {
            "author": "Angryboda",
            "body": "The only good thing about dating a man that much older than you is they are supposedly emotionally mature. \nIf he isn’t, why are you with him?",
            "score": 24,
            "replies": [
                {
                    "author": "eetraveler",
                    "body": "Maybe she is looking forward to 20-30 good years by herself after he dies of old age??",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "CoffeeChocolateBoth",
                    "body": "There is no reason to date someone that much older than you! People who do, have issues! BIG issues!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Parking_Ad_4601",
                    "body": "This!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "nagato36",
            "body": "20 years older and abusive color me surprised",
            "score": 11,
            "replies": []
        },
        {
            "author": "SignificantMatter771",
            "body": "I'm tired of posts like this  Hes old and manipulative(not to mention abusive). Literally everyone from professionals,, family to internet strangers are telling you to end it. Leave immediately or stfu. ",
            "score": 10,
            "replies": [
                {
                    "author": "leddik02",
                    "body": "Agree with this.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "excludingpauli",
            "body": "As a 44M happily married for 20 years to a 40F (you know, appropriate age difference). Your husband is a creep and I assure you that well functioning men in his age range will agree with me that being in your 40s and married to someone who is effectively still a child is about the biggest red flag you can fly. You need to get away from him.",
            "score": 27,
            "replies": []
        },
        {
            "author": "four_roses",
            "body": "I was in this situation once. Thank GOD I didn’t marry him, but you’re younger than I was when it happened to me, so please accept my advice along with all the grace and compassion I can offer.\n\n\nI understand why you married him. But I also understand why he married you, and your reasons were very different from his. He does not have good intentions. He does not have your best interests at heart. He doesn’t respect you. \n\n\nLet me say that again: he does not respect you.\n\n\nHe is actively manipulating you. You are not safe. Please get somewhere safe immediately. Don’t go home after work, or don’t be there when he comes home from work. If you have to be there when he is, take a trusted person with you. Get your important documents and any sentimental items you can carry. He may hide or destroy them. He will beg and plead and threaten you to try to keep you from leaving, and once it becomes apparent that it’s not working, he will get violent. That’s not speculation, he absolutely WILL get violent. He has before, and he will again. It will only get worse, especially now.\n\n\nGet out of there, immediately, and take everything you NEED with you. File a police report if he does anything that warrants it, and file one for each instance of DV that has already occurred. Go back to get the rest of your things with a police escort. ONLY with a police escort.\n\n\nGo to a relative’s home, a friend’s home, or a women’s shelter if he’s already succeeded in isolating you from your support. Lock down your finances. Do not speak over the phone or face to face. Screenshot all of his text messages. If you have any shared expenses, start unraveling yourself from them. For example, if you’re on his phone plan, get your own.\n\n\nFile for divorce. Yes, it’s expensive. But it’s much cheaper in the long run than staying with this man.\n\n\nNow that you’ve given him advanced warning that you’re filing (!!!) he will try to prevent you from leaving by any means necessary. Don’t count on him staying at work all day. Get out now. And please update when you’re safe.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Fun-Yellow-6576",
            "body": "Get out now, no more talking or texts. There’s a reason a 42 y/o man married you when you’re 22. It’s because women his own age would have seen right through him. File for divorce now. If you took his name, take yours back.",
            "score": 7,
            "replies": []
        },
        {
            "author": "dunkinbikkies",
            "body": "Your 22, the beginning of your life, he is 42 and really at the \"should be chilled\" age and clearly isn't. (He sounds like a child)\n\nJust leave him,  honestly don't even think about it anymore.",
            "score": 8,
            "replies": []
        },
        {
            "author": "FullBlownPanic",
            "body": "*gasp* an age gap relationship where the older partner is manipulative? cOLoR mE sUrPRiSeD\n\n\n\nGirl - this is a tale as old as time. Run.",
            "score": 22,
            "replies": []
        },
        {
            "author": "itsokaydude",
            "body": "girl….",
            "score": 7,
            "replies": []
        },
        {
            "author": "nuki6464",
            "body": "Why would you even marry someone 20 years older than you. That screams red flag 🚩",
            "score": 7,
            "replies": []
        },
        {
            "author": "annierockaway",
            "body": "48 hours??!! You better start sharing location with someone who will care if you go missing.",
            "score": 6,
            "replies": []
        },
        {
            "author": "hogger303",
            "body": "Codependency is a real problem",
            "score": 5,
            "replies": [
                {
                    "author": "IT_techsupport",
                    "body": "> Codependency\n\nMy dumbass read this as \"code dependency\" (kind of applicable I guess)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nicalawgurl",
            "body": "Honey this man is a walking red flag. Please show yourself how much you’re worth and leave him asap!",
            "score": 5,
            "replies": []
        },
        {
            "author": "queenswithswords",
            "body": "Don't marry men old enough to have a daughter your own age.\n\nThere's a reason why those types sniff around girls in their late teens/early 20s.\n\nThere's a long line of failed relationships in their own history and women their own age learned to back away from that garbage when we were your age.",
            "score": 5,
            "replies": []
        },
        {
            "author": "WashclothTrauma",
            "body": "There’s a reason women his age do not want him. That is all.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Creepy_Ad5354",
            "body": "Get the annulment, before it’s too late and you have to deal with divorce proceedings. I promise you, you won’t regret this.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Patient_Meaning_2751",
            "body": "He is 42.  If he hasn’t learned how to treat a woman by now, he ain’t gonna start now.",
            "score": 4,
            "replies": []
        },
        {
            "author": "NoeTellusom",
            "body": "This man is nearly twice your age and that almost never works, because there's a reason women their own age refuse to be with them. He's manipulative, abusive and emotionally unstable. \n\nPlease get out and get a divorce.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Adventurous_Exit_835",
            "body": "he was 22 when you werent even born.... do people think anymore. When i was 26 i went on a date with a 21, holy fuck my brain melted in my skull. Your brain hasnt even fully developed.",
            "score": 5,
            "replies": []
        },
        {
            "author": "jcradio",
            "body": "The thing you need to know about narcissistic people is they do not change. By not leaving you are reinforcing his behavior.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Katydidnot58",
            "body": "Ugh. This makes me tired. 1) He’s manipulative.  2) He has a history of this behavior and it has fallen into a pattern.  3)He has more compassion for his animals than he does for you.  3 strikes, time to leave.",
            "score": 4,
            "replies": []
        },
        {
            "author": "anonymouse12222",
            "body": "One day you will be the age he was when you met. You will then look at people who are your age now and you will never be able to imagine being attracted to them romantically.\n\nThat’s when you’ll understand he was always manipulating you. \n\nBet he doesn’t hang out with males your age - has nothing in common with them.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SavyBae",
            "body": "Not reading this…you married a old man 😂😂😂everyone knows why old dudes date younger",
            "score": 4,
            "replies": [
                {
                    "author": "CK_5200_CC",
                    "body": "Yeah bloody predatory manipulators",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Most-Oil-1340",
            "body": "As a woman in an age gap relationship, neither of you are mature enough to be married. Holy shit.",
            "score": 10,
            "replies": [
                {
                    "author": "Secure_Rock_3834",
                    "body": "What? You’re hilarious. You’re condoning abuse? Hmm.",
                    "score": -17,
                    "replies": []
                },
                {
                    "author": "Most-Oil-1340",
                    "body": "No, he’s absolutely an asshole and shouldn’t be mistreating you.\nDid you hurt your shoulder reaching that hard?",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "No-Quiet-8956",
                    "body": "Explain how they said abuse is ok?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "cinnabunzxx",
                    "body": "You’re the one condoning it lol\n\nHmmm",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Backup of the post's body: Hello, I’m exhausted by my marriage and all of the things that have transpired. I’ve pleaded with my husbands to adjust or to compromise to find a resolution. He would agree, then go right back to doing it. Not honoring our agreement, this lead to our fights, and they became physical at some point and he even blamed me for his actions. His family continues tell him it isn’t his fault, and I doubt I’ll ever get an apology for his behavior \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 3,
            "replies": []
        },
        {
            "author": "asyrian88",
            "body": "Love bombing incoming, followed by some classic DARVO.\n\nMove on. This ain’t it, OP.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ckm22055",
            "body": "He is the \"prince charming\" that doesn't exist. He begins the relationship with a loving and caring man. You told him about your past relationships, and you gave the road map for her future behavior.\n\nWhat I mean by road map is he knew how to get you to fall in love with \"perfect prince charming.\" He knew what you needed and gave you that and more. Then, bam, he has you in his net. He knows what you will accept after committing to him.\n\nThen, the real monster can come out. He knows he can abuse in any way he wants, and all he has to do is apologize, and he will never do it again. Then, here comes the prince charming you fell in love with. Then, slowly, once you are happy again, Prince Charming disappears, and here comes the moster.\n\nI think you finally realized that Prince Charming never existed. He has shown you who he is, and he will never change bc he has a routine down to a science. He gaslights you into believing that you did something or didn't do something, and that made him continue to abuse you. You twist yourself into a pretzel to make him happy.\n\nKeep listening to the professionals and not him. He is a liar!\n\nRun and keep running like your ass is on fire.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lola_the_Showgirl",
            "body": "He's a fully grown man. He's not changing. How long have you been together and how long married? There's something wrong with a 42 year old man with a 22 year old wife, you know...",
            "score": 3,
            "replies": []
        },
        {
            "author": "Prudent_Worth5048",
            "body": "Before I even saw the insane age gap, I assumed this loser was like 20. He’s way too old to be acting like that. Just leave! Find someone your own age.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Litlitmcgee",
            "body": "As a 22 year old, ew, why??",
            "score": 3,
            "replies": []
        },
        {
            "author": "PeacockFascinator",
            "body": "Get it annulled and move on with your life. Stop talking to him about it",
            "score": 3,
            "replies": []
        },
        {
            "author": "MessageNo6074",
            "body": "No offense, but the fact that he married you is a good indication that you shouldn't be married to him.",
            "score": 3,
            "replies": []
        },
        {
            "author": "violentwaffle69",
            "body": " Didn’t even read the texts , saw the age gap and already knew. Why the fuck are you married to someone 20 years older than you lmao",
            "score": 3,
            "replies": []
        },
        {
            "author": "ilovecats456789",
            "body": "Is this for real? Why would you have such a serious conversation via text?",
            "score": 3,
            "replies": []
        },
        {
            "author": "heatherdoodel",
            "body": "He's 42.  He's not going to change now if he hasn't yet.  Cut your losses and leave girl.  You're 22..  you don't even know what you truly want out of life yet.  Go be single and find yourself again and then when you do look for another parent.   Have HIGH standards. Being alone isn't the end of the world.",
            "score": 3,
            "replies": []
        },
        {
            "author": "chinsnbirdies",
            "body": "Did you marry my friends ex? \n\nGirl. Run.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PoppyPopPopzz",
            "body": "This is why a 42 year old woman wouldnt have this man who would ever entertain that behaviour",
            "score": 3,
            "replies": []
        },
        {
            "author": "BeeboWeebo56",
            "body": "Girl, what are you doing wasting your life with a man who is old enough to be your dad? Let alone an abusive one. Get your shit and get out of there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "petit_cochon",
            "body": "Honey, you are 22 years old. You have your whole life ahead of you as long as you leave this manipulative, abusive man. But if you don't, you'll have the unhappiest life you can imagine.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JellyOceana",
            "body": "Well he’s 20 years older then you. Duh",
            "score": 3,
            "replies": []
        },
        {
            "author": "MeekaD920",
            "body": "Girl leave and DO NOT TELL HIM YOUR PLANS! The most dangerous time is when a woman leaves her abuser. He’s love bombing you and also trying to guilt you with the cheat comment. GTFO now!",
            "score": 3,
            "replies": []
        },
        {
            "author": "missholly9",
            "body": "youre 22 and married to a 42 year old man and you wonder why there are problems? girl, date someone your own age.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Absidy09",
            "body": "20 years your senior is insane",
            "score": 3,
            "replies": []
        },
        {
            "author": "leftdrawer1969",
            "body": "Just saw that it’s early enough for an annulment!! DO IT!!!! it will save so much time and effort and money.\n\nHere’s something to think about: given the chance tomorrow, would you marry him again?\n\nIf not, LEAVE NOW",
            "score": 3,
            "replies": []
        },
        {
            "author": "Certain_Mobile1088",
            "body": "You do not need his consent or agreement to leave. Why are you even having this conversation, again? He took advantage of you. He has continuously manipulated you. \n\nFor your own safety, get out. It is much more dangerous now. Please get safe and update here as a comment so we know!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok-Consideration8724",
            "body": "Who would’ve thought that a 20 YEAR AGE GAP relationship wouldn’t work out? Jeez. Get someone in your own generation.",
            "score": 3,
            "replies": []
        },
        {
            "author": "c-c-c-cassian",
            "body": ">”I’m not going to treat you poorly anymore.”\n\nSoo… why did he in the first place?",
            "score": 3,
            "replies": []
        },
        {
            "author": "bradperry2435",
            "body": "Divorce him. Take half his shit and move on. Also find some your age.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PrettyRetard",
            "body": "Don’t even need to read anything by in the texts or your post. He’s 20 years older than you. LEAVE!",
            "score": 6,
            "replies": []
        },
        {
            "author": "MimiLaRue2",
            "body": "It seems like he is very manipulative, immature, and can't give you the positive, loving relationship that you want and need. \nThe good news is, you are very young and as you mentioned in your text, you could even get an annulment and not go through the larger hassle of divorce. Sounds like you don't have kids so that is another positive, as it will be a much easier break. \nUse this as an important life experience.  Learn and grow from it. Have fun and get to know yourself before you even think about dating someone else.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zerxes32",
            "body": "Proud of you stick to your guns",
            "score": 2,
            "replies": []
        },
        {
            "author": "Street_Papaya_4021",
            "body": "The moment I read (42M) I knew it would be bad. Please leave him and if an older man ever approaches you again ask yourself, why someone at that big age who should be established is one single, and two not able to get women his own age or even closer. There's a reason why he didn't go after 30 years olds, or even late 20s. It's because they wouldn't take his shit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "shamesister",
            "body": "She's my age and married to a man, my daughters age. \nPeople just want to pretend that's okay.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Admirable_Gain_9103",
            "body": "Ew",
            "score": 2,
            "replies": []
        },
        {
            "author": "bionicback",
            "body": "Giving him the heads up you’re leaving puts you in immediate danger. Take what you can hold and get out while he’s not there. This is a very dangerous situation.",
            "score": 2,
            "replies": [
                {
                    "author": "four_roses",
                    "body": "Right?? I saw that in the texts and was like 😱 OP will end up badly injured at best if she isn’t smart about this tonight",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MargotEsquandolas",
            "body": "You've seen a professional and they've advised you to leave. He's shown violent behavior. You're young and don't have kids. Cut your losses, tell your family and other support people, and put yourself first. You are not safe with him. He can work on his anger issues without being your husband. It's not your job to fix or save a grown man, especially one that already knows what he should be doing, but chooses to take his anger out on you instead. \n\nNo one here is going to tell you different advice than what the professional already recommended.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ponderingnudibranch",
            "body": "Divorce and block him on everything.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JoeLefty500",
            "body": "Get out. Or you’ll get more of the same. Save yourself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LifeNo4515",
            "body": "Please leave. You’ve got the next 20 years to reach where he hasn’t yet in life with someone who deserves you and who is mature enough to handle an actual relationship.",
            "score": 2,
            "replies": []
        },
        {
            "author": "heil_shelby_",
            "body": "He is 42. He’s not going to change. There is no magical conversation you can have with him or a different way to re-word the same things for him to finally get it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "to_annihilate",
            "body": "I had an ex who was 14 years older than me, and I was in my early 20s. I thought, awesome! A guy who's been around the block and I can skip the games. \n\nWRONG. In fact. Him being that old and dating someone my age was a huge red flag I ignored. It means he has fucked up and can't date anyone his age because they're into his tricks and knows someone younger will be easier to manipulate over and over again. \n\nWhen we split, he was LITERALLY on his knees telling me I \"would never be unhappy again\" and he \"would do anything to get me back.\" \n\nI fell for it at least once and he was behaved for a few weeks and then back to being himself again. He won't get better but you have SO MUCH TIME. Get divorced. Grow as your own person.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Signature9394",
            "body": "OP says he’s not capable of having a relationship and his response is “yes I am, let me show you”. How he feels about himself is so irrelevant in this but forget it, dismiss OP’s concerns or opinion over him based on his action. Now let’s defend himself and try to persuade OP to give him a chance. \n\nHe just doesn’t seem at all sorry or understand the fundamental issues he has. Sorry to say this but no wonder why he’s married to a naive woman who is young enough to be his daughter. Yikes",
            "score": 2,
            "replies": [
                {
                    "author": "sabineblue",
                    "body": "100000%!! He’s a textbook narcissist",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vibe_me_pos",
            "body": "He is waaay too old for you. Didn’t you ever wonder why he chose such a young woman? It’s because he needed someone inexperienced who he could groom to take his shit and would be easier to control. Your therapist is right. He isn’t going to change. It will always be the same cycle over and over.  His violence will escalate until you are seriously injured. Please protect yourself and get out of this abusive relationship. Hitler was nice to his dog too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "IT_techsupport",
            "body": "Youll have to do trial by combat if for me to let my daughter marry a guy 20 years her senior, I dont even care about my life at that point, not happening. Run while you can geeesh",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeathwishDena",
            "body": "JFC put these in order and also leave",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpecialModusOperandi",
            "body": "You young - free yourself from this poor excuse of a man who thinks you’re too naive to expect to be treated with respect and care.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alostcord",
            "body": "baby this and baby that...RUN",
            "score": 2,
            "replies": []
        },
        {
            "author": "prettywookie96",
            "body": "No one mentioned you've been in a dv relationship before. You're co dependent, the fact that you're engaging with him and feeding him shows that. You need to get the strength to leave him and go completely no contact. He will grind you down, and the cycle will begin again. Trust me, I've been there. I moved out, went back 5 months later, and within 4 weeks, he was back to his usual abusive self. You need to work on your self worth and self confidence, I promise it's the best thing you can do for yourself x",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pippin_the_parrot",
            "body": "I’m not saying this to be mean but the bullshit about you being mature is bullshit. He’s immature and women his age have more life experience and are less likely to accept his abuse. Get as far away as fast as you can.",
            "score": 2,
            "replies": []
        },
        {
            "author": "frizabelle",
            "body": "If you were to make a Venn diagram representing good men, and men in their forties who marry girls twenty years their junior, there would just be two separate circles.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Brogdon_Brogdon",
            "body": "Dude, just on the base level that you’re only 22, get the fuck out. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "grummlinds2",
            "body": "You need to leave this man. He’s too old, too immature, and will never change. Give yourself a shot at a good life by leaving him. ❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bhimtu",
            "body": "OP -The VERY LAST page here is the one you should pay attention to, and NO, don't go back to him, my goodness! Look at what he wrote: \"Ok....you don't love me (this is important because now he's blaming you for this break-up, do you see this? he's not being accountable for his behavior being the reasons you are leaving).\n\nOP -he's 20 years older than you, and in his 40s and still behaving like a teenager, His use of language indicates he's incredibly selfish AND immature.\n\nI hope you did not go back to him, because he will not be changing anytime soon. He's telling you what you want to hear, but I guarantee -you go back and you'll be here on reddit in no time complaining about him again.\n\nHe's a 40+ yr old child. FYI -edited to say, you don't need an apology. You need an exit plan, and one that hopefully includes a friend WITH YOU when you move out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "subzbearcat",
            "body": "Honey, you grew up and he stayed a kid.  Only man-children are interested in age gaps that big.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Propanegoddess",
            "body": "Girl wtf is this? Go somewhere he can’t find and have his ass served. Only communicate through lawyers.\n\nGet therapy. Stop dating men old enough to be your father. At least until you know why you’re doing it and they can’t find women their own age.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Overall_Card_5704",
            "body": "You know the reason he’s with someone so much younger than him is because no one his age would be stupid and naive enough to stick for his bs right? You’re not mature nor are you special. You’re easily manipulated and dependent and that’s exactly what he’s taking advantage of.\n\nNo one with any type of sense or self worth would stick around with a man like this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "catsweedcoffee",
            "body": "Age gap. I literally needed nothing more than to see your ages. He’s with you because women his own age won’t tolerate his shit. \n\nGet a divorce. Get therapy. Figure out who you are, because you’re 21yo and this shouldn’t be the rest of your life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "patronsaintkac",
            "body": "also, punching around you, leads to punching you and then worse",
            "score": 2,
            "replies": []
        },
        {
            "author": "rusalkachka",
            "body": "Don't even need to read the post. The title says it all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Estimate2636",
            "body": "Don’t tell him by yourself and don’t see him by yourself!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "sanglar1",
            "body": "It reminds me of those alcoholics who promise they'll quit. You have an opinion with more than 500 votes which tells you put your affairs in order, keep your money safe, etc... No better opinion than this one.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wide_Ordinary4078",
            "body": "Run for the hills! He is telling your sweet nothings so he can lock you up the next time and make sure you don’t leave. He will treat you like that movies “girl in the basement” on lifetime! (Even though that was about a father locking his daughter in the basement!)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Adorable-Interest-23",
            "body": "22 and 42 is absolutely insane. He sounds like he got you to marry him because no one else his age would. Divorce him. You’re young and are still discovering who you are.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kcpirana",
            "body": "Well, “you are just trying to rationalise cheating on me” is a perfect example of why he’ll never change. He’s deaf.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Brownie-0109",
            "body": "Baby….Baby……Baby\n\n\nIn this case, it’s true",
            "score": 2,
            "replies": []
        },
        {
            "author": "CoffieeCatz",
            "body": "The age gap itself is already alarming before reading the rest.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lildoza04",
            "body": "Please leave him. As a survivor, I am telling you girl, he will not fix his behavior and will use this and more against you in the future. Leaving is so hard to do but you deserve better.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Annual-Radio6905",
            "body": "Op is trying to take her power back with a verbal battle.\n\nThat doesn't work.\n\nOp, you stated your boundaries, now enforce them\n\nLeave.\nWait til he isn't home and take everything that isn't replaceable.\nEverything else you can buy new - material things aren't as important as safety.\n\nGet the marriage annulled.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Adept_Ad_8504",
            "body": "He sounds exhausting. Girl, let this manchild go. I can't believe he's in his 40s acting like this. Something isn't right with him in his head. I wouldn't stick around to find out either.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bmyst70",
            "body": "NOR\n\nYou need to divorce this man ASAP.  Look at his **ACTIONS** not his words.  His actions include physical abuse (a **COMPLETE** red flag) and treating you worse than his dogs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NextAffect8373",
            "body": "Don't date someone twice your age",
            "score": 2,
            "replies": []
        },
        {
            "author": "Terrible-Pea494",
            "body": "I mean, any man in his 40s chasing someone in their 20s is no prize to begin with. Add all the other stuff and why are still with this guy? You will be nursing him when you’re in the last of your best years. Do you really want to sacrifice your youth for this???",
            "score": 2,
            "replies": []
        },
        {
            "author": "gba_sg1",
            "body": "Dude was out of high-school and in university for 2 years before you were even a sperm.\n\nBail the fuck out.",
            "score": 2,
            "replies": [
                {
                    "author": "Inevitable_Bit_9871",
                    "body": "> before you were even a sperm.\n\nSperm is only half of DNA, the other half of her was an EGG and women are born with all her eggs, so technically she was an unfertilized egg in her mom at that point. I wonder why people always think people were sperm before birth and not the egg",
                    "score": 0,
                    "replies": [
                        {
                            "author": "gba_sg1",
                            "body": "You need A + B to make a human. Take 1 part away, they aren't existing.\n\nPick whichever piece you'd like to exclude.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CandidNumber",
            "body": "Aaaaand this is why women his own age won’t fuck him, we no longer fall for this shit. Younger women haven’t learned this lesson yet. Has nothing to do with us being bitter and old I promise. Get out now",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lov3I5Treacherous",
            "body": "This marriage was never an actual marriage. Do some growing up and don’t even consider another one until your brain has actually fully developed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BelieveInSymmetry",
            "body": "He will use every bit of information against you. Stop telling him anything!! Get out safely.",
            "score": 2,
            "replies": []
        },
        {
            "author": "youcantwin1932",
            "body": "Never, ever, choose to stay with a narcissist. They will never change their behavior. Believe me, I suffered for 27 years and finally got my out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Initiative-6184",
            "body": "You’ve gotten professional advice to leave. Please leave. \n\nLet me guess. You met him young. You got pregnant quickly. He told you that you were very mature for your age. He doesn’t/didn’t want you to work so part of you staying is because you’re financially dependent. Either you don’t have much family or he has essentially cut them off by telling you that they don’t support you or want you to be happy. Anything ringing a bell so far?9",
            "score": 2,
            "replies": []
        },
        {
            "author": "potatochipgworl",
            "body": "I read the texts before seeing the age correctly I guess and it sounds relatively every relationship I’ve tried to leave in my 20’s. That man is grandpa age talking/acting that way. His brain fully developed 20 years ago, he isn’t going to change.",
            "score": 2,
            "replies": []
        },
        {
            "author": "klmoran",
            "body": "Oh jeez. You’re too young to be married when you barely know yourself at this age, but that’s not the problem in ANY WAY!! He’s 20 years older than you, an abuser and he wants to hang onto his young wife but has no interest in being a decent person! Stop with the drama and make a plan to leave. Violence and abuse are dealbreakers, that’s not to do with marriage vows so he can shove that!",
            "score": 2,
            "replies": []
        },
        {
            "author": "raydiantgarden",
            "body": "He’s a piece of shit abusive loser. Please get an annulment. He’s going to get worse, not better. Who gives a damn what his family thinks? They’re not the ones that have to live with him as his spouse.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LilRedRidingHood72",
            "body": "He wants a wife but doesn't want to be a husband. 20 years older than you. Run OP he is not the one",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeCreates",
            "body": "You're 22 girl move on.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Think-Agency7102",
            "body": "As a 43yr old I couldn’t fathom being with a 22yr old. Something is wrong with this guy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Absinthe_gaze",
            "body": "The age gap is gross. He could be your father. There’s a reason he would entertain a lady that young and that’s because women his age wouldn’t put up with his shit. He will not change. He will manipulate and lie and do the same things over and over until he kills you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "zombiexmuffins",
            "body": "Girl there is a reason no woman his age wanted him.\n\nGet out. Please.",
            "score": 2,
            "replies": []
        },
        {
            "author": "joesmolik",
            "body": "You’ve gotta ask yourself this question why is a 42 year-old man with a 22 year-old woman he is old enough to be your father and the in the answer is, I am willing to bet no woman. His age wants to be around with him because they can see what he is manipulative self-centered controlling BS artist he thinks he can talk to you or treat you like crap and say I’m sorry and it gets better apparently, from your post this is a continuing behavior and that will not improve. You need to break up with him, divorce him move on I hope and pray that you do not have any children. If you don’t get out now, but you still can’t so you won’t be tied to the individual for the rest of your life as I said why is he with somebody that’s 22 instead of 42. What you say it’s because it was behavior in the way that he treats women please get out before it’s too late.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hidingbehindthisuser",
            "body": "My ex was like this and he started to hit me. Believe them when they show you who they are. Honey you are wayyyyyyyy to good for this dude. He clearly goes for younger women because he’s incapable of having a relationship with Someone his own age",
            "score": 2,
            "replies": []
        },
        {
            "author": "LessLikelyTo",
            "body": "Leave now and don’t waste anymore of your life. Get the annulment and don’t wait!",
            "score": 2,
            "replies": []
        },
        {
            "author": "resting_bees",
            "body": "girl don’t just run, SPRINT out of this marriage",
            "score": 2,
            "replies": []
        },
        {
            "author": "hometown_nero",
            "body": "And now you leave, because it will never change.",
            "score": 2,
            "replies": []
        },
        {
            "author": "outofnowhereman",
            "body": "Read about half of it and if I meet your husband I’m going to slap him… hard",
            "score": 2,
            "replies": []
        },
        {
            "author": "sabineblue",
            "body": "I literally just left a relationship with a very similar dynamic. I tried so many times to leave and finally did it. Your text thread looks eerily similar to hundreds of conversations with my ex partner over the course of 4 years.\n\n*He is not going to change*\n\nI agree with everyone else, you need to go no contact and *let your loved ones know about the situation.* Please do not try to do this alone. Not only is it very dangerous to try to leave at this juncture, but without the accountability from others, it’s tempting to keep coming back to the relationship. \n\nDo some research on covert narcissism and how to navigate conversations in which your partner is trying to manipulate and gaslight you. Look up ‘grey rocking.’ Assert your boundaries and don’t back down. Stay strong. You already know what to do.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fresh_Swimmer_5733",
            "body": "He’s gross. Leave and get yourself together. You deserve happiness and peace",
            "score": 2,
            "replies": []
        },
        {
            "author": "ElectronicPOBox",
            "body": "This age difference is gross",
            "score": 2,
            "replies": []
        },
        {
            "author": "NoEntrepreneur7420",
            "body": "Get the hell out. Do not marry him!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ashley5748",
            "body": "Girl. Look at your age difference. This guy is a creep. Run away.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OddWeek8924",
            "body": "GET. OUT. This was my past marriage to a T. Get out now. ❤️❤️❤️ I know it’s hard but it gets easier and everything is 20/20 in hindsight",
            "score": 2,
            "replies": []
        },
        {
            "author": "Formal_Goat1989",
            "body": "Just leave",
            "score": 2,
            "replies": []
        },
        {
            "author": "UltimatePragmatist",
            "body": "Oh my god. Girl, fuck apologies. You don’t need an apology. You need to save your life. Divorce him and ghost him and never look back. Then seek therapy to explore your childhood and how you ended up with a 40+ year old man bamboozling you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ShaadowKaat24",
            "body": "Get the annulment. Jeez.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Prestigious-Dig-3507",
            "body": "Is that you Elvis?",
            "score": 2,
            "replies": []
        },
        {
            "author": "piedubb",
            "body": "You’ll go back!  Didn’t you realize him being 42 and you being 22 was an issue to begin with?",
            "score": 2,
            "replies": []
        },
        {
            "author": "God_of_Mischief85",
            "body": "Get out now.   He has proven, time and again, that he is not going to change.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Artistic-Copy-9649",
            "body": "It never gets better!!! This is just the cycle of abuse. And it always gets worse.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CutePandaMiranda",
            "body": "You shouldn’t have married a guy 20 years older than you. If he truly loved you, he would’ve treated you with respect from the start. Stop settling and just leave.",
            "score": 2,
            "replies": []
        },
        {
            "author": "leftdrawer1969",
            "body": "Holy shit that age gap is predatory",
            "score": 2,
            "replies": []
        },
        {
            "author": "DullGoat9337",
            "body": "Leave or you are gonna end up on the news. He’s too old to change and he is unstable.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Catlover9382",
            "body": "You don’t need an apology…….YOU NEED TO LEAVE",
            "score": 2,
            "replies": []
        },
        {
            "author": "littlemonsterfeet",
            "body": "All I needed to see was tge age difference and the first screenshot.... Says it all",
            "score": 2,
            "replies": []
        },
        {
            "author": "ExtendedSpikeProtein",
            "body": "22/42 is already a massive red flag. Certainly you can do better than this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LadyBubbleBubbs",
            "body": "If you’re going to leave him the leave, but stop telling him you’re leaving. You’re opening yourself up to him doing something dangerous and rash. Just pack it up, and leave when he’s not home. Rebuild, seek therapy if you haven’t already, and live your life",
            "score": 2,
            "replies": []
        },
        {
            "author": "Equivalent_Hat_7220",
            "body": "LEAVE NOW",
            "score": 2,
            "replies": []
        },
        {
            "author": "Something-funny-26",
            "body": "Typical abuser behaviour. Wife leaves or threatens to, husband apologises and promises to change, emotionally manipulates wife. Wife goes back to him. Husband is good for a week or so and then goes back to abusing her. And repeat.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ParticularSimple5178",
            "body": "Ew how long ago did you two started “dating”?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Scythe95",
            "body": "I'm sorry is he double your age???",
            "score": 2,
            "replies": []
        },
        {
            "author": "Eliza-green1",
            "body": "Same shit, different year",
            "score": 2,
            "replies": []
        },
        {
            "author": "SkiME80",
            "body": "So you married someone half your age shocking it didn’t work.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jules793",
            "body": "There aren’t enough zeros and ones in the UNIVERSE to make it your fault all the time. It’s literally scientifically IMPOSSIBLE for you to be the only one to make mistakes in a situation. Please leave and don’t think twice about making your life different. When I realized this in a relationship I was I in it was a game changer. We are all human but seriously it’s is IMPOSSIBLE for everything to be your fault all the time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lingering_POO",
            "body": "If you played professional tennis and your doubles partner of 10 years has been steadily getting worse and neglecting training and other duties, you try to encourage them but eventually you have to move on. \n\nThis is that time. What a bag of shit he is and he will never ever change. I’m the same, stuck rigid in my ways… but because I love my wife and we are a rock solid team, I want to do anything I can to help her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fancy-Ad-6231",
            "body": "He’s 42 and you are 22? You’re just a baby. Leave, block him, forget him and move on",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dance-Top",
            "body": "Honestly, I was married to this exact man. Please just leave. They don’t get better. I was 32 when I left, you’re 10 years younger than I was. Just go. You won’t regret it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Internal_Ad_8147",
            "body": "LEAVE!",
            "score": 2,
            "replies": []
        },
        {
            "author": "fluffyjellycake",
            "body": "Just leave before he kills you",
            "score": 2,
            "replies": []
        },
        {
            "author": "Less_Town138",
            "body": "Go NC and don't look back! Have the papers for the annulment drawn up and get them served to him by a marshal to avoid dealing with his problematic actions and words. Also then he can't say he never got the papers cuz the marshal signs a document stating when they served him.\nLeave this man to rot alone.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pro-brown-butter",
            "body": "Get out now and take this a lesson when you are considering partners in the future. There is a reason a 40 something year old man is grooming young women",
            "score": 2,
            "replies": []
        },
        {
            "author": "toobasic2care",
            "body": "I just want to say honey, at 22, there is SO MUCH out there in the world all for you. \n\nIt only gets brighter and better once you escape. \nPlease stay safe and I hope you find strength and courage to leave.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdLoud2296",
            "body": "Damn girl, just block his sorry ass .\nNot sure what you think your going to get out of this conversation  . \nIt's a useless discussion  , that will go absolutely  go nowhere . Move on now before it gets worse .",
            "score": 2,
            "replies": []
        },
        {
            "author": "Salt-Environment9285",
            "body": "he is using his age and \"experience\" to make you feel small. you are too young to be trapped w him. \n\nget out. find someone who deserves you. \nand is closer in age.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lostmindz",
            "body": "oh, ffs, he's 20 years older than you...  buy a goddammit clue",
            "score": 2,
            "replies": []
        },
        {
            "author": "Civil_Confidence5844",
            "body": "Why do you need an apology? Leave him. There's a reason he's 42 with a 22 year old. I'm 30 and wouldn't even be with someone your age. He's a manipulative abuser. Stop sending him messages. He doesn't care about anything you're saying.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DainteeDuchezz",
            "body": "Yeah, I agree with the other posters. You’re moving way too loudly for somebody who uses it against you. Go, go quietly and go fast. He’s not gonna suddenly change his tune and be a good guy, you’re not gonna convince him of your worth, leave this shit alone so you don’t have to spend years healing from it",
            "score": 2,
            "replies": []
        },
        {
            "author": "MistsofThra",
            "body": "20 year age difference - not a surprise this guy is a toxic manipulator.",
            "score": 2,
            "replies": []
        },
        {
            "author": "UsedCollection5830",
            "body": "😳😳😳😳😳22 and 42",
            "score": 2,
            "replies": []
        },
        {
            "author": "ASHER-82",
            "body": "Get the fuck out before he kills you. And stop talking to him. Stop giving him info, stop running you mouth and move.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Firm_Explorer9033",
            "body": "OP’s brain hasn’t fully formed. Pre-frontal cortex isn’t quite baked all the way. Decision making isn’t working right. She’ll find out the hard way.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MileZeroCreative",
            "body": "“Oh baby….Oh baby …. Oh baby ….,” 🙄. \nYou may as well start packing now girl.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mariruizgar",
            "body": "So you’re telling him all your plans and how you’re going to leave!? Just do it with your important documents and locked down credit. He’s abusive and could kill you! LEAVE NOW IN SILENCE, don’t share anything else.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Moniquoi",
            "body": "Don’t walk, run. It will not, under any circumstance, improve. It will get worse once he understands you are not coming back. Surround yourself with family and friends who know what’s happening and never underestimate your need to be safe and secure.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sudden_Application47",
            "body": "He’s not going to change until he gets therapy. He’s not gonna get therapy until it is the last ditch option you’re gonna have to leave.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LadyGlitterTryhard",
            "body": "Love, this is a textbook abuse cycle. Completely predictable and WILL NOT STOP (source: growing up in an abusive household). Leave ASAP, don’t wait and don’t let him where you are. I hope you have someone in your family or friend group who will let you stay until you can get the rest figured out (without telling him where you are). You have too much life left to let this be your story and if he’s already hurt you physically, it won’t be the only time. \nnow.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Low-Interview-5966",
            "body": "The age gap was the first red flag. He never respected her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CathcartTowersHotel",
            "body": "Do not give him any hours. He might kill you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "aluminum_canoe",
            "body": "I agree, I know this is way easier say than done, but you already know you need out, stop convincing yourself and go. This will get more and more dangerous for you. This man has taken advantage of you on the premise that you don’t know any better. This is not normal or healthy or legal. Don’t tell him anything, get out!",
            "score": 2,
            "replies": []
        },
        {
            "author": "mel-74",
            "body": "I might be being over the top here but I don't think I am but please don't tell him if/when you are leaving him. I watch a lot of true crime and there are so many women that get murdered by telling the abusive partner that they are leaving! If you leave, just tell close family your plan and one day just go, no words, no call, no texts, literally nothing! Be safe please.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Subject-Regret-3846",
            "body": "Leave him. What kind of 42 year old is with a 22 year old? A manipulative jerk. Too many red flags in this picture",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Resource_8530",
            "body": "Why are you even trying to justify anything with this manchild. He will lie and gaslight you until you believe that you are wrong. Get out now. No one deserves the way this guy is acting and you deserve much better. Cut him off quickly and cleanly. Tell him you are done and for him not to contact you ever again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DealerAutomatic",
            "body": "You're being played, big time",
            "score": 2,
            "replies": []
        },
        {
            "author": "Emmmxs",
            "body": "EW EW EW GET THE FUCK AWAY FROM THIS PERSON AS FAR AS YOU CAN MIVE AWAY ACROSS THE COUNTRY AND NEVER LOOK BACK this man will one day beat you death. Just ask yourself one question? WHY HAS HE NOT BEEN MARRIED WITH SOMEONE HIS AGE! Oh and when you move out take someone with you a brother,an uncle a friend or even a cop!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ultra_instinctA",
            "body": "Babe, for me the first red flag are the ages 😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fun_Abbreviations818",
            "body": "Get the annulment while you still can. It will only get worse. That’s why he dated you, a woman closer to his age wouldn’t put up with that shit. He’s manipulating you. He will change just long enough to make it more difficult to leave, he’s done it before. Get out!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fine-Alternative-121",
            "body": "22 married to a 42 year old?? This marriage should have never happened.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cakebatterchapstick",
            "body": ">22F 42M\n\nSometimes you don’t need to read much further",
            "score": 2,
            "replies": []
        },
        {
            "author": "ahchava",
            "body": "And this is why a 42yr old man had to find someone without a fully formed brain to marry. Your brain has developed since you met this person which is why you’re seeing how exhausting and manipulative he is. Cis Womens brains have a pretty well developed frontal lobe around 22 and will finish cooking around 23-24. So, these things that you’re noticing? They’re only going to get more obvious. I agree with the professional that told you to leave. Be careful though. Sometimes older men like this will get violent when you actually try to leave so try to do that when he’s out of the house",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bbrownsugar311",
            "body": "42?!? \n\nOP please leave NOW. He is a predator and he will not change.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prize-Discussion-733",
            "body": "It doesn’t matter what his family thinks, they are part of the reason he is this way. Leave and heal",
            "score": 1,
            "replies": []
        },
        {
            "author": "lessthan313",
            "body": "Run, run for the hills.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sodiumbigolli",
            "body": "Oh my God I read the text before I saw that he’s 42. OP, you need to flee. This man is a nightmare, immature, exhausting, and threatening. Maybe be single for a while. It’ll be a nice break.",
            "score": 1,
            "replies": []
        },
        {
            "author": "syntheticchicken",
            "body": "Women his own age wouldn’t put up with this why should you? Prioritize yourself and get out. You’re so young go be free from this man, who is old enough to be your father. Life is short but his is shorter. Run.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ActualPhrase7823",
            "body": "This is my ex. Leave, he is bargaining himself back to the status quo and even then turned it back on you with the line about you setting yourself up to cheat. Leave, you will\nnot look back, seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "False-Association744",
            "body": "Be free. You’re so young. Be on your own for a while and figure out who you are and what you want. And it’s not this. And don’t date anyone over 30 until you’re 25 or 26. Those guys are creeps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Virtual_Dentist_1813",
            "body": "You literally have your whole life ahead of you. Do you want it filled with false promises, zero accountability, and people supporting his bad behavior? Please leave and do well for yourself. Build a beautiful life for yourself. Do not let him steal your youth and suck you dry. And for the love of all that is holy DO NOT let him impregnate you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "baby-Ella",
            "body": "LEAVE",
            "score": 1,
            "replies": []
        },
        {
            "author": "generickayak",
            "body": "Leave ASAP. He will NOTchange.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Worst-Lobster",
            "body": "Geez . Run … fast and far . Don’t look\nBack . Try to learn from this abusive relationship and never put yourself in one again . Good luck",
            "score": 1,
            "replies": []
        },
        {
            "author": "Karmadawnxo",
            "body": "From experience 24(F) ex/father of my child is (43)M. We were together from when i was 18-23. The comments saying hes love bombing you, theres a reason he doesn’t date women his age, etc. are 10000% real. He is not going to change. The marriage is not going to change. Pack your bag, get in your car & drive as far away as you possibly can. RUN. You are young enough that you can start your life completely over & treat this as a lesson.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sunshineandbrimstone",
            "body": "Flashes of my abusive ex...especially the last few texts. \n\nStay gone, you can do this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WookieeForce",
            "body": "Eff this guy",
            "score": 1,
            "replies": []
        },
        {
            "author": "FortuneWhereThoutBe",
            "body": "Stop telling him what you're going to do. Just do it. Pack up your stuff, everything that is important to you, leave what's not necessary or can be replaced easily and get the hell out. He's already shown you that you're not a priority in his life, so stop making him one in yours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KaytSands",
            "body": "Oh sweet girl. There is a reason why he love bombed and went after what he was hoping was a young, inexperienced girl. I am the same age as him. If any man attempted to treat me this way, the first time I would be done. I am old and tired and have zero to give to a relationship like this. There is a reason why these messed up dudes prey on young women like you because they know they can sweet talk their way right back in. STAND YOUR GROUND and get rid of this trash. You are young and have your whole life in front of you. You deserve peace, freedom and to experience an actual life. He is offering nothing and will absolutely continue to give you nothing but lies and broken promises.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prestigious-Copy-494",
            "body": "Just watch some YouTube videos on narcissists. You won't ever look back and you'll thank your lucky stars to have gotten out of this relationship. Hugs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prairie_Crab",
            "body": "Honey, do you need a flashing billboard to tell you? \n#LEAVE HIM.",
            "score": 1,
            "replies": []
        },
        {
            "author": "millimolli14",
            "body": "STOP telling him your plans, STOP threatening him with divorce, he knows you’re not going to leave, he’s love bombing and gaslighting you, it’s called abuse, this is literally an abusive man and marriage. Get everything sorted your side, get a solicitor and get proper advice, leave without him knowing the chances are when he realises you’re actually leaving him he could get violent. At the minute it’s a game to him",
            "score": 1,
            "replies": []
        },
        {
            "author": "FOSP2fan",
            "body": "It doesn’t matter what he says. It matters what he does and how you feel. This man makes you feel unsafe. That tells you all you need to know. Get out now before he hurts you or entraps you with children.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spectaphile",
            "body": "Ma'am, why are you on here asking for advice when actual professionals have already given you, well, professional advice on what you should do? Please ignore the lovebombing and manipulation and leave before he hurts you or impregnates you (or both).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Momn4D",
            "body": "The age gap should have been the first red flag, no man that age is looking for women your age due to your “maturity”, it is and always will be 100% due to a perceived lack of experience and vulnerability. He believed you were easy to manipulate and abuse, don’t let him be right. Now you know to stay away from such gross age gaps and some red flags to look out for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dcp00",
            "body": "Girl, this man about to die. What are you doing babygirl?",
            "score": 1,
            "replies": []
        },
        {
            "author": "pssshhhthatsabsurd",
            "body": "He’s a full grown adult manipulating a child. Leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "carlocos25",
            "body": "All I had to read was the title for this one….",
            "score": 1,
            "replies": []
        },
        {
            "author": "Parking_Ad_4601",
            "body": "For 42 he is a baby. Tell him you were looking for a man and not a child (age gaps do work sometimes but this…no) he hits you? Get away fast as you can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Assistance-815",
            "body": "1) Divorce. Be done. This is bad, and you've already experienced DV with another person you know what you need to do LEAVE. \n\n2) If there's anyone else under 25yo here STOP MARRYING PEOPLE THAT ARE NOT WITHIN 2 YEARS OF YOUR AGE (ALSO THEY NEED TO BE 18+ OBVIOUSLY WHEN YOU START DATING AFTER 20)\n\n3) I'm sorry you're dealing with this but the only way through it is to cut ties, cut contact and be single for awhile. Figure out where you want to be in life, what you actually think you want to do and accomplish,  become a whole independent person before you settle into a marriage. IMO it rarely ends well for people to get married before 25 and even less so when there's such a significant age gap.\n\n4) Take the animals with you when you leave! \n\n*end of list*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Abject_Jump9617",
            "body": "updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "Think_Apple1044",
            "body": "Why are you dating someone 20 years older than you when you are so young and still learning about life? Dump him and be with someone your age who can grow with you. Change takes time. It is not feasible for him to change so dramatically in such a short time. If you learnt psychology you would know that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dizzy_Combination122",
            "body": "I mean I only had to read the title to know this relationship is doomed. He’s old enough to be your dad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikaylaa99",
            "body": "Marrying someone near the age of your father is crazy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beneficial-Nimitz68",
            "body": "wait wait wait..\n\n22F and he's 42M..\n\nNo kids?  do you have  your own money/job?  \n\nIF no kids, start legal processing.  DON'T tell him, get all your records straight, his 401k monthly earnings, log his abuse (physical or mental) in a text message to yourself (yes thats a thing), change the code to your phone. If it is your face or finger print, change it to a code he would not know or can guess!\n\nhe is saying sorry sorry sorry.. how many times has he said sorry sorry sorry in the past and I will change, i promise?",
            "score": 1,
            "replies": []
        },
        {
            "author": "_muck_",
            "body": "You are way more mature than him. Leave this man child",
            "score": 1,
            "replies": []
        },
        {
            "author": "NonniSpumoni",
            "body": "You were groomed by an older man and think this is okay behavior?\n\nFucking run. He's a violent perv.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InteractionNo9110",
            "body": "Men like this have to target young women. They are the only ones who will put up with it. A woman his own age would have walked out ages ago. \n\nNot all marriages are meant to be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jasno-",
            "body": "Don't have a baby with this \"man\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "CoffeeChocolateBoth",
            "body": "SO? Stop replying to him in any way, go NC with him and his family! Speak only to him through your lawyers!   \n\n\nIf you take him back one more time, he will be good for a little while, and you know this already, he will convert right back to his old self, why? Because you've allowed it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ynotfoster",
            "body": "You won't get an apology; you need to accept that. Don't waste time or put effort into it.  He won't change either.  File for divorce and continue with therapy.  You are young and have your whole life ahead of you.  Focus on yourself, work on your issues and put effort into an education and career path.  You've got this, leave him in your past.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Think_Apple1044",
            "body": "I 40F lived with a 40M for almost a year, kicked him out due to his childish behaviours, then he moved in with a 21 year old. Manipulated the shit out of her, called cops on each other 3 times, isolated her from her family, broke up with her then came back to me to talk shit about her. He then proceeded to ask me to loose weight so I would be “more attractive to him”. Basically trying to gaslight me to have a 20 year old body, while already being financially stable. Obviously I kicked him to the curb. He also told me their relationship was just sex. People like this prey on younger women because women their age don’t put up with their shit. GET OUT.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spellcaster4783",
            "body": "Tbh, sounds like you already know what you wanna do, you just need to get your affairs in order. You need to have an exit plan for Incase he tries to come after you or your family. If he’s willing to hurt you while he’s telling you he loves you, there’s no telling how much he’s willing to hurt you once that love fades to anger. He and his family already blame you for his behavior while failing to hold him accountable for anything, they aren’t going to protect you once you’ve “abandoned” their son(NOT what you are doing but that’s how he’s probably gonna take it). If he wanted to treat you better, he simply would. He wouldn’t sit there and make empty promises. He hasn’t filled them yet, and you shouldn’t keep waiting around hoping they will be. Believe his actions, not his words, and his actions say get that annulment. \nYou are so young, you WILL find someone better for you who won’t treat you like dirt. If he’s 42 and still acting like that, that river has officially frozen over, you’re not gonna change what’s under that surface. I get people your age also being trash in the dating department, but you’re more likely to encounter much more open minds in younger people with a different level of empathy than 40+ yr olds. He wants to keep you as a possession, not a partner. Remember that; losing you would be a blow to his ego, not his heart.\nSorry for the long message, I really hope you’re okay and have a support system behind you!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "gemmygem86",
            "body": "He's 20 years older than you. There's a reason people his age won't touch him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BluebirdLow5079",
            "body": "“Let’s talk about our baby” the LAST THING you want to do is have a baby with this man, he wants to trap you knowing it’s much harder to leave him with a kid. Please leave him, no more second third fourth chances.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Royal-Principle6138",
            "body": "He obviously can’t find a woman his own age as they wouldn’t put up with his shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Haunting-Aardvark709",
            "body": "Your mariage was a mistake. Own it, divorce him and get over it. Mute him right now and stop responding to his ridiculous messages.",
            "score": 1,
            "replies": []
        },
        {
            "author": "a_womans_mind",
            "body": "Please don’t tell him you’re leaving because that will escalate things in his mind and can put you in danger. Please please please",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maleficent_Pay_4154",
            "body": "He can’t even behave in a conversation how is he going to maintain this in your relationship.  I’m sorry you deserve better",
            "score": 1,
            "replies": []
        },
        {
            "author": "Woopsied00dle",
            "body": "Girl I thought this was part of the CJ thread it’s so bad. Trust me. This dude got into a relationship with you because you are so much younger than him. Get out of there",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beautiful_Dream1880",
            "body": "Better be ready to get an restraining order, cause this isn’t going to end well if you don’t.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bloontsmooker",
            "body": "What can we do to help you leave this situation as soon as possible? This is outrageous and absurd - you don’t deserve this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "maudelinfeelings",
            "body": "Age gap",
            "score": 1,
            "replies": []
        },
        {
            "author": "forgiveprecipitation",
            "body": "He’s 42 but he can’t get “your” and “you’re” right. The rest is even more annoying. Time to dip.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical-Heron-619",
            "body": "His msgs read so like my ex’s. They don’t change and if they see the manipulation works they go harder. Good luck moving on towards a better life without him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Massive-Song-7486",
            "body": "Its always the same here:  \n\n#agegap",
            "score": 1,
            "replies": []
        },
        {
            "author": "GwangPwang",
            "body": "when you're 40 he's gonna be a 60yr old senior citizen. Leave and date a younger more capable responsible man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One_Arm4148",
            "body": "This brought back horrible memories, I feel sick. 🤢 🚨🚫🚩✂️ Leave him now! Don’t wait like I did in the past. His love bombing is a manipulation tactic, it’s not true. He will never change and he will do much worse because you chose to stay.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FunSet8614",
            "body": "Him saying that you don't let me him and are rationalizing to cheat on him....yea huge red flag. Verbal and emotional abuse. You need to think of yourself and your mental well being. Thank goodness no kids.  DO NOT GET PREGNANT WITH THIS MAN",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bitter_Rose2",
            "body": "Girl what the fuck \n\nDump this old man and find better, not even worth getting upset about.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Black_Death_12",
            "body": "If he hasn't figured out how to not be a piece of shit by the age of 42, he isn't going to figure it out by the age of 43.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Correct_Werewolf_693",
            "body": "That bit at the end saying you are finding reasons to cheat tells me he ain’t gonna change his ways because he is making you the bad guy for explaining your feelings he isn’t sorry he is trying to do the same that’s always worked and then back to normal again for him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comfortable_Sugar752",
            "body": "Give me 48 hours to change\n\nLol\n\nPlease leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuspiciousBluejay531",
            "body": "22 F? 42 M? And y'all are married? For how long? You need to dump his ass and then ask your therapist what \"grooming\" is. I promise when they explain you'll realize the gravity of how fucked this all is if you haven't yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xavore12",
            "body": "Ummmm… why the hell are you married to someone in their 40s when you’re 22.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jewifer",
            "body": "I can't even tell which order these messages are supposed to be looked at.",
            "score": 1,
            "replies": []
        },
        {
            "author": "miss_spooky27",
            "body": "This is scary. This guy not only love bombed you but probably groomed you aswell. This is manipulation and abusive behaviour. Dont tell him your plans. He may lash out and end your life, if he can't have you no one can type of thing...\nI've been through this very thing. I got choked out until I lost consciousness. He actually thought he killed me until I was lucky I woke up later. Bruised and battered. \nBut I got out. Some don't. Please dont let it come to that. Protect yourself. Trust your instincts.\n\nYou deserve so much better and I hope you give yourself that.\nTime to walk away and do what's right for you. Do not let this man decide your fate and continue treating you this way only to sweet talk you when he needs forgiveness. A real man who loves you will never scare you and have you fear for your safety. \n\nIts a big ass no. Red flag behaviour.\nYou know this to be true. We all do for that matter.\n\nGood luck OP",
            "score": 1,
            "replies": []
        },
        {
            "author": "Difficult-Level-3070",
            "body": "Why did you get married so early? And to someone double your age? That's odd, or you're a potential gold digger?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Time_Ad_9058",
            "body": "You need to get support from others who love you and send him the message they will come after him if he doesn’t allow you to leave. He is a dangerous manipulator with violent tendencies",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Champion469",
            "body": "He's making my skin crawl. Good luck OP and I hope you get the amazing life you deserve after this is all behind you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "avocado_macabre",
            "body": "When i was 31 i dated a 48 year old. Never got physical but he would gaslight me, lovebomb me, berate me, lovebomb me, promise he'll \"never do it again\", do it again, lovebomb me, coerce me,  lovebomb me\n\n\nSee a pattern? It never gets better as long as you keep believing him because then he knows he can get away with it as long as he keeps sweet talking you back into it. \n\n\n\nLeave him once and for all",
            "score": 1,
            "replies": []
        },
        {
            "author": "Timely-Target-845",
            "body": "You got yourself a man child. There was some serious ups and downs in that message chain with some manipulation for bonus. You are better off without that in your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clear_Emotion_8236",
            "body": "\"You're just trying to find a reason to rationalise cheating on me\" THEN he goes on with the usual apology 😒. Ummm, he's a piece of shit. Take it from a 58(f), he will behave like this for the rest of your marriage. In my experience, men don't change their behaviour.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tikithecockateil",
            "body": "Just so you know, they don't change. I wasted 30 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NerdyGreenWitch",
            "body": "You married someone old enough to be your FATHER. Why did you think that was a good idea? Older guys that go after barely legal women are broken in some way and know women their own age won’t put up with their shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rachihc",
            "body": "You are doing the right thing by leaving. You are young, you deserve a life without that bullshit. Move on, be happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dutch-masta25",
            "body": "His replies make me feel a bit sick, you can see how he’s lying through his teeth just to try and sway you back. My dad would do the same after flying off the handle and smashing the place up, he’d then say how sorry he was and that he would never do it again. Guess what? He did it again and again, I always felt sorry for the women who came into his life and were subjected to that on a daily basis.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anonimityville",
            "body": "He’s not even talking to her. He’s talking through her. He keeps saying these same cliches over and over again. I think ChatGPT could’ve done a better job than this guy. He is not sincere at all.  They sound like lines from sappy boy band groups from the 90s, which OP’s husband would be familiar with, but she wouldn’t because she wasnt born yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dankarella666",
            "body": "I’m exhausted reading these texts. \n\nLife is short. Really fucking short. Do you REALLY want to spend the rest of your life continuing to do this? Stop threatening papers and leave. Just nut up and do it. He isn’t going to change and clearly he’s proven this many, many times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Wishbone_8024",
            "body": "Run 🏃‍♀️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Uninspired714",
            "body": "Lost me at 22F 42M.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlackWidow7d",
            "body": "This “marriage” is icky and gross. What are you doing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flicksterea",
            "body": "Leave and never, **ever** look back. This bastard hit you. You're worth more than this than words can express.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jus4fun49",
            "body": "LEAVE!",
            "score": 1,
            "replies": []
        },
        {
            "author": "CoveCreates",
            "body": "You are in danger. Leave, safely, and immediately.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Avitar_X",
            "body": "I wouldn't expect someone that's 42 to change their ways.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lanky-Pen-4371",
            "body": "First text. No. He’s abusive. He should not be yelling at you. This is the cycle of domestic violence where he’s trying to make up for it before more abuse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tulip_angel",
            "body": "Get the annulment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "floofelina",
            "body": "Don’t go back. He will make you and your kids miserable, but he’ll wait till you’re pregnant to really let loose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GodsGirl64",
            "body": "Just run before you end up dead!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marvin_is_my_martian",
            "body": "RUN RUN RUN RUN RUN\n\nThis man married you because women his age already figured him out and they did not want to he controlled. They look for younger women with less life experience and live bomb/abuse them because these women don't realize right away what they got into.\n\nRUN.\n\nNOW.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mountain-Bonus-8063",
            "body": "Oh, honey...run.  this is dangerous ground. He will get angry and violent at some point.  I went through this same thing.  I got an annulment too.   But it got scary there for a bit,and its difficult to get protection that will make you feel safe.  Get out while you can, and get a restraining order ASAP.  Good luck! ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "swiggityswirls",
            "body": "The earlier you realize that you can only believe people based on their actions over their words the better. \n\nIt sounds so much easier said than done, it sounds like a no brainer obvious kinda thing. But now you have the real world lived experience of it. You have firsthand knowledge and see the patterns of how convincing some people can be, how they can get that close to you and sneak past all of your guards because of their words and their words alone. And once they've 'got' you, their mask comes off and now their actions and words more and more often do not match up. \n\nYou see how deep you got and how many chances you gave him. It's because you became so totally invested before you got the real chance to see the red flags. They weren't one off actions, they weren't exceptions, they are part of the deal of being with people like this. \n\nTrust yourself and make decisions with the rational part of your brain. Evaluate your options and choose the course towards the future you want. You know if you stay, you'll get more of this. How many times, over and over, does he need to show you that this is who he is? He's just trying to overcome the next challenge to get a stay of execution. He wants you to stay around just a bit more, a bit more, a bit more, and then eventually you'll look around and another ten years have passed with no changes. The only thing that's happened is 'same shit, different day'. So please, choose yourself and get out, no matter how painful it is, you will survive it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrinceFridaytheXIII",
            "body": "… ew",
            "score": 1,
            "replies": []
        },
        {
            "author": "HyRothgarrr",
            "body": "This guy will never change he will only get worse. Stay away from him. Make sure you're in a safe place. Have all communication go through your lawyer and talk to them about a protective order.  Your safety comes first!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beagle-Mumma",
            "body": "OP! \n\nPlease leave!! Your husband is telling you what he thinks you want to hear so you stay. He is not committed to making permanent changes because he thinks, deep down, he doesn't need too. \n\nPlease get hold of the free PDF:\n\n'Why does he do that?' By Lundy Bancroft. \n\nThere's a reason a 49 year old goes after a woman nearly 20 years younger than him. However it's backfired, because in your texts you come across as far more mature and relationship responsible. Get your annulment and leave!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "lol-daisy325121",
            "body": "In what order do I read these? 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrimyGrippers",
            "body": "Chat tell me if I have to read past the title",
            "score": 1,
            "replies": [
                {
                    "author": "nothathappened",
                    "body": "Nope.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "foxhair2014",
            "body": "It will never change. Leave, before he does something worse than just hurt you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thatit67888",
            "body": "God i hate when people use \"baby\" as a term of endearment 🤢",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dark_Denim_Phantom",
            "body": "They always blame you for what you “made them do”…ever notice some guy twice their size or with the ability to fire them never makes them so mad they lose control. They seldom have such a lapse with people around whose opinions they value. They’ll wait til it’s just you two. They don’t have anger control issues they have control issues + anger. Keep going. Lawyers, annulment, everything, with the end being no contact and reclaiming yourself for the future you deserve.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bluefromthelou",
            "body": "When the sugar daddy turns to salt",
            "score": 1,
            "replies": []
        },
        {
            "author": "wastedp0tentiall",
            "body": "You're 22... even if he was a good  partner you shouldn't be having kids at this age. Live your life. Finish college. Figure out who u are as an adult.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AssWhoopiGoldberg",
            "body": "Man this is tough. He definitely won’t change, but thankfully you have your whole life ahead of you",
            "score": 1,
            "replies": []
        },
        {
            "author": "vdivvy",
            "body": "OP, what a POS your husband !! And good for you for standing your ground and for saying your peace. I hope you follow through with this divorce and live the life that you deserve surrounded by people that love you. It made me sick reading your texts, especially the last one where he just showed his true colours right there. He deserves nothing from you. 🫶🏼",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Secret_4560",
            "body": "You have stated your case. You've pointed out his behavior, unwillingness to change or listen to you, and how all of this makes you feel. He said he'd change, you know from experience he won't and professionals are telling you to leave him. \n\nIf you want to leave, leave. If you don't leave, then expect nothing to change. If you choose to stay, don't be all \"Surprised Pikachu\" when shit goes sideways.\n\nAlso, don't tell him your fucking plans if you decide to leave! Good god, talk about telling the enemy your position!",
            "score": 1,
            "replies": []
        },
        {
            "author": "yrabl81",
            "body": "Big virtual hug.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeepingWillow0724",
            "body": "Oh God this is disgusting. Leave this GROWN ASS MAN CHILD. Why are you married to a man who is twice your age? If you haven't figured it out yet, there's a reason he's not with a woman his age. I'm so sorry for you OP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlowStateVibes",
            "body": "God danhit, what order are these in?!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "cryptonomica_",
            "body": "this age gap makes me want to vom. the fact that they're married means she was even YOUNGER when they got together\n\nedit: i somehow didn't see the last page and the \"ok you don't love me and you're finding a reason to cheat on me\" has me seeing REDDDDD. what an abusive prick daring to raise a fist at anyone, nonetheless someone young enough to be his CHILD",
            "score": 1,
            "replies": []
        },
        {
            "author": "Left_Resolution6109",
            "body": "People protect my abuser too. And enable him. I’m 3 kids in and Ivr got 2 broken ribs. But I have my life. You never think it wil happen to you until it’s done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Barb_W1RE",
            "body": "You seem more mature, and you're half his age. Leave. You have your whole life ahead of you to find someone to treat you well. He won't ever change. I promise you, you won't regret it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Distance-9401",
            "body": "I read those ages wrong at first and was just thinking dude is an immature shithead and then realized hes 42 not 24 but my opinion still is that hes an immature shithead thats still doing this shit 20 years older than he should.\n\nOP you are right for leaving this asshole as he will never really change and treat you like you deserve to be treated. I wont go into the age gap thing since thats been covered well by others but someone in their 40s is who they will be pretty much and is why he was hoping someone younger would look past his bullshit.\n\nYoure only 22 though and youll find someone better in no time and realize truly how messed up this relationship really is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jpezzi25",
            "body": "Updateme!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MollyMasonMoon",
            "body": "Babes, he's 42. If he was going to change, he would have by now. Also, anytime someone that much older than you it's a red flag. It usually means women within their age range can't tolerate them. Get away from this man and take care of yourself 💚",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stoned-detailer",
            "body": "Just fucking run",
            "score": 1,
            "replies": []
        },
        {
            "author": "biblical_gays",
            "body": "Wee woo danger get out yesterday and tell no one who would tell him",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoObjective8146",
            "body": "Your husband is a creep lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Carpenter1691",
            "body": "Your pictures suck and so does the order of them... also your marriage... just start over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Master-Drama8567",
            "body": "Holy shit, he’s a piece of crap. You’re way better. Leave him",
            "score": 1,
            "replies": []
        },
        {
            "author": "daddy2161984",
            "body": "🙃🙃🙃🙃🙃🙃 almost can’t make this stuff up",
            "score": 1,
            "replies": []
        },
        {
            "author": "daddy2161984",
            "body": "I mean shit he’s gonna be shooting fucking dust bunnies I would run as fast as I could regroup and think what YOU want for for future your never stuck and it’s never to late to start over or again, but as a 41 year old man with 2 kids the advice I would give my kids is this ain’t the one for you I promise because if you don’t heed this as a warning there is going to be hell to pay on the other  side. Please see this for what it is he is a man your still a child he should know how to treat animals and kids and people by the time he was 42 this is red flag city.",
            "score": 1,
            "replies": []
        },
        {
            "author": "akawendals",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "egoomega",
            "body": "I’d say big issue is your 22 he’s 42.\nI do think that’s a huge gap especially for someone who is still a younger adult… u may be mature enough so it doesn’t say anything against you if that’s the case… but moreover it shows the person who is 42 is not mature otherwise they’d likely be closer to their age group and would not have problems like anger issues at their age.\n\nBest of luck whichever path you feel you must take",
            "score": 1,
            "replies": []
        },
        {
            "author": "andboobootoo",
            "body": "“You’re just trying to rationalize in your head a reason to cheat on me.\n\n     - Boyfriend’s response to OP’s detailed description of how she has been hurt by him.\n\nOP, this level of desperation along with over-the-top comments, like the above, make it clear: this guy is mentally ill and is probably a danger to himself and others. RUN!",
            "score": 1,
            "replies": []
        },
        {
            "author": "bagoboners",
            "body": "Screw the apology. Stop asking for it/hoping for it/waiting for it… get out now. You know already that it won’t change because, despite all the bullshit he spouts, it hasn’t yet. It’s hard to make this kind of change when you’re so used to everything as it is, but his behavior has been screaming the opposite of what his words are whispering. Just pull the plug on this. Focus on yourself and your own happiness… take care of you- and eventually you’ll find someone closer to your own age who can treat you much better than this abusive old fool.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inevitable-Depth3311",
            "body": "This seems scripted and not like any married couples messages that I have ever seen",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pnwsparklymess",
            "body": "22F and 42M is all I need to read 🚩",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future-Path8412",
            "body": "This is like manipulative bingo and it’s a blackout. You don’t love me, check, you are just making an excuse to cheat, check, I’ll change, check, free space (living in YOUR house), check, we exchanged vows, check, let’s talk about having a baby, check. Welp, he’s won and the prize better be a divorce!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bigchungus183",
            "body": "He’s 42, he’s not gonna change lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "SubstantialShop1538",
            "body": "He's a narcissist. Thank goodness you don't have any kids. He probably has tried to baby trap you, but he showed his true colors before that happened, thankfully.\n\nGet divorced or annulled. If feasible move away. You are in a dangerous relationship. Stay safe and get out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "squishsharkqueen",
            "body": "When he was your age, you were literally 2 years old. A grown ass man. And a toddler. Stop texting him, file your paperwork, and go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RegularAcid",
            "body": "just that age gap alone is a problem why are you with a grown ass man!! There’s a reason women his age don’t talk to him. You’re still very young don’t limit your life to this ..being married to this dude.  you have so many years ahead of you to meet people YOUR age and then maybe settle down again.  go travel or something the world’s yours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "talktoyouinabitbud",
            "body": "LOOOOOL",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient_Big_5600",
            "body": "Why do you think he married you so young? Because you’re fun and full of life??! Lmfao! Girl, he wants you malleable like play-Doh! He wants to get away with bad behavior because you don’t know any better!! Shame on him for being abusive. Shame on you for staying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rare_Percentage2749",
            "body": "wait girl he’s 42? leave his ass now!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fragrant-End3850",
            "body": "Bros dating her dad pretty much. Y’all wild af now days. 🤣🤣🤣🤣🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "sffood",
            "body": "It’s problematic enough that you married a 42yo man, but even more disturbing that he sounds like a 15yo kid. Like he is actually too dumb to even groom you properly.\n\nAs a rule, if you are going to date a middle aged man, then at least choose one that is intelligent and accomplished. This here is a bag of shit.\n\nDivorce. Immediately.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious_Rabbit608",
            "body": "These weren't agreements. They were statements to make you complacent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Little-Ms-Sunshine23",
            "body": "The age gap is extremely concerning…he doesn’t love you or even like you, this is manipulation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuller1017",
            "body": "You see why he can’t get a woman his age. Let this loser go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "2ndcupofcoffee",
            "body": "Think about the fact that he does not say why he treats you badly while knowing he wants to but not understanding why. He won’t change because he is getting something out of abusing you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "litebeer420",
            "body": "Literally saw the age gap and didn’t have to read anything. Gtfo dude.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StraightResolution4",
            "body": "Y'all have a 20 year age gap he literally is old enough to be your dad.  Which my normally shouldn't matter but it seems like y'all are on two totally different wavelengths. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Midnight-Rants",
            "body": "RUN. And don't ever look back. He won't change, specially NOT in 48h (WTH?!). Have someone with you when you get your things out, to be safe. Don't be alone with him, don't sleep at the house, don't talk to him, don't text him. Been there. Put yourself first now more than ever. Good luck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Queasy-Trash8292",
            "body": "You need to divorce. This guy will not change. \n\nTwo other things:\n\n1. Look up the grey rock method. This will teach how to be as boring as possible to him. You are feeding him with your time and energy. He will continue to trap you in this cycle as long as you continue to engage. \n\n2.   Stop having conversations like this over text message. Emotional and deep conversations are for the phone, video, or in-person (with a therapist if needed). If you have multiple therapists telling you to go, you need to listen to them. And go. \n\nYour life will be much better off without this person. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoContest6481",
            "body": "I don't need to read beyond the first screenshot, This is the cycle of abuse. He is love bombing you. Get out now. I was you for 23 years. Don't waste another minute. Next time, the violence will begin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeikoAki",
            "body": "42 LMAOO",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tbird5555",
            "body": "This man is a narcissist and the best thing you can do is get away from him and cut all ties. Change your phone number. Do whatever you need to do but stay away from him. Get an order of protection as soon as you leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beautiful_Bid2557",
            "body": "Why do people talk like they're in a bad rom com, \"im sO sOrRy bAbY\" 🤢🤮 maybe just don't",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ice_Friendly",
            "body": "22 and 42?! Who could have ever guessed that was not going to work out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "que_cosaa",
            "body": "22 and married?! So young",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pure_Mathematician70",
            "body": "Absolutely not. Leave him. First of all that message he sent about you trying to rationalize it in your head to cheat on him is such narcissistic behavior. It is manipulative and shows you straight up that he doesn’t think he’s in the wrong. He believes you’re doing all of this to spite him and he did nothing wrong for you to act this way and in his mind the only answer to you doing this is to cheat on him. Insane. Also if he’s raising his fists at you whether or not he has hit you, is a huge red flag. He’s held himself back but what’s to say he doesn’t “lose control” one day and hits you? If he has said he’d “change” multiple times and never does, you know for a fact that nothing will change. Go find happiness somewhere else, it’s not with this guy. He’s also way older than you and acting like a child. Yuck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spiritual_Oil_7411",
            "body": "You don't have to prove your case in order to leave him. The only permission you need is your own, and you dont want to be with him, so go.  \n\nThe age difference is alarming, please don't get pregnant, just pack your shit and go. You can file from your friends couch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OpinionOwn1283",
            "body": "He’s 20 years older than you. If you, at 22, are expecting things from him that he cannot give you at his big age of 42, you HAVE to get outta there girl. \n\nYou’re so young and so beautiful and so competent and so deserving. Please go find someone who can make you feel as amazing as you are.",
            "score": 1,
            "replies": []
        },
        {
            "author": "murderdeity",
            "body": "Learn to gray rock. No more communication unless it's through your attorney. You never speak to this person again. No one cares what the family of someone who has physically harmed you thinks. \n\n\nHe needs an information diet such that the only info he has comes through your lawyer. Dont get caught up in your emotions and respond. It gives him the attention and validation he needs. Be careful because leaving a relationship is the most dangerous time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gutentaj",
            "body": "Girl 42?! Leave while you’re still young!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LibrarianAcrobatic21",
            "body": "Yes, 42 was your first red flag. He can't get anyone near his age to give him the time of day.\n\nGet it annulled stay safe.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intermountain-Gal",
            "body": "You yourself have said that professionals are telling you to leave. Plus, despite false promises to change, he doesn’t change. The hard truth is he will never change. Especially when others are encouraging his behavior.\n\nDo NOT tell him you’re leaving. That’s asking for a potentially deadly encounter. While he is somewhere else, leave. Vanish. Do not talk to him except through your lawyer. Block him and his family and friends.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Vegetable54",
            "body": "Things will only escalate. I'm sorry honey. It's time to go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quirky_Masterpiece55",
            "body": "Holy smokes. Please don’t bring a child into this dumpster fire of a relationship!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual-Contest54",
            "body": "20 years of marriage, 3 known affairs, millions of lies, everything for him from Harley to sports cars, took everything and hid, I lost everything. IT AIN'T WORH IT! PLUS HE IS 42 & you 22, girl get out now!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ozias7",
            "body": "My wife and I have 3 firm rules. Don't lie, don't cheat, don't hit. Any one of those and we'd be over. \nIf he's 42 and hasn't figured out how to act right, you're not gonna change that. There's plenty of fish in the sea, time to go fishing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sorry_Baseball_1691",
            "body": "I want to say to all younger women (this isn't a slam) don't be flattered when an older guy shows you attention. Women in their own age range won't put up with them. The way he is so manipulative/creepy with you gives me the icks. If he can't love and care for an innocent dog he isn't capable of having kids. I have seen this play out with family members.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tight_Following1628",
            "body": "I was with somebody like this. We went through three separations and on the third one I found out he was talking to two other women. Just leave. He’s not worth it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character-Food-6574",
            "body": "It’s well past time to leave and get a divorce. You’ve got a man old enough to be your father that acts like a mean, immature selfish kid. Time to stop talking and leave.",
            "score": 1,
            "replies": []
        },
        {
            "author": "purple_dramaqueen",
            "body": "Girl if he doesn’t have his shit together at 42 it’s never going to happen. Punching shit and yelling at his age is ridiculous. Divorce him and find someone your own age who you can grow healthily with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "n3wchpt3r",
            "body": "You already know that he going to go right back to the same behavior bc as soon as he didn't get what he wanted in the text he resorted to \"you don't love me\" and \"you're looking to cheat\". Even right in the middle of his \"apology\" he did the same crap.  Pack, leave, block, annul",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far-Sink-2204",
            "body": "Leave him. He has 19 years more than you to get his shit together and he hasn’t. He is being emotionally manipulative. You deserve better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Temporary_Worldly",
            "body": "Leave him his behavior isn’t ok",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElitistSwede",
            "body": "Takes more than 48 hours. I love it when people say that, like if they're \"good\" for two days it cleans the slate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "AcousticWord93",
                    "body": "Obviously this is in the wrong thread, but I agree with everything you said. Lol",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Glittering-Bee-714",
                            "body": "Hahaha omg 😱 I totally thought this was under another thread lol I feel bad wasting my rage hahah lol 😂",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AcousticWord93",
                                    "body": "I don't think Elon rage is ever wasted! Hah",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mysterious-Wasabi103",
                    "body": "What",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SunnyWillow1981",
            "body": "Why did you marry a man who was 20 when you were born?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Path-3534",
            "body": "If you don’t have the guts to see your marriage through then just leave. Don’t try to seek outside validation for your weak ass choice",
            "score": -2,
            "replies": [
                {
                    "author": "PlanetOfThePancakes",
                    "body": "She was groomed my this POS predator. She’s not weak",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ok-Path-3534",
                            "body": "And you’re basing this “grooming” assumption based on what?",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "PlanetOfThePancakes",
                                    "body": "The giant ass age gap?????? Are you blind?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Ok-Path-3534",
                                            "body": "I mean for all you know they could’ve met when she was 20 and she pursue him?  Why assume that it was the other way? For all you know he could’ve been some non traditional student in her College 101 biology class that she asked out.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "PlanetOfThePancakes",
                                                    "body": "It’s still gross and weird and the power imbalance places the onus on him. No 40 year old should be pursuing a 20 year old.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fast-Recognition-550",
            "body": "He’s old enough to be your father!!",
            "score": 0,
            "replies": []
        },
        {
            "author": "slothinsocks91",
            "body": "I don't think the pictures you uploaded were in order, and I feel like some things may have been left out, so I'll just go based on what I saw. Firstly, how long have you two been together? I usually don't give people flack about an age gap, but 20 years seems pretty extreme to me given you're so young. \n\nI'm horrible at explaining things so I deleted the majority of my comment because it hardly made sense to me after typing it out. Relationships are tough and as much as you might think you're the perfect partner, everyone has flaws. Getting down to it, if you love each other, go to therapy. If you're not interested in that, break up and move on. You're still young.",
            "score": -2,
            "replies": []
        },
        {
            "author": "RaiderNationBG3",
            "body": "You should give him another chance. Jmo.",
            "score": -3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -10,
            "replies": [
                {
                    "author": "onmyti89_again",
                    "body": "Gross.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Path-3534",
            "body": "Just screenshots with no context? Makes me wonder what part you’ve played in this relationship. It takes two people to make something work or not work. Always the other side to the story. It’s easy for all these comments to justify your side without knowing all the facts. 🤷🏾‍♂️",
            "score": -56,
            "replies": []
        },
        {
            "author": "Secure_Rock_3834",
            "body": "Did you read the screenshot? He was literally apologizing for putting his hands on me and throwing things.. what?",
            "score": 10,
            "replies": []
        },
        {
            "author": "KittenIttle",
            "body": "I’m going to totally ignore the COMPLETELY imbalanced power dynamic here to tell you something. I’m 36. My wonderful, supportive partner is 19 years older than me, so I understand being attracted to an older man and loving them for that as much as anything else. BUT the difference is I was already my own person when we cemented our relationship- I was 35. Not once has he EVER raised his voice at me. In the last six months in particular, we have not had a single argument- we communicate if we feel misunderstood or think we might have misunderstood. We talk it out if we come to a difference of opinion. We share every minute of every day and we have yet to have a lull in conversation. \n\nWhen I was 22, I dated women and men 10, 15, and many more years older. I learned those people seek out women who are barely legal because women their own age can see the fact that they’re still children. \n\nIn a way, you were groomed. Your brain is still leaning hard on the hippocampus for decisions, and that clouds judgement with emotions that cannot be separated from logic. Honey, you’re so young. You have one life. It took me 35 years to find a man who actually is a MAN and a partner and frankly the closest thing to a soulmate I believe exists. \n\n\nDon’t let people tell you to stay. The second he told you his animals were worth better treatment than you, he told you what he wanted. He wants a good obedient little girl, not a woman who is strong and smart and independent. And you ARE. Don’t let this overgrown 15 year old take that from you, because believe me, if you stay he will. Mine nearly killed me- eventually throwing things turned into me being thrown under a faucet while they tried to drown me, and so much worse. Don’t walk. Run.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Interesting_Note_937",
            "body": "You need to leave. NOW!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Path-3534",
            "body": "And?  My comment still stands, nobody is without fault when a relationship breaks down",
            "score": -52,
            "replies": []
        },
        {
            "author": "Must_Love_Dogs0331",
            "body": "No, it doesn’t “stand”. There is no justification for physical violence. They certainly need to communicate in a healthier manner with counseling UNLESS violence comes into play. ATP she needs to leave, immediately. And the age difference is creepy.",
            "score": 22,
            "replies": []
        },
        {
            "author": "frizabelle",
            "body": "Abusers aren’t provoked into being abusive by someone else’s behaviour. They want to abuse people. I think you probably know that, as if this is your attitude, you most likely are one.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Ok-Path-3534",
            "body": "Ooph now we’re making character judgements based off of comments. Meanwhile OP is posting off an account less than 2 months old with negative karma and this being its only post.\n\nDefinitely an AI Chat bot",
            "score": -38,
            "replies": []
        },
        {
            "author": "frizabelle",
            "body": "Yeah, when you make a comment saying a victim is as responsible for an abusive relationship as the abuser, it’s pretty revealing of your character. I’m really not sure why you think your words and opinions aren’t fair game to judge your character on.",
            "score": 26,
            "replies": []
        },
        {
            "author": "kaldaka16",
            "body": "Please explain to me how a victim of abuse is at fault for their (abusive) relationship breaking down. I really want to know how you justify that idea.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Path-3534",
            "body": "How do we know she wasn’t also an abuser? Anybody can come to a public forum and sow sympathy by posting screenshots with no context.\n\nBesides this has already been proven a rage bait post. It’s a 40 day old account with nothing but negative karma and this single post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kaldaka16",
            "body": "I'm not actually referring to this specific incident (though I disagree with your reading of it).\n\nYou said *nobody* is without fault when a relationship breaks down. I want to know if you truly think that about all relationships.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cscottrun233",
            "body": "That’s not true at all. One person could be doing everything to try to make it work while the other person fights against it.",
            "score": 1,
            "replies": []
        }
    ]
}