{
    "title": "Bachelor party dinner, split the bill? I barely had anything!",
    "author": "simikoi",
    "subreddit": "TwoHotTakes",
    "rank": 16,
    "score": 199,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/TwoHotTakes/comments/1jdjxg1/bachelor_party_dinner_split_the_bill_i_barely_had/",
    "id": "1jdjxg1",
    "selftext": "Okay so a buddy of mine was getting married and had a bachelor party. We all met up at a pretty nice restaurant to begin the evening. I got stuck in traffic and I was there about 45 minutes late. They had all been sitting around drinking heavily and already had several rounds of expensive cocktails by the time I got there.\n\nThey had already ordered the food but it hadn't arrived. Since I was late I just ordered a small steak and one beer, my total was maybe 30 bucks. The bill comes and it's astronomical.  Then they all look around and say shall we split the check? They tally it up and it's like $180 a person.  I didn't even bring that much cash with me so I couldn't have paid an even share if I wanted to.  I mentioned that all I had was a steak and a beer and I put in 60 bucks. Everyone kind of side eyes me and I hear a couple people at the end of the table grumble about how cheap I am. I don't even really know those guys so I shrug it off.  \n\nLater in the evening, one of the guys I do know pretty well pulls me aside and tells me that it's my buddy's bachelor party and I should have chipped in my full share. That a couple of the other guys who I don't know are upset with me.  He suggests I pay for a couple of rounds at the nightclub we were at to make up for it. But I declined and said I paid for way more than I ate.  \n\nAm I in the wrong here? I mean I know it's my buddy's bachelor party and all but $180 for a steak and a beer?\n\nEDIT: everybody is s assuming I'm broke and only have $60 to my name.  This isn't the case, I make a decent living and could have covered the entire check no problem.  But I was running to late and didn't have a chance to stop and get cash.  I had $100 on me and I assumed I'd be fine for dinner.  When I saw they had been drinking several rounds of expensive alcohol before I even got there it just didn't seem right to ask me to pay the full amount.  I ordered a small steak and a beer because I thought the kitchen could make it quick and I'd be able to get my food with everyone else, which I did.  \n\nEDIT 2:  several have said it was rude of me to be late. I suppose it was but the restaurant was over an hour away from me and I had to work that day. I left an hour and 15 minutes before I was supposed to be there and GPS said it would take about an hour. But along the way traffic conditions changed and it took me 2 hours. I texted that I was going to be late, I'm not sure what else I could have done.\n\nEDIT 3: The party took place a few years ago, it was pre-pandemic. So those of you who think you can't get a 4oz steak dinner and a beer for what I paid, you have to remember how much more restaurants cost now.  The steak was $20 and the beer was $7. \n\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for submitting to the Two Hot Takes Podcast Subreddit! We'd like to remind you that all posts are subject to being featured in an episode of the Two Hot Takes Podcast. If your story is featured you'll\nget a nifty flair change to let you know and we'll drop a link so you can see our host's take on your story.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "andrei_snarkovsky",
            "body": "The only rule of bachelor parties is that the bachelor doesn't pay. After the bachelor is covered, what the rest of the party ordered for themselves was on them.",
            "score": 296,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "The bachelor did not pay either. They got the bill and counted heads, minus the bachelor, and divided equally among the number of people there.",
                    "score": 81,
                    "replies": [
                        {
                            "author": "andrei_snarkovsky",
                            "body": "Right. I’m saying that’s the only rule. Your friend who pulled you aside and said you should have paid your share since it’s a bachelor party is wrong.",
                            "score": 87,
                            "replies": [
                                {
                                    "author": "Imaginary_Shelter_37",
                                    "body": "Your share is your food and drinks plus tax and tip, plus  your portion of bachelor's food and drinks plus tax and tip.\n\nI think equal sharing of costs is fine as long as no one's individual bill is substantially more or less than the others.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "simikoi",
                                    "body": "The first rule of bachelor club is... the bachelor doesn't pay \n\nThe second rule of bachelor club is... the bachelor doesn't pay.\n\nThe third rule of bachelor club is... THE BACHELOR DOESN'T PAY!",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "peppsDC",
                                            "body": "I do feel like you should pay your full share of whatever the bachelor had. It's not his (or his friends') fault you were late. 60 for your dinner/drink and whatever percentage of his stuff sounds a bit light, but it depends on the prices of the place and obviously I can't see the menu so it might be OK. \n\nBut yeah by no means so you owe the full 180.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "serjsomi",
                            "body": "How many guys were there?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "simikoi",
                                    "body": "Including me and the bachelor, I think there were around 12 of us.  I'm not sure exactly what kind of drinks they all ordered, but I know a few of them had ordered some pretty expensive scotch at some point before I got there because I heard them discussing it.",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "serjsomi",
                                            "body": "At 180 I bet they did order some expensive drinks. Id say your 60 was the perfect amount. I wouldn't pay for others if I only had something small either.",
                                            "score": 44,
                                            "replies": [
                                                {
                                                    "author": "simikoi",
                                                    "body": "They were talking about this scotch they had and bragging about how good it was.  Not sure which one they ordered or how many they actually drank.",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "serjsomi",
                                                            "body": "I'd wager if you put 3 scotches in front of them they'd have a 30% chance of picking out the one they \"loved\"",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "simikoi",
                                                                    "body": "You're probably right",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Tight-Shift5706",
                                            "body": "Typically,  with large groups, separate checks are not issued.  My experience has been that bachelor doesn't pay for ANYTHING.  From there, the bill is equally divided.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mr_gonzalo05",
                    "body": "Yeah, homie is already paying with his freedom",
                    "score": -14,
                    "replies": []
                }
            ]
        },
        {
            "author": "loricomments",
            "body": "Screw that. You are not there to subsidize their drinking and you did kick in extra for the groom. They're the cheapskates, not you.\n\nEdit for my shitty proofreading.",
            "score": 62,
            "replies": [
                {
                    "author": "No-Eagle-5072",
                    "body": "Exactly! You already overpaid for what you had..if anything, they should be thanking you for covering part of their tab.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Comfortable-Focus123",
            "body": "You always discuss prior. There are always people who will take advantage of these types of situation.",
            "score": 13,
            "replies": []
        },
        {
            "author": "BefuddledPolydactyls",
            "body": "If you covered your meal and beverage, and your share of the bachelor's, you should be good. If he was one of the scotch drinkers, you just might have been a bit short.",
            "score": 30,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "Hmmm, interesting point.  I hadn't considered the possibility that they were buying him the expensive scotch.  He definitely wasn't the only one drinking it because several were talking about how excellent it was.  But yeah that could have meant I didn't cover enough of his share.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Middle_Arugula9284",
            "body": "Only mistake you made was NOT Asking for a separate check once you showed up really late. Thats it.",
            "score": 35,
            "replies": []
        },
        {
            "author": "Lisa_Knows_Best",
            "body": "You're not wrong and this shit happens all the time. For future events such as this just ask for your own check when you get there. It's not that big of a deal especially consider you get there late and didn't spend much.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Enough_Ad_7577",
            "body": "I had a bachelor party where splitting the bill was fine for 6/7 meals...the final meal a couple people got upset about splitting based on what they ordered. I understood their frustration with it, but we also were not going to sit down and calculate exactly what everyone had and what they owe to the penny. \n\nwhen I pushed back, some other people in the group just handed me cash to make up for the complainers, which didn't really feel like a great solution but it smoothed things over as a group. \n\nI do understand being upset about a huge discrepancy ($180 vs. $60), but my situation was closer to $35 vs. $70. \n\nyou're not in the wrong, and the group should have been more transparent on how splitting meals will work before the bachelor party started.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fattydog",
            "body": "You’re not wrong so long as you covered your proportion of the Groom’s meal too.\n\nHowever, you have really minimised being an hour late. Was this planned or did you just not turn up and make everyone wait an hour for you?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Lucky_Log2212",
            "body": "Not wrong. They partied, they drank and you didn't. They shouldn't be so dumb to have done that. They said they were splitting the bill. YOU paid for your portion. What they did was on them, not you. They can be as mad as they want to be.",
            "score": 7,
            "replies": []
        },
        {
            "author": "spyy-c",
            "body": "It depends on your friend group dynamic, really.\n\nThe way some people operate is that since they are amongst friends, they just split everything evenly because the value per person doesn't matter, they just split everything evenly regardless of whether or not it's \"even.\" It's a sign of friendship, no one is worried about who ordered what. It also makes it way easier to pay when everyone is drunk.\n\nPeople that are more close knit just don't care enough to nitpick about whether or not they got their fair share. How much money you have and your age probably factors in as well. I know people who would insist on paying equally even if they didn't eat, and know some people who literally couldn't afford to splurge like that even if they wanted to. They sound like the kind of people that have money to spend, and all know each other very well, so they probably perceived it as you snubbing them.\n\nWould I be correct in assuming you're younger, make less money than them, and arent as close as friends to the group as you are to the groom?",
            "score": 4,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "You would be incorrect in your assumption that I was younger.  We were all pretty close in age, I am maybe 2 years older than the groom.  But yes there were several guys there I didn't know at all and others I had only met once and a couple I know very well.  I don't know what kind of income the other guys made, but I earn a similar income to the guys I do know.\n\nEveryone is assuming I don't have money because I didn't bring that much money with me.  I could have covered the entire check if I wanted to.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "spyy-c",
                            "body": "Well assumptions about you aside, some people just always split even when they go out no matter what when with close friends",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WhatsInAName1117",
            "body": "I don’t see how they’re all so dense because you obviously showed up late. I’m sure they all seen you show up when you did and they had already drank so much at that point so you clearly didn’t partake. I can only image what type of people some of these “friends” to the bachelor are. A lovely crowd (I’m being sarcastic).",
            "score": 4,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Backup of the post's body: Okay so a buddy of mine was getting married and had a bachelor party. We all met up at a pretty nice restaurant to begin the evening. I got stuck in traffic and I was there about 45 minutes late. They had all been sitting around drinking heavily and already had several rounds of expensive cocktails by the time I got there.\n\nThey had already ordered the food but it hadn't arrived. Since I was late I just ordered a small steak and one beer, my total was maybe 30 bucks. The bill comes and it's astronomical.  Then they all look around and say shall we split the check? They tally it up and it's like $180 a person.  I didn't even bring that much cash with me so I couldn't have paid an even share if I wanted to.  I mentioned that all I had was a steak and a beer and I put in 60 bucks. Everyone kind of side eyes me and I hear a couple people at the end of the table grumble about how cheap I am. I don't even really know those guys so I shrug it off.  \n\nLater in the evening, one of the guys I do know pretty well pulls me aside and tells me that it's my buddy's bachelor party and I should have chipped in my full share. That a couple of the other guys who I don't know are upset with me.  He suggests I pay for a couple of rounds at the nightclub we were at to make up for it. But I declined and said I paid for way more than I ate.  \n\nAm I in the wrong here? I mean I know it's my buddy's bachelor party and all but $180 for a steak and a beer?\n\n\n\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "nagato36",
                    "body": "Nah you do not owe those guys anything, you can treat the bachelor but that’s about it I’d say",
                    "score": 7,
                    "replies": [
                        {
                            "author": "simikoi",
                            "body": "I figured the extra 30 bucks I threw in more than covered my share of what the bachelor ordered.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "subsetsum",
                                    "body": "Not sure. How many people were there? If there were ten total friends, not including the bachelor then at $180 each that implies that the bill was $1800.  The cost for each of the 10 people also cover the bachelors part of the meal, had he been included the cost per person would be $1800/11 or $163.63 per person.  You kicked in $60 total so the $1740 still due is to be divided among the 9 friends, meaning each pays $193.33/person. Each person is now paying $13.33 more than they otherwise would have, or $13.33*9 = $120. Long story short, this is probably why they are pissed. They were counting on splitting the bill ten ways but because you didn't carry 1/10 of the load they each ended up paying more. ",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "2livecrewnecktshirt",
                                            "body": "So OP should be paying $120 more so the other 10 don't pay $13 more? What?",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SoftwareMaintenance",
            "body": "Should have asked for a separate check. Then chipped in your portion for the bachelor's cost.\n\nAs an aside, I don't think how much cash op had at the moment had any bearing on the situation.",
            "score": 1,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "I probably should have asked for a separate check, but I was the one who was late and I had about 30 seconds to order my food if I had any chance of getting my food brought out at the same time as everyone else's.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JellicoAlpha_3_1",
            "body": "If I were you, I'd go to the wedding and bail on the party afterwards\n\nAfter the wedding, when the groom asks what was up...you can explain that after your negative experience at the bachelor party, you decided you didn't want to socialize with those guys anymore moving forward",
            "score": 1,
            "replies": []
        },
        {
            "author": "simikoi",
            "body": "Yes I was late, but I was coming from over an hour away and I had to work that day. I left an hour and 15 minutes before I was supposed to be there and GPS even told me it would take about an hour. But along the way traffic conditions changed and it took me 2 hours. I texted when I hit the traffic and let them know I'd be late. Not sure what else I could have done.  \n\nIf I was close friends with the majority of the people at the party I might have zelled them money but I only knew the bachelor and one or two other guys. And all these other guys I didn't know were sitting there drinking ridiculously expensive Scotch for almost an hour. I don't see why I should have had to pay for all their drinks.  I paid for more than my share of the bachelor's meal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jamestiberousjlkirk",
            "body": "Equal split !",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiny_Ad_6951",
            "body": "Who brings 60$ to a bachelor party and is maxed out at that point?",
            "score": 0,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "I had credit cards and I could have hit the ATM later if I needed to.  But I was running late and couldn't stop for cash before I got there.\n\nBut I had $100 cash on me, I just didn't feel I needed to pay for their expensive cocktails when I wasn't even there while the drinking took place.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Middle_Process_215",
            "body": "$60 is hella light at a steak place. You needed to contribute at least $100 as you were paying for part of the bachelor's meal as well. I haven't seen a meal at a steak joint that was less than $60 anywhere.",
            "score": 1,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "This took place a few years ago, pre-pandemic. It's hard to remember what prices were like back then, but restaurants were a hell of a lot cheaper. My 4 oz steak was $20 and my beer was $7. Maybe with tax and tip I should have factored it to be closer to $35. But my share of the bachelor's portion was under $20 so I more than covered it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Middle_Process_215",
                            "body": "Wow. A steak for $20. That's unheard of.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "simikoi",
                                    "body": "This was pre-pandemic prices, and I got the 4oz \"petite\" steak.  It was $20 and the beer was around $7.  Because I was late I didn't want my food to come out late and I had like  30 seconds to decide.  I figured the small steak could be made quicker.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "grateful_dad13",
            "body": "You were pretty late to an important event which is not particularly nice. You’re making a point about fairness over a relatively small amount as bachelor parties go. You’ll remember their disappointment longer than you would have remembered paying some extra money. Cash is irrelevant since there’s Venmo, Zelle. Why didn’t you enjoy a nice cocktail and get with the festivities of your good friends instead of having one drink?  I went out recently with friends- I don’t drink so I drove. They drank a lot, had a big pile of oysters which I didn’t have. I paid my share rather than making a point about fairness. I’d personally rather be thought of fun, easygoing and generous than making a point of paying just what I had especially since you likely didn’t even cover your share of the bachelor. Weddings and bachelor parties are expensive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Winter-Brief-6991",
            "body": "So how far do you live from where the bachelor party was? Were you truely late because of traffic, or were you late because you’re bad at planning, or were hoping to miss dinner to avoid spending money?\n\nI agree you shouldn’t have had to pay that much, but man, your punctuality will start affecting your friendships if you don’t work on it.",
            "score": -6,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "You think I was trying to be late to my friends party???  No, that was not my plan.  It was pretty far away, about an hour drive.  I left over an hour ahead of time as a cushion but I hit a lot of traffic and it took two hours.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "I had money and I had more than $60 on me.  I just didn't have $180 cash on me.  I was running late so couldn't stop at the ATM.  I had $100 cash and I figured that should be enough to get me through dinner.  If I wasn't late I could have had time to stop and get cash and I would have been drinking with the rest of them and paid my share.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "allislost77",
            "body": "It was his bachelor party… so yeah. Should have known that. YTA",
            "score": -13,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "I guess it's my fault for being late? Had I been there the entire time I probably would have equally taken part in all the expensive drinks and cocktails they had.  But I was late and just had a petite 4 oz steak and a beer.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "BenedictineBaby",
                            "body": "You paid for your own and chipped in 30 for the bachelor. You aren't cheap. They are massive assholes for expecting you to pay for part of THEIR tabs.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "allislost77",
                            "body": "It’s not that big of a deal, you didn’t know. I’ve been in those situations and it sucks because there’s always a couple of assholes who kind of take advantage, knowing the bill will be split. Last one I went to was $300. \n\nI honestly didn’t go to a couple just for this reason alone. I just took the groom out on a different day and paid for everything.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "hhamzarn",
                                    "body": "I have specific friends I will not go out to dinner with because they’re the ones who promote splitting the tab and then overindulge. My hubs and I just keep it more to a potluck at someone’s house scenario with them and then no one feels taken advantage of.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "revengeappendage",
                            "body": "I mean, I doubt that. The only reason you were late is because you were stuck in traffic. You even said you didn’t bring enough to cover it.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Town_3603",
            "body": "$180 x 12 = $2160\n\n$2160 - $30 = $2130 \n(assuming you calculated $30 for your beer + steak w/ tax & tips correctly)\nI don't know a place that sells steak & beer with tax tips for $30.\n\n$2130 / 11 = $193.63 per person including bachelor, but not you.\n\nBachelor portion to be divided by 11 people: $193.63 / 11 = $17.60 per person\n\nEveryone else pays $193.63 + 17.60\n\nYou pay $30 + $17.60",
            "score": 0,
            "replies": [
                {
                    "author": "simikoi",
                    "body": "\"I don't know a place that sells steak & beer with tax tips for $30.\"\n\nThis all occurred a few years ago (pre-pandemic) so prices for things weren't as crazy as they are now. Plus I ordered the petite 4oz steak in hopes of it being done at the same time as everyone else.  I'm not sure exactly what my tax/tip total was, maybe closer to $35?  But that's why I threw in $60, figured that should more than cover it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "NeverRarelySometimes",
            "body": "YTA. You're supposed to be treating the groom, too.",
            "score": -11,
            "replies": [
                {
                    "author": "FinalConsequence70",
                    "body": "OPs bill was $30. He kicked in $60. So twice what he consumed. Why should he be subsidizing the expensive mixed drinks and whiskey ( that he heard them talk about ) of a bunch of random guys he doesn't know? Especially since he wasn't even there to partake?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "NeverRarelySometimes",
                            "body": "That was his fault, too.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "FinalConsequence70",
                                    "body": "Not really sure how if he didn't agree to cover anything other than his share and a portion of the groom's. This is shit that gets agreed upon PRIOR to an event, not after a bunch of people go hog wild and then expect everyone else to subsidize THEIR expensive purchases.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}