{
    "title": "AITA for telling me dad’s sisters that they helped him die after his funeral last week?",
    "author": "Status_Tomatillo_401",
    "subreddit": "TwoHotTakes",
    "rank": 17,
    "score": 49,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/TwoHotTakes/comments/1jdqjvc/aita_for_telling_me_dads_sisters_that_they_helped/",
    "id": "1jdqjvc",
    "selftext": "This will be long sorry in advance. I, 37 female, just lost my dad 66 male a few weeks ago. It is important to know that I always adored and sought my dad‘s approval, even though he made me work for it my entire life. A little backstory is needed so here goes. \nI am one of six siblings, growing up. I was my parents only daughter and I had five brothers. My two oldest brothers were my mom’s my third oldest brother was my dad and myself, and my two other brothers were result of their marriage. \n\nRight before my 21st birthday my dad had my little sister as a result of him having a two-year affair in which he blamed on me when I moved out of the house right before my high school graduation. \n\nGrowing up my parents/mother owned a large foster agency, which provided a very comfortable living for both my immediate family as well as the extended family on both sides. That is important to know because prior to their business ownership my mom and dad had a rocky marriage, which caused his family to take sides. His sisters were always exceptionally cruel to my mother, but when she amassed wealth, his sisters became remarkably kinder to her. \n\nBut here’s where the story takes a turn all of the stress from owning this child placement agency due to the nature of its environment, and the things that she had to see children go through my mother, became very sick, resulting in her congestive heart failure diagnosis and her closing her foster agency down. So after several years of my father, not having to work at all, he in turn ended up opening his own roofing company, which grew to be very successful. The moment the financial success transferred so did the kindness from mydad’s sisters. With my dad no longer having to rely on my mother financially his cruelty and abusive nature was able to flourish. \n\nBecause he and his family is from a different southern state than  we originally were from, our accents and demeanors were different. We were often called proper and or uppity. This gave him a way to constantly make fun of me with assistance from his sisters to my face during family get-togethers. They took it a step further and included my cousins in the teasing and ridiculing. Many times my dad would go out of his way to financially support his sisters and nieces and their various endeavors, but would refuse to help my mother pay for school trips or activities that involved myself and my brothers. He would regularly call us derogatory names, such as stupid and or dumb, even though we had some of the highest grades in our school. He regularly told me that I was a failure or compared me to my cousins. Mind you, I received a presidential invite at 17 to attend Bush’s 2nd inauguration after impressing during my first sole visit to Washington DC. My ultimate frustration came to a head weeks before my graduation when I just packed up my things and moved out of the house to move in with my now ex-husband. \n\nAt my wedding my dad even went out of his way to skip the father daughter dance because he was talking to his mistress that we knew nothing and he even invited his sisters who I specifically said I did not want to come. \n\nA year and a half into my marriage, my mother discovered my dad‘s two year affair that his sisters not only knew about but also helped him engage in and hide, as well as the fact that his mistress was pregnant with my youngest sister. What followed was pure hell as my parents had a very ugly divorce made worse because my dad ended up giving my mother an STI that she was allergic to and inevitably aided in her death. \n\nThe same year of my mother‘s passing my father, who is also diabetic, injured his foot. I had begged his sisters to take him to the doctor because he refused to go with me. They laughed at me and laughed it off, resulting in him getting gangrene and having his leg removed. What followed was the stiff and steady decline of his mental and physical health. \n\nLast year out of the blue my dad called me for help and like the dutiful  child that I’ve always tried to be to him, I came to his Aid without hesitation. He revealed to me that he had to have part of his colon removed in which I took him to his surgery and doctors appointments while also being heavily pregnant and raising my two autistic children. Right after his surgery, he also found out that he had stage three lung cancer from the 30 odd years of smoking, as well as the asbestos covered rules that he would work on. After going through his first round of radiation chemotherapy, he caught the flu and less than a month ago passed away. \n\nThe day that he passed away, his sisters made everything absolutely impossible. They refused to let us, his children participate in planning his funeral going as far as to block anybody from talking to us at hospitals and funeral home. they lied about his time of death, telling us that he just started to decline and pass suddenly when in fact, they knew the day before his passing that his death was soon approaching, thus robbing us of spending his last moments with him. When I would inquire as to his viewing or service, they would lie and say they weren’t for sure what day everything would be on. When I would ask about the obituary, they would keep telling me that it wasn’t done yet. But at the same time would ask me for information as well as for pictures of him over the years. When his viewing was being held both I and my fiancé showed up surprising everyone because we were not supposed to know when and where it was being held, but they forgot that Google is free. Upon our arrival, we were threatened that if we did or said anything that they did not like they had tasers and would put us down. And despite how many times we ask for funeral programs or a simple copy of his obituary which they refuse to have printed in the newspaper, they refused to give us a copy going as far as to send that in the messages. \n\nMay I also add that they intentionally made his funeral on a weekday, knowing that not only am I a teacher, but that I also could not bring my disabled children and expect them to be safe due to their elopement issues. So I begged them to please just let me have a funeral program. Something for me to hold on to,  a token or a Momento something in which they refused and made threats. They went as far as to text me the picture of the cover of his funeral program and nothing more. \n\nThis is where I may be the asshole because after years of rejection and belittlement, I decided that lowering them off of their high horse will also extending an olive branch of forgiveness was necessary. I told them that the death of their beloved brother was their fault minus the cancer. I will not blame my reaction purely on grief because that is immature. I did it because I hit my wall with them years of being verbally abused and belittled ultimately led me to my action. Needless to say me finally standing up for myself did not go over well and right when they hit their ceiling, I blocked them wow never to listen and or hear anymore of the abuse that they had grown so comfortable with dishing out. I took it a step further and blocked every member of his family, including my brother and my sister who watched what they were doing and said nothing, even though they never showed up for him. So…. AITA?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for submitting to the Two Hot Takes Podcast Subreddit! We'd like to remind you that all posts are subject to being featured in an episode of the Two Hot Takes Podcast. If your story is featured you'll\nget a nifty flair change to let you know and we'll drop a link so you can see our host's take on your story.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tight-Shift5706",
            "body": "OP,\n\nNo offense.  Your father is likely in hell, and his sisters will follow.  Don't waste another moment with they and their garbage.\n\n Research and locate a seasoned probate attorney to discuss your entitlements and alternatives regarding his death. Hopefully he has an estate to which you are entitled.  Perhaps in his death he can provide for you what he failed during his life.",
            "score": 81,
            "replies": []
        },
        {
            "author": "Moemoe5",
            "body": "I’m confused..Your dad was a horrible person and he died how he lived. His sisters are no better. You don’t need to forgive them. Just stay away from them.",
            "score": 35,
            "replies": [
                {
                    "author": "Southern_Common335",
                    "body": "This 100%.   Good riddance to all.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Puzzlehead-Bed-333",
            "body": "Seconding, you need a good probate lawyer stat. Today. \n\nYou can never communicate with them again however you should be entitled to a portion of his (and your mother’s he likely received) estate. \n\nDo not let yourself and your children down in this regard and call today.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Biotoze",
            "body": "Some people deserve to be forgotten.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok_Passage_6242",
            "body": "NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "Subject-Regret-3846",
            "body": "NTA\n\nNow go on and be free and don’t talk to any of these people ever again. That would be the most healthy thing for you to do. \n\nDon’t get pulled into their drama, etc. Honestly, that’s what you should’ve done with your dad because he was terrible too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Backup of the post's body: This will be long sorry in advance. I, 37 female, just lost my dad 66 male a few weeks ago. It is important to know that I always adored and sought my dad‘s approval, even though he made me work for it my entire life. A little backstory is needed so here goes. \nI am one of six siblings, growing up. I was my parents only daughter and I had five brothers. My two oldest brothers were my mom’s my third oldest brother was my dad and myself, and my two other brothers were result of their marriage. \n\nRight before my 21st birthday my dad had my little sister as a result of him having a two-year affair in which he blamed on me when I moved out of the house right before my high school graduation. \n\nGrowing up my parents/mother owned a large foster agency, which provided a very comfortable living for both my immediate family as well as the extended family on both sides. That is important to know because prior to their business ownership my mom and dad had a rocky marriage, which caused his family to take sides. His sisters were always exceptionally cruel to my mother, but when she amassed wealth, his sisters became remarkably kinder to her. \n\nBut here’s where the story takes a turn all of the stress from owning this child placement agency due to the nature of its environment, and the things that she had to see children go through my mother, became very sick, resulting in her congestive heart failure diagnosis and her closing her foster agency down. So after several years of my father, not having to work at all, he in turn ended up opening his own roofing company, which grew to be very successful. The moment the financial success transferred so did the kindness from mydad’s sisters. With my dad no longer having to rely on my mother financially his cruelty and abusive nature was able to flourish. \n\nBecause he and his family is from a different southern state than  we originally were from, our accents and demeanors were different. We were often called proper and or uppity. This gave him a way to constantly make fun of me with assistance from his sisters to my face during family get-togethers. They took it a step further and included my cousins in the teasing and ridiculing. Many times my dad would go out of his way to financially support his sisters and nieces and their various endeavors, but would refuse to help my mother pay for school trips or activities that involved myself and my brothers. He would regularly call us derogatory names, such as stupid and or dumb, even though we had some of the highest grades in our school. He regularly told me that I was a failure or compared me to my cousins. Mind you, I received a presidential invite at 17 to attend Bush’s 2nd inauguration after impressing during my first sole visit to Washington DC. My ultimate frustration came to a head weeks before my graduation when I just packed up my things and moved out of the house to move in with my now ex-husband. \n\nAt my wedding my dad even went out of his way to skip the father daughter dance because he was talking to his mistress that we knew nothing and he even invited his sisters who I specifically said I did not want to come. \n\nA year and a half into my marriage, my mother discovered my dad‘s two year affair that his sisters not only knew about but also helped him engage in and hide, as well as the fact that his mistress was pregnant with my youngest sister. What followed was pure hell as my parents had a very ugly divorce made worse because my dad ended up giving my mother an STI that she was allergic to and inevitably aided in her death. \n\nThe same year of my mother‘s passing my father, who is also diabetic, injured his foot. I had begged his sisters to take him to the doctor because he refused to go with me. They laughed at me and laughed it off, resulting in him getting gangrene and having his leg removed. What followed was the stiff and steady decline of his mental and physical health. \n\nLast year out of the blue my dad called me for help and like the dutiful  child that I’ve always tried to be to him, I came to his Aid without hesitation. He revealed to me that he had to have part of his colon removed in which I took him to his surgery and doctors appointments while also being heavily pregnant and raising my two autistic children. Right after his surgery, he also found out that he had stage three lung cancer from the 30 odd years of smoking, as well as the asbestos covered rules that he would work on. After going through his first round of radiation chemotherapy, he caught the flu and less than a month ago passed away. \n\nThe day that he passed away, his sisters made everything absolutely impossible. They refused to let us, his children participate in planning his funeral going as far as to block anybody from talking to us at hospitals and funeral home. they lied about his time of death, telling us that he just started to decline and pass suddenly when in fact, they knew the day before his passing that his death was soon approaching, thus robbing us of spending his last moments with him. When I would inquire as to his viewing or service, they would lie and say they weren’t for sure what day everything would be on. When I would ask about the obituary, they would keep telling me that it wasn’t done yet. But at the same time would ask me for information as well as for pictures of him over the years. When his viewing was being held both I and my fiancé showed up surprising everyone because we were not supposed to know when and where it was being held, but they forgot that Google is free. Upon our arrival, we were threatened that if we did or said anything that they did not like they had tasers and would put us down. And despite how many times we ask for funeral programs or a simple copy of his obituary which they refuse to have printed in the newspaper, they refused to give us a copy going as far as to send that in the messages. \n\nMay I also add that they intentionally made his funeral on a weekday, knowing that not only am I a teacher, but that I also could not bring my disabled children and expect them to be safe due to their elopement issues. So I begged them to please just let me have a funeral program. Something for me to hold on to,  a token or a Momento something in which they refused and made threats. They went as far as to text me the picture of the cover of his funeral program and nothing more. \n\nThis is where I may be the asshole because after years of rejection and belittlement, I decided that lowering them off of their high horse will also extending an olive branch of forgiveness was necessary. I told them that the death of their beloved brother was their fault minus the cancer. I will not blame my reaction purely on grief because that is immature. I did it because I hit my wall with them years of being verbally abused and belittled ultimately led me to my action. Needless to say me finally standing up for myself did not go over well and right when they hit their ceiling, I blocked them wow never to listen and or hear anymore of the abuse that they had grown so comfortable with dishing out. I took it a step further and blocked every member of his family, including my brother and my sister who watched what they were doing and said nothing, even though they never showed up for him. So…. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "TravelKats",
                    "body": "You were and are way to involved with these people.  You need to move on.  What they do or don't do isn't your concern unless they do it to you. Quit talking to them and caring about their bad behavior.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Organic_Can_7036",
                    "body": "Let's be real, sharing family secrets ain't cool, right?",
                    "score": -13,
                    "replies": []
                }
            ]
        },
        {
            "author": "DesperateLobster69",
            "body": "NTA. Terrible people all around! Everyone except for you, OP.. you need to make the calls to find out when the will is being read and if there is one. You need to find out what you're getting/entitled to, get it & never speak to those loser sisters ever again!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "JellicoAlpha_3_1",
            "body": "This is an AI Story folks...spammed into multiple subs for karma\n\nDownvote and move on",
            "score": 1,
            "replies": [
                {
                    "author": "Status_Tomatillo_401",
                    "body": "No this is not an AI story. Yes I did cross post MY real life events but not for subs",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Status_Tomatillo_401",
                    "body": "No this is not an AI story. Yes I did cross post MY real life events but not for subs",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JellicoAlpha_3_1",
                            "body": "If you say so\n\nAnd yes, you are karma pharming\n\nYou don't need to post the same story in 5 different places just to get some advice. \n\nOnce is more than enough",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Status_Tomatillo_401",
                                    "body": "I posted it in 3 places. What is karma pharming?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}