{
    "title": "AITA for cutting off my best friend of 15 years after our weddings?",
    "author": "Happy_Pin_7613",
    "subreddit": "TwoHotTakes",
    "rank": 4,
    "score": 1663,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 71,
    "url": "https://www.reddit.com/r/TwoHotTakes/comments/1jdwt4r/aita_for_cutting_off_my_best_friend_of_15_years/",
    "id": "1jdwt4r",
    "selftext": "\nAbout a year ago, my best friend and I got engaged about two months apart. I’ve always known I didn’t want a wedding ceremony or reception, but my fiancé insisted. So, I honored his wishes and started planning.\n\nAt the same time, my friend was planning her wedding and asked me to be her maid of honor. Typically, that role comes with planning the bachelorette party, so I found myself knee-deep in organizing that too. Then she asked me to throw her a combined wedding shower/housewarming party—all of this coming out of my own pocket while I was also planning and paying for my own wedding and honeymoon.\n\nOn top of that, I was expected to buy a dress from a specific website, name-brand shoes, and get professional hair and makeup for her wedding day. I estimate I spent around $2,000 on her wedding events. The other bridesmaids offered to chip in for supplies more than once but never actually followed through.\n\nI chose not to have bridesmaids because I didn’t want my friends to assume the financial burden of being in a bridal party, nor did I want to cover those costs for them. My plan was to have a small ceremony with immediate family, followed by a reception with all of our loved ones at the same venue.\n\nMy friend never offered to help throw me a wedding shower or bachelorette party, which I understood since she wasn’t “in the bridal party.” But then again—no one was. And she was well aware that she was my best friend. This wasn’t the first time in our friendship that I felt like I was the only one putting in effort while she simply received.\n\nThe Red Flags Begin\n\nFlash forward to her wedding shower/housewarming party. After all the planning, purchases, and decorations—set up for 75 guests—only three people showed up. She spent the entire time entertaining those three while barely acknowledging me. I understood she was likely upset about the turnout, but it didn’t excuse how she dismissed my presence. After all, of the 75 invited guests, I was the one who showed up, I was the one who planned it, I was the one who paid for it, set it up, attended, and cleaned up afterward. I even got a gift for them from her registry. It felt like I was nothing more than a free event planner, caterer, and host. \n\nThen came her bachelorette party. Luckily, this time, people actually showed up. But again, I felt more like an unpaid coordinator than a cherished friend. It felt like she saw my efforts as an obligation rather than a gift from a best friend. The next morning, our mutual friend and I got up early, cleaned everything, and packed up the cars—while she stayed asleep in the common space where she could hear us (we were literally popping balloons). When we woke her up to say goodbye, all we got was a half-asleep, half-hearted “thank you.”\n\nThe Wedding\n\nTwo weeks before her wedding, I told her I had cleared my schedule to help with any last-minute planning. This meant driving 45 minutes to her place—twice—to help out.\n\nOn the day of her ceremony (a Friday, meaning I had to use PTO), she barely spoke to me but still expected me to have everything handled. And I did. No major issues, just that same underlying feeling that I was being taken advantage of as her Type A planner friend.\n\nThen it was time for my wedding. A mutual friend tried to plan a bachelorette party for me with her, but she didn’t help—so we canceled it to avoid stressing out our mutual friend.\n\nIn the weeks leading up to my wedding, that mutual friend and I met up multiple times to help finalize details. Meanwhile, my best friend never checked in.\n\nOn my wedding day, she sent me a text:\n\n“Is there anything I can help you with?”\n\nEverything was already done. It was too little, too late. It just reinforced the feeling that I was an afterthought—that she only reached out because she had to, not because she actually wanted to.\n\nAt my reception, she realized she hadn’t been invited to the ceremony and began crying. She proceeded to cry for most of the reception. And remember the gift I got her from her registry, despite everything I was doing for both her wedding and mine? She got us a card with cash. Which, I mean, sure—I’m not ungrateful—but at that point, the sentiment mattered so much more to me. And she didn’t even include a heartfelt note. She did come up to congratulate me—while sobbing—and later spoke with our mutual friend, who told her that whatever concerns she had needed to wait until after my honeymoon.\n\nShe didn’t listen.\n\nThe Final Straw\n\nAt 2 AM on my wedding night, she sent me a long-ass paragraph about her feelings, her confusion, and her desire to “fix” our relationship.\n\nAt that point, I was done. I told her we’d talk after I got back from my honeymoon.\n\nWhile I was away, I gained clarity. I realized I didn’t see a point in talking things through because the root issues had been there for years. And I couldn’t get past the fact that she thought it was acceptable to send me that message on my wedding night. It was yet another moment where her feelings took priority over my experience.\n\nIt’s been four months since I cut her off.\n\nAITA?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for submitting to the Two Hot Takes Podcast Subreddit! We'd like to remind you that all posts are subject to being featured in an episode of the Two Hot Takes Podcast. If your story is featured you'll\nget a nifty flair change to let you know and we'll drop a link so you can see our host's take on your story.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "TexasToastt",
                    "body": "You are a FANTASTIC friend and you are NTA.  I hope you find a friend just like yourself one day.  \n\nI want to tell you something my mother said several times to me growing up. \"There are only two different kinds of people in the whole world:  There are givers and there are takers.  A giver will never be a taker, and a taker can never be a giver.\")",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "kyero8",
            "body": "Heck no, NTA! You’re a giving friend, and she’s a taker. You don’t need someone like that in your life. I hope you were able to enjoy your reception and honeymoon despite her making it about herself.",
            "score": 738,
            "replies": [
                {
                    "author": "Medical_Let_2001",
                    "body": "Exactly! OP went above and beyond, and her friend couldn't even match a fraction of that effort. Cutting her off was the right call, friendships should be a two-way street, not a one-sided chore.",
                    "score": 112,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrandWrangler8302",
            "body": "NTA. She used you, plain and simple. Your wedding night message was the ultimate proof of her selfishness.",
            "score": 193,
            "replies": []
        },
        {
            "author": "Full-Desk5792",
            "body": "Nuhuh NTA! What a leech, disgusting behaviour if I do say so myself. \n\nHow do people find this audacity? Under which mountains, through which rivers, across which oceans do they find the gall, to act like that???\n\nYou’re better than me, I would’ve slapped the tears off her face at the wedding and then sent her an invoice for the money spent on all of her events (which were so undeserved). \n\nEnough negativity though, I HOPE YOU AND YOUR PARTNER HAVE AN AMAZING LIFE TOGETHER FULL OF LOVE AND LAUGHTER AND JOY!!!!",
            "score": 125,
            "replies": []
        },
        {
            "author": "TalkAboutTheWay",
            "body": "3 people out 75 invited showed up???!!! Hahahaha oh my god. Those no shows knew what was up!",
            "score": 99,
            "replies": [
                {
                    "author": "Thrillllllho",
                    "body": "I would love to know if they actually RSVP'd or were just invited",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheRealCarpeFelis",
            "body": "Unquestionably NTA. She’s a user. You may have been ber best friend but she sure as hell wasn’t yours.\n\nI had a friend much like that. She was MOH in my first wedding. Back in those days (1980) bachelorette outings weren’t full weekends or trips like we see today. It was her idea she’d take me out for bachelorette drinks the night before my wedding. I didn’t ask her to, it was definitely her idea. \n\nCome the week of the wedding, she tells me sorry, can’t do it, because another friend will be in town that night and she just HAD to see him. You’d assume from this that he was a romantic interest, but he wasn’t. I pointed out to her that this was my wedding, a once in a lifetime thing (little did I know… he turned into Evil Starter Husband, but I digress). She didn’t care. Because my other bridesmaid wasn’t in town yet, I ended up going out that night with another friend who wasn’t even in the wedding party—and wished I’d asked her to be MOH instead.\n\nAnd then I started thinking back. Like your “friend”, she was also a person who always put her own wants ahead of everything and everyone else, no matter what. She’d been treating me like a sidekick. 12 years later when I remarried, she was not invited.",
            "score": 63,
            "replies": []
        },
        {
            "author": "Rare-Credit-5912",
            "body": "NTA\n\nI’m not trying to make this about me. I ended friendships of 43 and 50 years respectively because I finally got feed up with the disrespect. No one has to put up with being disrespected.",
            "score": 29,
            "replies": [
                {
                    "author": "Gloomy_Pineapple_836",
                    "body": "I ended 2 long term friendships over the past few years. You just get tired of the bull.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "bcgambrell",
            "body": "NTA. Leaving aside the wedding time, how would you characterize your friendship? Were you always the one initiating/planning things? Did she even plan or throw you a birthday party? Graduation or engagement party? \n\nStressful times have a way of focusing a spotlight on the cracks and flaws of any relationship. It could be your view of the friendship didn’t match her view. Or, she’s a user and you’ve been obliging her all of this time. \n\nYour situation is modern example of Aesop’s fable of the ant & grasshopper. You’re the ant: busy working and preparing for winter. Your former BF is the grasshopper: enjoying life but ill prepared for future. But, at the end of the fable, the grasshopper begs the ant for help and the ant refuses. The grasshopper ultimately dies at the end. The moral (for OP) is an ant will always be disappointed in the grasshopper’s one sided view of the future.",
            "score": 25,
            "replies": []
        },
        {
            "author": "viola2992",
            "body": "You were on a budget, yet you spent $2000 on her.  \nWhy did you allow it?",
            "score": 36,
            "replies": []
        },
        {
            "author": "HallAccomplished5000",
            "body": "Honey you are the AH to yourself for putting up with it for so long. You were a great friend. But the friendship can't be carried alone by you. She was crying on your wedding day because she realised she fucked up and had already lost you. Honestly. I'd keep her hanging a little bit meet up for dinners occasionally she pays to recoup some of your thousands spent on her. But it isn't your style and isn't worth your energy. ",
            "score": 16,
            "replies": []
        },
        {
            "author": "Zealousideal-Cod-924",
            "body": "How has she reacted to being cut off?",
            "score": 13,
            "replies": []
        },
        {
            "author": "Duckr74",
            "body": "Keep us Updateme! if there is one",
            "score": 9,
            "replies": []
        },
        {
            "author": "millimolli14",
            "body": "WOW your ex friend is an absolute bitch, she has used you then tries gaslighting you on your wedding night, how on earth does she think she’s in the right NTA Updateme!\nHas she reached out at all since you cut her off?",
            "score": 11,
            "replies": []
        },
        {
            "author": "Successful_Moment_91",
            "body": "NTA\n\nSometimes it takes special events to see how little we mean to selfish, entitled people. Cutting them off is such a relief",
            "score": 9,
            "replies": []
        },
        {
            "author": "Ok_Algae_7232",
            "body": "NTA for cutting her off, but honestly YTA for going through with all that, at what point would you think hey maybe this person doesn't gaf about me and I should respect myself and stand up for me?!\n\n ffs this was so infuriating to read, you put in thousands of dollars and she didn't even acknowledge you AND thought its ok to contact u on ur wedding day!",
            "score": 9,
            "replies": []
        },
        {
            "author": "Walmar202",
            "body": "There are two kinds of “friends” in this world—“givers” and “takers”. You are a giver, and I commend you for it. You know what it means to be a loyal friend.\n\nTakers are users. They may be very friendly and appear to be loyal, but they are always “me first”. Sometimes, like in your case, it takes years to properly identify them, frequently by a major life event, like how she revealed her true self.\n\nYou need to ghost her. She is not worth the emotional investment. Best wishes to you!",
            "score": 8,
            "replies": []
        },
        {
            "author": "leftytrash161",
            "body": "You were on a budget for your own wedding, but had $2k lying around to spend on hers?",
            "score": 12,
            "replies": []
        },
        {
            "author": "Vibe_me_pos",
            "body": "Wow! She is a popular woman. Only 3 people out of 75 invited came to the shower? Didn’t she have family? What about her fiancé’s family? That is a huge red flag. She probably treated everyone like she treated you. Her loss. Congratulations on your marriage!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Medical_Onion_3500",
            "body": "I’d be willing to bet this wasn’t the first time she’s acted so selfishly either. You’re NTA, she used you because she knew she could. Sorry OP",
            "score": 6,
            "replies": []
        },
        {
            "author": "gerbiltuna",
            "body": "Here’s an alternative thought…I’m not saying you’re wrong for being upset. But…maybe she was paying more attention to the non you guests during her celebrations because she felt like she had to be more “on” with them? Like she was surprised no one showed so she wanted to hang on extra to the ones that did. I think people generally take those closest to them for granted, usually not on purpose.\n\nIt doesn’t excuse her being a shitty friend and you don’t owe her anything, but weddings can be stressful, and maybe she was so in her own head about how little she felt she mattered to others that she took you for granted. Maybe she didn’t realize how offended you were until your wedding.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Summertime-Living",
            "body": "NTA- Your life will feel a lot lighter now that you’ve cut that boat anchor off.",
            "score": 4,
            "replies": []
        },
        {
            "author": "cynicgal",
            "body": "NTA.\n\nShe put in zero effort and still wants to be the VIP at your wedding. BS.\n\n\"Fix\" the relationship? What is there to fix? What relationship?\n\nShe took you for granted, saw you as a nuisance, and never treated you as a friend.\n\nWhy would you want to \"fix\" anything with her? So she can take advantage of you again and again? Don't be daft.",
            "score": 3,
            "replies": []
        },
        {
            "author": "tothegravewithme",
            "body": "My wedding ended a close friendship of mine. She’s still trying to recover it but I’m not interested. Our children are friends so there’s still contact but I’m never going out of my way for her again. \n\nThere’s often a catalyst to deep reflection of relationships and in this case it just happened to be weddings. Take it as a wedding gift!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Food-On-My-Shirt",
            "body": "Definitely not TA. She used you and didn't even make a half assed attempt when it came to your celebrations. I'm curious though, since you cut her off has she tried contecting you to try and weasel her way back into your friendship, or has she been talking shit or acting like she doesn't understand why you're doing this when she talks with mutual friends?",
            "score": 3,
            "replies": []
        },
        {
            "author": "theidiotsareincharge",
            "body": "Can we please circle back to the shower/housewarming party — out of 75 invited guests only 3 showed up. How does that happen?",
            "score": 3,
            "replies": [
                {
                    "author": "tagenero",
                    "body": "My guess? \nAll the other friends saw the bride for the shit friend she is and let their lack of attendance do the talking.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "MISKINAK2",
            "body": "Hope she reads this and feels that trickle of shame crawl up her spine \n\nThere's a reason no one showed up to the shower. You're not alone, but she is and has no clue why.\n\n(Do brides seriously have both a shower and a bachelorette party?)",
            "score": 5,
            "replies": []
        },
        {
            "author": "nykc11",
            "body": "Honestly, ESH. Your ex best friend sounds selfish, but you sound like a poor communicator and probably a lot more passive aggressive than you think. \n\nFor instance, why stew about not getting a bachelorette party? From your post you make it sound like you were completely unenthused about having wedding at all. Is it really so unreasonable that the people around you would assume you wouldn't want one? Why not say something if you did?\n\nDid you really have no idea that no one would show up to her shower? You got 75 affirmative RSVPs and then 72 of them decided to flake without saying anything? It's not impossible, but something tells me there's information missing here. \n\nWhy exactly did you take it upon yourself to be 'literally popping balloons' next to someone who was trying to sleep (and Im guessing was hungover) -  the guest of honor no less. You don't make any mention of needing to vacate the property (like if it was an AirBnB) and she was still sleeping when you left which makes me think that it wasn't exactly urgent. Are you sure you weren't just trying to get back at her for whatever perceived slights you felt at the party?\n\nWhy did you disinvite her from the ceremony without telling her, and choose to have her find out by unknowingly showing up to just the reception? That was pretty cruel, and totally unnecessary. That obviously doesn't excuse her behavior at the reception or later on that night, but it's hard to feel bad for you when you're the one that chose that time and place to make such a passive agressive statement.\n\nBy all means, sever ties. You guys sound toxic for each other. But please don't think that you're walking away smelling only of roses.\n\nEdit: typo",
            "score": 13,
            "replies": [
                {
                    "author": "8thhousemood",
                    "body": "THANK YOU. I’m reading all of this and just wondering over and over — did OP ever think to say no to their ex-friend? Did OP ever ask anyone, ex-friend or otherwise, for help with their own wedding?\n\nOP sounds like a chronic people pleaser who has effectively trained their friendS (because no one else stepped up either did they?) to treat them this way.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Martha_primrose",
            "body": "NTA you did everything for her and she did nothing back. She only cares about herself and loosing you as a friend means she will have no one to do things for her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tasty-Answer-8183",
            "body": "Wait you didn't explain how you cut her off. Did you explain why or just ghosted her? 🤔 In any case NTA, she was really self centered and didn't think about you at all. Sometimes weddings really show people's, especially brides', true colors 😬",
            "score": 2,
            "replies": []
        },
        {
            "author": "Deputycrumbs",
            "body": "F!ck your “so called” best friend! It’s that simple",
            "score": 2,
            "replies": []
        },
        {
            "author": "Historical_Kick_3294",
            "body": "Definitely NTA. You sound like a fabulous best friend, and she sounds like a using loser.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Quick_like_a_Bunny",
            "body": "NTA for cutting off a selfish friend but “she got us a card with cash” sure makes you sound like a snob and a half",
            "score": 4,
            "replies": []
        },
        {
            "author": "RandomThoughts628",
            "body": "Something stuck out to me. She asked you to plan things for her. It seems she’s having a more traditional wedding as well, so accepting the role of MOH is expected to have additional responsibilities. You accepted knowing that.\n\nYou, on the other hand, are not having a traditional wedding. On top of that, you never asked her to plan things for you, so on top of you never asking her for things, your wedding has less clear expectations because it’s non traditional. You can’t expect her to read your mind when she’s made her expectations of you very clear. YTA. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "rebel-yeller",
            "body": "I think you were the asshole for continuing to do all of the work for her wedding when you saw exactly what was going on. Cutting off the friendship? nta.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Backup of the post's body: \nAbout a year ago, my best friend and I got engaged about two months apart. I’ve always known I didn’t want a wedding ceremony or reception, but my fiancé insisted. So, I honored his wishes and started planning.\n\nAt the same time, my friend was planning her wedding and asked me to be her maid of honor. Typically, that role comes with planning the bachelorette party, so I found myself knee-deep in organizing that too. Then she asked me to throw her a combined wedding shower/housewarming party—all of this coming out of my own pocket while I was also planning and paying for my own wedding and honeymoon.\n\nOn top of that, I was expected to buy a dress from a specific website, name-brand shoes, and get professional hair and makeup for her wedding day. I estimate I spent around $2,000 on her wedding events. The other bridesmaids offered to chip in for supplies more than once but never actually followed through.\n\nI chose not to have bridesmaids because I didn’t want my friends to assume the financial burden of being in a bridal party, nor did I want to cover those costs for them. My plan was to have a small ceremony with immediate family, followed by a reception with all of our loved ones at the same venue.\n\nMy friend never offered to help throw me a wedding shower or bachelorette party, which I understood since she wasn’t “in the bridal party.” But then again—no one was. And she was well aware that she was my best friend. This wasn’t the first time in our friendship that I felt like I was the only one putting in effort while she simply received.\n\nThe Red Flags Begin\n\nFlash forward to her wedding shower/housewarming party. After all the planning, purchases, and decorations—set up for 75 guests—only three people showed up. She spent the entire time entertaining those three while barely acknowledging me. I understood she was likely upset about the turnout, but it didn’t excuse how she dismissed my presence. After all, of the 75 invited guests, I was the one who showed up, I was the one who planned it, I was the one who paid for it, set it up, attended, and cleaned up afterward. I even got a gift for them from her registry. It felt like I was nothing more than a free event planner, caterer, and host. \n\nThen came her bachelorette party. Luckily, this time, people actually showed up. But again, I felt more like an unpaid coordinator than a cherished friend. It felt like she saw my efforts as an obligation rather than a gift from a best friend. The next morning, our mutual friend and I got up early, cleaned everything, and packed up the cars—while she stayed asleep in the common space where she could hear us (we were literally popping balloons). When we woke her up to say goodbye, all we got was a half-asleep, half-hearted “thank you.”\n\nThe Wedding\n\nTwo weeks before her wedding, I told her I had cleared my schedule to help with any last-minute planning. This meant driving 45 minutes to her place—twice—to help out.\n\nOn the day of her ceremony (a Friday, meaning I had to use PTO), she barely spoke to me but still expected me to have everything handled. And I did. No major issues, just that same underlying feeling that I was being taken advantage of as her Type A planner friend.\n\nThen it was time for my wedding. A mutual friend tried to plan a bachelorette party for me with her, but she didn’t help—so we canceled it to avoid stressing out our mutual friend.\n\nIn the weeks leading up to my wedding, that mutual friend and I met up multiple times to help finalize details. Meanwhile, my best friend never checked in.\n\nOn my wedding day, she sent me a text:\n\n“Is there anything I can help you with?”\n\nEverything was already done. It was too little, too late. It just reinforced the feeling that I was an afterthought—that she only reached out because she had to, not because she actually wanted to.\n\nAt my reception, she realized she hadn’t been invited to the ceremony and began crying. She proceeded to cry for most of the reception. And remember the gift I got her from her registry, despite everything I was doing for both her wedding and mine? She got us a card with cash. Which, I mean, sure—I’m not ungrateful—but at that point, the sentiment mattered so much more to me. And she didn’t even include a heartfelt note. She did come up to congratulate me—while sobbing—and later spoke with our mutual friend, who told her that whatever concerns she had needed to wait until after my honeymoon.\n\nShe didn’t listen.\n\nThe Final Straw\n\nAt 2 AM on my wedding night, she sent me a long-ass paragraph about her feelings, her confusion, and her desire to “fix” our relationship.\n\nAt that point, I was done. I told her we’d talk after I got back from my honeymoon.\n\nWhile I was away, I gained clarity. I realized I didn’t see a point in talking things through because the root issues had been there for years. And I couldn’t get past the fact that she thought it was acceptable to send me that message on my wedding night. It was yet another moment where her feelings took priority over my experience.\n\nIt’s been four months since I cut her off.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loose_Amphibian_6045",
            "body": "NTA you deserve better updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "First_Ad6174",
            "body": "Nope you are NTA. I think you were a friend of convenience as she selected you to do all the heavy lifting for her wedding while she knew you were planning your wedding. I’m glad that you realized this & put a stop to it before she took advantage of you again. Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiny_Association5663",
            "body": "Absolutely NTA, let her stew.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rare-Craft-920",
            "body": "NTA and hope you’ve blocked her everywhere. She is insufferable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Over-Choice577",
            "body": "NTAH",
            "score": 1,
            "replies": []
        },
        {
            "author": "prayingforrain2525",
            "body": "Not even close. It's an expensive lesson, but it's good you learned it. She's no friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "artwin_mum_37",
            "body": "Has she tried to reach out to you at all?",
            "score": 1,
            "replies": []
        },
        {
            "author": "veemar1977",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big-Tumbleweed-1766",
            "body": "Honesty NTA. I recently cut out a friend and went to lunch with her bc our mutual friend was in town. I was reminded the next day why she was still BLOCKED. She was still terrible. Also - WTF who does that to someone on their wedding. Keep her blocked and move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Riz_Poulet_Maggi",
            "body": "You did everything for her marriage and she in return did nothing and realizes it on the happiest day of your life....... Leave her in her corner.... So long friendships are useless (in this context)",
            "score": 1,
            "replies": []
        },
        {
            "author": "lsp2005",
            "body": "You sound like a best friend. She never did. In all of your post I kept asking myself how is this other person showing you that they are your BFF. I could not find anything. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "seidinove",
            "body": "NTA. Your former friend is astoundingly obtuse and a main character.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cruciferousvegan",
            "body": "The deja vu in this is unreal. I had a “friend” like this as well with a similar use and abuse pattern where I’d taken on an obligation that had become something I couldn’t do anymore, at least not how *they* wanted. I tried to compromise and be flexible about changing the dynamic so we could still do what they wanted or we could keep being friends but, if they wouldn’t budge, I would just stop doing this thing with them. \n\nNope. Things blew up and they called me a liar because I’d put up with things for so long. We’d been friends since middle school and that’s all it took to blow it all up which means it wasn’t worth it in the first place. I very nearly tried to reach out to them because, ironically, they’re doing their wedding soon and didn’t invite me. But I know I didn’t do anything wrong and I can’t mend the bridge I didn’t blow up in the first place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MmaRamotsweOS",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fine-University-8044",
            "body": "YTA for asking if YTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Cook7731",
            "body": "NTA!! At all!! My best friend did pretty much the exact same thing to me, I helped soo much with the planning of her wedding, bought alot of decorations, paid and planned her whole Bachelorette, and basically set up the wedding for her. They day of the wedding, she completely ignored me. I was her MOH, and she had 2 other bridesmaids and basically just spent the entire time with them while sending me to.do.random chorus for her. It was to the point that the photographer had to straight up ask her if she wanted any pictures with me as MOH cause she had avoided me all morning. The reception wasnt any better, she got upset about alot of stuff and basically spent her entire wedding reception in her room with the other bridesmaids while I ran interference with her family and in-laws and all the guest. Basically, I spent the entire wedding doing anything I could to cheer her up, and she never even said thank you. I stopped talking to her after that. We did reconnect a bit and she did apologize but our friendship was never the same and almost a year ago I decided I just wasn't willing to put any effort into that relationship anymore and completely cut her off. Honestly, it's been great. The experience showed me that I don't have to accept crappy treatment from friends. That if I wouldn't allow a partner to treat me that way, I shouldn't allow a friend to either. I'm so happy for you, op!! Congrats on getting married!! ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Realistic_Store9122",
            "body": "NTA\n\nAfter 4 months... Stop thinking about your used to be BF.\n\nObviously she wants to fix things between you two because she wants to have you around to plan for her baby shower(s).\n\nI think you're in a good place and can only get better from here. Congratulations on moving forward and leaving that ugly luggage behind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeykaDagmar",
            "body": "People who treat weddings like a cash cow piss me the fuck off. NTA, You should lay it all out for her, maybe she'll financially reimburse you som since she didn't reciprocate the effort and never speak to her again.\n\nThat's disgusting to treat you like the help at her wedding, and then expect to be the center of attention at yours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "disagreeabledinosaur",
            "body": "You're not the asshole, but please for the love of the flying spaghetti monster learn to stand up for yourself and to ask for what you actually want.\n\n\nYou're going out of your way left and right to accommodate her without standing up for yourself. Do what you're happy to, then stop. If you find yourself building up resentment then stop. When you offer to help, people will generally accept and think you're happy to do it.\n\n\nOn the other hand you seem to be full of unspoken expectations for how she should be doing things for you. If you wanted her to throw you a party, ask. If you want her to run around before the wedding, ask well in advance.\n\n\nYou're your own worst enemy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaFeePoppelepee",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "madpeachiepie",
            "body": "Nope, NTA. Not anymore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Previous_Yard4483",
            "body": "OP, how dare you become engaged and get married around the same time as your  MsSuperSpecialFriend huhhhh? Everyone knows you are not the marrying type, let alone deserving of a wedding ceremony and/or a reception. How could you not know that 2025 was the year chosen only for people like MsSuperSpecialFriend to get married? Who do you think you are huhhhh? Stealing the attention from her (by having a wedding) and expecting her to reciprocate your kindness? When you could have just waited for another 2 years or 5 years after your special friends' wedding to get married? Look now you couldn't even be there when your special friend was having an emotional crisis (which you caused) and needed your attention/comforting/reassurance because you had to go to your honeymoon. /s\n\nOkay, I'm done being sarcastic now, and hopefully you get the gist of what your friendship dynamics were like. And I am glad that you finally took off the rose-tinted glasses and saw your friend for who she really is. NTA, for choosing you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JDNL19",
            "body": "NTA. \nI am currently going through something very similar. \nI also didn't have a wedding party. And now I am looking at spending 1000+ and also having to throw the bridal shower and bach party (which is a getaway) due to being the MOH. Meanwhile, she threw a half-ass bach party with just 2 others in town. To top it off, I'm pregnant, and she hasn't offered to throw a baby shower. \nIt's crazy how these things always come to light during situations like this. I'm planning on just letting the friendship fade out after the wedding. \nFriendship is 27 years old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FormalRaccoon637",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "blackbean-chowfun",
            "body": "Nooooooo NTA. Girl you gave her your time, dedication and loyalty. She used you to plan for everything and then when it was your turn she just disappeared. Shows how she \"values\" you. \n\nGTFOOOOOOOO",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gloomy_Pineapple_836",
            "body": "Absolutely not. I’ve been there done that. It sucks so much but you can only give so much before you’re gave out. Being expected to do all of it and nothing ever good enough. Your friend seems to be dealing with some mental health issues ( bi polar, narcissistic, BPD). Or shes just a shitty friend. Life’s short. It hurts and it sucks but it’s for the best. Take care of you. Cut her off and change your number.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RhereNnow",
            "body": "NTA in the least! Glad to hear you made the decision to cut that person out of your life. That’s not a relationship worth saving. She’s not a real friend. I say, good riddance and best wishes to you and your husband!",
            "score": 1,
            "replies": []
        },
        {
            "author": "was_that_necessary",
            "body": "AI slop, stop feeding the bots",
            "score": 0,
            "replies": []
        },
        {
            "author": "floss147",
            "body": "She sounds like a right leech. I would have cut her off too. \n\nGood for you for protecting your peace and sanity.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Babaraul",
            "body": "You doing marathon times in the hundred",
            "score": 0,
            "replies": []
        }
    ]
}