{
    "title": "Is this really how dads are?",
    "author": "Accomplished-Ant6455",
    "subreddit": "TwoHotTakes",
    "rank": 14,
    "score": 10,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/TwoHotTakes/comments/1jed2al/is_this_really_how_dads_are/",
    "id": "1jed2al",
    "selftext": "hii guys  \n\nEnglish isn't my first language so I'm sorry for any mistakes in advance. so a little about myself: I'm 17, girl and I live with my foster dad alone one week and with my siblings the other week still with my dad. I'm gonna try to stay anonymous and not confuse you guys to much with my whole back story. I went through some traumatic things when I was younger so I probably view things different. \n\n \n\nWell that said there have been a few occasions where my dad does things that I do not agree on. with that I do not mean in house rules because he's pretty chill with that but with how he act's.\n\nI will sum up a few things some were just words others were whole situations: He has called me fat and lazy ( while knowing I'm depressed what is not an excuses i know) body shamed me with clothes, never wants to say sorry when he's in the wrong, never wants to hear my side because he things i just want to win but all i want is for him to understand that he's words do affect me;\n\n And then the event that brought me here was what happened with my brother: so my brother has been sick for the past week and couldn't eat anything before coming right out again. \n\nSo my dad went to the doctor with him to get it checked and he can only eat crackers or toast so they went and bought that;\n\n He ate a few packs and then my sister had to go in the bathtub and after a while my dad joint and once my brother noticed he jointed to.\n\n It does happen more that they all go in the bathtub but my dad took my sister out to go brush her hair and found the wrapping papier from his crackers;\n\nAnd when he came out the bathroom and was going up the stairs to get some underwear because he was naked and cold.\n\nMy dad stopped him in the middle of the stair and told him he first had to clean it up. My brother responded with \" yes but I'm first gonna get some underwear\" what I think I pretty reasonable. \n\nMy dad told him not your gonna first clean it up and already sounded pretty annoyed.\n\n My brother again informed him the he will after he got some underwear on (he is 10 years old an di do y-understand you don't wanna walk naked through the house );\n\nMy dad then took him by he's wrist and try to pull him down the stair because he didn't wanna do it my brother didn't give in and neither did my dad. My brother tried to hold himself on anything he could grab and kept saying \"I first want to put on some underwear\".\n\nhe even pulled back a fist ready to punch him because he was so mad.\n\n My dad obviously won and my brother went upstairs and locked himself in his room because he was so mad. \n\nMy dad keeps telling everyone this story around the family and laughs about it and so does the rest of the family except me. I find this so many other things then funny and i hate how he brags about it.  \n\nSo here comes my question again: Is this really how dads are? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for submitting to the Two Hot Takes Podcast Subreddit! We'd like to remind you that all posts are subject to being featured in an episode of the Two Hot Takes Podcast. If your story is featured you'll\nget a nifty flair change to let you know and we'll drop a link so you can see our host's take on your story.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "silfy_star",
            "body": "Oh, you poor girl\n\nThis is not normal, your siblings and you need to talk to a TRUSTED MANDATED REPORTER - not family! A school counselor, a psychologist, even a cop directly. Considering you’re a foster child, your case worker would also be someone you could tell\n\nI will keep my personal experience to myself, but this is NOT normal, NOT okay, and you need to tell someone who can actually do something (family cannot help you and can actually work against the overall case, such is my experience)\n\nETA: delete this post, your replies, and the account when you’ve gotten the info you need",
            "score": 23,
            "replies": [
                {
                    "author": "PatienceOutside3493",
                    "body": "Let's be real, dads are like walking dad jokes incarnate.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "No-Sun-6531",
                            "body": "What is the joke here? Because I didn’t read anything remotely funny.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "oh_such_rhetoric",
            "body": "This is definitely not normal—it is very concerning in several ways, but the bottom line is that you and your siblings are being abused. This is not how good and loving parents treat their children.\n\nThis is not a safe environment for you, and you’re doing well to realize that because of your past trauma it can be hard to see what’s normal and what’s not. Thank you for sharing with us, and please continue to advocate for yourself and your siblings. \n\nI would encourage you to talk to an adult who is a mandated reporter: a teacher or counselor at school, a coach, your foster family, your case worker—whoever you feel comfortable with. As soon as possible. \n\nAny adult who works with kids in an official capacity is probably a mandated reporter. Mandated reporters are required to take action anytime they feel like a kid is in danger, so if you talk to one that’s the best way to make sure this gets addressed and you are staying in a safe place and that your siblings are safe too. \n\nTake care of yourself ❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "justablueballoon",
            "body": "Of course not.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Backup of the post's body: hii guys  \n\nEnglish isn't my first language so I'm sorry for any mistakes in advance. so a little about myself: I'm 17, girl and I live with my foster dad alone one week and with my siblings the other week still with my dad. I'm gonna try to stay anonymous and not confuse you guys to much with my whole back story. I went through some traumatic things when I was younger so I probably view things different. \n\n \n\nWell that said there have been a few occasions where my dad does things that I do not agree on. with that I do not mean in house rules because he's pretty chill with that but with how he act's.\n\nI will sum up a few things some were just words others were whole situations: He has called me fat and lazy ( while knowing I'm depressed what is not an excuses i know) body shamed me with clothes, never wants to say sorry when he's in the wrong, never wants to hear my side because he things i just want to win but all i want is for him to understand that he's words do affect me;\n\n And then the event that brought me here was what happened with my brother: so my brother has been sick for the past week and couldn't eat anything before coming right out again. \n\nSo my dad went to the doctor with him to get it checked and he can only eat crackers or toast so they went and bought that;\n\n He ate a few packs and then my sister had to go in the bathtub and after a while my dad joint and once my brother noticed he jointed to.\n\n It does happen more that they all go in the bathtub but my dad took my sister out to go brush her hair and found the wrapping papier from his crackers;\n\nAnd when he came out the bathroom and was going up the stairs to get some underwear because he was naked and cold.\n\nMy dad stopped him in the middle of the stair and told him he first had to clean it up. My brother responded with \" yes but I'm first gonna get some underwear\" what I think I pretty reasonable. \n\nMy dad told him not your gonna first clean it up and already sounded pretty annoyed.\n\n My brother again informed him the he will after he got some underwear on (he is 10 years old an di do y-understand you don't wanna walk naked through the house );\n\nMy dad then took him by he's wrist and try to pull him down the stair because he didn't wanna do it my brother didn't give in and neither did my dad. My brother tried to hold himself on anything he could grab and kept saying \"I first want to put on some underwear\".\n\nhe even pulled back a fist ready to punch him because he was so mad.\n\n My dad obviously won and my brother went upstairs and locked himself in his room because he was so mad. \n\nMy dad keeps telling everyone this story around the family and laughs about it and so does the rest of the family except me. I find this so many other things then funny and i hate how he brags about it.  \n\nSo here comes my question again: Is this really how dads are? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TD1990TD",
            "body": "As a little girl, my sister and I went into our bathtub with our dad as well. Depending on your sister’s age, I’d say it’s not weird for sibling and parents to go into the bathtub together.\n\nThe situation you’ve described, is it your dad or your foster dad?\n\nI have a feeling you’re Dutch. Is that true? You can DM me if you’d like.\n\nI feel like your dad is far too strict for your brother. But I feel like there’s a lot of details missing. Where’s your mom? Does your father care for you and your siblings (just 2, or are there more?) all by himself, when you’re there? Is your dad in therapy?\n\nDepending on past events and the possibility of trauma, it could be that your dad is doing his very best not to break down and lose you all permanently. That would explain him being so strict to your brother, and next laughing about it. It sounds like he’s trying to laugh it off because he doesn’t know how to handle this otherwise.\n\nDoes this resonate?",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Sun-6531",
            "body": "Am I reading correctly that your dad is getting in the bathtub with your sister and brother?? Like bathtub as in naked bathing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "emr830",
            "body": "Nope. A good parent doesn’t name call or fat shame. A good parent listens. A good parent isn’t physically abusive. \n\nTell a teacher or a school guidance counselor. Write everything down before you meet with them so you don’t forget something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cultural-Revenue4000",
            "body": "This is abuse! This is weird! Why is the dad taking a naked bath with a 10 yo boy and little girl?!\n\nHe is emotionally/verbally abusing you. \n\nTell your teacher. Tell your social worker. Get them to get you and those kids out of that environment!",
            "score": 0,
            "replies": []
        },
        {
            "author": "tinusplots",
            "body": "There is nothing wrong with a father and his kids sharing a shower or a bathtub.\nSometimes to make kids do their chores and clean up after themselves a trick is to humiliate them into doing that.  Your dad succeeded in that.",
            "score": -4,
            "replies": []
        }
    ]
}