{
    "title": "AITAH for asking my boyfriend to stop hanging out with his friend?",
    "author": "Various-Fig-2151",
    "subreddit": "TwoHotTakes",
    "rank": 10,
    "score": 17,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 73,
    "url": "https://www.reddit.com/r/TwoHotTakes/comments/1jedxqx/aitah_for_asking_my_boyfriend_to_stop_hanging_out/",
    "id": "1jedxqx",
    "selftext": "\nI (22F) have been with my boyfriend, Nate (22M), for six years. He is a great guy—he treats me well and is the person I want to marry.\n\nWe both attend the same university. During my freshman year, I became very close with my roommate, Katie (23F). We did everything together and ultimately became best friends. Since she was such an important part of my life, I introduced her to Nate. At first, they didn’t talk much, but after about a year of knowing each other, that changed.\n\nKatie switched her major to biology, which is also Nate’s major. Nate is a tutor for our university’s academic program and enjoys teaching, so he and Katie ended up taking multiple classes together and studying in the same group, along with our mutual friend, Josh (22M). I thought it was nice that we could all go to the library together—I would study for my exams while my friends studied for theirs. Over the summer, Nate even helped Katie get a research position in his lab, as well as a job at the urgent care where he works. It was really kind of him to do that for a friend.\n\nThat same summer, the four of us—Nate, Katie, Josh, and I—went on a cruise together. But after that trip, I noticed a shift. Katie rarely texted or called me anymore. Whenever we did hang out, it was always brief, usually just a quick lunch. She also started inviting Nate to our meetups, even when I just wanted some girl time.\n\nSince the summer, Nate and Katie have been hanging out alone at least twice a week—usually in the research lab, grabbing lunch in between, or doing other things together.\n\nHere’s the problem: Since the start of my senior year, they’ve started hanging out outside of school without me, often without telling me. One instance that really hurt my feelings was when Katie went over to Nate’s apartment to watch a cartoon movie she wanted to see. At the time, I had been trying to make plans with Katie, but she kept saying she was busy. Then, when I looked out my window, I saw her walking into Nate’s apartment. (Nate and I live in the same apartment complex.)\n\nI opened my window, shouted “Hi!” and told her I was coming down. She didn’t seem enthusiastic. When I got to Nate’s apartment, I asked what she was doing there, and she said they were just hanging out before their meeting at school. I felt hurt that neither of them had texted me to invite me, especially since they knew I was home with no classes at that time.\n\nOver time, this kept happening. I wouldn’t find out they were hanging out unless I checked their locations on Find My Friends or heard about it later. I told Nate that it hurt my feelings that Katie barely spoke to me anymore and constantly flaked on our plans. He responded by saying, “We’re just closer now than you and Katie are.”\n\nI told him I found it weird that my best friend had suddenly become his best friend. Not only that, but he’s done a lot for her—he got her a job, a research position, helped her apply to PA school, and more. Most of my other friends have also told me it’s strange how much time they spend together without me.\n\nAt this point, I’ve started to feel insecure. What’s so wrong with me that Katie doesn’t want to hang out anymore? It’s not that she’s too busy or has other friends—she only really spends time with me, Nate, and Josh. And Nate’s only real friends are Katie and Josh, though we don’t see Josh as often.\n\nTo test things, I decided not to text Katie for a month to see if she would reach out first. She never did. That really hurt.\n\nI told Nate that I was uncomfortable with how much time they were spending together, especially since Katie and I hadn’t seen each other in three months. His response was:\n\n“It may be untraditional, but it’s a good friendship for me. You should be grateful I have a friend, because honestly, if she weren’t my friend, I’d have no one to talk to other than you. I know it’s ‘weird,’ but it hurts my feelings that you’re so against it. I don’t like that you’d rather me have zero friends than have an untraditional friendship.”\n\nThen, a few days ago, I noticed his location was at a shop. I texted him, asking what he was doing, and he said, “Shopping.” He didn’t mention who he was with. When I asked, it took him longer than usual to answer. Finally, he admitted he was with Katie. I asked why he didn’t just tell me, and he said, “Because I didn’t want to upset you.”\n\nHe also accused me of being selfish and jealous. And honestly… maybe I am jealous. I don’t know what to do at this point. I asked him to stop seeing Katie outside of school, or at least to cut back on how much time they spend together. Is that unfair of me? How should I handle this? Any advice would help so much.\n\nEdit: For some comments and to add more background. \n\n-Katie has been single her whole life and has never had a boyfriend. \n-When I asked Nate about feeling uncomfortable he said he would never cheat on me and he pointed out he finds Katie very unattractive. \n-He hasn’t “lied” to me but has rather just not mentioned anything. So he doesn’t say I’m hanging out with Katie today. He just does it and I find out through his location or seeing her at his place. \n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for submitting to the Two Hot Takes Podcast Subreddit! We'd like to remind you that all posts are subject to being featured in an episode of the Two Hot Takes Podcast. If your story is featured you'll\nget a nifty flair change to let you know and we'll drop a link so you can see our host's take on your story.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooCupcakes780",
            "body": "I’m just going to say it: I would be very surprised if they didn’t have an affair. \n\nThis is not normal. There’s always a reason why people do things in secret. They are both knowingly and on purpose keeping their “hang outs” a secret from you - if they had nothing to hide this wouldn’t happen. \n\nI’m sorry to just say this but it’s true and your bf is trying to gaslight you hard.",
            "score": 69,
            "replies": [
                {
                    "author": "rocketmn69_",
                    "body": "The next time you're over at his place, wait until his guard is down, then quietly ask to borrow his phone for a second. If he refuses,  don't argue, just get up and say, \"That's all the proof I needed to know. Goodbye.\" Then walk out and block them both",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Historical_Kick_3294",
                            "body": "Absolutely this.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Historical_Kick_3294",
                    "body": "100% true.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Inner_Flounder_2635",
            "body": "Sounds like they are dating.",
            "score": 37,
            "replies": [
                {
                    "author": "LabAdministrative530",
                    "body": "That’s what I got out of it. He’s now dating her and slowly phasing out OP",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Old_Length7525",
                    "body": "Of course they’re dating. The only question is whether they are “just” having an emotional affair or also having a physical affair.\n\nI’d be curious to know if the sex with OP has dropped off. That’s often a telling indicator. \n\nAlso, the details are a bit fuzzy. Katie was OP’s roommate and best friend. It’s not clear when or why she moved out.\n\nIt’s also not clear how much time or effort Nate had been putting into his relationship with OP.\n\nBut the bottom line is this- he is putting what little extra energy he has (as a busy full time student with a job) into a relationship with OP’s former best friend, and that disrespect is grounds for ending the relationship.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beatleslover4ever1",
            "body": "It sounds like he’s prioritizing Katie over you, and that’s not okay. He needs to make a decision, and if he doesn’t, then you should find someone who puts you first. They’re both acting suspiciously and nothing good can come from this.",
            "score": 36,
            "replies": []
        },
        {
            "author": "justablueballoon",
            "body": "You don't really want to marry Nate",
            "score": 18,
            "replies": []
        },
        {
            "author": "bacongrilledcheese18",
            "body": "Do you really need us to state the obvious here?? It’s time to get rid of both of them, seems they’re trying to get rid of you",
            "score": 16,
            "replies": [
                {
                    "author": "Foolish-Pleasure99",
                    "body": "He monkey branched to her best friend right in front of her.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Inner_Flounder_2635",
            "body": "I wouldn’t waste my time on either of them anymore. She has pretty much ghosted you and he is lying to you.  I know you two have been together for a long time and it will be difficult but it really seems like they have a relationship that is not just platonic.",
            "score": 15,
            "replies": [
                {
                    "author": "rocketmn69_",
                    "body": "She sneaks over to his room for alone time, when both are too busy to hang out with you. Personally I wouldn't talk to her again.  If you go somewhere and she's there with \"your bf\" just turn around and leave",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kukka63",
            "body": "Unfortunately Nate doesn't want to be in a relationship with you anymore, he just not had the guts to tell you yet.",
            "score": 13,
            "replies": []
        },
        {
            "author": "rocketmn69_",
            "body": "OP, don't message him for a week. See if he even notices.  They are having an emotional affair at the very least. The fact that they are spending a lot of alone time at his apartment and going on dates is very telling.\nYour semester is almost over. When you pack up to go home, break up with him. Tell him that,\" you can now stop sneaking around to be with Katie. You said I was jealous, of course I am. You're supposed to spend time with your gf, who apparently hasn't been me for a long time. 75% of your free time is spent with her, cuddling on your couch watching movies, going shopping, to dinner, telling me you're tired to go out, but sneaking off with her. I'm tired of being the 3rd wheel in the relationship. Don't bother replying. Goodbye.\"Then block him.\n\nThe text Katie, \" Thanks a lot for ruining my relationship. I know that you guys have been cheating and lying about it. Someone sent me proof. I really hope karma bites you, and he cheats on you.\"\nThen block her\n\nOr, just block them both now",
            "score": 11,
            "replies": [
                {
                    "author": "Historical_Kick_3294",
                    "body": "Excellent advice.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Traditional-Ad2319",
            "body": "You've been with the guy since you were 14. Highly unlikely this relationship will last. And if he's not already having an affair he definitely sounds like it's heading that way.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Away-Understanding34",
            "body": "So why doesn't he invite you to hang out or shop, either with him alone or with the 2 of them? Sorry but I am not sure they are just friends. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "mockingbird82",
            "body": "Nate nor Katie are the people you think they are. Cut your losses and stop wasting your time. I'm sorry.",
            "score": 6,
            "replies": []
        },
        {
            "author": "KookyInteraction1837",
            "body": "Don’t you really see what’s happening???",
            "score": 9,
            "replies": []
        },
        {
            "author": "briza044",
            "body": "They are banging, sorry to break it to you",
            "score": 4,
            "replies": []
        },
        {
            "author": "MerryMoose923",
            "body": "The most likely reason Katie isn't hanging out with you is that she wants to have Nate, and feels guilty.   It's easier to stop being your friend so she doesn't have to face you. And it's entirely possible they are having a relationship behind your back. \n\nMen and women can be friends and have boundaries in those relationships that make their partners feel secure.  Calling it an \"untraditional\" friendship seems odd - isn't it just a friendship?\n\nNate's comment that you should be grateful he has a friend is kind of odd as well.  You're not prohibiting him from having friends.  You have tried to voice your feelings about a particular friendship that makes you uncomfortable.\n\nPlease stop checking his location on-line, and questioning who he is with.  You're only going to drive yourself crazy.  And you look crazy and jealous by doing it.\n\nIs Nate spending less time with you overall?  Is he spending less quality time with you? I'm getting more of a vibe that you are hurt and confused more than being jealous.  You feel left out by you boyfriend and your former best friend.  Bluntly, if other friends are noticing how much time Nate and Katie spend together without you and are commenting on it, there is something to it.\n\nSit down with Nate and tell him that while you are happy he has friends, you feel like he is not putting the same effort into your relationship that you are.  Ask him point blank if he wants to break up with you and date Katie.  If he says yes, let him go and move on.  If he says no, ask him to commit to being more transparent about the friendship with Katie, and to focus more on your relationship - try to be specific about what you want.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Major_Boat_4404",
            "body": "My boyfriend is friends with his ex and I definitely feel uncomfortable with it. While Nate can choose his own friends, you can also ask for some boundaries with the friendship. \n\nI asked for certain things from my boyfriend and we have conversations about it. For example, I shared that I was uncomfortable with them hanging out alone in his home. That behavior stopped. I asked for consideration with what they watch together (I’m uncomfortable with them watching rated R for nudity things together). He compromised with me there. \n\nWhile I will always be uncomfortable with their friendship, we have conversations and he cares about me enough to listen to how I’m feeling and willing to discuss solutions that work for the both of us. \n\nMy biggest piece of advice (that comes from being almost 40 & studying healthy relationships) is that your significant other should care about your feelings & prioritize those above friendships. Nate should be open & willing to discuss this situation with you and how it can get better. If that isn’t happening, end the relationship & find someone who will prioritize you.",
            "score": 6,
            "replies": [
                {
                    "author": "Historical_Kick_3294",
                    "body": "Absolutely this.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "apocketstarkly",
            "body": "He’s not your boyfriend. He’s Katie’s.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Past-Anything9789",
            "body": "NTA - but seriously if he is prioritising her over you thats a pretty big sign than things are not right in your relationship.\n\nI would guess that your 'best friend' and your 'boyfriend' are waiting on you to catch up. Sit them both down and say to them that they are both prioritising each other over you, so you deserve the truth from them at least. Or just move on, as it seems like they have but they don't have the guts to pull the trigger. \n\nP.S. - you do NOT want to marry someone who choosing others over you - this is not your forever person. He's your practice - go find the person who make you feel like your their world.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AdLongjumping5641",
            "body": "Nate has 2 girlfriends",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lula_Lane_176",
            "body": "I know it's not what you want to hear, but it's very likely Nate and Katie are doing their own thing without you and you know what I mean. This isn't the guy you want to marry.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cultural-Revenue4000",
            "body": "Sounds like neither of them wants you to know they are an item. Clearly, something happened on the cruise. \n\nHow’s he with his phone? If he’s hiding her and his phone, then you know.\n\nThe lying is unacceptable. This would not be a life partner i want.",
            "score": 2,
            "replies": [
                {
                    "author": "Old_Length7525",
                    "body": "OP needs to see his phone.\n\nI’d bet a bunch of bitcoin their texts aren’t innocent and reveal plenty of chats that aren’t about the Mighty Mitochondria.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "havenicluewhatsoever",
            "body": "You might be ignoring or rationalizing what you are observing. If you were seeing all this in someone else’s relationship, how would you interpret these things?",
            "score": 2,
            "replies": []
        },
        {
            "author": "witchofwestthird",
            "body": "Hey, OP… I remember being 22 and thinking the person I was with was so perfect. He was actually the worst. By my 23rd birthday, I had met my husband (I just didn’t know it yet). The person who you’re meant to be with isn’t going to do things that hurt you on purpose. He knows them spending time together without saying anything to you hurts you and he chooses to do it over and over. It’s because, on the most basic level, he doesn’t care about your feelings. Doing things that hurt you and then manipulating you by saying things like, “You should be grateful” about being hurt is crazy. And you’re wrong when you say he treats you well. This is not how you treat a partner “well”",
            "score": 2,
            "replies": []
        },
        {
            "author": "TooTallTabz",
            "body": "I'm surprised I didn't see anyone mention that you guys are 22 and have been together for 6 years. Wow",
            "score": 2,
            "replies": []
        },
        {
            "author": "Historical_Kick_3294",
            "body": "I’m sorry, but he’s prioritising his friendship with her over his relationship with you. That tells you everything you need to know. You’re worth more than being second best.\n\nUpdateme",
            "score": 2,
            "replies": []
        },
        {
            "author": "BeeJackson",
            "body": "Sweetie, they are in love. If he’s really invested in your relationship it’s just so he doesn’t look like the bad guy. Maybe YOU think Katie is unattractive, but he absolutely does not.\n\nAnd she’s not your best friend. She hasn’t been a friend or best friend for a long time because she knows she’s in love with your boyfriend.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Late-Champion8678",
            "body": "Yeah, he’s cheating.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ok-language-nerd-511",
            "body": "Nate is not your boyfriend anymore. He's Katie's. \n\nKatie is not your friend. She's the b!tch that stole your boyfriend. \n\nWhy do you think she started studying biology?",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Confidence5235",
            "body": "You never told him that you didn't want him to have any friends. He twisted what you said to make you look like the bad guy. He's manipulative and selfish. He's not the guy for you. And she doesn't want to be your friend. She wants to be his girlfriend. They're both awful assholes. Cut ties with both. They clearly don't care about your feelings.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dull-Geologist-8204",
            "body": "My best friend is a guy and none of what they are doing is okay. \n\nMy best friend and my exes weren't always friends but not once when we went out was someone I was dating not allowed to come. They always new where I was and knew there was an open invitation to come hang out.\n\nDoesn't matter whether they are cheating or not the behavior is wrong. You shouldn't feel like a third wheel in your relationship. If Katie has some problem with you that isn't wanting to screw your bf she should have said something to deal with it or your bf should have. \n\nYou deserve to be treated better then this. I agree with the others that the relationship is done.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Deep_Unit_7550",
            "body": "I recognize this behavior from college. It can be very awkward to be around the old girlfriend and the new one at the same time.  That overlap period can be hard to manage.  It would be much easier for your former boyfriend and former best friend if you minimized that overlap.\n\nSeriously, confirm what all of Reddit thinks and then dump their asses.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FeelingNarwhal9161",
            "body": "You realize that Nate may not have broken up with you, but he’s now dating Katie, right? You’re the third wheel they wish would go away.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Backup of the post's body: I (22F) and my boyfriend (22M) who we will call Nate have been together for 6 years. He is a great guy. Treats me very well and is the person I want to marry. \n\nWe both go to the same university. My freshman year I became very close with my roommate (23F) who we’ll call Katie. We did everything together and ultimately became best friends. Since she was my best friend i introduced her to Nate. They didn’t really talk around each other until a year of knowing each other. Katie changed her major to biology which is Nate’s major. Nate is a tutor for our Universities academic program and enjoys teaching. Katie and Nate took multiple classes together and had a study group along with another one of our mutual friends Josh (22 M). I thought it was so nice how we could go to the library and I would study for my exams while my friends studied together. Over the summer Nate was able to help Katie get a research position in the lab he works in as well as a job at an urgent care he works at. It is very nice of him to do that for someone especially a friend. During the summer we also went on a cruise together. Nate, Katie, Josh and I. Since after the summer I noticed Katie rarely would text or call me. Every-time me and her would hang out would be extremely short and over a quick lunch. She would even invite Nate to come and hang out with us even though I just wanted girl time. Since the summer him and Katie hang out together alone at least 2 times a week. Usually in the research lab, getting lunch in between, or something like that.\n\nHere’s the problem. Since the start of my senior year Nate and Katie have hung out outside of school without me on multiple occasions without telling me. One instance that really hurt my feelings was when Katie went to Nate’s house to watch a cartoon movie she wanted to see. I was trying to arrange a time for me and Katie to hang out. Next thing I know I look out the window and she’s at my boyfriend’s apartment. (Me and Nate live in the same apartment complex). I opened the window and shouted hi and told her I was coming down. Which she didn’t seem enthusiastic about. I went over to Nate’s and asked them what she was doing there and she said they were just going to hang out until their meeting at school. At the time I felt hurt that neither him or her texted me to ask me to come over with them. Especially since I live across the street and they knew I didn’t have any classes at that time. Overtime this kept happening where they would hang out and I wouldn’t know until later or if I checked their locations on find my friends. I told Nate that it hurt my feelings she barely talked to me anymore and always flaked out on when we were supposed to hang out. He told me that they are just closer now than me and Katie are. \n\nI told him I find it weird that my best friend has suddenly become his best friend. Not only that but he does a lot for her. He got her a job, a research position, helped her apply to PA school and a lot more. Most of my other friends told me it was weird that my boyfriend and friend would hang out together all the time without me. Overtime I have started to feel insecure. What’s so wrong with me that Katie doesn’t want to hang out anymore? It’s not because she is busy or has other friends either. Im not being mean when I say me, Nate and Josh are her only friends. As well as Nates only friends are Katie and Josh. Though we don’t see Josh much. I told myself I wouldn’t text her for a month to see if she would text first since I’m always the one reaching out to see her. Of course she didn’t reach out and it really hurt. I told Nate that I have started to feel uncomfortable and not ok with how much time they spend together and the fact that Katie and I haven’t seen each other in 3 months. He responded by saying \n“May be untraditional but it’s a good friendship for me. You should be grateful I have a friendship. Bc tbh if she wasn’t my friend, I’d have no one to talk to other than you.\nI know it’s “weird” but it hurts my feelings that you’re so against it. I don’t like that you’d rather me have 0 friends rather than have an untraditional friendship”\n\nAlso I was looking at his location and saw he was at a shop with her. I texted him asking what he was doing and said shopping. Didn’t mention he was with Katie. I asked with who and it took him a little too long to answer. I asked why he didn’t mention he was with her and he said because he didn’t want to upset me. \n\nHe also accused me of being selfish and jealous. Which I guess is true. Honestly I don’t know what to do at this point. I asked him to stop seeing her or at least hanging out outside of school. Is that unfair of me? How should I go about this? Any advice would help so much\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TwoHotTakes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DisembarkEmbargo",
            "body": "I think Nate has a crush on Katie and Katie has a crush on Nate. They seem to be best friends now and you are the third wheel. I would talk to Nate about this and if he doesn't agree with you - break up .",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd-Wafer-4250",
            "body": "Him and Katie sitting in a tree, K. I\n S. S. I. N. Gee!",
            "score": 1,
            "replies": []
        },
        {
            "author": "badtrips777",
            "body": "He’s cheating on you with her. Hope that helps",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient_Big_5600",
            "body": "He’s friends with someone who broke your heart. She stole your boyfriend and feels guilty/possessive. Neither of these people have an honest relationship with you. They’ve already said goodbye to whatever y’all had. It’s just them now, they’re the couple.",
            "score": 1,
            "replies": []
        },
        {
            "author": "13acewolfe13",
            "body": "There's something weird going on here...they're acting totally sus",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeeJackson",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeeJackson",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "Any-Dependent31",
            "body": "NTA If they aren't sleeping together then she's at very least clearly always had a thing for him and he's just behaving shitty. I would wager something happened when you all went away which is why she started pulling away then.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PippiLS_2211",
            "body": "make it simple and keep your self respect. block them both and be done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LabAdministrative530",
            "body": "Your edit doesn’t make the situation itself any better. If you want to sit there and believe everything he’s telling go ahead. He’s clearly dating her",
            "score": 1,
            "replies": []
        },
        {
            "author": "sgray1919",
            "body": "I think her switching up is all you need to know. They either hooked up and she feels bad, they are having an affair and she feels bad, or she likes him and feels bad. It's weird as hell but who knows maybe they are just friends but I highly doubt it. Ya'll are in your early 20's and have been together since high school? Been there ,done that and it rarely ends well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "argenman",
            "body": "And he’s fucking her…or is soon to.  Move on OP to a better boyfriend and friend.  You’ve lost both of them…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snowybird60",
            "body": "NTA OP, They were hanging out together.Long before you found out about it and he wasn't telling you, neither was she. That's not normal.People don't lie unless they're hiding something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vibe_me_pos",
            "body": "Nate may say he finds her unattractive, but Katie is doing everything she can to snatch your bf. If I were you I would move on. This will not end well. I think we all know she will get him into bed or it will be a mutual decision. They just have so much in common! /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "whiterussian802",
            "body": "Cut them both out of your life it doesn’t sound like it would be much of a loss…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical-Shine957",
            "body": "My guess is he’s already moved on with his new gf Kate",
            "score": 1,
            "replies": []
        },
        {
            "author": "Separate_Highway1111",
            "body": "Yeah, I’m pretty sure he’s cheating on you with her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Melalemon",
            "body": "Esh. Oof. You’re not being prioritized in your relationship anymore. This is the age where people start to change sometimes even if you’ve been in a relationship together for a while. People grow and evolve. It’s worth having another conversation and encourage space to talk things out in more depth. Because it’s also not fair to him to end a friendship that is aligned with his hobbies and interests, but it’s also not fair to you that you’ve explained your feelings about this and he pretty much shamed you for feeling your feelings and communicating them to him. A partnership is choosing your partner every day over and over, and he may just need to be reminded of that. Good luck OP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "swigbar",
            "body": "All this and you still want to marry him? Gurl, he doesn’t even like you. Pathetic",
            "score": 1,
            "replies": []
        },
        {
            "author": "DianeFunAunt",
            "body": "They’re sleeping together. Get rid of both of them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fortheloveofbulldogs",
            "body": "UpdateMe",
            "score": 1,
            "replies": []
        },
        {
            "author": "22Hoofhearted",
            "body": "TLDR: College gf friend is hooking up with my bf...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flynn_JM",
            "body": "INFO: what type of shop were they at? Has this friendship changed how often you and your bf hang out?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Away-Understanding34",
            "body": "In regards to your edit: he has lied to you. He knows how uncomfortable you are with him hanging out with her and he purposely doesn't tell you. It's called lying by omission. Is it really that hard to make another friend? Probably not since there's other people in his classes. He just doesn't want to. He wants Katie and she wants him. The whole thing about him not finding her attractive is also a lie to make you believe nothing is going on. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "NerdyGreenWitch",
            "body": "They’re sleeping together. Dump him and find a new roommate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pretty_Goblin11",
            "body": "So…. They are having a sexual relationship.  Katie can’t be your friend anymore because she’s fucking your boyfriend and trying to take your spot.   The fact that your boyfriend is telling you basically  that your feelings don’t matter and trying to gaslight you into this is weird.   Tell him. It isn’t untraditional for a woman to ditch her best friend for her boyfriend, it’s shady.  Then go hang out with josh.  Alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PapiKeepPlayin",
            "body": "Not gonna lie all this of them hanging out alone together means they have to be messing around with each other. No guy with a gf is gonna choose to hang around some other girl all the time unless he's into her. Him telling you he's not attracted to her is just to throw you off so you won't be suspicious. I'd say press him and her why they hang out with each other so often and get answers. But deep down you know what's going on right? If I were you, I'd dump them both. There is no way these solo hangouts with just him and her so often is just innocent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Biotoze",
            "body": "Pretty sure they’re already dating each other",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElitistSwede",
            "body": "Doesn't seem like there's anything *wrong* happening, but I don't think your intuition is off. It also seems like you've made your feelings known, and he isn't giving that any weight or attention. If there really was nothing going on, I think he'd prioritize you and make you *feel better. So I'd kind of be surprised if they didn't have some kind of secret.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Length7525",
            "body": "Time to close Chapter 1 on your Life’s Book of Love. Nate was a good starter boyfriend. Time to find a guy who just wants to date you and not your best friend or roommate.",
            "score": 1,
            "replies": []
        }
    ]
}