{
    "title": "Trumps Budget proposes nearly trillion dollar cut from Healthcare services. Do we support this?",
    "author": "Warm_Difficulty2698",
    "subreddit": "AskTrumpSupporters",
    "rank": 113,
    "score": 148,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 265,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1io6g9n/trumps_budget_proposes_nearly_trillion_dollar_cut/",
    "id": "1io6g9n",
    "selftext": "https://www.aha.org/news/headline/2025-02-12-house-and-senate-consider-separate-budget-resolutions-aha-urges-congress-take-seriously-impact\n\nI noticed that no right wing media apparatus had reported on the cuts to Medicare. I recall several reps indicating they wouldn't cut Healthcare funding. Do we support cutting $800 billion from Healthcare services to fund other Trump agenda items? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "DOGE will eventually need to start looking up instead of down if they actually want to make the government more efficient. You want to save billions of dollars in healthcare entitlements? How about letting Medicare negotiate ALL drug prices. For the Pentagon, we need to starve the hogs there that have been robbing us blind.\n\nI don’t support it if it means people are going to lose their health insurance, but in principle I want people to get off welfare and join the middle class.",
            "score": 46,
            "replies": [
                {
                    "author": "thenewyorkgod",
                    "body": "> How about letting Medicare negotiate ALL drug prices.\n\nWell, Bided did that, then trump ended it. So?\n\n\\https://www.thecardiologyadvisor.com/news/trump-ends-push-to-slash-prescription-drug-costs/",
                    "score": 91,
                    "replies": [
                        {
                            "author": "ClevelandSpigot",
                            "body": "I knew that all I had to do was read the article, and it would end up contradicting itself.  It starts off with,\n\n>One of those now-cancelled policies directed Medicare to investigate ways to slash drug costs, including the possibility of a $2 monthly out-of-pocket cap on some generic medications.\n\nOkay.  Tell me more.\n\n>A key provision in former President Joe Biden’s [Inflation Reduction Act](https://www.irs.gov/inflation-reduction-act-of-2022), negotiating Medicare drug prices, remains untouched for now. Last week, Medicare unveiled a list of prescription drugs up for negotiations next. They included [Ozempic](https://www.healthday.com/a-to-z-health/general-health/ozempic-2665708850.html) and Wegovy, the popular weight-loss and diabetes drugs.\n\nSo, Trump actually *isn't* ending a push to slash prescription drug costs.  Okay.\n\nBut, what about,\n\n>A $35-a-month cap on [insulin](https://www.healthday.com/a-to-z-health/diabetes/everything-you-need-to-know-about-insulin) costs and $2,000 annual out-of-pocket cap on prescription [drugs](https://www.thecardiologyadvisor.com/news/doacs-and-amiodarone-concomitant-therapy-increases-bleeding-risk-in-af/) were not affected by the executive order signed Monday, *NBC News* reported.\n\nOh, good.  Trump's original plan (the one that Biden destroyed) also included epinepherine.  I hope that is included, too.  These two seem like really easy, affordable, and effective things to do.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "jankdangus",
                            "body": "Yeah, Biden negotiate some drug prices and he deserves credit for that. I think even though Trump ended it, he still has the opportunity to reinstate it and codify it into law as legislation where Medicare is allowed to negotiate ALL drug prices.\n\nSo far I’ve only seen low hanging fruits cut, we need systemic changes in order to make meaningful cuts in the deficit.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Ask-Me-About-You",
                                    "body": "Why would you try to spin this into anything but what it is? Trump is rolling back price-saving measures for Americans without any sort of replacement. He also had the opportunity to leave it alone and he didn't, which will cost Americans money and likely lives.\n\nUntil he has anything more than the concept of a plan, leave it alone.",
                                    "score": 64,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Because the goal of DOGE is to make the government more efficient. So if they are serious about doing that then they would try and negotiate ALL drug prices.",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "Ask-Me-About-You",
                                                    "body": "How does one \"negotiate ALL drug prices\" with the tens of thousands of pharmaceutical manufacturers around the globe that provide drugs to the United States?",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "Because other developed countries have already done that, so we can do that too. Big Pharma is still making a profit selling to other countries, they just get away with price gouging here in America because 98% of our politicians are crook.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 25,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jankdangus",
                                                                            "body": "Yeah they have socialized healthcare. The different with negotiating drug prices is that Medicare is already socialized. Why should my tax-dollars go toward not only R&D on top of Big Pharma price gouging Americans who rely on Medicare. Any logical person would see how fucked up that is.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[deleted]",
                                                                                    "score": 11,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jankdangus",
                                                                                            "body": "We have a mixed economy, so we already have some form of socialized healthcare. That’s what I support. I usually don’t like giving the government too much power, but if we were to try universal healthcare then absolutely non-citizens should be excluded. \n\nI don’t think universal healthcare is the ideal solution, but I think we can both agree we want healthcare reforms which include negotiating ALL drug prices, closing the evergreening loophole, shortening drug patents, and price transparency. The free market does work, but that’s contingent that Big Pharma doesn’t do everything they can to stop their patented drugs from becoming a generic drug.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "SassySleeper1",
                                                                                    "body": "Question: Do you mean your tax dollars go towards MEDICARE or MEDICAID? Because I paid into Medicare and Social Security when I worked. And now I pay $185 a month for Medicare. I just want to be clear about what your tax dollars are going towards and who you want to kick off. Poor people? Elderly people? Disabled people?\n\nI agree Medicare should be able to negotiate drugs because we still pay a lot of our income on drug prices that are way less expensive in countries with socialize medicine.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jankdangus",
                                                                                            "body": "Yes? But I’m pretty sure Medicaid is already allowed to negotiate drug prices.\n\nHuh we are literally on the same side here. I meant that I don’t want my tax dollars be used to pay for the overpriced drug prices because I want it to be lower via negotiations.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "C47man",
                                    "body": "Large companies hate the idea of Medicare negotiating all drug prices. Trump has never made a decision as POTUS that wasn't beneficial to large companies and their already-fat profit margins. He has run on and openly promised to protect these companies and the elite Uber-rich class of \"citizens\" they are run by. Why would you expect him to do something good?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Sure, but given that RFK Jr. got confirmed. It looks like the Trump administration might actually try to stand up to Big Pharma this time around. Btw in his last term, he did try to stand up to them with price transparency and capping insulin, the problem was EO are hard to enforce.\n\nHe didn’t necessary run on protecting the elite uber-rich class. Did he not campaign on capping credit card interest rates? I expect him to do something good because he’s responsive to his base. He doesn’t have a consistent ideology, he just does whatever that makes him more popular. \n\nBtw not everything the uber-rich does is bad. I support foreign corporations and American corporations investing into America and creating thousands of new jobs which is what happened recently.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "TricksterPancake",
                                                    "body": "Do you think he cares as much about his base now that he doesn't have any more elections to win?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "Yeah that’s the question that everyone is asking. He has the choice to sell out his base or his donors. If he sell out his base, he can enrich himself. Otherwise, he can sell out his donors, and cement his legacy as one of the greatest presidents ever.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "riskyrainbow",
                                                                    "body": "Would you not consider the $TRUMP fiasco \"selling out his base\"? Obviously it was their choice to invest but it was done under his leadership and his supporters lost billions.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jankdangus",
                                                                            "body": "Yeah I guess you can say that, I personally don’t like it since I think it’s a rug pull, but at the same time it’s true that some of his supporters who got in early made money and pulled out before it’s too late.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "riskyrainbow",
                                                                                    "body": "So if one disadvantages a large portion of their base to advantage another it at least partially balances out?\n\nIf you agree that Trump performed a rug pull, do you not see that as one of the most self-serving actions a president has taken in modern history? Was he not exploiting the office for personal gain? Would you not call it disgusting and abhorrent of Biden or Schumer or Pelosi were even remotely involved in something similar?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jankdangus",
                                                                                            "body": "Nah, it’s just a non-issue. But it’s your choice whether you get scammed or not. I’m all for spreading awareness about crypto rugpulls. Yeah, I think he was exploiting the office for personal gain and it is disgusting and abhorrent. But this doesn’t really affect public policy which I care about the most.",
                                                                                            "score": -2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "riskyrainbow",
                                                                                                    "body": "Other than tax cuts, what do you think were Trump's greatest policy victories in his first term?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "jankdangus",
                                                                                                            "body": "No, I don’t think Trump first term was successful. To answer your question though it would be First Step Act, USMCA, COVID relief, and Operation Warp Speed. Not a legislative achievement, but he did manage to reduce border crossing at all time lows.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "riskyrainbow",
                                                                                                                    "body": "If you agree his first term was unsuccessful, why do you have faith the second will be better?\n\nIf you believe USMCA is an accomplishment, what do you think of Trump doing everything he can to nullify it with tariffs?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "jankdangus",
                                                                                                                            "body": "Lame duck term, that means he doesn’t have to listen to his donors unless he wants to enrich himself, but there’s some percentage chance he cares about legacy more.\n\nIdk, generally not a fan of tariffs unless it’s small enough to be absorbed and not passed down or it’s for national security reason. \n\nThe problem with tariffs is we don’t have a robust competitive domestic market meaning the critics are right that corporations will get away with passing it down. \n\nThis is why I get infuriated when people like Ben Shapiro think that corporations holding uncheck amount of market power is not an issue. I guess it makes sense to have that position in order to justify not raising taxes on the rich. \n\nPersonally I think corporate tax cuts should be conditioned. Along with all loopholes being closed which would indirectly raise taxes on the wealthy.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "riskyrainbow",
                                                                                                                                    "body": "Can you explain how he had a lame duck term with both houses of congress? You support him because you think there's some percentage more chance he'll care enough to be effective this time?\n\nAlso, you said you care most about policy but you're against tariffs which make up about 90% of his policy goals, why do you even support him?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "jankdangus",
                                                                                                                                            "body": "Yes, and we have already seen that. He’s more aggressive this time around. It really feels like he’s speed-running in trying to fulfill all his promises. \n\nI think tariffs are fine as a negotiation tool which appears what Trump is mainly using it for. It doesn’t look like he actually plans to implement them recklessly. And again I’m all for national security tariffs even if it means I have to pay more for the goods I buy. \n\nI’m not interested in bankrupting Tesla, so I can buy a Chinese EVs for cheaper. It’s not good for American companies nor the workers there who would now be out of a job.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Dependent_Nature_953",
                                                            "body": "Yes because what he accomplishes will determine the next election in four years. It's either he proves the dems right and the country goes to hell or he implements policies that he said he would do like \"America first\" and etc and Republicans would have a chance in the next election.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "the_dj_zig",
                                                                    "body": "Do you honestly think Trump cares what will happen when he’s no longer in office?  I think your belief that he cares what happens to the Republican Party after he leaves office is, respectfully, a little naive.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Dependent_Nature_953",
                                                                            "body": "Yes if your theory is he's in it for fame n glory then yea because after money all you have is fame. He wants to be known as the greatest us president ever so that sorta doesn't go in line with what you say.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "the_dj_zig",
                                                                                    "body": "How does it not go in line with what I say? If he’s in it for the fame, he won’t care what presidents after him do. All he cares about is whether or not people think his terms in office were the best.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "rthorndy",
                                                                                    "body": "I think he just wanted to stay out of jail. I mean, is *he* really doing anything now? He's handed the keys to Elon and just signs whatever Elon and the Proj 2025 people out in front of him.\n\nDoes he seem particularly active in the day-to-day stuff now? He was incredibly active in the campaign season, especially given his age. Does he seem a little run down now, letting everyone else run the show?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SassySleeper1",
                                                    "body": "If he wanted to cap credit card interest rates, why is he trying to shut down Consumer Financial Protection Bureau, which would help be a watch dog for that. That bureau has helped the average American recoup $21 BILLION. How is that waste or fraud?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "It’s not waste or fraud. I didn’t support removing that agency.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "rthorndy",
                                                                    "body": "Why do you think it was targeted? To me, it seems like a massive conflict of interest for musk to be driving this destruction ... yet TS seem to be so unconcerned about overwatch or accountability for DOGE. Where do you stand on that?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jankdangus",
                                                                            "body": "Yeah, at this point I’m not a fan of Elon running DOGE. It was targeted because Elon had a deal with visa.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Debt_Otherwise",
                                    "body": "If it was a Biden policy do you honestly think Trump will reinstate it?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "He might, nothing is for certain. But again if he’s serious about making the government more efficient he would do that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sophophilic",
                                                    "body": "If he was serious about making government more efficient, why would he get rid of a policy that makes government more efficient only to later potentially reinstate it? ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "No, the policy is still there. He only got rid of the EO. He didn’t repeal the legislation.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "keelhaulrose",
                    "body": "If you think DOGE is about government efficiency why do you think they targeted the CFPB, which took an $800 million budget and turned it into $21 billion in return,  making it one of the most efficient departments?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Yeah I agree, that the CFPB should have been kept. That is not definitive evidence they won’t touch the Pentagon or entitlements though.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "keelhaulrose",
                                    "body": "Their goal is to cut $2 trillion.  How do you think they can do that without touching Medicare/Medicaid, Social Security,  and/or the Pentagon?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "No, that’s why I’m saying. They will touch it. Regarding healthcare entitlements, I only want to see them negotiate ALL drug prices for Medicare. For social security, it should be privatized.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "jphhh2009",
                                                    "body": "Would you mind explaining a little about what that privatization would look like? I see that quite a bit but I am pretty ignorant about the subject.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "It was actually a good idea by Bush, but it was smeared left right and center by the media. Bush didn’t mean he was going to take away people social security. Instead of it being a giant pool of cash, he wanted it to be put into an individual index fund and you aren’t allowed to access it until you are at retirement age. If we did that earlier, social security wouldn’t be in danger of going insolvent. We can still do it now, but it would have been better if we did it earlier. So what Bush proposal was similar to what we already have now which is a retirement index fund or a 401k.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ClevelandSpigot",
                                            "body": "Precedence is warranted here.  Bill Clinton is credited with balancing the budget for two years (I think it was), and actually having a surplus at one time.  However, he had to cut DEEP into both Medicare and the military in order to do so.  That last part is often ignored.  So...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LittleSnuggleNugget",
                    "body": "What do you make of the 880 billion of spending cuts to the committee of Energy and Commerce (funds public healthcare) as put forth in the new Republican budget plan here?\n\nhttps://docs.house.gov/meetings/BU/BU00/20250213/117894/BILLS-119NAih.pdf",
                    "score": 10,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Again I wouldn’t support it if it means Americans are losing their healthcare. I doubt this will go anywhere considering entitlements are a third rail of politics.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "LittleSnuggleNugget",
                                    "body": "Thanks for the response! How do you feel about the proposed 4 trillion increase to the debt ceiling?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "I want the national debt crisis to be slowed down. I like Bill Clinton and he deserves massive credit for actually balancing the budget. If the increase in the debt ceiling is a signal that they aren’t actually interested in cutting spending then hell no I’m not in favor of it.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zanabanana19",
                    "body": "How can people with disabilities get off welfare when they are disabled and lose their insurance? Do you feel that providing no healthcare to these people would make their medical needs no longer exist?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Yeah, then I wouldn’t support them losing their health insurance. But it’s disingenuous to say that all people on welfare, are in that dire situation.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zanabanana19",
                                    "body": "Welfare is an umbrella term that refers to all social services like Medicaid, food stamps, cash assistance, etc. so no, not all welfare recipients are disabled. But all are in dire situations. \n\nDo know what it takes to get approved for welfare?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Oh yeah I misspoke, of course they are all in dire situation. I’m just saying for the people who have the ability to change their income trajectory we should encourage that. Our national debt is at 36 trillion dollars and we have a 2 trillion dollars deficit. Our country is going bankrupt, unless we find ways to not get more people, but rather less people dependent on the government.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "zanabanana19",
                                                    "body": "Did you know that to be on welfare, you have to attend job search classes, resume workshops, and make applications to jobs every week and if you don't you get cut off? (And that's assuming you were even able to get approved in the first place.)\n\nDid you know that it's not actually possible to live off welfare benefits? Single parent with a disabled child in my state can get max $430 dollars a month cash and about $350 in food stamps. I think conservatives believe that people are living a good life for free on welfare?\n\nEdit to add that the avg 2 bedroom apartment in my area is $2000/mo plus utilities... But the family only gets $430 cash a month from welfare. This is not an extreme example, very common.\n\nDid you know that if a family on welfare ever manages to earn or save 2000 they are cut off immediately? Even though it would cost first (2000) + last (2000) + security deposit (2000) = $6000 to move into an apartment? \nHow does this family get off welfare when they are punished for trying to save up to get off the streets?",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zanabanana19",
                    "body": "Hi again! We know that you support Trump (per flair) and I'm interested in understanding what that means to you and what is guiding your (mostly reasonable imo) take on Medicaid.\n\n1) can you share where on the political spectrum you identify with? eg if conservative, would you say you're far right, middle, etc? Republican? Libertarian? Other? Not trying to put you in a box, but I want to understand how you place yourself on this admittedly imperfect scale.\n\n2) do you feel that most people who identify politically similar to you agree with your views on Medicaid?\n\n3) can you also share what your highest level of education is? \n\n4) is there any world in which you could support medicare for all US citizens regardless of income? What would it take you to get there? Or what are the absolute deal breakers?\n\nI really appreciate all thoughtful responses!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "1. On economic issues I lean conservative, but I believe in repealing the rules and regulations that the rich used to rig the system in their favor. This means ending all tax loopholes and negotiating drug prices as I stated earlier. On social issues I lean more libertarian. I would say I’m a center-right wing populist. That means I’m a civic nationalist unlike my far-right counterparts.\n\n2. Yes, if they don’t they are no better than the Bush-Era Republicans where we should give everything to the rich and let them continue to rig the system in their favor via legalized bribes. Another thing I’m against btw.\n\n3. Gen Z, freshman in college. I think most Gen Z right-wingers think like me. Gen Z tend to me more populist, that’s why you can’t really tell the difference whether they are right or left since they likely have large agreements.\n\n4. Yeah well, I’m fine with trying universal healthcare, but I don’t think it’s the ideal solution. I’m open-minded so if my idea doesn’t work then I would try it. The dealbreaker is if it includes non-citizens. If there were to be universal healthcare they should absolutely be excluded. \nMy preferred solution is dismantling the medical-industrial complex and making healthcare a true free market. There’s no reason for hospital to charge insane markups other than corruption. I guess it could be fixed with government-intervention price controls, but that seems to always lead to shortages.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zanabanana19",
                                    "body": ">I believe in repealing the rules and regulations that the rich used to rig the system in their favor. This means ending all tax loopholes\n\nDo you see supporting Trump as furthering this goal? How?\n\n>give everything to the rich and let them continue to rig the system in their favor\n\nDo you agree that Trump is ensuring a system where we \"give everything to the rich and let them continue to rig the system in their favor\"? I'm honestly struggling to understand how you hold these reasonable views while supporting Trump. \n\nNo snark, I genuinely can't get my head around it. And I'm a bit of an odd mix of ideologies myself. I'm very progressive but I also have an MBA and I'm not entirely anti -capitalism. But there's a 100% overlap between what you don't like and what Trump is about and actively doing. Can you explain?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "On Trump’s tax plan he released a few days ago, he said he would end the carried interest loopholes and eliminate tax breaks for billion dollars sports team. Great! Let’s see if he follows through with that promise. \n\nYeah, I think 99 percent of the working class whether they are right and left which is a false dichotomy hold these reasonable view of being against crony capitalism. The problem is that most of our politicians are bought out by the donor class. Trump is in this weird gray area where he’s an anti-establishment, a populist, and corrupt. The reason why he won the popular vote is because the country is dying for a real populist and Trump is the closest thing we will get. \n\nYeah well, my ideology was quite literally campaign Trump 2016. The main reason why I voted for Trump was because of DOGE which is another way of saying drain the swamp. Let’s figure out which social programs we can both agree we want to fund, such as paid family leave, and do it. The problem is we really don’t have the money to do so unless there’s radical reforms in the federal budget first.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "zanabanana19",
                                                    "body": "Do you know that Elon Musk literally posted to x this morning calling anyone who needs social services a parasite? The richest man in the world called a majority population in the US parasites. Thoughts on that? \n\nDo you think the US can afford to spend hundreds of millions on armored Tesla cyber trucks right now but not on social services? Because that's a new contract approved yesterday",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "Oh I didn’t see that. I agree with federal bureaucrats being parasite and would want their jobs to be replaced with AI. Yeah if he said that then I would obviously disagree. I think that might just be his hyperbolic way of saying what I’ve been saying which is to try and change income trajectory and get people off welfare.\n\nYeah, I just found about that recently. I thought the only subsidies Tesla gets is EVs subsidies which has been repealed. And of course I wouldn’t approve of that. I want government spending of waste, fraud, and abuse to go down.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "zanabanana19",
                                                                    "body": "It's here: [parasites \n](https://imgur.com/a/82DrWho)\n\nDo you support musk still?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jankdangus",
                                                                            "body": "Yeah, and you wonder why Musk approvals is so low. There is no reason for him to use this inflammatory language to Americans who rely on welfare. I have a similar perspective, but I definitely wouldn’t frame it that way.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "zanabanana19",
                                                                                    "body": "Do you still support him? Should he be representing the American government and its people?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jankdangus",
                                                                                            "body": "Well if he actually starve the hogs in the Pentagon and stand up to Big Pharma to make the government more efficient then we should give him a lot of credit. So it really depends how he go about making the government more efficient.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "zanabanana19",
                                                                                                    "body": "So you agree that it's not ok to call people parasites. But it might be ok if he makes some progress you value? Do you see a moral or ethical dilemma there?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "jankdangus",
                                                                                                            "body": "No, two things can be true at the same time. Of course I don’t like the framing, but that doesn’t mean I won’t take yes for a answer when he goes make systemic changes where he looks up instead of down to make the government more efficient.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "zanabanana19",
                                                                                                                    "body": "Aren't there ways to de bloat the government and get out of debt without harming the most vulnerable Americans more?",
                                                                                                                    "score": 3,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "jankdangus",
                                                                                                                            "body": "Yeah, this is what I mean by Elon having to look up.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zanabanana19",
                    "body": "What are your thoughts on Mark Cuban's goal of removing the middleman / drug brokers?\n https://www.costplusdrugs.com/",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Yeah I think what he did is a good step in the right direction. I know he supported Kamala, but I still have respect for him for what he has done and built.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "zanabanana19",
                                    "body": "Do you think most trump supporters agree?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "I mean during the election cycle of course everyone would be more tribal. They probably still don’t like him though. And there are good reasons not to other than he’s opposed to Trump. Mark Cuban is against capping credit card interest rates.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Nah, I get it. I don’t want to come off not being sympathetic. I want the government to do everything in its power to help you and change your income trajectory, but remember it takes two to tangle. It’s a combination of good individual decision-making along with government assistance to get you back on your feet. That’s just my philosophy and what I believe the role of the government should be. If you got any ideas of things the government should be doing, but it’s not, I’m open ears.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "defnotarobit",
            "body": "So I compared your article to the actual bill being proposed.  The $880 billion is for Energy and Commerce, which includes Medicaid.  Assuming $800B is for Medicaid is ridiculous.  Energy and Commerce is the largest committee and has everything from clean water, to food and drug safety, vehicle safety, tourism, foreign commerce.  This article is only fearmongering the readers.\n\nSo do we support cutting $800 billion from Healthcare services?  I support as much as there is fraud and excessive overhead.  If it's $10m or $2.7 trillion, I don't care.\n\nSource: [https://docs.house.gov/meetings/BU/BU00/20250213/117894/BILLS-119NAih.pdf](https://docs.house.gov/meetings/BU/BU00/20250213/117894/BILLS-119NAih.pdf)",
            "score": 2,
            "replies": []
        },
        {
            "author": "xmu806",
            "body": "That sounds insane. Fuck no. That will collapse every hospital in the country.",
            "score": 2,
            "replies": []
        },
        {
            "author": "basedbutnotcool",
            "body": "This sounds bad, but I would like to see a detailed list of everything that’s being cut away, and then I can make up my mind. But if this is for essential services, then I’m going to be very conflicted about it",
            "score": 3,
            "replies": [
                {
                    "author": "Heffe3737",
                    "body": "With due respect, musk claimed his aim was to cut two trillion from the budget. How could anyone, and I mean anyone, cut two trillion from our budget *without* making cuts to essential services in Medicare and Medicaid? \n\nI ask because I’m confused why that would concern you. You explicitly voted for people that said they would do this - did you not believe them?  Did you not understand how much of the federal budget is dominated by healthcare expenditures?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "basedbutnotcool",
                            "body": "Again it would depend on what’s being cut away. \n\nI’m happy that there’s an attempt to fix the major spending problem, I’m just going to be conflicted if the cuts are for services that are super necessary that’s all",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Heffe3737",
                                    "body": "I suppose my question is this: how do you think they can make the cuts they said they would, that you explicitly voted for, without cutting some services that you feel are “super necessary”?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IwinULose19692",
            "body": "Yup",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gaxxz",
            "body": ">Trumps Budget proposes nearly trillion dollar cut from Healthcare services\n\nTrump hasn't released a budget. You're looking at the House Republican budget.",
            "score": 0,
            "replies": [
                {
                    "author": "rational_numbers",
                    "body": "Do you expect the House to push back on Trump at all this term? Is there any chance Johnson would put forward a proposal knowing Trump didn’t like a part of it?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Gaxxz",
                            "body": "The budget document just approved by the House budget committee is just a framework. It has savings targets for each House committee. It's up to each committee to fill in the details.\n\nThe Senate has already pushed back on Trump. Rather than \"one big beautiful bill\" like the House, their budget addresses just immigration and repealing the IRA.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fullstep",
            "body": "I don't know the details of this budget cut, but can we please stop pretending that it is somehow automatically a bad thing to cut funding to a program that, at it's core, does good things? Waste and general inefficiencies can exist in any department and in any program. If you think there's a problem with the budget cuts, I'd like to see specific line items rather than just expressing a general concern.",
            "score": -30,
            "replies": [
                {
                    "author": "mastercheeks174",
                    "body": "It would definitely be great to see specific line items from this admin! Do you expect we’ll get that transparency any time soon?",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "LittleSnuggleNugget",
                    "body": "Have you checked out the budget plan put forth by Republicans yesterday? I highly recommend reading through the entire document, as it is a great way to learn more about the proposed spending cuts as well as the 4 trillion dollars of debt ceiling increases that will be needed to implement this plan.\n\nhttps://docs.house.gov/meetings/BU/BU00/20250213/117894/BILLS-119NAih.pdf",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "flowerzzz1",
                    "body": "So someone linked it below. Essentially it calls for $2T in cuts to our mandatory spending (things the law says we have to spend on). Total spending there now is $3.8T. This 3.8 is made up of Medicare, Medicaid, Social Security and some smaller programs like SNAP, Veterans Income Security, Military Retirement Programs etc. \n\nSo cutting $2T would be near 50 percent right? Do you think we can cut 50 percent of the above programs and not actually cut benefits to Americans who qualify for, have paid into, and rely on these programs? Is this something you would support?",
                    "score": 33,
                    "replies": [
                        {
                            "author": "jdtiger",
                            "body": "It's $2T over 10 years, so about 5%. And only $880B of that is for the House Committee on Energy and Commerce which has jurisdiction over Medicare/Medicaid, but they have jurisdiction over [lots of other things](https://en.wikipedia.org/wiki/United_States_House_Committee_on_Energy_and_Commerce#Jurisdiction) they could cut from",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "fullstep",
                            "body": "> If you think there's a problem with the budget cuts, I'd like to see specific line items rather than just expressing a general concern.",
                            "score": -25,
                            "replies": [
                                {
                                    "author": "C47man",
                                    "body": "Does a 50% cut to those services concern *you* enough to make you want to see the line items? Obviously we're concerned. The question is whether *you* are. Not whether you support them or not. But is this proposal something that you think has the *possibility* to do so poorly that you want to know more about it?",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "jonm61",
                                            "body": "It's not 50% 🙄. It's $2T over 10 years, not in 1 year, FFS. Maybe you should understand what you're talking about before you get upset about it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "whoisbill",
                                    "body": "Isn't this the responsibility of the people proposing the cuts? Will they be transparent about this?",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "wolfehr",
                    "body": ">If you think there's a problem with the budget cuts, I'd like to see specific line items rather than just expressing a general concern.\n\nShould it go both ways? If you think there's a problem with the budget, you'd like to see specific line items being cut instead of expressing general concern and a top line figure that must be cut?",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "knobber_jobbler",
                    "body": "It's probably because instead of a pragmatic approach using an actual technique and process to deal with wastage and inefficiency - there are a few and as yet I've not heard a single Trump administration or DOGE person use one of these, or demonstrate they are - they are just making sweeping cuts with little care or concern.  There's simply no way Elon and his little band of 20 year olds with no industry experience can even begin to do what they are doing in the time scales they have. It's like they are using a magic 8 ball or just putting a spreadsheet into ChatGPT and going with whatever it spits out. It takes weeks, if not months for a seasoned group of qualified professionals to do this kind of job on a medium sized business that has all its paperwork in order. Perhaps that makes it a bit clearer?",
                    "score": 22,
                    "replies": [
                        {
                            "author": "jonm61",
                            "body": "They're using AI algorithms that they spent months working on before Trump took office to identify the stuff they've identified. They hired, and vetted for security clearances, these 'young geniuses' who are coders, to write these algorithms for the various systems. That's how they're doing it all so fast. Plug in, run, get results. It's not that hard. For them, anyway.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "knobber_jobbler",
                                    "body": "Are you a software engineer? Have you ever worked in software engineering? Who did the security clearance? Why did Trump issue an EO to bypass their security clearance? If these are geniuses, why are they leaving open really basic software vulnerabilities? Who paid for them to work on these for months before Trump took office? How did they test this system without access to the information needed to test it? I worked in and managed QA, process and change management, lean development etc. within software development teams for 20 years so excuse me while I have some considerable doubts here.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hardcorish",
                    "body": "56% of our national spending goes to defense, versus say 0.1% that was going to agencies such as USAID.   Do you believe it would be wiser to look into trimming the fat from the thing that takes up 56% of our budget, or 0.1%?",
                    "score": 33,
                    "replies": [
                        {
                            "author": "sourcreamnoodles",
                            "body": "Pulling numbers out of our ass I see. Military is 13%, not 56.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hardcorish",
                                    "body": "Do you believe it would be wiser to look into trimming the fat from the thing that takes up 13% of our budget, or 0.1%?",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "Dave_from_the_navy",
                                            "body": "So a couple of things on that. 1, USAID takes up 1.2%, not .1%. 2, if the goal is to expose money going to sources that don't help Americans, it makes logical sense to start at the department that is literally designed to spend money overseas. Could more fraud and waste be found in a larger spending category? Sure! Does it really matter at the end of the day if they get to it all eventually? Not really. It's been less than a month, I'm sure they'll dig into the DoD eventually.\n\nEdit: I was looking at 2023 numbers! Actual percentage is closer to 0.6%!!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "JThaddeousToadEsq",
                                                    "body": "Does injury to the American people carry less concern than the immediate need to cut without patience?\n\nThat is to say, reports have been that Midwestern farmers no longer have buyers for some of their grains because usaid was buying it to send overseas, so they now have spoiling harvests. Additionally, one of the benefits to USAID buying these grains to send overseas was that if an immediate need for more grains occurred here in the US (such as a tree disease attacking fruit harvests this requiring supplementation in the supply chain), we would already have the stock and the output to use internally. Currently if something like that happened, wouldn't you think we might be in a tougher spot for some time?\n\nAlso, USAID was one of our greatest diplomatic assets. When foodstuffs were delivered to third world countries and areas that we wanted a diplomatic foothold, those bags of grains and food said USAID in bigger lettering than even WFP. Is the loss to diplomacy worldwide and the potential radicalization of people in areas that we had been helping before worth the immediate loss of USAID? Do you think the American people would have been better served if it had been a phase out process instead of an immediate unplugging?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Dave_from_the_navy",
                                                            "body": "I agree with you wholeheartedly. I'm not trying to suggest that USAID was entirely wasteful spending. There was quite a bit that was suspect, but I'm also sure that there was a large portion that was incredibly helpful both domestically and diplomatically like you mentioned. I think the sledgehammer method that the administration is currently taking seems a bit harsh and we're throwing the baby out with the bathwater a bit. That said, there is certainly a lot of dirty bathwater to drain from the system as well, no?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "JThaddeousToadEsq",
                                                                    "body": "I wouldn't go so far as to say \"a lot\" but certainly they're some tinge to the bathwater. That being said, isn't waving a sledgehammer bearing a dangerously high chance of accidentally smashing the entire bathtub?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "jonm61",
                                                            "body": "You're acting like we stopped all USAID funding. We didn't. We're still providing food and medical aid. \"Lifesaving\" aid was not paused.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "Remarkable_Kale_8858",
                                                                    "body": "Does this answer the question about American farmers?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Hardcorish",
                                                    "body": "My main issue with the approach being taken currently is that the agencies being targeted all have one common thread:  They're all investigating Musk or one of his companies in some capacity.  I'm sure he'll eventually begin actually targeting fraud, waste, and abuse but currently it seems he's wanting to shutter the agencies responsible for holding him accountable.\n\nThis can't be ok with most supporters, I'd hope?  I don't know how they feel about it but I can imagine if we replaced Musk with Hunter Biden, they'd not be ok with what was happening.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Remarkable_Kale_8858",
                                                    "body": "Isn’t 43B out of 6.7T .64%?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MakeGardens",
                                            "body": "It would be wiser to trim both, to trim everything possible. ",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "sourcreamnoodles",
                                            "body": "Just because I have the Trump Supporter tag doesn't mean I'm FOR waste in the military. Sure I'd like them to find waste in the military. If we follow your logic then would it then be wiser to trim fat from medicare / medicaid? That's a bigger percentage... I think the main purpose though of comments like this are to get wrapped up in an argument about what to do first instead of just going for it and actually getting stuff done. Cutting waste is popular no matter if it's 10% or 0.1%.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hardcorish",
                                                    "body": "The issue (as I see it, and I'm curious to get your opinion on) is the fact that Elon has been targeting agencies that have placed him under investigation.  We can debate about how useless or useful it may be to initially target agencies that only make up 0.1% of our spending budget, but the facts remain that the agencies he's shutting down and defunding have that one common thread.\n\nImagine if Biden's son was given the keys to the Treasury and all other government departments and told to look for fraud, waste, and abuse yet the only things he's able to accomplish are shutting down agencies who were investigating him.  You wouldn't be ok with that right?  I sure wouldn't be.\n\nI'm all for major government reform but I don't think this is the direction most people (including many Trump supporters) expected.  Am I wrong in that regard?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "sourcreamnoodles",
                                                            "body": "Well sure if there is a conflict of interest he should let others handle it, do you have examples of this? Also what do you think of Trump saying he now wants to cut military spending in conjuction with Russia and China. It seems the main reason to spend so much is to stay ahead of these two so if they reduce as well... it could be a good thing.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "jonm61",
                                                    "body": "The Pentagon is on the schedule, so it's coming, and I can't wait to see what they find. \n\nIt also just came out that $2.7T in Medicare fraud (I think it was over 10 years) sent overseas was identified last June, and the Biden administration sat on it.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "sourcreamnoodles",
                                                            "body": "Yea if that turns out to be true it's an insane amount of fraud. That's approaching 10% national debt.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Segolin",
                    "body": "You think the Trump admin had enough time to investigate what is waste and what is not?\nDo you think the Admin should be open about what standards they have to met?\n\nIts rushed, no transparancy.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "long_arrow",
            "body": "do you know the details on what exactly is being cut?",
            "score": -7,
            "replies": [
                {
                    "author": "LittleSnuggleNugget",
                    "body": "Have you checked out the budget plan put forth by Republicans yesterday? I highly recommend reading through the entire document, as it is a great way to learn more about the proposed spending cuts as well as the 4 trillion dollars of debt ceiling increases that will be needed to implement this plan.\n\nhttps://docs.house.gov/meetings/BU/BU00/20250213/117894/BILLS-119NAih.pdf",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "hotlou",
                    "body": "Have you?\n\nIf this budget plan is meant to promote fiscal responsibility, why does it increase the deficit by $4.5 trillion over the next decade (Sec. 2001, Committee on Ways and Means) while slashing $330 billion from education (Sec. 2001, Committee on Education and Workforce), $230 billion from agriculture (Sec. 2001, Committee on Agriculture), and $880 billion from healthcare programs (Sec. 2001, Committee on Energy and Commerce)? Meanwhile, it still raises the debt ceiling by $4 trillion (Sec. 2001, Committee on Ways and Means).\n\nCutting education by over a quarter-trillion dollars directly harms workforce development and long-term economic growth. The National Bureau of Economic Research has shown that increased education spending leads to higher earnings and employment rates, reducing reliance on government assistance. How does undercutting education align with the conservative goal of self-sufficiency and a competitive economy?\n\nSimilarly, slashing farm subsidies and agricultural support while inflation remains high threatens America’s food supply and global trade competitiveness. The USDA Economic Research Service has repeatedly found that agricultural investment is essential for keeping food prices stable and securing rural economies. Isn’t food security a national security issue?\n\nHealthcare cuts of nearly a trillion dollars will increase emergency care costs, leading to more unpaid medical bills and strain on hospitals—costs that get passed on to taxpayers and businesses. The Journal of the American Medical Association found that preventive care programs reduce long-term government spending on emergency treatments and disability benefits. How does making healthcare less accessible reduce costs in the long run?\n\nIf the goal is economic growth and national strength, how does cutting education, farming, and healthcare—while adding trillions in debt—align with conservative principles of strong national security, economic competitiveness, and fiscal responsibility?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ArrantPariah",
                            "body": "> Similarly, slashing farm subsidies and agricultural support while inflation remains high threatens America’s food supply and global trade competitiveness. The USDA Economic Research Service has repeatedly found that agricultural investment is essential for keeping food prices stable and securing rural economies. Isn’t food security a national security issue?\n\nI think that slashing farm subsidies would be a good idea.  Farm subsidies often disproportionately benefit large, corporate farms, leading to farm consolidation, inflated land prices, and fewer jobs in rural areas, ultimately harming the economic diversity and stability of smaller rural communities.  They can also incentivize unsustainable farming practices that harm the environment, impacting the long-term viability of rural landscapes.  John Oliver had a piece on this: https://www.youtube.com/watch?v=MI78WOW_u-Q\n\nHowever, farm subsidies are unlikely to be cut, given the clout that agricultural states have in the legislature.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": "What would be some unacceptable Healthcare cuts in your opinion?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "long_arrow",
                            "body": "cutting all medicare or medi aid. but I am ok cutting some waste like covering  rich people if they have 10 million in the bank and 0 income. it happens. Or removing trans surgery for minors (unless  consented by parents) from the coverage",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": "All? Does that mean you'd be ok with a 25% cut to those? 50%? 75%?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "long_arrow",
                                            "body": "If I know a precise number, I would be working in the trump administration.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "CaptainAwesome06",
                                                    "body": "You could work for the administration if you knew what percentage of Medicare/Medicaid you would be okay with cutting?\n\n1. Why don't you know what number you are okay with?\n\n2. Why do you think just knowing that number would qualify you for working in the Trump administration?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Coopzor",
                                                                    "body": "Why do you only care if it hurts you and not other people?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "long_arrow",
                                                                            "body": "Care to elaborate?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Coopzor",
                                                                                    "body": "You people like it when other people get hurt?\n\nhttps://youtu.be/oOjJtEkKMX4",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "CaptainAwesome06",
                                                                    "body": "Was that supposed to be a joke?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "long_arrow",
                                                                            "body": "Yes",
                                                                            "score": -4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Eyruaad",
                                    "body": "Does this mentality also apply to how they should be taxed?  10 million in the bank but 0 income means they don't pay taxes.  Is that fine?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "OkNobody8896",
                                            "body": "Presumably, if someone has 10 million dollars in the bank, they’ve already been taxed in that money, no?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "long_arrow",
                                            "body": "so Warren had that wealth tax idea before. I'm not necessarily against it.  It's impossible to implement because you have situations like unrealized gain and collectibles. It's one of those things where just because it's good does not mean we should do it. Countless scholars have studied and nobody knows how to do it",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Eyruaad",
                                                    "body": "But that's not a yes or no.  Should people who have 10 million and no income pay taxes? And then how do you decide which benefits they are entitled to?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "long_arrow",
                                                            "body": "they should, but how do you do it? if you say tax the cash, then they can buy stocks. if you tax the stock, what if they have a loss? do they take a loan to pay the tax?  there are millions of cases. what if their money is not in the US?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Eyruaad",
                                                                    "body": "So that sounds like you argue they shouldn't pay taxes?",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "long_arrow",
                                                                            "body": "is that what I said? read again, my first two words",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "JellyDoodle",
                                                            "body": "I've been thinking about this for a while and this seems like the perfect time to have discourse about it. \n\nI think that if someone has 10mil in the bank and no assets and doesn't spend any money, there's probably no good reason to tax it. The money was likely already taxed when it changed hands. (ex. Income Tax)\n\nHowever, most rich people have assets and do spend money. If you own property you pay property tax. If you buy goods or services you pay sales tax. If you buy or sell equities like stock you pay capital gains tax when you realize the income.\n\nIt also should be noted that doing nothing with your money effectively causes it to depreciate by virtue of inflation. There is an incentive to utilize it.\n\nNow if you still wanted to tax wealthy people on top of that, then you have to make it painless or useful. \n\nI'm just spit-balling here, but what about a \"Sovereign Reserve Account\"? If you have large amounts of liquidity you're not using, you could park it in a government-backed product that guarantees protection from inflation. In exchange for this safeguard, the government would take a predetermined percentage of any interest earned above an inflation-protected baseline. This way, your funds maintain their real value, and any extra gains contribute to public profit. \n\nEh? Eh?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ignis389",
                                                                    "body": "> I think that if someone has 10mil in the bank and no assets and doesn't spend any money, there's probably no good reason to tax it. The money was likely already taxed when it changed hands. (ex. Income Tax)\n\n\nThey are most likely getting an interest in a savings account on that 10mil. How much interest would be appropriate on a 10mil bank account? How much should the interest be taxed?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "p739397",
                                                                            "body": "Interest in income and gets taxed already. What are you proposing changing? \n\nThey aren't letting that much money sit in savings though, it'll be in brokerage and the gains will be unrealized. So the only taxable items on an ongoing basis would be if the receive dividends",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "sourcreamnoodles",
                                    "body": "Even if consented by parents*",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "long_arrow",
                                            "body": "I know, I just don’t want to debate that point",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "sourcreamnoodles",
                                                    "body": "It's the popular position, no need to fence sit just calmly explain your position and if they take offense to it then it's their problem and not yours.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "mehnzo",
                                                            "body": "Even when it’s been proven that gender affirming care for minors measurably reduces harm (i.e. suicide)? Even when over 30 years of medical research supports providing care? Even when each case is studied on a case by case basis to decide what is best for the patient? When all parties are consenting, the government, not guided by experts, should deny this care?",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "sourcreamnoodles",
                                                                    "body": "Nothing of the sort has been proven. Self harm does not decrease post transition, it's bad for children, and it's bad for society - I don't want my money funding it.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mehnzo",
                                                                            "body": "Have you looked it up? How sure are you?",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BBExotics",
                                                                                    "body": "You ask a million questions and that’s kinda all I see a lot of liberals do and then try and act like they’ve got a “got ya” moment… as a democrat, I definitely do not support gender transitions for minors. It’s wicked weird that anybody would. Especially with the current research on the poor mental health of a large part of the community.. this isn’t something that should be rushed and it really opens doors for years of regret later in life",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mehnzo",
                                                                                            "body": "So you took a look at my references from earlier?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "long_arrow",
                                                            "body": "I know. The issue is a lot of times they do sealioning, if you explain they ask 2000 questions, if you don’t answer they say you caved.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "long_arrow",
                            "body": "Yes I get that emotionally. But logically I encourage you to talk to your representatives.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "plastic_Man_75",
            "body": "Trump hasn't reused a budget",
            "score": 0,
            "replies": []
        },
        {
            "author": "Amishmercenary",
            "body": "I'm a big fan - it's half of my comments on this sub, calling for cuts to our ridiculous mandatory spending which has grown out of hand over the last 2 decades. AND tax cuts to go along with it? Love it.",
            "score": -26,
            "replies": [
                {
                    "author": "Warm_Difficulty2698",
                    "body": "It's cutting funding from one budget to use it for spending on another. \n\nThe tax cuts are only going to benefit the top earners and corporations. \n\nIf that's you congrats. If not, why support it?",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "What income groups are you seeing being affected by the tax cuts? I didn't see them specified in the bill. Got a source?\nEdit: Yeah that’s I figured",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "RMWonders",
                                    "body": "What does that question mean?  What groups will be adversely affected by spending cuts to enable tax cuts?  What groups will benefit from the tax cuts?  Or something else?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "I’m asking for a source for their claim. I want to see the numbers for the tax cut plan- what income groups are affected? By how much?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "RMWonders",
                                                    "body": "I get you’re asking for a source, but I don’t understand your question - Are you asking for a source for what wealth groups will get the benefit from the tax cuts?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Nrksbullet",
                                                            "body": "The claim was that tax cuts will *only* benefit top earners. If lower/middle class benefits from tax cuts, doesn't that mean he was wrong? I don't see a problem for asking for a source for the claim that only the really wealthy will get tax cuts.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Amishmercenary",
                                                                    "body": "Thank you- I just have looked at a few sources and haven’t seen the actual numbers to support this claim.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kwamzilla",
                                    "body": "According to the Center on Budget and Policy Priorities, households in the top 1% income bracket ($743K+ annually) would receive average tax cuts of about $60k per year.\n\nHere's a source: [https://www.cbpp.org/research/federal-tax/2025-budget-stakes-high-income-tax-cuts-price-hiking-tariffs-would-harm](https://www.cbpp.org/research/federal-tax/2025-budget-stakes-high-income-tax-cuts-price-hiking-tariffs-would-harm)\n\nThe likelihood is that cuts to SNAP and Medicaid will primarily have negative effects on low/middle incomes. The only real positive might be the doubling of child tax credits from $1k to $2k. Not to mention most individual ones that might help the every day man will expire in 2025.\n\nDo you think it is fair, valid or efficient to give $60k tax breaks to the top 1% (And similar to the rest of the top 5% just for this? \n\nCan you explain why the top 5% need such large tax cuts to achieve this and how this is efficient?\n\nSource: [https://www.americanprogress.org/article/budget-committee-republicans-are-moving-to-take-away-food-and-health-care-from-americans/](https://www.americanprogress.org/article/budget-committee-republicans-are-moving-to-take-away-food-and-health-care-from-americans/) (I acknowledge you may not like this source but it is evidence and therefore you're welcome to dispute with your own).\n\nHow do you reconcile this with Trump's promises to help the common man and middle class and challenging the elites/1%?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">According to the Center on Budget and Policy Priorities, households in the top 1% income bracket ($743K+ annually) would receive average tax cuts of about $60k per year.\n\n>Here's a source: [https://www.cbpp.org/research/federal-tax/2025-budget-stakes-high-income-tax-cuts-price-hiking-tariffs-would-harm](https://www.cbpp.org/research/federal-tax/2025-budget-stakes-high-income-tax-cuts-price-hiking-tariffs-would-harm)\n\nSo it's extending the 2017 TCJA? Awesome, it looks like OP's claim is incorrect then, because the Middle Class saw significant gains through TCJA. \n\n[https://thehill.com/opinion/finance/584190-irs-data-prove-trump-tax-cuts-benefited-middle-working-class-americans-most/](https://thehill.com/opinion/finance/584190-irs-data-prove-trump-tax-cuts-benefited-middle-working-class-americans-most/)\n\n\"[A careful analysis of the IRS tax data](https://www.heartland.org/publications-resources/publications/measuring-the-effects-of-the-republicans-tax-cuts-and-jobs-act-on-personal-income-taxes), one that includes the effects of tax credits and other reforms to the tax code, **shows that filers with an adjusted gross income (AGI) of $15,000 to $50,000 enjoyed an average tax cut of 16 percent to 26 percent in 2018, the first year Republicans’ Tax Cuts and Jobs Act went into effect and the most recent year for which data is available.**\n\n**Filers who earned $50,000 to $100,000 received a tax break of about 15 percent to 17 percent, and those earning $100,000 to $500,000 in adjusted gross income saw their personal income taxes cut by around 11 percent to 13 percent.**\n\nBy comparison, no income group with an AGI of at least $500,000 received an average tax cut exceeding 9 percent, and the average tax cut for brackets starting at $1 million was less than 6 percent. (For more detailed data, see my table published [here](https://www.heartland.org/publications-resources/publications/measuring-the-effects-of-the-republicans-tax-cuts-and-jobs-act-on-personal-income-taxes).)\"\n\nSo yes, I love this! Please cut my taxes by 15%+ ! Biden never came close to doing aything similar for the Middle Class!",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "the_dj_zig",
                                                    "body": "You do realize the 2017 TCJA progressively rolled back those cuts to the middle class, right? They’re no longer in place as of this year. The cuts that are still in place are the corporate cuts and the cuts for high earners. So if the plan is to extend the 2017 cuts, logic suggests it will only be the cuts that are still in effect and not the ones that have expired.\n\nIn other words, your taxes aren’t getting cut either way.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": ">You do realize the 2017 TCJA progressively rolled back those cuts to the middle class, right?\n\nOh absolutely - Dems refused to make those cuts permanent and as a result they sunsetted.\n\n>So if the plan is to extend the 2017 cuts, logic suggests it will only be the cuts that are still in effect and not the ones that have expired.\n\nWhy would the logic suggest that permanent cuts be extended? Do you know the meaning of the word permanent?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "the_dj_zig",
                                                                    "body": "How exactly would the Dems have made them permanent? They were written in by the GOP to sunset from the get go. And after Trump left office, the Democrats never had the majority to pass a tax law, so I’m curious where your logic that the Democrats allowed them to sunset comes from?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Amishmercenary",
                                                                            "body": "Dems would have made them permanent by actually voting for them…",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "the_dj_zig",
                                                                                    "body": "Again, voting for what? The Republicans wrote them in to sunset before it went for a vote. It was never an option for them to be permanent.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Amishmercenary",
                                                                                            "body": "The cuts had to sunset in order to be passed via the Byrd rule- are you familiar with the legislative history of TCJA? It doesn’t seem like it",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "the_dj_zig",
                                                                                                    "body": "The business tax cuts in the law are set to sunset in 2028. Why could they not be set at the same year? Almost like they were preplanned that way.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Amishmercenary",
                                                                                                            "body": "The goalpost moving here is pretty comical ngl",
                                                                                                            "score": 0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "snowbirdnerd",
                    "body": "Most of the country is very unhappy with our medical insurance system. Specifically private insurance. This wood guy out only real public insurance plan. \n\n\nDo you really like our private insurance system? ",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "I don't really care if it's private or public but yes the ACA fucked up our healthcare system majorly by combining the two to such an extent. I'd be happy to support universal if Dems wanna propose a cheaper plan with a ceiling to the spending on it.",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "snowbirdnerd",
                                    "body": "Our healthcare system was bad before the ACA. We had ballooning costs, a huge problem with uninsured people, and private insurance companies mass denying claims under the pretense of preexisting conditions. I agree that the ACA wasn't great, it essentially just required that everyone get private insurance which we all hated before and hate now.\n\nI'm also for Universal healthcare, a public option would go a long way to fixing many of the problems we have in our healthcare system. Medicare is essentially that, a private healthcare option that does it a good job reducing costs but limiting administrative costs and negotiating lower prices for procedures and medication.\n\nIf you are for Universal healthcare why would you be for cutting Medicare?",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "Because I think there's too much bloat in the current system - all our mandatory spending programs should have their overall budgets cut every year to get to a more healthy spending level. Something like 2-5% a year seems reasonable.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "snowbirdnerd",
                                                    "body": "Programs like Medicare and Medicaid are funded by a separate payroll tax. We all pay the FICA tax each pay period. You can almost think of it as a completely different entity from the rest of the federal government. That money is supposed to be for us when we get old or fall into finical ruin.\n\nCutting the spending won't end the tax but it will end the protections those programs afford us. Protections that we have already paid for and have been paying for our entire careers.\n\nPersonally I don't want my investment in those programs to be taken away. Do you?\n\nAlso these are very efficient systems with very low overheads. Why would we cut systems that are tightly monitored and well known for efficiency?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": ">Programs like Medicare and Medicaid are funded by a separate payroll tax. We all pay the FICA tax each pay period. You can almost think of it as a completely different entity from the rest of the federal government. That money is supposed to be for us when we get old or fall into finical ruin.\n\nYup I'm aware. But you fail to mention here that Medicare and Medicaid aren't entirely paid for by FICA taxes...\n\n>Cutting the spending won't end the tax but it will end the protections those programs afford us. Protections that we have already paid for and have been paying for our entire careers.\n\nThis is an extremely melodramatic take that I just don't believe. You think that 2% cuts will end the protections from Medicare and Medicaid? LOL",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "snowbirdnerd",
                                                                    "body": "  \nSure, it is also funded by user premiums and interest on investments. \n\n[https://www.medicare.gov/about-us/how-is-medicare-funded](https://www.medicare.gov/about-us/how-is-medicare-funded)\n\n>  \nHow is it funded?  \n  \nPayroll taxes paid by most employees, employers, and people who are self-employed\n\n>Other sources, like these:\n\n>Income taxes paid on Social Security benefits\n\n>Interest earned on the trust fund investments\n\n>Medicare Part A premiums from people who aren't eligible for premium-free Part A\n\n>Sure Medicare is also funded by users premiums and interest on it's investments. \n\n  \nThis also isn't a small cut. Trump wants to cut $800 billion with most of it coming from Medicaid. Medicaid yearly spending is about $600 billion at the federal level. This isn't a small cut, it a gutting of the system. What makes you think he is cutting just 2% of it?",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Amishmercenary",
                                                                            "body": ">Sure, it is also funded by user premiums and interest on investments.\n\n>[https://www.medicare.gov/about-us/how-is-medicare-funded](https://www.medicare.gov/about-us/how-is-medicare-funded)\n\n>\n\n>How is it funded?\n\nAnd by federal income and corporate taxes...\n\n>What makes you think he is cutting just 2% of it?\n\nI was referencing my own numbers. The 800B goal I've seen could alternatively come from social security, with a small fraction coming from medicare/medicaid, nothing has been passed yet, but if theres already 100B in improper payments from SS I imagine that's only the tip of the iceberg in terms of bloat. \n\nWould you agree that the 100B in improper payments is a good start towards cutting funds to these programs? Or would you rather we continue the 100B in improper payments?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "snowbirdnerd",
                                                                                    "body": "Right, I already covered the payroll tax so I didn't think I would have to bring it up again. \n\n\nThe article in the OP and everything I've read says this $800 billion would be primarily coming from Medicaid which is basically the whole system. \n\n\nPersonally I am all for cutting waste but this is an elimination of an entire public healthcare system that specifically helps low income people and kids. \n\n\nWe both want to get out of this private insurance hell we have created so why are you for cutting our public healthcare system? ",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Amishmercenary",
                                                                                            "body": ">Right, I already covered the payroll tax so I didn't think I would have to bring it up again. \n\nDo you think payroll taxes are the same as corporate/income taxes? What makes you think that? \n\n>The article in the OP and everything I've read says this $800 billion would be primarily coming from Medicaid which is basically the whole system. \n\nDid you read the primary source? That's not at all what I'm seeing: \n\n\"(4) COMMITTEE ON ENERGY AND COMMERCE.— 10 The Committee on Energy and Commerce shall sub11 mit changes in laws within its jurisdiction to reduce 12 the deficit by not less than $880,000,000,000 for 13 the period of fiscal years 2025 through 2034.\"\n\nWhere does the bill say that the 800B would be coming primarily from Medicaid?",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "snowbirdnerd",
                                                                                                    "body": "What? Why would I think they are the same? I was clearly taking about FICA and even mentioned it in my post about funding. ",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Amishmercenary",
                                                                                                            "body": ">Right, I already covered the payroll tax so I didn't think I would have to bring it up again.\n\nWhat specifically are you bringing up again? I didn't mention Payroll tax in my previous comment. I only mentioned income and corporate taxes in my comment to you before that. \n\nIn addition, Where does the bill say that the 800B would be coming primarily from Medicaid? Could you cite your source for me?",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "BBExotics",
                                                                                                                    "body": "In true liberal fashion the second there is a hiccup in the argument they go ghost lol",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Amishmercenary",
                                                                                                                            "body": "It's been a trend I've noticed ever since the election.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "the_dj_zig",
                                                                                    "body": "Why do you think the solution to fraudulent SS checks is cutting funding to SS? That just makes it hard for legitimate payments to be made.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "curiousjosh",
                                    "body": "Did you know this was the original plan but republicans as a block refused to support it so their only way to pass ACA was to have the public option removed so they could get the votes needed?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "Sure - that's why ultimately Obama is to blame for his vanity project.",
                                            "score": -9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Lone_Wolfen",
                                    "body": ">I'd be happy to support universal if Dems wanna propose a cheaper plan with a ceiling to the spending on it.\n\nWell you'd be happy to know that universal is cheaper on us than our current system!  I would have to dig it back up when I get home but economists projected a nationwide savings in the billions per year converting to universal healthcare, primarily from removing the for-profit middleman of insurance and covering of far cheaper early treatment instead of patients having to put it off until they require life saving (and savings devastating) surgeries.\n\nSo yeah, you're still supporting of universal now?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">Well you'd be happy to know that universal is cheaper on us than our current system!\n\nWhile I understand how it could be, I think the only way I would support it is if there were a hard ceiling on our spending of it - such that it was significantly cheaper than our current method.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lone_Wolfen",
                                                    "body": "I don't see why you need an arbitrary cap on spending in an already cheaper system unless you're trying to sabotage it into being dysfunctional.  Care to explain your reasoning there?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": "I wanna make sure it stays cheaper. For example, if we capped Universal at 90% the cost of our current spending on healthcare then I could see myself being in favor.\n\nBecause if we don't cap it, I guarantee that the government will find a way to increase costs every year...",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Lone_Wolfen",
                                                                    "body": ">Because if we don't cap it, I guarantee that the government will find a way to increase costs every year...\n\nIs \"there's more Americans to cover\" not a valid reason to increase spending each year?\n\nI get your concerns, and transparency will be necessary, but we need accountants for that, not programmers like DOGE hired.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Amishmercenary",
                                                                            "body": ">s \"there's more Americans to cover\" not a valid reason to increase spending each year?\n\nI'm happy to discuss a timeline- lets say it's capped for 10 years at 90%. If we're still there at that point then I'm happy to increase the cap if the GDP/Birth Rate/Inflation is matching as well. \n\n>I get your concerns, and transparency will be necessary, but we need accountants for that, not programmers like DOGE hired.\n\nWe've had accountants telling us for years that there is waste in the government and that financial reports coming out of the government don't make sense. Biden could have made those cuts, but the reality is Dems would never support that. They want the government bloat.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Lone_Wolfen",
                                                                                    "body": ">Biden could have made those cuts, but the reality is Dems would never support that. They want the government bloat.\n\nAn issue on both sides of the aisle.  Democrats and Republicans alike are sucking as much as they can out of the government into their own pockets.  Musk however is perhaps the worst of them all, having received taxpayer funded subsidies in the billions, and why I don't trust him to eliminate any actual bloat in our government.\n\nThanks for the reasonable discussion over universal healthcare, adjustment for population/inflation is necessary but I agree keeping an eye on it and altruistic accountability for anomalies is what we need.  Have a good day?\n\nEdit:  Apparently being nice was taking it too far and blocked me.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Amishmercenary",
                                                                                            "body": ">An issue on both sides of the aisle.\n\nNot anymore :)",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": "What would be some unacceptable Healthcare cuts in your opinion?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "Not sure, I'd have to see some specifics of a proposal in order to confirm. Obviously I don't want our healthcare system to collapse overnight but I don't think any of what we've seen thus far is close to that.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "stayfun",
                                    "body": "Deleted my comment as I got unnecessarily snarky. My apologies.  Have a nice day, okay?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "Coo",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">Some of the proposals come close. \n\nSo if these proposals go through you think our healthcare system is going to come close to collapsing? I think that's absolutely hogwash haha.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": "Naw I couldn't care less tbh. Government bloat has had these cuts coming a long time. We've all known that much of the healthcare industry is built on these state-sponsored ponzi schemes. Can't wait to see how cuts expose them.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": "Never in my life would I think I would see people defending the education systems that have abused students and their aid and endowments for decades....",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "subduedReality",
                    "body": "Do you know anyone that receives any form of government assistance/retirement that would be affected by this?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "Hard to tell- Imo if we cut funding for these kinds of programs the program heads will “find” wasteful spending before touching recipient payments.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "subduedReality",
                                    "body": "What do you base this on? Do you have experience on the subject? (I do, but I don't know everything, and I'm here to learn.)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "I base it on the fact that the GAO can’t successfully audit these programs because their financials are so botched. If you have botched financial statements then in my experience there’s always going to be spending that’s wasted.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "dethswatch",
            "body": "\\>to fund other Trump agenda items?\n\nOo- which other items?",
            "score": -6,
            "replies": [
                {
                    "author": "mastercheeks174",
                    "body": "Tax cuts?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "dethswatch",
                            "body": "yeah, I'd like to hear about those. Maybe we can make a deal.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mastercheeks174",
                                    "body": "I’d love to see some kind of deal like during the Clinton admin. Massive cuts across government (necessary as hell), matched with tax cuts for middle and lower class, raising corporate taxes back to where they should be to capture revenue during hyper growth phases (ai/tech). This would be ideal to stabilize the economy and leaves us in a good place to lower corporate taxes when and if the AI bubble pops. Would you be down for something like that? Essentially create consumer growth propping up “losses” from higher corporate taxes (as they expand revenue massively across the board).",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "dethswatch",
                                            "body": "clinton had the luck of being in charge when computers became indispensable and (a bit) the internet started adding productivity- productivity is more $ to the economy. \n\nAI \\_could\\_ do that, but if it took the same trajectory, we're at something like the year 1986 and Excel is amazing and this Macintosh thing might be useful. I think it'll be a while- and if it takes off like just general computing did (which is could well) then we won't need to play with taxes, we'll be so awash in cash that we can cut across the board and still have plenty. Or that'd be the ideal situation.\n\nAlso- if you want to hobble companies with taxes and I can buy the same services overseas, then it's going to be a problem, won't it?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": "What would be some unacceptable Healthcare cuts in your opinion?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "dethswatch",
                            "body": "huh uh- I asked you first.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": "I'm not asking what's in it right now, I'm asking what would be unacceptable to you?",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "ThrowawayBizAccount",
                                    "body": "We are here to ask Trump Supporters questions, and asking NTS questions outside of Ask NTS threads is breaking the rules. Have you familiarized yourself with the rules after the 2025 Inaugural?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "dethswatch",
                                            "body": "yes- and perhaps you're not familiar with rule 3, which clearly allows clarifying comments.\n\nMay the mods strike me down if I'm wrong but, I'll bet you're allowed to clarify what you're aslking about.\n\nSo again- which \"other items\"?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "bigtiddyhimbo",
                                                    "body": "So far the other items include massive tax breaks for cooperations and billionaires, as well as buy 400M worth of armored Tesla cyber trucks. Shocker. \n\nDoesn’t seem to be many other plans to allocate these funds to other than threatening our allies with invasion if they don’t want to willingly join the US. As well as the talks of annexing the West Bank, and displacing over a million Palestinians for real estate.\n\nNow you can answer! what are some unacceptable healthcare cuts?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "dethswatch",
                                                            "body": "\\>include massive tax breaks for cooperations and billionaires,\n\nPlease point in the direction of some evidence of this, I'm really hoping it's true.\n\n\\>400M worth of armored Tesla cyber trucks. Shocker.\n\nBiden budgeted for that, and it's \"armored teslas\", not cybertruck as such, and some other electrics too, but I mean, why bother with facts when your feelings are hurt?\n\n\\>threatening our allies with invasion if they don’t want to willingly join the US.\n\nOk- I'll play along- the beady-eyed flapping heads to the north must immediately accept the US as their sovereigns or we will steal the Stanley Cup and, uh, grow our own maple syrup in quantities such as they've never seen.\n\nYou should probably start stocking up and the supplies needed to endure this massive war.\n\n\\>displacing over a million Palestinians for real estate.\n\nFinally a decent issue to discuss- welp, what to do with all of these terrorist and terrorist lovers? Why is it that their brothers in egypt, jordan, etc, won't accept them into their countries?\n\n\\>what are some unacceptable healthcare cuts?\n\nThis is politics- anything is negotiable.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DidiGreglorius",
            "body": "I’m not representing that this is Trump’s view, but I personally favor deep cuts to federal entitlement spending — Social Security and Medicare. Our population is aging, the Social Security trust fund will run dry in about 8 years time. It’s the responsible thing to do. Medicare should simply be converted to a block grant to States and phased out over ~20 years.",
            "score": -1,
            "replies": [
                {
                    "author": "Warm_Difficulty2698",
                    "body": "May i ask if you think our Healthcare system would work better fully privatized?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ethervariance161",
            "body": "I think there is lot of room to improve the efficiency of medicare spend. \n\n839B spent on 61million people is 14k per person per year. \n\nCompared to the UK which spend about 4k per person per year. \n\nI'm a big fan of the privatization movement within medicare where private insurers take on the risk of managing patients via medicare advantage and the government pays a flat rate per person",
            "score": -1,
            "replies": []
        },
        {
            "author": "defnotarobit",
            "body": "Depends on how much it is.  Where did you get that $800B number?  It's not in your article.",
            "score": -2,
            "replies": [
                {
                    "author": "bigtiddyhimbo",
                    "body": "It’s in the official documents on the trump tax plan recently released that expands on cutting certain expenses to fund these tax breaks for the ultra rich. \nWhat are your thoughts with essentially all of Medicare and Medicaid being cut to fund tax breaks for the ultra wealthy?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "defnotarobit",
                            "body": "I searched and can't find it, could you be kind enough to provide a link please.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bigtiddyhimbo",
                                    "body": "https://www.healthcaredive.com/news/house-gop-budget-healthcare-medicaid-aca-cuts/740035/\n\n“Republican 2025 tax plan Medicaid” was all I had to search to find this. Can you answer the question now?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "defnotarobit",
                                            "body": "Let's have a look here at the article:  \nRepublicans would seek to pass a work requirement.  I'm a huge fan of this!  If you can work, absolutely must.  I don't like leeches.  This would save $109B.  This is a \"might\".\n\n$530B for reducing the rate at which the federal government matches states' Medicaid spending.  Looks like it takes out the 50% floor.  I'm ok with this.  This is a \"could also\".\n\nE&C could consider limiting supplemental payment programs, saving $175B.\n\nThe article does post a link to the bill, so that's amazing!  Let's look at the source.  CTRL-F:  \n\"medicare\" - 1 result.  New budget authority, blank, outlays, blank.  For all years\n\n\"medicaid\" - 0 results\n\n\"social\" - 3 results.  Again, no mention of cuts or dollars.\n\n\"cut\" - 0 results\n\n\"reduce\" - 10 results.  A number of committees must submit changes in laws to reduce deficit by certain Billions of dollars within their scope.  Education and Workforce might be Medicaid - so $330B total there.  \n\n\"880\" - Oh here we go, under the Committee on Energy and Commerce.  $880B reduction of deficit for 2025 through 2034.\n\nSo the article's author is assuming 100% of that debt reduction is for Medicaid, nothing for the rest of the Energy and Commerce.  That includes Biomedical research, food drug device safety, environmental protection, clean air and climate change, water, toxic chemicals, energy policy, renewable energy, nuclear facilities, electronic communications, broadcast tv, cyber security, data security, consumer protection, vehicle safety, travel, tourism, and interstate and foreign commerce.\n\nok, let me answer your question now that I have information:\n\n>Do we support cutting $800 billion from Healthcare services to fund other Trump agenda items?\n\n  \nYOUR ARTICLE IS NOTHING BUT LIES AND DECEIT! $880B COVERS THE ENTIRE ENERGY AND COMMERCE JURISDICTION NOT JUST MEDICARE.  MIGHT! COULD! POSSIBLY!  SCARE TACTICS!  THAT'S ALL THIS IS!\n\nOMG! THE REPUBLICANS ARE TAKING AWAY SOCIAL SECURITY AND MEDICARE! pfft.  All bull.  All the Democrats have are lies.  Did you not think I would look at the source?\n\nWhat do you think of the article now?  Please answer this question.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZarBandit",
            "body": "Entitlements (government welfare) are a massive proportion of the Federal budget.  In 2019 it was > 70%.  I believe it’s in the mid 60’s now because the cost to service the debt has increased since then, largely as a result of the liberal lockdowns and Biden wrecking the petrodollar. \n\nA 1% reduction in welfare waste would represent a staggering amount of money.  I’d be willing to bet there’s far more than that.",
            "score": -8,
            "replies": []
        }
    ]
}