{
    "title": "What is your opinion of various aspects of human sexuality, and of laws governing them?",
    "author": "ArrantPariah",
    "subreddit": "AskTrumpSupporters",
    "rank": 97,
    "score": 18,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 206,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1irmo9z/what_is_your_opinion_of_various_aspects_of_human/",
    "id": "1irmo9z",
    "selftext": "What is your opinion of, and should there be laws that limit/prohibit:\n\n1.  Pornography?\n\n2.  Prostitution?\n\n3.  Adultery?\n\n4.  Sodomy?\n\n5.  Miscegenation?\n\n6.  Contraception?\n\n7.  Abortion?\n\n8.  Incest?\n\n9.  Homosexuality?\n\n10.  Transvestitism?\n\n11. Transgenderism?\n\n12.  Polygamy?\n\n13.  Age of consent/statutory rape/pedophilia?\n\n14.  Masturbation?\n\n15.  Paraphilia?\n\n16.  Beastiality?\n\n17.  Other forms of sexual immorality?\n\nSome of these were *huge* issues in the past.  The Supreme Court officially legalized miscegenation, abortion and sodomy.  Then, the Supreme Court reversed itself on abortion.  Which means that any of the above could be open either to liberalization or to restriction/prohibition in the future.\n\nWhat are your preferences with regard to the above activities?  If you want laws, then what should those laws be?  Laws governing human sexuality vary widely across the planet.  For example, some countries permit homosexual marriage, while others impose a death sentence on homosexuals.\n\nAnother example of variations in sexual laws: https://www.chinadaily.com.cn/en/doc/2003-11/10/content_280236.htm\n\n>A Singaporean police sergeant has been jailed for two years for having oral sex in a country where prostitution is legal but oral sex is not, a newspaper reported Friday.\n>\n>The Straits Times reported that the 27-year-old police coast guard sergeant landed in court after a 16-year-old reported to the police that she had performed oral sex on the man.\n>\n>She was above the age of consent and agreed to perform the act, but oral sex is against the law in the city-state, the paper said.\n>\n>\"The act by itself is an offence. It is not a question of consent or no consent. Even between consenting people, it is an offence,\" criminal lawyer Subhas Anandan told the paper.\n>\n>The maximum punishment for the offence is life imprisonment.\n\nIn most of the USA at present, prostitution is a crime, but oral sex is fine, although the \"age of consent\" is a tad higher in many US jurisdictions.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TMist94",
            "body": "1. I think that pornography is generally harmful and not a good thing, but I am not for the government interfering in citizens' lives where there are no victims. I am against how socially acceptable it is and the negative impacts it comes with, but would not support government action taken against it as long as the participants are consenting adults and nobody is injured.\n2. My views on prostitution have flip-flopped some over the years, I'm still struggling with a firm stance on it. I think overall it is wrong and devalues intimacy, but I am often swayed by the argument that outlawing it causes more harm than good by trapping victims of human sex trafficking since they're afraid to go to the police once they're prostitutes, even if it is against their own will. If it were to be legal, I would want there to be a lot of regulations around it to ensure that everybody participating is doing so of their own will, and regular STD testing required both for the prostitutes, as well as clients being required to show a clean STD test taken within a certain amount of time beforehand.\n3. Adultery is horrible and wrong, but should remain a civil matter. It should be dragged through the mud socially more than it tends to be these days, for both men and women cheaters, but I don't like the idea of criminal penalties.\n4. What consenting adults do on their own private time is none of my, or the government's, business.\n5. Interracial relationships/marriage are perfectly fine and should not be restricted by government or society.\n6. Contraception is a wonderful thing and should be used by anybody having sex who doesn't want a child. That being said, it does not absolve one of responsibility if a child should still come of it despite the use of contraceptives. Realistically, we're never going to stop human beings from sleeping with each other, even in situations where they probably shouldn't. So I see no cons to making sex as safe as possible.\n7. I used to be pro-choice (despite most of my ideology being republican/conservative), but that has changed in recent years. I think that abortion is overall a bad thing and would love for it to be wiped out completely, but if I were in a position to make policy about it, I would likely adopt something similar what most of Europe does - a very limited time-frame (usually around 12 weeks in Europe, I usually just say the first trimester for simplicity) and after that it is illegal outside of exceptional circumstances such as rape and/or incest. Abortion in general is a terrible thing in my view, but even the thought of very late-term abortions are abominations and should be punished harshly, particularly for the doctors who perform them.\n8. Incest is wrong and has a high likelihood of being very damaging for any child, should one be born from it. It should be illegal with harsh punishments up to where there is significant risk of birth defects, and after that point should be unacceptable and shamed socially.\n9. What consenting adults do on their own private time is none of my, or the government's, business.\n10. I think that cross-dressing and the culture surrounding it is generally harmful to society, and should not be as well accepted by society as it has become, but I would not be supportive of any legislation against it in and of itself. I believe in a free society with minimal government intervention, except in cases where there is somehow a victim involved, so legislating what somebody can wear would not align with my values.\n\nEdit: Comment was too long, continued below.",
            "score": 14,
            "replies": [
                {
                    "author": "TMist94",
                    "body": "11. Much the same as #10 above, but I think that much of what we're seeing recently is a mental health crisis. Many of the people involved have legitimate mental health issues that they need professional help with, and giving way to their delusions rather than being honest with them is not helping anybody. \n\n12. I think that polygamy is generally wrong and should be socially discouraged and not legally recognized (e.g., no polyamorous marriages), but other than that, again, what consenting adults do on their own private time is none of my, or the government's, business. \n\n13. Age of consent should either remain where its at, or be raised by a couple of years or so. Any form of sexual assault/contact towards a child under 12 should carry the death penalty without exception (so long as it is proven without a reasonable doubt); above that varies by the age of the victim and perpetrator/case/severity, but should still be penalized harshly in cases where the adult was knowingly engaging in such a way with a minor.\n\n14. No opinion really, masturbation is a personal thing where the government absolutely should not be involved in any capacity. Should it somehow be an issue, it should be handled in-house among family. The only exception I can think of would be something like public masturbation, which of course falls under public indecency. Overall, not an issue to me. \n\n15. There are many different kinds of paraphilia, and my thoughts on it varies by case. Overall I think that they're negative, but if its only consenting adults involved and nobody is getting injured or killed, then that's their business.  \n\n16. Beastiality is horrible and should always remain both socially and legally unacceptable. Aside from it just being gross, animals cannot consent.\n\n17. I'm not particularly interested in government being the morality police. If no children are involved, and nobody is getting injured or killed, and everybody involved is consenting, then it is none of my, or the government's, business.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "BikePuzzleheaded2399",
                    "body": "You think cross dressing is inherently sexual? Do you think effeminate dress back in the day was sexually immoral? Very young children, boys and girls, would wear a dress like garment; aristocrats would wear effeminate clothes, makeup, and wigs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sfprairie",
            "body": "OK, here goes:\n\n\n\n1. Pornography? - Too much of it and too easy to be access by children. I valid area of intense government regulation. \n2. Prostitution? - Do not like it but the reality is that it exist.  An area of abuse by criminal organizations.  Also an area than needs intense government regulation. Would like to see more prosecution on the demand side and the criminal supply side.  I can see a case for legal but regulated.  Not an area for the Fed, but reserved to the States.  Well, the Fed should be involved in trafficking.  \n3. Adultery? - Valid justification for divorce. \n4. Sodomy? - Private interaction of consenting parties. \n5. Miscegenation? - I had to look this one up, never hear the term before.  This is fine. \n6. Contraception? - Support.  All for air dropping condoms into areas with high births to young single moms. In fact, I am willing to spend my taxpayer money on free vasectomies to anyone who wants it.  \n7. Abortion? - Tolerable in the 1st trimester, hard no in the 3rd.  Not sure where to draw the line in the 2nd. \n8. Incest? - Illegal.  I believe Game of Thrones explained why.  :-)  \n9. Homosexuality? - Not the governments business. \n10. Transvestitism? - Not the governments business.  How you choose to dress is up to you. \n11. Transgenderism? - That is a you issue.  If you want to transition, that is also up to you.  But it is not an operation the government or health insurance is compelled to provide. Also opposed a transgendered person in sports of their non-birth gender.  \n12. Polygamy? - Opposed to the legal recognition.  How three people choose to live is up to those three.  However, the third is not getting any legal support.  ie no claims to inheritance, three party tax returns, ect. \n13. Age of consent/statutory rape/pedophilia? Fine the way it is.  18 is considered an adult. Yes, it is arbitrary but I don't know of a better way. I know some States have a lower age, but I will leave that to those States. \n14. Masturbation? - Not the governments business so long as it remains private.  \n15. Paraphilia? - Also had to look this one up.  Is this an issue?  \n16. Beastiality? - Illegal\n17. Other forms of sexual immorality? - So really it comes down to consent, not forcing on others and not involving children and animals.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Fignons_missing_8sec",
            "body": "1. Pornography? fine\n2. Prostitution? should be decriminalized \n3. Adultery? bad, but not a issue for the government\n4. Sodomy? good time\n5. Miscegenation? What year do you think it is?\n6. Contraception? good\n7. Abortion? pro choice\n8. Incest? bad, marriage should be illegal within a set number of degrees, intercorse probaly should be too, but that gets tricky.\n9. Homosexuality? I'm only half, but it is a good time.\n10. Transvestitism? fine\n11. Transgenderism? fine\n12. Polygamy? fine\n13. Age of consent/statutory rape/pedophilia? Important, should be 18 nationally, with romeo and juliet laws.\n14. Masturbation? good time\n15. Paraphilia? fine\n16. Beastiality? illegal \n17. Other forms of sexual immorality? Should not be the government's business",
            "score": 15,
            "replies": [
                {
                    "author": "MrEngineer404",
                    "body": "Given the feedback on this list, and to be a tad frank, why would you vote MAGA then? Several of these stances are particularly counter to the MAGA platform or Trump's whole deal, in general, so why would you align behind politics that would shoot down your believes on peoples freedoms here? The MAGA platform has come out pretty stringent on contraception, abortion, all trans topics, and has been testing the waters on overturning marriage equality, (not to mention a couple other items on here, regarding Trump's relation with them that I won't go into) so why would you support them when they seem so set on outlawing people's freedoms that you seem to be fine with them keeping?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Fignons_missing_8sec",
                            "body": "There are far more important things than stances regarding human sexuality. Also, for someone who hates gay people Trump sure has no problem appointing them to the highest position they have ever held in government and hosting their weddings at Mar-a-Logo. Plus it’s not like I fully agree with the Dem's stances here, for one I'm against puberty blockers and trans women competing in competitive women's sports (wait till I tell you my trans ex who I'm still very good friends with agrees with me on those two).",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MrEngineer404",
                                    "body": "> for someone who hates gay people Trump sure has no problem.....\n\nPer another comment to my reply, I would tangentially agree, and say I don't think anyone is claiming Trump, specifically, \"hates gay people\", as he seems to more or less not care personally about a LOT of this; But would you say it is fair to claim that even if Trump does not seem to outwardly care strongly on this, it would seem a LOT of the MAGA base & political actors connected to MAGA seem to be anti-gay & anti-trans? Does it matter whether or not Trump presents benign to LGBTQ rights, if he does not stop those moving political pieces around and beneath him from taking hostile actions against it?\n\n>There are far more important things than stances regarding human sexuality\n\nA Lot of these items, and opinions on their legality touch upon fundamental freedoms of expression and rights to exist openly in society; what important issues are so much stronger of a factor for you, that they outweigh subject matter that the legalization/outlawing of such would fully up-end a lot for 1st amendment and privacy rights?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Fignons_missing_8sec",
                                            "body": ">what important issues are so much stronger of a factor for you, that they outweigh subject matter that the legalization/outlawing of such would fully up-end a lot for 1st amendment and privacy rights?\n\nHuman progress, and stopping the bureaucratic regulatory state that stands in the way of it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AccomplishedCarob307",
                            "body": "How has the MAGA platform been “testing the waters on overturning marriage equality”? \n\nThe 2024 Republican Party platform removed language on traditional marriage, and Trump is supportive of gay marriage. He made a married gay man is Treasury Secretary, making him the highest serving gay man in the history of American governance.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "jankdangus",
                            "body": "MAGA might be socially authoritarian, but Trump himself is socially libertarian. He’s not going to touch abortion any further besides cutting funding for planned parenthood nor is he going to let the Supreme Court overturn gay marriage. It’s not politically viable for him and it will make him deeply unpopular. He would legalize weed federally if not for his base stopping him. So for Trump it’s certainly a balancing act.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "MrEngineer404",
                                    "body": ">nor is he going to let the Supreme Court overturn gay marriage.\n\nvia what levers of power does Trump have any means to PREVENT SCOTUS from ruling on something and overturning precedent? The White House has no means by which to force SCOTUS to not take up a case decision.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "He took credit for the overturning Roe v Wade. I think he will try and bully them similar to how he bullies Congress.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ixvst01",
                                    "body": "\\>MAGA might be socially authoritarian, but Trump himself is socially libertarian.\n\nSo what do you think happens when Trump is gone and the pressure for the GOP to be socially libertarian on things like gay marriage is gone? Do they revert back to the strong government-enforced social conservative ideals?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Yeah, I guess that would happen.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Owbutter",
            "body": ">Pornography?\n\nI think it's a pox on humanity but legal\n>Prostitution?\n\nShould be legal and with some light regulation just to prevent human trafficking and exploitation\n>Adultery?\n\nLegal\n>Sodomy?\n\nLegal\n>Miscegenation?\n\nLegal \n>Contraception?\n\nLegal \n>Abortion?\n\nLegal until 19 weeks\n>Incest?\n\nEww but legal\n>Homosexuality?\n\nLegal \n>Transvestitism?\n\nLegal \n>Transgenderism?\n\nLegal, with the caveat that kids shouldn't be making permanent changes to their bodies \n>Polygamy?\n\nLegal\n>Age of consent/statutory rape/pedophilia?\n\nLike most states have their laws.\n>Masturbation?\n\nLegal\n>Paraphilia?\n\nI had to look this one up, surprising. Weird and legal\n>Beastiality?\n\nDisgusting, animals cannot consent, illegal.\n>Other forms of sexual immorality?\n\nLike what? Podophilia? Weird and legal",
            "score": 3,
            "replies": []
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "I'm going to have to dance around these subjects very carefully.  Not that I think my views are extreme or anything, but rather, the Admins like to come down hard on some of them.\n\n**PLEASE NOTE:**  Point 13 applies to all other points.\n\n1. I'm fine with pornography existing and being age-limited.  I understand why states like Texas feel that certain websites need to do more in verifying the age of viewers, but I don't exactly know how to implement such a thing.\n2. I always laugh at people who think prostitution should be illegal.  It's just a ridiculous concept.  It's so strange to me that it's okay for me to sell my body picking up a bunch of heavy crap and the like, but it's not okay for me to do so in bed.\n3. I would, ideally, want the government completely out of marriages altogether.  What happens in a relationship is for the people in the relationship to determine.\n4. Put what you want where you want it, as long as everyone is consenting.\n5. This is another one of those things that I don't get.  My sister once spent two years mapping out our family tree.  How far back does one need to go to figure out what race they are?  Is it just by looks or what?  What if you're married for 40 years and find out one of your ancestors was of mixed race?\n6. I don't particularly like abortifacients, but that's just a me thing.  And I fully admit, I haven't used contraception in years.  I've also been married to a wife who, quite literally, cannot have children.  Use what you want.\n7. I think abortion is a tragedy, and one that should be avoided most of the time.  That's not a moral thing, really, so much as \"Dude, you can tell me the condom broke or whatever, but chances are, you were doing something wrong.\"  I think they should be legal and safe, within reason, but I think that, barring health crises, rape, incest, etc., people shouldn't need to get one.\n8. This one always gets me.  I find it weird and I'm very opposed to the \"grooming\" aspect of many such cases, but I also have heard about long-lost cousins who were in a relationship and realized they were related, etc.  Ultimately, if it's two consenting adults, I suppose it's none of my business, but still, it seems icky.\n\n(This got too long, sorry!  Will comment the rest.)",
            "score": 3,
            "replies": [
                {
                    "author": "JustGoingOutforMilk",
                    "body": "1. 9.  Who you want to bump uglies with has nothing to do with me (see below).  Unless it's me.  Or my wife.  In which case, then yeah, I'm going to have an opinion on the subject.\n2. 10.  What you want to wear, outside of public indecency laws, also has nothing to do with me.  I may think you look silly, but that doesn't matter.\n3. 11.  Here's a sticky one.  I do not care.  If I've known you as Betty, but you want me to call you Al, I'm okay with that.  It's your body.  However, I think that it's important that someone be of \"sound mind\" to begin transitioning and that they are open about it when it comes to relationships.  I also believe that physical truths are truth--if you have an outie, I don't expect a lesbian to want to do the horizontal tango with you.\n4. 12.  Don't care.  It's a weird legal issue, which is part of why I think the government should be out of marriages.  I've met several polycules (not quite the same thing), and those have severely tainted my views on things, but I am also adult enough to realize that just because they failed doesn't mean it's always horrible.\n5. 13.  **HERE IS THE BIG ONE!**  As mentioned above, all of these points tie into this one.  As long as everyone involved is of the age of consent, I don't really care.  I would support a national age of consent law, because things are really strange, and I would support some sort of Romeo and Juliet law to allow younger couples around the age of consent to not go to jail.  I think sometimes here our commitment to ensuring that children are not abused winds up destroying innocent lives--think about the kids who get busted for child pornography because they sent a naughty pic to their SO.  I could write up a lot about this, because I find the notion of the magical minute ridiculous, and I think it's strange that I could theoretically be drafted to go off and die for my country before I could buy smokes, but still.\n6. 14.  Just don't do it somewhere I can see, okay?  And if you must do it in a public restroom, be quick about it and clean up your dang mess!\n7. 15.  This encompasses such a wide range of topics, so let me use the scientific definition.  If we are talking about disorders, I want people to be treated.  But for most uses of the term, people are just talking about kink.  Nothing wrong with getting a little kinky.  But if I walk into your apartment and you have a swing, a rack, and an assortment of toys on proud display, I'm most likely going to excuse myself shortly after.\n8. 16.  No.  Just no.\n9. 17.  I don't know what sexual immorality is.\n\nUltimately, I have five issues with someone's sex life, preferences, whatever:\n\n1. Is it with me?\n2. Is it with my wife?\n3. Is everyone consenting?\n4. Are there any kids involved (see point 3!).\n5. Do I have to see it?\n\nSo long as all those questions are answered satisfactorily, I don't care.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "Twitchy_throttle",
                    "body": "Something that interests me about some folk (both left and right) is how they think government should stay away from people's lives on things like homosexuality but they think incest should be illegal. I'm not disagreeing with you. I personally think incest is gross, but so is the idea of two men getting it on (to me personally). But I don't really understand the difference between one being immoral and illegal and the other one being acceptable. \n\nWhy do you think that is? What's the practical difference between a guy getting a BJ from his boyfriend or his sister? Is incest a mental illness?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrhymer",
            "body": "The government should only act on rights violations specifically direct harm by force or fraud.\n\nThat means most of your general list is fine except 7,8,13, and the exception is 16 that should be illegal because it's just gross.",
            "score": 2,
            "replies": []
        },
        {
            "author": "heroicslug",
            "body": "\n\n\n\nPornography? Legal for persons above the age of majority. In practice, good luck keeping it away from kids. Still, an effort should be made.\n\n\nProstitution? Should be legal. I'm a bit more libertarian than most on the right, and I think that what consenting adults do is generally their business.\n\n\nAdultery? Should be legal, but we should eliminate no fault divorce and a proven case of adultery should be grounds for divorce.\n\n\nSodomy? Gross but consenting adults will do what they will.\n\n\nMiscegenation? Fancy word for intercourse and reproduction between the races, nothing objectionable here.\n\n\nContraception? State-Funded Norplant (5-Year contraceptive implant) provided for any any girl free of charge upon the onset of puberty. Socially encouraged if one is unmarried and sexually active.\n\n\nAbortion? Legal up to a certain point but socially frowned upon.\n\n\nIncest? Ughhh I guess it should be legal between consenting adults, that's gross but.. fuck the state. There's certainly an argument to be made here for criminalizing and reproduction that results from such an arrangement, given how much higher the percentage is for birth defects. But no, the Kentucky state troopers shouldn't go arrest Jim Bob for bedding Sally Sue.\n\n\nHomosexuality? Legal, but we need to look at all of this business with same-sex couples adopting children away from their birth parents. Honestly it needs to be studied.\n\n\nTransvestitism? Cross-dressing? I had to look that up lol. Legally permitted but socially discouraged. Mocked openly for the absurdity that it is.\n\n\nTransgenderism? Legal but heavily socially discouraged.\n\n\nPolygamy? This one is tough, frankly, the state ought not recognize any institution of marriage. There should be a civil partnership\n\n\nAge of consent/statutory rape/pedophilia? Oh, Jesus Christ. 16 across the board, I guess? I think that's the lowest I'm personally willing to see it go. Japan has it at 16, as so some other countries. Romeo & Juliet laws applying in some circumstances. Pedophilia should 100% be a crime, obviously.\n\n\nMasturbation? Legal. How are you gonna make jacking off illegal? How would you enforce that?\n\n\nParaphilia? Honestly not even sure what this is lol\n\n\nBeastiality? Gross. It's animal abuse. Like children, they don't have voices for themselves, so it's up to us to protect them.\n\n\nOther forms of sexual immorality? Legally permitted, socially discouraged.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mainaccount98",
            "body": "1. Pornography? Don't care. Mia khalifa is hot af\n2. Prostitution? should absolutely be legal\n3. Adultery? Sucks for the other person but not the government's business \n4. Sodomy? Please clean out first \n5. Miscegenation? Don't care \n6. Contraception? Should be illegal to lie about it\n7. Abortion? Too many variables to make a blanket opinion\n8. Incest? Don't care, fuck your sister if y'all want to\n9. Homosexuality? Some will say sword fighting with the bros is gay, some won't. Lines are blurred. \n10. Transvestitism? Creepy but not the government's business \n11. Transgenderism? Mental illness. The ladyboys in Thailand still identify as male\n12. Polygamy? Sounds fun but maybe high maintenance \n13. Age of consent/statutory rape/pedophilia? It's all over the place. Should at least have some uniformity. \n14. Masturbation? Doing it in public is frowned upon, in America at least \n15. Paraphilia? As long as you don't turn into a serial killer\n16. Beastiality? Personally find it gross, but interesting gray area of right or wrong\n17. Other forms of sexual immorality? What else didn't you list? Poop stuff just seems wrong across the board and nothing is going inside of my penis.",
            "score": 7,
            "replies": [
                {
                    "author": "vs7509",
                    "body": "Sorry can you help me understand what you mean in #16 / how that is a “gray area”?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "CJDizzle",
                                    "body": "If you swap the supermodel out would there be any category of person that would change your feelings on the matter?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "mainaccount98",
                                            "body": "I mean yeah that's a broad spectrum. Like if you're a brick layer with 200 grit sandpaper hands, I be like yeah unhand that horse dick. You're probably hurting him.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "CJDizzle",
                                                    "body": "Okay bricklayer jacking off a horse is bad, supermodel jacking off a horse is good for you. Any concerns about sexualization or ability to give consent or taking advantage?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "mainaccount98",
                                                            "body": "I mean people jerk off horses all the time for breeding race horses so it doesn't seem like a big deal. I find it all gross regardless.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "pantsfeelplain",
                                                                    "body": "Is \"people do it all the time\" a good argument for something being moral?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mainaccount98",
                                                                            "body": "Depends. I've always been kinda confused by that word. Like it's immoral to steal, but what if your family's starving and you need to steal food? Does it make a difference if you steal from a big grocery store or a mom a pop shop? Does it also factor in if you can only get to a mom and pop shop because Walmart is too far away?\n\nIf people do it all the time, even if it might be immortal, at least it's acceptable.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bigtiddyhimbo",
                                    "body": "So beastiality is okay as long as someone hot is doing it..?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MattCrispMan117",
            "body": "\\>Pornography? \n\nDont personally support a ban but would be fine with one. l dont believe its protected under free speech.\n\n\\>Prostitution?\n\nLeave it up to the states (like we do now actually). l kinda like the system we have now where its only legal in one state (Nevada) and anyone who wants that sort of thing can move there but the wrest of us dont have to live around it.\n\n\\>Adultery?\n\nlmmoral but should not be legal. SHOULD however be considered in custody battles and as to whether or not a spouse recieves alimony.\n\n\\>Sodomy?\n\nlmmoral but shouldn't be illegal (at least l wouldn't want it illegal in my state). l think you can make a technical case under the constitution that there is no right protecting someones right to do this but that doesn't mean any state should make it illegal even if they have the right to.\n\n\\>Miscegenation?\n\nSame as above minus the immoral part. lts not protected by the constitution but that doesn't mean l want to se it banned.\n\n\\>Contraception?\n\nSame as the last three PLUSS being immoral in this case lol.\n\n\\>Abortion?\n\nUltimately l would like to se a national abortion ban but l dont believe the constitution allows for this except by constitutional ammendment. Until the support for something like that is there it should be left up to the states; and l do support full bans on this with the obvious exception of life of the mother and rape.\n\n\\>Incest?\n\nShould technically be left up to the states but l consider it immoral and would vote to make it illegal as in all instances (in my opinion) such relationships are never full consensual.\n\n\\>Homosexuality?\n\nSame as sodomy.\n\n\\>Transvestitism/Transgenderism?\n\nlmmoral (more so for those who promote it to the mentally ill then the mentally ill themselves) but l think (while, honk if your tired of reading it, it should be left up to the states!) it should be legal after 18. \n\nSelf abuse isn't something l think you can legislate away (for adults) in a free country.\n\n\\>Polygamy?\n\nlmmoral but probably should be legal. At least going off the logic of gay marriage.\n\n\\>Age of consent/statutory rape/pedophilia?\n\n18. Life sentences for anyone who violates thhis\n\n\\>Masturbation?\n\nlmmoral should not be illegal.\n\n\\>Paraphilia?\n\nl do not know what this means and google was not helpful (lol). Could you define what you mean here specifically??\n\n\\>Beastiality?\n\nls wrong and while it should be up to the states l'd hope to God we can all agree this should be illegal.\n\n\\>Other forms of sexual immorality?\n\nl dont know of any. l think you got them all man.",
            "score": 2,
            "replies": [
                {
                    "author": "BikePuzzleheaded2399",
                    "body": "I’m confused. If you hold beastiality and homosexuality to both be immoral, why do you want homosexuality to be legal in your state, but also want beastiality to be illegal in your state? Also, do your moral convictions come only from god, if so, why do you treat the sexual activities differently?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "basedbutnotcool",
            "body": "> What is your opinion of, and should there be laws that limit/prohibit:\n\n> 1.  Pornography?\n\nI don’t like how widespread it has become, and how mainstream it is. I think it’s very damaging for people, especially young people. I want stricter regulation on the industry but I don’t think it should be banned. \n\n> 2.  Prostitution?\n\nI don’t like, but I don’t think it should be banned. \n\n> 3.  Adultery?\n\nI don’t respect these people at all, but no laws against it should be applied. \n\n> 4.  Sodomy?\n\nIf everyone consents, I don’t care. \n\n> 5.  Miscegenation?\n\nSame as above. \n\n> 6.  Contraception?\n\nFine by me, contraception helps in a lot of aspects. \n\n> 7.  Abortion?\n\nI don’t think it should be banned, but I am heavily against it and how it is celebrated and treated lightly. It should be an absolute last resort. \n\n> 8.  Incest?\n\nYeah no fuck this shit. It’s disgusting. \n\n> 9.  Homosexuality?\n\nIf everyone consents, and it’s not displayed in front of children in a suggestive way I don’t care. \n\n> 10.  Transvestitism?\n\nWeird and I wouldn’t do it. Don’t think it should be illegal though. \n\n> 11. Transgenderism?\n\nI feel sorry for them, they are suffering with mental illness. I don’t think it should be illegal to transition if you are aware of all the risks and dangers, and are able to consent to everything. \n\n> 12.  Polygamy?\n\nIf everyone consents, I don’t care. \n\n> 13.  Age of consent/statutory rape/pedophilia?\n\nReally depends on context and the age gaps. Like if it’s 17 and 19 then it’s no big deal. 15 and 45? Major deal. Pedos are disgusting and should either go to therapy, or go to jail. \n\n> 14.  Masturbation?\n\nIt’s fine\n\n> 15.  Paraphilia?\n\nIf everyone consents its fine \n\n> 16.  Beastiality?\n\nDisgusting and cruel. Degenerate behavior. \n\n> 17.  Other forms of sexual immorality?\n\nNot sure what else there is left. If there’s any that people want me to expand on I can",
            "score": 1,
            "replies": [
                {
                    "author": "CavalierTunes",
                    "body": "Regarding homosexuality, you said:\n> If everyone consents, and it's not displayed in front of children in a suggestive way I don't care.\n\nCan you clarify what you mean by \"not displayed in front of children in a suggestive way”?\n\nTo some people, a female teacher offhandedly mentioning her wife is \"grooming.\" To some people, a children's book that has no sexual content but a gay character is \"inappropriate.\" Some people (whether they recognize it or not) have a different standard for what is “suggestive\" based on the sexual orientation of the individuals involved (e.g., a man and a woman kissing in public is considered \"normal,\" but two men kissing in public is considered \"harmful\").\n\nSo, my question is, can you expand further on where you draw the line?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "basedbutnotcool",
                            "body": "It’s suggestive when there’s naked men dancing at pride parades when there’s children around. That’s disgusting. Even me as an adult I’m disgusted by that.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CavalierTunes",
                                    "body": "That’s fair. Do you feel the same way about women at a car wash?\n\nAnd I’m just curious where you draw the line. I think that naked people dancing in the streets (regardless of sexual orientation) is not appropriate. But what’s the lower bound of what you consider “suggestive,” such that it should be disallowed?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "basedbutnotcool",
                                            "body": "There’s naked women at car washes?\n\nI don’t mind if there’s adult only events where people can be promiscuous. But if your event is trying to market itself as a kid friendly event and there’s stuff like that then I have a problem",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CavalierTunes",
                                                    "body": "No disagreement here.\n\nI’m just curious where you draw the line. I think that naked people dancing in the streets (regardless of sexual orientation) is not appropriate. But what’s the lower bound of what you consider “suggestive,” such that it should be disallowed?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "basedbutnotcool",
                                                            "body": "I don’t know, it’s really situation dependent. I agree that it doesn’t matter the sexual orientation of the people doing it, I just notice that it’s a lot more lgbt people doing it",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "CavalierTunes",
                                                                    "body": "I think that’s an honest answer. But, can I offer a counterpoint?\n\nIs it possible that it’s not actually more common among the LGBT community, just more publicized? Could it be that rage-baiters and news outlets that aren’t LGBT-friendly tend to push the narrative more that it’s common among the LGBT community?\n\nFor example, I saw a lot of people online about the idea of children going to a drag queen reading hour at a library (which contained no suggestive content), but ignoring families taking their children to Hooters. I think that our society has normalized suggestive behavior so much that we don’t notice it unless it’s abnormal—and to many people, being gay is abnormal.\n\nJust some food for thought.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "basedbutnotcool",
                                                                            "body": "I mean sure, but the other possibility is that these accounts pushing this messaging are in response to the degenerate behavior, and wouldn’t be able to exist if it wasn’t so common. \n\nI disagree with drag queen story hours read to children, and I disagree with taking children to hooters. Both of them are weird",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BigDrewLittle",
                    "body": ">> 11. Transgenderism?\n\n>I feel sorry for them, they are suffering with mental illness. I don’t think it should be illegal to transition if you are aware of all the risks and dangers, and are able to consent to everything. \n\nIn the US, the claim of mental illness was also once routinely wielded against gay people. Why specifically would you draw a line at transgender/transsexual people being mentally ill, but not cisgender gay people?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "basedbutnotcool",
                            "body": "Because every trans person has a mental disorder called gender dysphoria, it’s the whole reason for transitioning in the first place isn’t it?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sshlinux",
            "body": "Yes there should be laws prohibiting them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Carcinog3n",
            "body": "1. Pornography? I'm ok with age verification but it shouldn't be illegal unless it's child porn, non consensual, revenge porn or other types of victim content\n2. Prostitution? should be legal\n3. Adultery? if you want to cheat on your spouse that's your problem not mine\n4. Sodomy? use soap\n5. Miscegenation? there is only one race, human\n6. Contraception? Fine\n7. Abortion? I think heartbeat laws, life of the mother, rape is a fair compromise\n8. Incest? If you want to diddle you sister and she wants you to who am I to stop you\n9. Homosexuality? stop shoving it down my kid's throat and behave like decent people\n10. Transvestitism? stop shoving 8t down my kid's throat and behave like decent people\n11. Transgenderism? stop shoving it down my kid's throat, behave like decent people and you cant force me to call me what ever you want\n12. Polygamy? one wife is enough for me but if you want more I don't care\n13. Age of consent/statutory rape/pedophilia? age of consent is 18, statutory rape is rape, pedophilia should be the death penalty\n14. Masturbation? It's natural\n15. Paraphilia? I don't care if you want to have sex with your toaster just don't expect me to recognize it as a conscious being\n16. Beastiality? disgusting, amoral and a health hazard to humanity\n17. Other forms of sexual immorality? too vague\n\nI want to add that in general I don't believe in victimless crimes but an honest discussion on what defines victimless probably needs to be had.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KnownFeedback738",
            "body": "I wouldn’t mind going back to traditional American laws on these issues",
            "score": -7,
            "replies": [
                {
                    "author": "Come_along_quietly",
                    "body": "Can you clarify?  lLike how far back?  Would you want homosexuality illegal?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "LittleSnuggleNugget",
                            "body": "Do you watch lesbian porn?",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "KnownFeedback738",
                            "body": "In a way",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "Come_along_quietly",
                                    "body": "Do you mean homosexuality in particular, you would like to see be illegal?  If so, can I ask where you draw the line between things you dislike (to what ever degree) but **don’t** think should be illegal, and things you dislike and feel should be illegal and people should be punished for?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "KnownFeedback738",
                                            "body": "Yea id be comfortable with some level of restriction",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "wagonspraggs",
                                                    "body": "How do you feel about restriction in YOUR bedroom?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "KnownFeedback738",
                                                            "body": "If i were interested in having sex with animals, i would welcome restrictions on that to encourage me to control those disordered appetites",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "wagonspraggs",
                                                                    "body": "What about with humans? I want to specifically discuss human interactions.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "KnownFeedback738",
                                                                            "body": "I’m sure you do. I’ve answered these questions, though. If you can’t infer meaning from what I’ve already said, oh well. Its pretty obvious, though. But I’m not interested in violating Reddit T and C to spell it out for you any more.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bustin_Justin521",
                                                                                    "body": "Without getting too specific because I don’t want you to violate terms of service or risk a ban, do your opinions on traditional laws and values on this topic extend beyond just sexual orientation? Would you also be in favor of interracial marriage being made illegal? If not is the difference because an interracial couple can still procreate while a gay couple can’t do the same?",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bigmepis",
                                    "body": "Should the first amendment be repealed?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "KnownFeedback738",
                                            "body": "Not necessary",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "bigmepis",
                                                    "body": "How can homosexuality be illegal without repealing the first amendment?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "KnownFeedback738",
                                                            "body": "It was illegal for most of the country’s history",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "man-vs-spider",
                                    "body": "Why? How is it your business what two men or two women do together in the bedroom?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "KnownFeedback738",
                                            "body": "It’s called politics.",
                                            "score": -15,
                                            "replies": [
                                                {
                                                    "author": "rrtneedsppe",
                                                    "body": "What does it have to do with politics?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "KnownFeedback738",
                                                            "body": "Just as much as anything else",
                                                            "score": -5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Final_Reserve_5048",
                                    "body": "Why?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "KnownFeedback738",
                                            "body": "Establish a proper order",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Final_Reserve_5048",
                                                    "body": "What do you mean by that?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "KnownFeedback738",
                                                            "body": "For example, i don’t think people who have a proclivity for fucking animals should be encouraged or even allowed to do so.  Erecting barriers and disincentivizing activities helps ppl to control their baser urges and order themselves",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Final_Reserve_5048",
                                                                    "body": "We’re talking about homosexuality here. You said you believe it should be illegal. Why?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "KnownFeedback738",
                                                                            "body": "Do you understand and agree with what I’m saying about the animals? Yes or no?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Final_Reserve_5048",
                                                                                    "body": "Are you comparing homosexuality to beastiality?",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "KnownFeedback738",
                                                                                            "body": "Answer my question.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Final_Reserve_5048",
                                                                                                    "body": "That beastiality should be illegal? Yes, I agree.\n\nNow answer mine.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "KnownFeedback738",
                                                                                                            "body": "There you go. Yes, I’m comparing them because theyre analogous",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Final_Reserve_5048",
                                                                                                                    "body": "Why do you hold such hatred for people that are doing you no harm?",
                                                                                                                    "score": 6,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "KnownFeedback738",
                                                                                                                            "body": "I don’t hold hatred for any category of people. You’re implying that you hate people who have urges to fuck animals and i find that quite sad.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Final_Reserve_5048",
                                                                                                                                    "body": "How have you contrived that? \n\nYou are comparing homosexuality to beastiality. In what way are they comparable?",
                                                                                                                                    "score": 4,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "KnownFeedback738",
                                                                                                                                            "body": "I’m not interested in being insulted simply because you’re offended.  You can move on.",
                                                                                                                                            "score": -1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Final_Reserve_5048",
                                                                                                                                                    "body": "When did I insult you?",
                                                                                                                                                    "score": 5,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "LittleSnuggleNugget",
                                                                                                                    "body": "What do you think the role of consent is in regard to sexuality?",
                                                                                                                    "score": 3,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "KnownFeedback738",
                                                                                                                            "body": "Important but not that only moral consideration. I also don’t think animal consent is a real concept and the people replying here likely aren’t vegans so they don’t either",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "LittleSnuggleNugget",
                                                                                                                                    "body": "Have you ever experienced sexual abuse?",
                                                                                                                                    "score": 3,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "KnownFeedback738",
                                                                                                                                            "body": "Irrelevant",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "LittleSnuggleNugget",
                                                                                                                                                    "body": "As someone who has, I really don’t think it is. Are you going to answer the question?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "KnownFeedback738",
                                                                                                                                                            "body": "I don’t care that you’ve been sexually abused. I’m capable of abstract thought and understand that it’s irrelevant. Do you have a relevant question? This is a place for ideas, not bleating about personal misfortune.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Quiet_Entrance_6994",
            "body": "1. I hate it/it should be banned entirely with jail time given to people spreading it making it.\n\n2. I hate it/it should be banned and those participating should be given light consequences and pointed to a regular job.\n\n3. I hate it/I don't really think you could make it illegal so I'd support social consequences like shaming and accountability. \n\n4. I see it as sinful and wrong/I think it should be socially discouraged and addressed when it's found out. \n\n5. I believe this is about interracial marriage, I'm fine with that and think it should be allowed socially and legally. \n\n6. I don't like it and generally think it shouldn't exist, primarily because I don't think they're even safe for women to be using. The idea of contraception is something I think everyone should be against but we aren't there yet as a society to do that. \n\n7. I hate it and it should be illegal because it's murder. Which is already illegal but people like to pretend abortion isn't murder. Abortionists should go to jail, period. \n\n8. I hate it and it should be illegal if it's an adult and minor situation, I think following pedophilia laws would work. If it's  two adults, I'm in favor of social shaming. \n\n9. I don't support it and think it should be socially shamed. I don't think legal consequences would work. \n\n10 & 11. I don't like either and neither should exist in public life. I wouldn't jail people for it unless they involved children or vulnerable people. Outside of that, I'd just support social shaming. \n\n12. I don't like it and it should be illegal. I don't care if the adults are consenting, that's gross and the children will suffer. \n\n13. Age of consent should be raised to 20 in my opinion. As a 22 year old, the idea that as a high school senior I could go into sex work or be sleeping with some old man and it's supposed to be fine because \"she's 18, she's an adult\" is beyond insane. Statutory rape and pedophilia should both be treated with the death penalty unless the adult was duped by the minor, which does happen. \n\n14. Don't like it/ it's a private issue that individuals and/or families should address. \n\n15. Hate it/ it should be privately addressed by an individual or their family. As a society we should discourage it and punish it accordingly, depending on what it is. \n\n16. Beastiality should be completely illegal and punishable with jail time.",
            "score": -9,
            "replies": [
                {
                    "author": "Come_along_quietly",
                    "body": "I’m not going to pick any one of the items in particular, but do you feel that things you just don’t like should be illegal?  Where do you personally draw the line between “I don’t like that”, and “ people should go to jail and/or be punished for that”?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "No, I don't. \n\nIn my opinion, things like homosexuality would be better combatted by social expectation and influence rather than jail time. Putting a guy in jail won't make him not gay, that logic has never made sense to me. \n\nThings like pedophilia or beastiality and incest cause actual harm and can be violent, which is a level of depravity that deserves harsher punishment.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "bigmepis",
                                    "body": "Shaming people won’t make them not gay either, would you rather just shame them into suicide?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "Shaming their actions and shaming them isn't the same thing.",
                                            "score": -13,
                                            "replies": [
                                                {
                                                    "author": "BigDrewLittle",
                                                    "body": "Do you believe people choose their sexuality?",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "I think people can do that. Not everyone and not purely from them just wanting to, but yes, people can.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "bdlugz",
                                                    "body": "So if I shamed people who post on reddit looking for a husband, that's fair game, and you wouldn't feel at all attacked personally? Just asking, because I wouldn't want to shame YOU, just the action.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "That's fine. I'm aware that it can look desperate or pathetic to some people.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "bdlugz",
                                                                    "body": "I don't have an issue with it. You do you! I'm just trying to show that attacking an action can be made personal. I did that in a harsh way, and I actually didn't like doing it at all, it's unfortunately more impactful to understand how it can come across. Does that make sense in a way? \n\nPs. I don't think you're pathetic and I hope you find what you're looking for.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "It makes sense. I already have that issue personally going on with my sister because she has a girlfriend and I think it's serious with her. I understand that she'd take it personally if I told her I'm not going to her wedding (if they get married) because I don't want to support that. \n\nI also know that I have nothing personally against her. Her being gay isn't her identity as a human being. Maybe it is for her, but I think it's incorrect.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "bdlugz",
                                                                                    "body": "I think if you asked her, it's not how she identifies, but it's a part of her identity. There's so much nuance in life, a little grace can go a long way... in politics, family, and everything in between. I hope you find love for everyone in your life, especially your sister, and have a great night?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "I have love for everyone in my life. That love just isn't what some people would prefer and that's fine.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "gallifreyGirl315",
                                                    "body": "I'm not sure how these are not the same thing. How do you separate these two?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "Let's use pornography as an example. \n\nShaming pornography - pornography is evil, disgusting, and should be banned entirely. \n\nShaming porn watchers - you are an evil, disgusting, and awful person for consuming pornography.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "gallifreyGirl315",
                                                                    "body": "This isn't the thing I'm asking about. If we want to use the pornography example, I'm asking about what is the difference between shaming the person for their action of watching porn and shaming them as a person?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "The answer is in my example. Shaming the action is about the action. Shaming the person is about the person.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "gallifreyGirl315",
                                                                                    "body": "So, this comes back to the original comment then that someone else made, do you think shaming a person about being gay will make them no longer gay?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "I'm not advocating for shaming a person for being gay. That's what I said in my original comments, to that person, and to you.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "gallifreyGirl315",
                                                                                                    "body": "I swear I'm not trying to be intentional obtuse here, I'm just not sure I understand what you are advocating for then. If the thought here is that homosexuality and the like should be socially unacceptable rather than legally, what is the means of doing that?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                            "body": "I think you're still conflating the treatment of people with the treatment of actions. I'll try to explain with another example. \n\nMy older sister is gay, or at the least bisexual, I'm not entirely sure. She's on a trip with her girlfriend right now. I currently pray for her and influence her towards directing her to Christ and, should she take that on, she'll eventually stop participating in homosexual action because she'll have given her life to Christ. \n\nThat is what I'm advocating for.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "gallifreyGirl315",
                                                                                                                    "body": "And I guess my point, is that I cannot always separate the actions a person takes from them as a person. I am also bisexual, but I am marrying a man because that's who I happened to fall in love with. To you, I have perhaps stopped participating in homosexuality, but I am still bisexual, I will still have an attraction to women. \n\nSo, is not acting on the thing enough, even if it doesn't change who the person actually is? And what if not acting on this thing causes that person a huge amount of emotional stress and struggle, that they are so miserable they would rather be dead? Is that an acceptable byproduct of the lack of action?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                            "body": "The goal isn't to completely rid you of your attraction to women. It's to change your behavior AND your outlook on your behavior.\n\nThere are many gay men and lesbians who speak about them keeping themselves from acting in these ways and it's not an easy thing but they understand that God has something better for them and He'll take that pain away eventually.\n\nTHAT is where the heart change comes in. Without God being your cushion for holding yourself back from homosexual action that'll probably be a life of some kind of pain. I know that many gay men specifically talk about romantic loneliness and how that weighs on them. I feel for them in that struggle, but I wouldn't put that above God's plan.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "gallifreyGirl315",
                                                                                                                                    "body": "Thank you for your time and responses. This is where I will part ways because I understand where you are coming from, I still do not agree, mostly on account of not believing in God, but we aren't here to discuss where our moral compasses come from. I hope you have a good day? Because I have to have a question.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SincereDiscussion",
                                    "body": "(Not the OP)\n\nEven if you want to set aside basic Christian teaching on this, the individualistic rhetoric IMO kind of falls apart when you realize that certain lifestyles are actually extremely destructive and expensive. What if someone's preferred sex act is associated with all sorts of diseases and costs us billions and billions every year in medical expenses? It's not simply a matter of seeing something harmless and saying \"that's gross\". Lots of bad lifestyles effectively require not just tolerance, but active subsidy. (How many billions do we spend on AIDS, prep, etc.?).",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "lenojames",
                                            "body": "But in those situations, it is not the act that is the problem, but the disease itself. The same things you say could be said for drinking or smoking too.\n\nHomosexuality is not the issue, especially when you consider that heterosexual couples engage in many of the same sex acts. It could even be argued that the homosexual community is leading the way with information and prevention of STD spread.\n\nSo why would you want to condemn the person, or the act, based simply on the disease that is (historically) associated with it?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "SincereDiscussion",
                                                    "body": "> But in those situations, it is not the act that is the problem, but the disease itself. The same things you say could be said for drinking or smoking too.\n\nYes, that's quite literally my argument! I wasn't trying to bury the lede here...that is exactly the point that I was getting at. We have laws, we tax them, we have all sorts of regulations on advertising, etc. We certainly don't treat smoking cigarettes as something to be proud of or alcoholics as a marginalized community. There have been decades-long campaigns to get people to stop smoking and at the very least to stop binge drinking. \n\n> Homosexuality is not the issue, especially when you consider that heterosexual couples engage in many of the same sex acts. It could even be argued that the homosexual community is leading the way with information and prevention of STD spread.\n\nWe can agree on the fact that women have butts. Beyond that, I don't know what your point is. Your comment is written as if we don't have data on this. Rates matter!",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "Fignons_missing_8sec",
                                                            "body": "Bi guy here, do you think the have gay sex tax should be a flat annual rate, or should it be like a pay-per-time thing like tax on a pack of cigarettes?\n\nIf it’s annual can I have half off for only being half gay?",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "SincereDiscussion",
                                                                    "body": "Oh I don't support a tax (would basically rely on the honor system and that's obviously not going to work, especially with the demographic we're talking about here). I think ideally we could stop subsidizing the lifestyle and then, hopefully the Overton window moves and we can simply return to the policies we used to have.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BoppedKim",
                    "body": "Are you aware that condoms are considered contraceptives?\n\nDo you agree with the Democrats in Ohio that are pushing a joke bill that makes nutting without intent to conceive a felony?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Owbutter",
                            "body": ">Are you aware that condoms are considered contraceptives?\n\nAwful little things, they should be illegal until they make ones that are comfortable.\n\nEdit: Nobody has a sense of humor?",
                            "score": -4,
                            "replies": []
                        },
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "I'm aware and I'm fine with discouraging condoms.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "iilinga",
                                    "body": "Despite the cost to Americans in funding the healthcare associated with STIs and pregnancy?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "I'd also discourage people sleeping around.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "iilinga",
                                                    "body": "Is that realistic?\n\nCondoms can also protect people in committed relationships passing STIs between them. Or would you have them needlessly share disease as well?",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "In so much as they're being used for other health things I'm fine with them. Specifically for preventing pregnancy, no.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "iilinga",
                                                                    "body": "So you’d prefer abstinence?\n\nHow does this view get applied to those not of the same faith as you? The Bible teaches tolerance, even for sinners.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "Tolerance does not mean leaving people to do as they wish. \n\nI would prefer abstinence because that's what is good for people. There is no benefit to sleeping around and \"it feels good\" is not a valid justification for sleeping around.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "iilinga",
                                                                                    "body": "So instead of loving your neighbour and withholding judgement upon them, you seek to control and dominate them instead? Subjugate them to your wishes? Is that how Jesus wanted His Word spread?",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "You must not be aware of what loving your husband and judgement in the Bible. \n\nLoving someone would be bringing someone into the body of Christ, not leaving them alone. So far as judging, we can judge people and their actions, not their ultimate fates. That could be worded incorrectly so don't take that as 100% truth. \n\nWhen Jesus sat with sinners like tax collectors and prostitutes, he demonstrated to us that we aren't supposed to view those people as less than to the point that we can't even speak to them. The gospel is for everyone and we're the messengers for that. The issue is that Jesus told them to change. They aren't supposed to stay the same, the point is to get them to change.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "lenojames",
                                                    "body": "Should the government discourage people from sleeping around? Should it be the government's function to enforce personal morality?\n\nOr, in a free society, should personal moral choices be left to the person?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "I said it should be socially discouraged.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lock-crux-clop",
                    "body": "Is it your belief that any sexual pleasure should be either socially unacceptable or illegal if it is not with the intent to have a child?\n\nFurthermore, why would legal consequences for things such as homosexuality not work? Would you be in favor of them if it did work?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": ">Is it your belief that any sexual pleasure should be either socially unacceptable or illegal if it is not with the intent to have a child?\n\nIf it's not ordered how God wanted it to be then it's wrong. Which means it needs to be respectful and with the context of marriage, which means they would have children. \n\n>Furthermore, why would legal consequences for things such as homosexuality not work? Would you be in favor of them if it did work?\n\nI just don't understand how jailing a gay guy would make them stop being participating in gay sex or relationships. I think they'd socially change their behavior to appear a certain way, but that wouldn't produce a heart change that'd get rid of their homosexual behavior, which is what I'd prefer.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "iilinga",
                                    "body": "Do you have an explanation for why animals can engage in homosexual behaviour in the wild? Is that not how God has created them?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "Animals aren't people.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "iilinga",
                                                    "body": "This is true. Yet they are God’s creations. So it is perfect for them to engage in homosexual behaviours?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "God didn't give people the same rules as animals.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "iilinga",
                                                                    "body": "But he gave them the behaviours and desires. They are his creatures and their lives and behaviours and they are Good. So how can you justify criticising God’s creations?",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "Once again, they aren't humans, who are made in God's image.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "iilinga",
                                                                                    "body": "But God created them. And He called them Good. But now you are saying this behaviour is not Good? How can you justify criticising His Creation?",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "Once again, humans and animals are not the same. One was created in His image, one was given dominion over the earth, one was given the chance to enter heaven. \n\nYour logic doesn't follow because you're comparing apples to oranges.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "iilinga",
                                                                                                    "body": "Whether or not animals can enter heaven is a matter of debate. It is not certain. Why are you so certain against them entering? Were animals not present in Garden?\n\nI asked you if God’s creations are Good. Do you agree or not?",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                            "body": "Yes, they are. \n\nThe problem is that you're trying to say that because God said his creations are good, therefore everything they do is good, therefore humans can do it too and it should be fine because those actions are good.\n\nYou can't use that logic in reference to the Bible.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "lock-crux-clop",
                                    "body": "Where does God condemn transgender and transvestite people? Where does He condemn homosexuality? Where does he condemn sodomy (our modern day act of it, not the people of Sodom, which are different even with similar words)? \n\nWhy do you house that belief on the age of consent when it directly goes against what is found in scripture?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "If you're looking for specific modern day examples from the Bible I'll just say that you won't find them. As far as homosexuality, that's talked about multiple times, specifically in the New Testament. I know people nowadays like to pretend something else was written, but that's what it says. \n\n>Why do you house that belief on the age of consent when it directly goes against what is found in scripture?\n\nI was specifically thinking about homosexuality when I said that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "lock-crux-clop",
                                                    "body": "So do you only believe that the age of consent for homosexuality should be raised to 20? I’m a bit confused what you mean by specifically thinking of homosexuality.\n\nAlso, there may have been confusion. Where does he condemn all sexual pleasures that aren’t directly for procreation? I specifically said it that way so that you wouldn’t look at verses against Sodom and Sodomites, as those were a sinful people that we used as a basis for our modern day word of sodomy.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "No, I'm saying the age of consent for everyone should be raised to 20. \n\n>Where does he condemn all sexual pleasures that aren’t directly for procreation?\n\nHe condemns homosexuality multiple times in the New Testament. Other forms of sexual immorality like incest or beastiality are can be found or interpreted from the Bible, which is how we apply them to situations throughout times.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "lock-crux-clop",
                                                                    "body": "If your basis for all of this is biblical then why would you want to raise the age of consent to 20? Do you take issue with Mary being a young teen when she married Joseph and had Jesus?\n\nWhat about things like oral sex, which you also said should be socially shamed? Or contraception, what in the Bible condemns that?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "Again, that specific comment about God was said in reference to homosexuality and sex within marriage. You're applying that to things I wasn't talking about. \n\n>If your basis for all of this is biblical then why would you want to raise the age of consent to 20?\n\nI have my reasoning in my post. 18 being the age is weird to me. That has nothing to do with me being a Christian.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "lock-crux-clop",
                                                                                    "body": "Ah, okay I misunderstood. Would you support raising the age of other things, like voting or driving, as well as age of consent, or only age of consent?\n\nAlso, do you think we as a society should shame people that hoard wealth?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "Yes, we should raise the age of many things in society and flatline everything to 20. 20 is adulthood. \n\nNo.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "lock-crux-clop",
                                                                                                    "body": "What makes 20 adulthood in your eyes?\n\nWhy are you pro shaming homosexuality due to it being called a sin in the Bible, but not pro shaming wealth hoarding (also said to be sin in the Bible)?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                            "body": "20 just makes more sense to me. No really deep reasoning beyond that. \n\nIf someone has their own wealth I'm not personally concerned if they keep it to themselves. When they want to give it out they can. I think encouraging charity is good, but forcing it or shaming people I don't think helps.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "lock-crux-clop",
                                                                                                                    "body": "Why are you personally concerned with which gender people have sex with, or which gender they present as? Is there something beyond the biblical reason? If not, why does wealth hoarding not concern you when it’s also discussed in the Bible?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                            "body": "The biblical reasoning is more than enough in my case.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                    "body": "Why is the biblical reasoning more than enough when it comes to homosexuality, but not enough when it comes to hoarding wealth?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                            "body": "I'm not saying it isn't enough. I'm saying I personally don't care about it the same amount. I also don't really think they warrant the same type of deterrent condemnation.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                    "body": "Why do you care about homosexuality more? Does it somehow negatively impact your life? And is that negative impact more of a negative impact on your life than wealth hoarding?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                            "body": "It falls under sexual immorality, which I take more seriously than greed or perceived greed.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                    "body": "Is there a reason for it, or is it just easier for you to avoid what you believe to be sexual immorality than to avoid greed?\n\nIs there a reason you mentioned “perceived greed”? Doesn’t it go without saying that doing something wrong is worse than appearing to do wrong while doing right?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                            "body": "Sexual immorality is easier to spot. \n\nI used perceived greed because I would need to know why someone is keeping their money to themselves. I don't necessarily think rich people need to be giving away tons of their wealth to charity, for example. They could keep that for their kids or put it into assets that'll gain in value over time. It's when they're called upon to give money and they refuse to that I have an issue with.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                    "body": "Do you believe we should only pursue easy to find things to fix?\n\nIs it not greed to keep money for the express purpose of making more money? Is it not greed to keep more money than you could ever use in your lifetime, or your children’s lifetime? I’m not talking about someone who has a couple hundred thousand dollars that they’re saving for retirement/ kids/ unexpected costs. What non greed related reason is there to hoard hundreds of millions of dollars, or more?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                            "body": ">Do you believe we should only pursue easy to find things to fix?\n\nNo, at no point did I indicate that either.\n\n>Is it not greed to keep money for the express purpose of making more money?\n\nI never indicated this either. \n\n>Is it not greed to keep more money than you could ever use in your lifetime, or your children’s lifetime?\n\nNot necessarily. Again, unless you need to give that money away, you don't have to give it up. It's your money. If you want to use that for a vacation or finding personal projects, go do that.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                    "body": "If that’s not what you meant to imply why did you say “sexual immorality is easier to spot” as your justification why that should be socially shamed, while greed shouldn’t be shamed?\n\nIf you didn’t mean to imply that then why did you say it was okay to keep money to put into assets that’ll gain money over time?\n\nWouldn’t using the money directly not be hoarding it? I am specifically asking if you believe hoarding money (ie not using it ever) is greed and an issue. If so, why is that either 1) harder to spot than sexual immorality or 2) not as bad as sexual immorality?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                            "body": ">If that’s not what you meant to imply why did you say “sexual immorality is easier to spot” as your justification why that should be socially shamed, while greed shouldn’t be shamed?\n\nWhat you asked assumed something incorrect based on what I said. I said it's easier to spot and you took that to mean we should only focus on that. That's a wild assumption. \n\n>If you didn’t mean to imply that then why did you say it was okay to keep money to put into assets that’ll gain money over time?\n\nI said gain value, not money. \n\n>I am specifically asking if you believe hoarding money (ie not using it ever) is greed and an issue.\n\nSure, I'll say that's an issue. \n\n>issue. If so, why is that either 1) harder to spot than sexual immorality or 2) not as bad as sexual immorality?\n\n1) I don't know what people are doing with their money or how their finances work, especially richer people. 2) I personally don't see it as bad as sexual immorality. Both can be bad, they don't all have to be the same kind of bad.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                                    "body": "What value is it gaining if not monetary? \n\nHow hard is it to look at someone who has been steadily increasing their wealth by more than they put out into the economy, either via spending or donating it?\n\nWhy do you see sexual immorality as worse? I’ve asked this and you’ve only said it’s easier to spot, never why it’s worse. Does someone being gay somehow impact your life? Does the economy slowing down due to the hoarding of wealth somehow not impact your life?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                                            "body": ">How hard is it to look at someone who has been steadily increasing their wealth by more than they put out into the economy, either via spending or donating it?\n\nI'm not aware of how finances work, especially for rich people. When I actually understand how they work then I'll say something. \n\n>Why do you see sexual immorality as worse? I’ve asked this and you’ve only said it’s easier to spot, never why it’s worse.\n\nSexual immorality is often depraved. Beastiality, rape, incest, pornography, sexual assault, and homosexuality are all sexual immorality. These things, in varying degrees, indulge lust and that is wrong. Before you attempt to say this no, I am not saying that gay sex is the same as rape or beastiality. I'm saying they're both forms of sexual immorality. \n\nGiven those examples, I'm personally more concerned about sexual immorality as a category. When it comes to greed, I'm less upset about that because that's more of an individual issue as far as I'm concerned. If someone is hoarding money because of greed we should influence them to have a more open heart, but I'm not going to be as upset about that as I would with sexual immorality. \n\nAgain, caring less about one doesn't mean the other doesn't matter. If you think they're equally bad, great. I don't and I'm fine with that.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                                                    "body": "Would you please explain why you think sexual immorality is worse? You still haven’t given a straight answer, just deflections. What is worse about it?",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                                                            "body": "I literally just gave you an answer, what are you not understanding? Sexual immorality include horrible things like rape and incest and I am more concerned about that than someone keeping their money to themselves. \n\nWhat are you confused about? Do I need to explain how rape is worse than greed? Is that concept lost on you?",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                                                                    "body": "Is slavery not just as bad as rape? What is slavery used for if not greed and pride, whereas rape is born from lust and pride?",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                                                                            "body": "That has nothing to do with what I said.\n\nBefore you say it does, I have already made it clear why one matters more to me than the other. You can disagree with that but I am not saying one is fine and the other is all bad. I'm saying both are bad but I'm not going to react with the same intensity to both. \n\nIs that clear enough?",
                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                                                                                    "body": "When have you explained why? You’ve just said one does and keep avoiding explaining why. I just want to know why you think that LGBT people, people that use contraceptives, and people that have oral and/ or anal sex deserve to be shamed by society, but those that hoard wealth don’t. Have you mentioned a reason for that at all?",
                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                                                                                            "body": "I already gave you a reason concerning the sexual immorality and the money situation. You either can't understand my explanation or you don't want to accept it. Whichever it is, I already explained it to you. \n\nI need you to address that first. Do you understand my explanation for why I care more about sexual immorality over greed or not?",
                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                                                                                                    "body": "What explanation are you referring to? If you’re talking about how you brought up the most severe case of sexual immorality (rape) and used that as your basis, then no, that doesn’t make sense to me, as that has legitimately no bearing on homosexuality or oral sex. If you’re talking about something else then it was not clear",
                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                                                                                                            "body": "I'm going to say this one more time: homosexuality falls into the category of sexual immorality, which includes things like rape. I take that whole category more seriously than I do greed, though both are wrong and should be addressed. \n\nIn short: sexual immorality includes things I view worse than greed, therefore I see that whole category as worse than greed. Is that clear or no?",
                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                                                                                                                    "body": "That is clear. Why do you feel it’s necessary to eradicate all things in that category before looking into other categories, or is that not what you’re saying?",
                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                                                                                                                            "body": "I'm not saying everything in that category needs to be eradicated. That's not possible for it to all be eradicated. I just care more about combatting those things.",
                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                                    "author": "lock-crux-clop",
                                                                                                                                                                                                                                                                                                                    "body": "Why do you desire to have social shaming of homosexuality, contraceptives, and oral and anal sex if not to get rid of them?",
                                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                                                                                                                                                                                                                            "body": "I do want them to be gone, I'm not delusional enough to believe it'll entirely be gone.",
                                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "bdlugz",
                                                    "body": "So should rapists be allowed to marry their victims? Do you ever wear mixed fabrics? Do you eat shellfish? Do you cover your head and remain totally silent in church? If not, why do you pick and choose which parts of the bible are important?\n\n  \nLet's not even start on abortion in the bible... that'll blow your mind.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "Respectfully, trying to play a gotcha with the Bible isn't really going to work. Y'all have tried that multiple times and it never works out.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "bdlugz",
                                                                    "body": "Because of hypocrisy? Why do only some rules apply to society and you?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "not_falling_down",
                                    "body": ">If it's not ordered how God wanted it to be then it's wrong. Which means it needs to be respectful and with the context of marriage, which means they would have children.\n\nDoes this mean you think that that married couples should be having up to a dozen (or more) children over the course of their marriage, or should the married couple stop having sex at all once they have the one-to-three children that they can afford to support?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "They should have however many God would like them to have. \n\nNFP exists in case that needs to be done in a more systematic way, particularly if there are health issues or maybe outside planning. The only issue is that saying you don't want kids period in a marriage..",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "not_falling_down",
                                                    "body": ">They should have however many God would like them to have.\n\nOur country has a Constitutional prohibition government interfering in people's religion. \n\n>**Congress shall make no law respecting an establishment of religion**, or prohibiting the free exercise thereof\n\n1) Why do you think that it's reasonable for your religious beliefs to control the lives of people who are of a different faith than you? \n\n2) How does this mesh with the statement often heard from Trump supporters : *Don't have children you can't afford?* Who should be paying the costs for feeding, clothing and sheltering those children that you want to force couples to have?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "You keep referencing the government as if I'm saying the government should get involved. I'm not. Most of this is social expectation and upheld by social values, not government force.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Final_Reserve_5048",
                    "body": "Do you think the US should be governed by essentially a Christian fundamentalist teaching?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "I'm pretty sure I said multiple times that I'm more in favor of socially upheld views rather than jail, which would be government influence.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Final_Reserve_5048",
                                    "body": "So socially upheld views that align with Christian teaching? \n\nWhat do you think of the statement “religion is for the individual”?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "Coming to religion is a decision of the individual.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Final_Reserve_5048",
                                                    "body": "But socially upheld views would prejudice those who do not believe in your particular god. Do you think those people should be subjected to that?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "It wouldn't necessarily result in that. Prejudice isn't something Christians are told is okay to do.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Final_Reserve_5048",
                                                                    "body": "But it would happen almost by way of social exclusion no? Christians believe being gay is a sin for example. So if this becomes a socially upheld view of the common people, gay people would be socially excluded due to them being perceived to be living in sin. Do you agree?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "No, Christians are quite literally told we aren't supposed to do that by way of the famous story of Jesus sitting with sinners.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Final_Reserve_5048",
                                                                                    "body": "Do you accept that the most likely group to socially reject homosexual people are religious groups?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "Sure, that might be true.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}