{
    "title": "What's the deal with Trump supposedly banning Julian Moore's children's book 'The Frecklefaced Strawberry' from schools?",
    "author": "Fando1234",
    "subreddit": "AskTrumpSupporters",
    "rank": 95,
    "score": 84,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 184,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1irphdd/whats_the_deal_with_trump_supposedly_banning/",
    "id": "1irphdd",
    "selftext": "According to this article Trump's administration has banned Julian Moore's children's book 'freckleface strawberry' from DoD schools.\n\nAny idea why this is?\n\nOn my side I'm about as close to a free speech purist as you get these days, and I often have a lot of sympathy for trump supporters for this reason. Particularly as they are made to feel unwelcome in educational institutions.\n\nBut is this an example of 'free speech for me but not for thee' from Trumps camp. Or is their something more going on here that a puff piece from Variety isn't getting into?\n\nhttps://variety.com/2025/film/news/julianne-moore-donald-trump-bans-book-freckleface-strawberry-1236310153/\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Horror_Insect_4099",
            "body": "The book sounds cute, and completely inoffensive.  If my daughter was younger, she'd probably love it.  I expect any actual review to end up removing it from the flagged list.\n\nWhen I first read this, my initial take was \"why is the department of defense having any say into what goes on in schools?\"  I figured they only educate military aged males, and I doubt most of them are going to be reading books about preteen girls with freckles.\n\nLooking deeper, seems the DoD-run schools (for children of service members) are pretty impressive!",
            "score": 3,
            "replies": [
                {
                    "author": "Fando1234",
                    "body": ">I expect any actual review to end up removing it from the flagged list.\n\n\nI'd hope so. But the question remains, why such clearly inoffensive books even up for review?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Horror_Insect_4099",
                            "body": "No clue (I'm curious as well).\n\nI expect Julianne Moore will be raking in a lot of extra cash thanks to the free publicity.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fando1234",
                                    "body": "True, just as when liberals tried to 'cancel' things, it tended to just bring them more publicity. \n\nI think it might even be called the Barbara Streisand effect?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cool_Cartographer_39",
            "body": "https://san.com/cc/pentagon-run-schools-may-pull-books-including-one-by-actress-julianne-moore/\n\n\"The Pentagon agency said none of the books being reviewed have been officially removed so far.\"",
            "score": 8,
            "replies": [
                {
                    "author": "Fando1234",
                    "body": "Interesting, as bad as this sounds I suspected there was more context. Though, is it not still a bit concerning that such benign sounding books are even in this review?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Solid chance it just got swept up by association.  It seems to be benign at a glance which probably just got grabbed because some hostile activist group like those who demand Gender Queer: A Memoir, which has explicit fantasizing of a child having relations with an adult, or It's Perfectly Normal which suggest such is normal & good, recommended it & it was determined good to double check. I imagine those groups had it in their bucket as a way to equate accepting their evils with accepting benign physical details. I mean if I saw pedophiles recommending even The Hobbit & hadn't read it myself I'd double check before reading it to my kid. ",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "beyron",
            "body": "From your own original post you said \"ban these books in DoD\" schools. In other words, just DoD schools, not for the general public and therefore not an actual ban on citizens that would be unconstitutional.",
            "score": 1,
            "replies": [
                {
                    "author": "Fando1234",
                    "body": "Just quoting the articles. Tbh, I've heard trump supporters say they are being silenced/had first amendment breached just for being 'shadow banned' on twitter. Surely this is at least equivalent to that? From a free speech perspective.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "beyron",
                            "body": "Trump supporter or not, claiming your first amendment rights were violated because of a twitter shadow ban is foolish. I don't care what side you're on, I care about the constitution and truth.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fando1234",
                                    "body": "I think the distinction is around 'censorship'. I would argue both of these are valid cases of censorship. \n\nMy belief is censoring content should be used sparingly. Even in a school library. \n\nAnd something simply talking about 'diversity' as a general concept, shouldn't be any where near the list of books being reviewed. - caveat is that I haven't read Moore's book so perhaps it does have something more controversial in, but from what I've read it doesn't seem to.\n\nI would apply the same to trump supporters and conservative voices being muscled out of academic institutions, media orgs, social platforms. \n\nWould you not agree there needs to be a lot of care when it comes to censoring views that are not violent or even malicious? And after often topics of open debate.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "beyron",
                                            "body": "Of course there should be care when it comes to censoring but I don't believe first amendment rights extend to private websites. Bans regularly happen every single day even here on reddit, I wouldn't call it a first amendment violation. You did however mention a school library which is very different if it's funded by tax dollars then the first amendment would be relevant but not in a private website.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mrhymer",
            "body": "It's a red herring. Schools are going to ban things that do not fall under Trump's DEI order. It's not Trump - it's butt hurt leftists.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JoeCensored",
            "body": "As usual it's fake news.  DoDEA is conducting a review of many books available in DoDEA school libraries.   The intention is to remove books which focus on DEI and equity politics.   While the books are under review, they are temporarily unavailable to students.   \n\nIf they don't contain the prohibited content, they will be back available to students after the review is complete.\n\nVariety just lies to their readers, so is saying the book is banned.",
            "score": -35,
            "replies": [
                {
                    "author": "xaveria",
                    "body": "> If they don't contain the prohibited content, they will be back available to students after the review is complete.\n\nGenuinely ….. Genuinely … how is this different from censorship?  This isn’t banning books because of pornography.  This is banning books in public schools because they contain a disfavored political point of view.",
                    "score": 132,
                    "replies": [
                        {
                            "author": "ChallengeRationality",
                            "body": "Censorship would be banning the book from being sold.  Having a book published doesn’t come with it the right to have that book in every school library.  There are tens of thousands of books published every year that you will not find in school libraries.  This is about removing propaganda ",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "xaveria",
                                    "body": "Are you comfortable with the \\*federal\\* government deciding for families, as well as local and state schools what is and isn't propaganda?  Aren't we against that?\n\nWould you be comfortable with a Democratic administration doing this exact same thing to remove what they would call \"right wing propaganda\" from public schools? Let's say Biden issued and executive order to remove any book that mentioned Christianity, would you approve of that?",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "scoopdedupe",
                                    "body": "You really believe this children's book is propaganda?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ChallengeRationality",
                                            "body": "This may blow your mind but something as simple as a comic strip can be propaganda",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "scoopdedupe",
                                                    "body": "Yes, but have you actually looked into this book? How is this propaganda? I see propaganda left and right coming from the White House on the other hand.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sshlinux",
                            "body": "Do you support that some schools ban books such as Mein Kampf? Are you okay with that kind of censorship when it's political views different from your own? We had it in my school but many don't. The only books that should be banned from schools are sexually explicit books such as homosexuality, transgender, and pornography.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "xaveria",
                                    "body": "I'm one of those people who was conservative ten years ago, and still consider myself a conservative now.  To me, the GOP has ceased to be conservative.  I am all for local school boards and even state education departments banning (or allowing) Mein Kampf, and I am all for keeping libraries age-appropriate when it comes to sexuality.  I believe, just like I did ten years ago, that the federal government should not be making these decisions.  \n\nDo you not see any problem -- as a conservative -- with this being a federal (and not just federal -- specifically done by executive order!) mandate?  How does this make sense given the push to eliminate the Department of Education?  I thought that the whole point was to return control of what our children learn to us.  Why are these decisions not ok coming from a federal agency, but ok specifically from the Presidency?\n\nI'll ask you the same thing I'm asking everyone else -- and no one is answering.  If the Democrats win in 2028, and the new President mandates by executive order \"Because of the separation of Church and State and because children should not be exposed to religious ideas, I am ordering that all schools receiving any federal funding must remove all books that mention Christianity or religion in any form, or lose their funding?\n\nTo be clear, I would strenuously oppose a Democrat president ordering such a thing.  However, if Trump gets away with this, the Democrats will one day have that power.   Does that not worry you even a little bit?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "sshlinux",
                                            "body": "I don't see a problem if a school provides religious books, has them in the library, or has a class, aslong as it's not mandatory for a student to learn or read. The pledge students do every morning that mentions God isn't mandatory either. If a student wants to learn or read it they should be able to and that might be the only access where they can get it. Has nothing to do with separation of Church unless it's mandatory. Like I said I'm okay with all books besides the sexually explicit ones because they are minors. I haven't done research on what the book in OP is about so I can't give my opinion on it.\n\nWhen I was in school over a decade ago, many of the students, myself included, would bring their Bibles and groups would go outside to say a prayer around the flag pole every morning. No teacher pushed it we did it on our own that's just freedom of speech and their right. We even had students check out Mein Kampf from the library, no teacher pushed it on them.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "xaveria",
                                                    "body": "I used to do prayer around the flag pole as well.  I actually fought for the right to have a Bible study in a classroom at lunch, instead of outside.  I lost, but that's a long story.\n\nSo, since you appreciated your freedom as a student to practice your faith, and to have books about religion, can I take it that you WOULD oppose a Democrat president using an executive order to ban such things?\n\nHow can you support a Republican having this power to censor books that you don't agree with, without opening the door for a Democrat to have the power to censor books that THEY don't agree with?\n\nThe book in question, by the way, is about a little girl learning to not hate her freckles.  Nothing sexual or political about it at all, except that the author is a left-leaning celebrity.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "sshlinux",
                                                            "body": "We had Bible studies in classrooms at lunch or before school when it would rain when there wasn't a class going on. \n\nI would oppose the executive order because it would be unconstitutional on freedom of speech and religion.\n\nI haven't seen any Republicans ban books besides sexually explicit or DEI ones. I highly doubt the book is just a girl not hating her freckles. It's likely some DEI propaganda otherwise they wouldn't even care, DEI should be banned from libraries too in school. \n\nOff topic a little bit but one thing I never liked in school was how it was mandatory by the state in English class to read WW2 Zionist propaganda books that were fiction. Not saying those should be banned but shouldn't be mandatory. We were also forced to write letters to Holocaust remembrance organizations.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "xaveria",
                                                                    "body": "From [Common Sense Media](https://www.commonsensemedia.org/book-reviews/freckleface-strawberry#:~:text=FRECKLEFACE%20STRAWBERRY%20is%20the%20story,her%20a%20nickname%20she%20hates): \n\n\"FRECKLEFACE STRAWBERRY is the story of a feisty young girl who feels different from everyone else because of her red hair and freckles. Kids tease her, ask her embarrassing questions, and give her a nickname she hates. \"\n\nI feel like we're going in circles.  Let's ask it this way -- who should make the decision whether those WW2 books were mandatory or not?  The school board?  The state?  Or the federal government? \n\nIf the President has the right to say, \"These books may not be mandatory?\" won't they also have the right to say, \"These books MUST be mandatory?\"\n\nIf the Republicans have that power, the Democrats will have that power.  What sort of thing do you think that Democrats will do with that power, when they next enter office?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sshlinux",
                                                                            "body": "Republicans are saying its DEI so I believe there is some truth in that or they wouldn't care about a book with a girl with freckles. It's ridiculous to say otherwise.\n\nWW2 nonfiction books should be mandatory by the state of course as they already are. Real history. But not fiction ones falsely labeled as autobiographies that are propaganda and indoctrination shouldn't be mandatory. I and many others pointed out to teacher the books were fiction and shouldn't be taught as real history, she didn't like that too much. Both sides are to blame for mandating those books in their states. I live in Illinois btw but the red part of state.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "throwawayDan11",
                                                                                    "body": "To clarify you are sure this book is promoting something you disagree with but haven't actually checked? Isn't that exactly the kind of logic that leads to intense censorship? ",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Bustin_Justin521",
                                                                    "body": "Which part of DEI do you think is inappropriate to teach children? Do you think it’s bad for children to learn about diversity, equity or is inclusion the part that troubles you? I think hiring someone based on their race or gender and ignoring merit is wrong I imagine we agree on that. What I can’t understand though and I’m hoping you can explain is why is it bad to teach kids to tolerate and be accepting of others even if they’re different?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sshlinux",
                                                                            "body": "DEI is just discrimination specifically against White people. Discrimination shouldn't be taught to children.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bustin_Justin521",
                                                                                    "body": "Can you give me a single example of a book in school that this administration is attempting to remove that’s teaching children to discriminate against white people? I’ll even take an example of a lesson plan in a classroom that teaches children to discriminate against white people if you have any evidence to support your claim of what’s being taught.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "sshlinux",
                                                                                            "body": "All DEI books",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Bustin_Justin521",
                                                                                                    "body": "If there’s so many examples of this and it’s such a prevalent issue it should be pretty easy to find at least one example to give correct? I’m not trying to ask that question in a rude way but I’m genuinely trying to understand your perspective of how this can be such a big issue for you but you can’t even provide one example which insinuates that maybe the problem isn’t as big as you’ve been led to believe.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tim310rd",
                            "body": "Yes, just like 4th graders shouldn't have access to mein Kampf, they shouldn't have access to this either since it fosters a similar mindset/outlook on the world. \n\nKids have limited experience with reality, and a book that promotes a political view is likely to be taken by kids at face value as gospel, since they don't have the life experience to critically examine the claims supporting the view or the wider implications of a policy position. We should teach kids general moral principles and skills that will help them navigate the world, while straying away from political topics.",
                            "score": -40,
                            "replies": [
                                {
                                    "author": "Cazy243",
                                    "body": "Should the same be said for religious texts? Since all of your argument apply to those as well?",
                                    "score": 53,
                                    "replies": [
                                        {
                                            "author": "jeaok",
                                            "body": "In public schools yes",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "tim310rd",
                                            "body": "They should have some idea of what religious people believe but it should be divorced from the truth of anything.",
                                            "score": -9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "xaveria",
                                    "body": "So you’re going to be comfortable if the Democrats come to power and ban any book that mentions, say, Reagan or Trump or the America First movement?  \n\nAs a former Republican, I have to ask this — You are comfortable with the FEDERAL government making censorship decisions on party lines, overruling local and state rulings of what should and shouldn’t be in their school/?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "tim310rd",
                                            "body": "Yes, keep my politics out of the schools as well. I don't want a kid to be taught from an educator about how good a guy Trump is. \n\nI think we should keep, at a minimum, fringe political ideas out of the classroom, and ideally I'd want the federal government out of education, but Biden tied federal funding of schools to \"equity commitments\", so I see this as more trump reversing the policies of the prior administration.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "JustGoingOutforMilk",
                                            "body": "This is about the Federal government looking at schools that the Department of Defense runs.  I would say that, in this case, it's pretty essential that they are looking into things.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jealous-Ad-2345",
                                    "body": ">Yes, just like 4th graders shouldn't have access to mein Kampf, they shouldn't have access to this either since it fosters a similar mindset/outlook on the world.\n\nDo you have an example of this? A specific example, not just \"They teach that white men are are all evil,\" because I have yet to see a single children's book that teaches that.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "tim310rd",
                                            "body": "Coaching for Equity - Teaches that Thanksgiving reenforces white supremacy\n\n\"What is white Privilege\" - Kelisa Wing (I'll just quote this one) What you are experiencing at this moment is called privilege. \r\n…What are some things that make it easier for White students to attend and \r\nfinish college?\r\nImagine you're at the starting line of a race.\r\n..You look up and down the starting line, sizing up the competition, wondering if \r\nyou have enough speed to outrun them. Suddenly, an official steps into the \r\nmiddle of the track and tells the runners that obstacles will be placed in each \r\nperson's lane.\r\n\"Okay,\" you think, \"that's kind of exciting.\" A crew of people come out with the \r\nobstacles.\r\nAs you look around, you notice that the obstacles being placed in the other \r\nrunners' lanes look different than yours. You see high fences, large pools, mud, \r\nand barbed wire. In your lane, you see a row of hurdles that you've been taught \r\neasily to leap over. The other runners look confused. You are confused. How is it \r\npossible that your race will be so easy and their race will be so hard?\" \"This belief came from many places, \r\nincluding inaccurate descriptions of Africans and African culture from people who \r\nhad traveled to the continent. And it came from a desire by White people to build \r\nwealth by using the free labor that enslaved people provided.\r\n…The actions that the people who founded this country took and the laws that \r\nthey created deeply hurt people who were not White\" \"White privilege still exists today. It's easy to spot when you know some of the \r\ndisparities in this country. \r\n…These kinds of differences give White people more power and more White \r\nprivilege.\r\n…Even though laws in our nation aren't overtly discriminatory, life is still no fair \r\nfor BIPOC. Many laws are written with White privilege\" \"DON'T BE COLOR-BLIND: Telling yourself or other people that you \"don't see \r\ncolor\" isn't true and isn't fair. \r\n…When you see color, you see more of what makes that person who they are.\"\n\n\"How can I be an ally\" - Also by Kelisa Wing (will just direct quote this one as well)  \"For example, if White students can get a great education, justice means that Black students should assume they can get one too. When Black students don't have the same educational opportunities as White students, that is racial injustice. Another example involves criminal behavior. Someone who commits a crime should be punished. But it is unjust if, for the same crime, a White person is not punished while a Black person is. \"\n\"An ally can be someone who belongs to a group that is oppressing another group, but the ally stands with those who are being oppressed in order to get justice.\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Bubbly-University-94",
                                    "body": "So does that mean religious texts should be banned till the child has a broader view of life?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "tim310rd",
                                            "body": "In general yes. Not even in Catholic schools are young children expected or encouraged to read the Bible in it's entirety.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -55,
                            "replies": [
                                {
                                    "author": "KnightsRadiant95",
                                    "body": "DEI is degenerate? The first comment said it would remove books that foxus on DEI and Equity Politics\n\nWould a book about kids in wheelchairs being a part of a sports team (Inclusion) be considered \"degenerate media\"? \n\nAnd no that book isn't made-up \n\n>Everyone Needs Friends: Wheelchair Basketball \n\n>This book will help children to be more accepting towards children in wheelchairs. Children in wheelchairs know their capabilities and limits when participating in games and sports. It would be nice for able-bodied children to encourage children in wheelchairs to participate in the games or sports they are playing. They will enjoy being part of the group, and it will put smiles on their faces, as they will not feel that they are being pushed aside and cannot join in because of their wheelchairs. Please encourage your child to take the first step in asking someone in a wheelchair to join in a game or conversation. Every child likes to have fun and to be included.\n\nOr what about a children's book called Grace for President, where an african american girl is inspired to run for president because she notices there aren't any women president's? Is that degenerate since it could be classified as DEI politics?",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "memes_are_facts",
                                            "body": ">DEI is degenerate?\n\nYes. It literally degenerates (in the true sense of the word) everything it touches by focusing on anything but merit.\n\nDegenerate /dəˈjen(ə)rət/\n\n1. having lost the physical, mental, or moral qualities considered normal and desirable; showing evidence of decline.",
                                            "score": -20,
                                            "replies": []
                                        },
                                        {
                                            "author": "TopGrand9802",
                                            "body": "Are either of those banned? Or are hypotheticals your thing?\n\nI feel like DEI as we've come to know it is different than the inspiring story of someone in a wheelchair working to be part of a sports team.",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "opc100",
                                                    "body": "Could it be argued that this is DEI as YOU have come to know it, when lots of people clearly see DEI differently to you?",
                                                    "score": 16,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kuriyamikitty",
                            "body": "Censorship is what China allows to be said about a certain event in a Square in 1989. This is more akin to limiting access due to age, which is effectively able to be ignored by parents- they can buy the book if they want and let their kids read it.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "xaveria",
                                    "body": "That’s a very high bar for censorship.  The Republicans have been complaining about censorship and First Amendment violation for a while now, and we haven't reached CCP levels.\n\nTo be clear — a private company banning Trump’s social media feed (when he could easily get his views out in many other ways) IS censorship, but the FEDERAL government banning books along party lines, overruling state and local control, is NOT censorship?",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "metalbracelet",
                    "body": "Isn’t removing any books an act of federal censorship? Trump signed an EO that specifically said they would “end federal censorship”. \n\nSource: https://www.whitehouse.gov/presidential-actions/2025/01/restoring-freedom-of-speech-and-ending-federal-censorship/",
                    "score": 61,
                    "replies": [
                        {
                            "author": "JoeCensored",
                            "body": "Context matters.   Unless you're in favor of hardcore pornography in elementary school libraries, you're in favor of censorship in school libraries.   \n\nHis EO is in the context of controlling narratives on social and legacy media.   It wasn't to advocate that any legal content for adults should be presented to small children in school.",
                            "score": -42,
                            "replies": [
                                {
                                    "author": "metalbracelet",
                                    "body": "While social media is referenced in the preamble, Section 2(b) and (c) make no such indication that the EO is or should be limited to media companies. \n\nMoving to pornography is taking the argument to an absurd extreme. Let’s stay within context: these are books that are at the appropriate reading level, with no pornographic content. So is this censorship that (to quote the EO) “\\[infringes\\] on the constitutionally protected speech rights of American citizens across the United States in a manner that \\[advances\\] the Government’s preferred narrative about significant matters of public debate”?",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "space_wiener",
                                    "body": "So a character with freckles she doesn’t like is now considered hard core pornography? \n\nWhat exactly is wrong with this book? This sort of thing is exactly what we should be teaching children.",
                                    "score": 42,
                                    "replies": [
                                        {
                                            "author": "JoeCensored",
                                            "body": "Are you not following what I'm saying?   Read again.  That's not what I said, and I couldn't be more clear.",
                                            "score": -30,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fando1234",
                    "body": "Doesn't 'prohibited content' sound a touch Orwellian?\n\nDon't get me wrong, I imagine we'd agree that liberals in recent years have done their fair share of book banning and censorship. I'm not denying that.\n\nBut this sounds downright creepy. Especially as DEI is such a broad concept, you could use it to ban just about anything. That's a lot of trust to put in the hands of the government around how people raise their kids.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "(Not the OP)\n\nYou can't play the \"trust in government\" card when it's a government school in the first place! If you don't trust the government at all, I guess abolish the schools. The truly bizarre, big government position is to say \"the education bureaucracy is untouchable, we fund it and don't ask any questions, we make them completely democratically unaccountable\". I'm not saying that's your position, but I don't see why it wouldn't be if the idea of such decisions being a result of elections bothers you.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "memes_are_facts",
            "body": "Not purchasing, maintaining, distributing,  or teaching a book is I'm no way censorship. \n\nIf I am wrong the biden administration censored ben shapiro bu not buying his book and putting it in every classroom.",
            "score": -7,
            "replies": [
                {
                    "author": "garethmueller",
                    "body": "Why do many Trump actions are benchmarked with Biden's, when Biden was \"worst president ever\"?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "itsmediodio",
                            "body": "Because the mass majority of trump critics spent the last 4 years insisting that Biden was one of the greatest presidents of all time and continue to insist that his administration was perfectly fine.\n\nBy pointing out that Biden did something they accuse Trump of doing they're questioning why those critics have a problem with it now, as it seems inconsistent.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "robertgfthomas",
                                    "body": "I don't recall seeing any claims of Biden being one of the greatest presidents of all time. Can you provide a source for the mass majority believing such things? My initial Googling isn't turning up much.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Horror_Insect_4099",
                                            "body": "Not OP, but search for \"biden greatest of all time\" - I found plenty of articles making this and similar claims.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "robertgfthomas",
                                                    "body": "I saw a poll that he's the 14th-best and claims that he's \"one of the best\". Would you say that's different from being *the* best or *the* greatest? \n\nI should put a disclaimer like u/itsmediodio suggested for the benefit of non-native English speakers: while saying something is \"the best\" might sound very similar to saying something is \"one of the best,\" the former is definitive: it means the subject is better than every alternative. The latter is nonspecific, and means the subject is better than somewhere between 50% and 100% of the alternatives.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "itsmediodio",
                                            "body": "I apologize, I was using what is called hyperbole. I should have written a disclaimer explaining the concept for those who are unfamiliar with it like non-native english speakers.\n\nThe exact definition per Oxford Dictionary is:\n\"exaggerated statements or claims not meant to be taken literally.\"\n\nSo when I say \"the mass majority of trump critics spent the last 4 years insisting that Biden was one of the greatest presidents of all time and continue to insist that his administration was perfectly fine.\" I'm not literally saying that a poll was taken on each biden supporters opinion on him with all of them saying he's the greatest president of all time, that would be silly.\n\nI'm just pointing out the fact that democrats continued to support  Biden for 4 years and have argued away his many faults and errors, at least until it became impossible to do so any longer and they tossed him aside. \n\nHere's a youtube video explaining the concept. You can even sing along to it if you'd like, that way you can learn about the term while having fun all at the same time!\n\nhttps://www.youtube.com/watch?v=kuzWLDWm6Zs",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "itsmediodio",
                                                            "body": "1. Hyperbole isn't a joke.\n\n2. Don't question the sincerity of other users. Only ask inquisitive questions from a neutral POV. If you replied to someone who wasn't a moderator you'd be banned for this comment.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fando1234",
                    "body": "I would argue that the left censored a lot of conservative ideas by not purchasing, maintaining, distributing or teaching them.\n\nWould you not agree that teaching children a broad spectrum of ideas is the foundation of a healthy democracy?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "sshlinux",
            "body": "I'm not aware of what the book is so I can't say. The only books that should be banned from schools are sexually explicit books such as homosexuality, transgender, and pornography. Leftists are fine with censorship when it comes to far-right political books such as Mein Kampf, a book we had in my school but banned in many.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Scynexity",
            "body": ">According to this article\n\nWell there's your first mistake. There is no such thing as a book ban. Nowhere in the United States have any books been banned. Some books have stopped receiving taxpayer funding. This isn't even one of those - it's just been automatically flagged for review because of its keyword associations. No one has banned it. No one is removing it. The news is lying to you.",
            "score": -42,
            "replies": [
                {
                    "author": "j_la",
                    "body": "What keywords? And why would those be flagged?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "It seems likely it was classified as supporting diversity and empowering women. Those areas with DEI overlap.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "metalbracelet",
                                    "body": "What is wrong with books \"empowering women\"? Would there be similar DEI concerns with books \"empowering men\"?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Scynexity",
                                            "body": "Nothing inherently. That's why they're reviewed.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "j_la",
                                    "body": "I thought the issue with DEI was things like how it impacts hiring practices, but now it just means “supporting diversity”? What does that mean? This is an apparently book about how a white kid should be comfortable in their own skin…is that a message about diversity? Is it the Trump administration’s position that young women shouldn’t feel empowered to be comfortable in their own skin?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Scynexity",
                                            "body": "No. You'll notice that I didn't say any of the things you seem to be referencing in this comment.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "j_la",
                                                    "body": "How is a book about a white girl “supporting diversity”? Or is it more that telling young girls to be comfortable in their skin is empowering?\n\nWhy do those kinds of things need to be flagged?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Scynexity",
                                                            "body": "The book is about someone's different immutable physical characteristics. That is the core of DEI.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "j_la",
                                                                    "body": "Different from what? Isn’t everyone immutable characteristics different from something?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Jealous-Ad-2345",
                                                                    "body": "So, if a kid gets made fun of or ostracized for their \"immutable physical characteristics,\" they be told that it's all in their head and not really happening, so as not to make the people making fun of them or ostracizing them feel badly about themselves?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Scynexity",
                                                                            "body": "I don't think that immutable physical characteristics should ever be the basis for judgement. That's why I oppose DEI. If a kid is getting bullied, I'd advise them to fight back.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Jealous-Ad-2345",
                                                                                    "body": "But what if that made the people who were bullying her feel guilty or bad about themselves? What if the school told them that they couldn't bully her anymore or they would face detention and they felt like their freedom of speech was being violated? \n\nBecause that, actually, is what opposition to DEI is. Wanting to pretend that racism, sexism etc. do not exist so that those who benefit from them and engage in them can feel more comfortable, and continue treating other people poorly without worrying that there will be consequences or that someone will make them feel badly about it.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Scynexity",
                                                                                            "body": ">  if that made the people who were bullying her feel guilty or bad about themselves? \n\nI hope it does. Kids are too coddled. \n\n>What if the school told them that they couldn't bully her anymore or they would face detention and they felt like their freedom of speech was being violated?\n\nThat's grossly ineffective and probably makes the problem worse.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Huge___Milkers",
                    "body": "There have been tens of thousands of banned from public schools. That is literally books being banned.\n\nI’m not sure why you’re trying to be pedantic? What would you call certain books not being allowed in public schools?",
                    "score": 53,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "When government agencies like public schools stop buying certain books, I call that certain books not receiving taxpayer funding. \n\nCalling it a ban is a disingenuous attempt to rhetorically evoke everyone's dislike of actual book bans, which is when private citizens are not allowed to own to read something.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "Jaijoles",
                                    "body": "If a book is already purchased and on a shelf, does keeping it on the shelf require more funding? If not, is pulling it off the shelf banning the book?",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "RomeluAlmighty",
                                            "body": "A good example of why you shouldnt ask TS two questions at once. They'll just cherry pick the question they think they can answer or deflect and not face the more difficult question..\nWould you agree?",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Scynexity",
                                            "body": "> does keeping it on the shelf require more funding?\n\nYes, it trades off with other use of that space.",
                                            "score": -36,
                                            "replies": [
                                                {
                                                    "author": "colcatsup",
                                                    "body": "How does that require more funding?",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "Scynexity",
                                                            "body": "The same way any book in a library requires funding. I genuinely don't think this is a serious point of contention. Libraries do not run themselves. Someone stocks the shelves. Checks out the books. Enforces the return of materials. Pays the electricity bill.",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dependent_Nature_953",
                            "body": "They ban pornographic material in schools too. That's fine or should kids just be exposed to EVERYTHING because you know freedom...\n\nBeing realistic the targeted \"books\" are the ones that go into graphic detail verging on pornographic in action and in drawings. Yes that is not acceptable since it isn't acceptable with male female relationship books either in schools 😒 but now that they put same standard on the same sex gender books it's uproar? Please 🙄",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "knobber_jobbler",
                                    "body": "Have you read the bible? That old testament has some pretty degenerate stuff going on. The whole slave owning guide in Exodus is wild. The father sleeping with his daughters is, well, a bit nasty and even the new testament has some good ones, like where a woman's place actually is: the home, making babies and cooking. I assume you're against this sort of degenerate media?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Dependent_Nature_953",
                                            "body": "The language is not a play by play of sexual content instructions. Big difference, hence why there is so much controversy in interpretation of the Bible's contents. \n\nHave you seen the portions in said inappropriate novels. Next ill slip my hands down his pants....ok there or put it in my mouth....how about not?\n\nLike I mentioned in another comment I also don't approve of having cheesy steamy novels (in schools) that have the shirtless man and damsel in distress on the covers because they are also graphic in describing sex acts. \n\nWhy is it a problem to just put it in a general library not inside a school one.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "knobber_jobbler",
                                                    "body": "But it is playing by play. Go and read the bible. It's an instruction manual and every time someone quotes anything in the old testament as worth living by it then opens the rest of that for the same thing. Exodus literally has guidance on keeping and beating slaves. I guess you're totally cool with these being in schools?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "fistingtrees",
                                    "body": "Texas has banned Slaughterhouse Five from libraries in public high schools. There is nothing remotely pornographic in that book. I read it after checking it out from the school library when I went to a public high school. So, why was it banned?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Dependent_Nature_953",
                                            "body": "Can't say as I haven't read that specific book. I have perused the ones highlight as inappropriate and even if everything was altered to make it male with female etc it would still be not ok. It's like putting the cheesy romance novels with the shirtless Fabio and damsel in distress cover books in a school. That'd be not ok as well.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "fistingtrees",
                                                    "body": "Sure, but in the process of trying to “protect” kids from cheesy romance novels, lots of important works are getting censored. Brave New World is, ironically, banned in some Texas schools. I had to read that in English class growing up, and I thought it was great and provided a chilling vision of what society could become. The Three Musketeers is banned and so is The Man in the Iron Mask. These are all classic works, that are completely appropriate for high schoolers. Do you think there is some ulterior motive, aside from “protecting kids”? Historically, hasn’t “won’t somebody think of the children” been a thin veil for restricting freedoms indiscriminately?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Dependent_Nature_953",
                                                            "body": "The books that have been \"banned\" were removed and will be evaluated and returned after if deemed harmless.  And tbh it's not really a ban since you can still get it on the internet...\n\nSurely think of the children has been used in many a situation including school shootings. We should ban all guns according to that logic. Truth is that I've mentioned it isnt the guns that should be banned it should be indication that we need to find reason kids see a gun as a solution to a problem (mainly bullying). My theory is it's pov shooting games allowing kids to see gun as solution to problem and bullying getting ignored by administration in schools. Why i say that? Because guns were always common in rural areas before these games were available but kids didn't tote them to school.\n\nBan guns and kids will start toting knives (and have been but it's limited nature of danger vs gun obviously) which means problem solved right if it doesn't make the news 😉 nope",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "KnightsRadiant95",
                                    "body": "> Yes that is not acceptable since it isn't acceptable with male female relationship books either in schools 😒\n\nWhen I was in school there was a book with a plot point where the main boy character is dating a girl and he has to manage work at the same time. How is that not acceptable?\n\nMy elementary school had Goosebumps books, in How I Learned to Fly, a boy thinks a girl is pretty and him and another boy are competing with eachother for her attention. How is that not acceptable? \n\n>but now that they put same standard on the same sex gender books it's uproar?\n\nWith those two books I mentioned if they were about same sex characters, would that be okay? Also why word it as \"same sex gender\" instead of either \"same sex\" or \"same gender\"?",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EverySingleMinute",
            "body": "So it sounds like another leftist lied?",
            "score": -2,
            "replies": []
        },
        {
            "author": "itsmediodio",
            "body": ">But is this an example of 'free speech for me but not for thee' from Trumps camp.\n\nNobody has a right to have their book be read by other peoples children in tax payer funded schools.",
            "score": -5,
            "replies": [
                {
                    "author": "Fando1234",
                    "body": "How could that work? All books are 'someone's' book. Are you arguing kids in America shouldn't be taught about American history? Kids need a well rounded education surely.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "itsmediodio",
                            "body": "Saying that nobody has a right to have their book be read by other peoples children in tax payers funded schools does not mean that nobody can have their books in childrens schools. It's a privilege, not a right. Has zero to do with freedom of speech. Freedom of speech doesn't mean that you get to force children to be your audience on the governments dime. Taxpayers through their government can ALLOW you the privilege of having your book in schools, and they can also take that privilege away. Nothing to do with rights or freedom of speech. \n\nThat's about as straightforward as I can explain it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "metalbracelet",
                                    "body": "But isn’t there a difference between “you are required to purchase and read my specific book” and “we are disallowing this specific book from even existing on a shelf for people to voluntarily select because of its content”?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "Nobody has a right for their book to \"exist\" in a spot on a shelf in a publicly funded children's school and tax payer can absolutely allow or disallow whatever books they want their children to read or not read through their elected representatives and the bodies appointed by those representatives.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "metalbracelet",
                                                    "body": "Then are you not arguing in favor of government-sanctioned content-based censorship? I honestly do not see the difference. There was no specific referendum voted on by the people to say we don’t want tax money paying for this content, nor was there even a vote in Congress. The removal of “DEI content” was done by executive order.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "itsmediodio",
                                                            "body": ">Then are you not arguing in favor of government-sanctioned content-based censorship?\n\nIf you want to phrase it like that then everyone does, unless you believe that literally every person who writes a book has a right to have that book in children's schools regardless of content or quality. I don't share that opinion.\n\nThere wasn't a referendum to put these books in schools in the first place, so none is needed to remove them.\n\nThey were placed there by bureaucrats who answer to authorities that answer to the tax payer, and now the tax payer have elected new authorities who have removed them.\n\nNobodies rights were violated.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "metalbracelet",
                                                                    "body": "I suppose I could see your point if it wasn’t clear that the content restrictions are based on the politics of “I don’t like this” and not on any level of inappropriateness for children or complete factual inaccuracy. I don’t like it when any political party restricts access to information based on “I don’t like this” and identity politics and I felt that would be a common ground?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SincereDiscussion",
                    "body": "Well said. It's simply not a free speech issue. The alternative principle here is just...the education bureaucracy must be completely unaccountable? Absurd. \n\nThe liberal attacks would also hit harder if so many of them didn't constantly advocate for hate speech laws and point to countries (e.g. Germany) with actual banned books as models for us to follow.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BarracudaDefiant4702",
            "body": "Typical media can't get the story right.  It's being reviewed, in which case even if it was banned it would only be by schools run by the U.S. department of Defense, and not banned by other schools or libraries, etc... \n\nMy guess is someone said it might contain DEI propaganda, but assuming it doesn't, it will not be banned, and worse case it would only be banned at DOD schools, something like 161 across the world.\n\nI'm very free speech, but certain books should not be in public (or dod) schools.  Parents should certainly be able to get whatever book they feel is age appropriate and share with their child, but that doesn't mean all books should be in school library, especially before high school.",
            "score": -13,
            "replies": [
                {
                    "author": "j_la",
                    "body": "What is DEI propaganda? What does it look like?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "BarracudaDefiant4702",
                            "body": "In summary, it's hiding racism, sexism, etc... by changing the target class.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "j_la",
                                    "body": "A book about a girl with freckles is hiding racism, sexism etc.?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "XelaNiba",
                    "body": "A child learning to love her freckles is DEI propaganda? ",
                    "score": 9,
                    "replies": [
                        {
                            "author": "BarracudaDefiant4702",
                            "body": "I never claimed it was, only that I am guessing someone decided to review the book in case it was.  Don't blame the messenger.  Why do I both even tying to answering any questions in this group when I get so many down votes.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -11,
            "replies": [
                {
                    "author": "bloodjunkiorgy",
                    "body": "Could you give an example of what a \"liberal agenda\" might look like in a children's book?",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Fando1234",
                    "body": "A heuristic I like to employ around free speech is that whatever powers of censorship you support, would you be comfortable with the opposing party using those same powers?\n\nIronically, this is what I've been saying to liberals for years and here we are...\n\nBut id ask the same question to you. If having a 'liberal agenda' is sufficient for children to not be taught a text. In a few years when the Dems are back, should they have the power to ban anything they deem as having a 'conservative agenda'?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "AskTrumpSupporters-ModTeam",
                                    "body": "your comment has been removed for violating rule 3. Undecided and Nonsupporter comments must be clarifying in nature with an intent to explore the stated view of Trump Supporters.\n\nPlease take a moment to review the [detailed rules description](https://www.reddit.com/r/AskTrumpSupporters/about/rules/) and [message the mods](http://www.reddit.com/message/compose/?to=r/AskTrumpSupporters&subject=Comment+Removal) with any questions you may have.\n\nThis prewritten note was sent manually by one of the moderators.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SincereDiscussion",
                            "body": "(Not the OP)\n\nYes, because there is literally no downside to that as education is controlled by the left through personnel already. Making it formal would actually make the issue *better* for us, because in contexts like this, we'd be able to say \"we make curriculum decisions and choices about what to include in libraries and so do you\". As opposed to a more complicated argument about how personnel is policy, the education system should in fact be accountable to voters, etc. while allowing you guys to tactically pose as free speech warriors.\n\nThere is an asymmetry here though: liberals don't have to pass laws because they make up the personnel in the first place. Therefore, they get to look all magnanimous by criticizing things like this, while at the same time knowing that if *they* want to exclude a book, they can just...not buy it, not put it on the shelf, not make it part of the curriculum, etc. Whereas the right, due to not having the personnel advantage, can *only* exert control politically.\n\nThe fear of the other side doesn't do anything in that context, because the worst case scenario is just...how things were prior to us doing anything. Things like this have *zero* downside. Risk: things are exactly as bad as they are now. Reward: they are better. It's an easy choice!",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Glad-Ad-4390",
                                    "body": "What? I don’t understand what you are saying by Dems controlling the personnel. I can tell you that in my state the school’s employees are mostly trump supporters. Out sounds as if you are making sweeping statements that are not accurate. If I’ve mistaken your intent I apologize.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "Okay, I guess we'll see then. Ultimately, even if I'm wrong, the worst case scenario is...curriculum represents voters' preferences? That's fine with me.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "metalbracelet",
                    "body": "The EO says that the Federal government should not engage in censorship that “\\[infringes\\] on the constitutionally protected speech rights of American citizens across the United States in a manner that \\[advances\\] the Government’s preferred narrative about significant matters of public debate”. Is this not removal based on the government's preferred view, as you said, against the liberal agenda?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "How many schools are operated by the DOD? Beyond that I don't know and I don't care.",
            "score": -11,
            "replies": [
                {
                    "author": "BarracudaDefiant4702",
                    "body": "Google says 161 worldwide.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}