{
    "title": "What are your thoughts on the DOJ dropping charges against Mayor Eric Adams?",
    "author": "OGstupiddude",
    "subreddit": "AskTrumpSupporters",
    "rank": 92,
    "score": 78,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 107,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1irxr7b/what_are_your_thoughts_on_the_doj_dropping/",
    "id": "1irxr7b",
    "selftext": "Here's a few timelines of the whole saga in case you aren't familiar:\n\n[https://www.fox5ny.com/news/whats-next-mayor-eric-adams](https://www.fox5ny.com/news/whats-next-mayor-eric-adams)\n\n[https://abcnews.go.com/Politics/eric-adams-federal-bribery-case-timeline/story?id=118824842](https://abcnews.go.com/Politics/eric-adams-federal-bribery-case-timeline/story?id=118824842)\n\n[https://www.usatoday.com/story/news/nation/2025/02/11/eric-adams-nyc-mayor-corruption-charges-timeline/78415508007/](https://www.usatoday.com/story/news/nation/2025/02/11/eric-adams-nyc-mayor-corruption-charges-timeline/78415508007/)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amishmercenary",
            "body": "I think the prosecutors should just publicize the evidence against Adams and see if it gets picked up by NYS, no? Maybe I'm not that well versed on why the state itself couldn't pick up charges?",
            "score": 2,
            "replies": [
                {
                    "author": "Twitchy_throttle",
                    "body": "Why do you think that the state should do it? Would you support a state prosecution going forward with charges, trial and (hypothetically) conviction if guilty?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": "Sure I’d be cool with that.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Twitchy_throttle",
                                    "body": "Why do you think it’s a state thing and not federal?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": "I’m pretty sure all the crimes he was accused of would probably apply on the state level- and no clue- maybe they didn’t want to prosecute? Or maybe evidence was not taken correctly? No clue",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Twitchy_throttle",
                                                    "body": "So what’s wrong with a federal prosecution?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Amishmercenary",
                                                            "body": "No clue I’m not opposed",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cchris_39",
            "body": "He’s cooperating with immigration enforcement.  It’s not the first time a perp made a deal to cooperate and avoid prosecution.\n\n\nThe great Alvin Bragg can always take it up, where is he?",
            "score": -1,
            "replies": [
                {
                    "author": "OGstupiddude",
                    "body": "Deals to avoid prosecution usually involve working with law enforcement to help charge more criminals you’re implicated with, not to help the state with their policy agenda. Do you think that this is how the DOJ should work? Corruption is okay as long as you’re doing our bidding? Surely if Biden did something similar you’d say this is corrupt? You might even already have examples of Dems or Biden doing it. If that’s the case, why should Trump and his DOJ be allowed to do this?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "There is nothing corrupt about it.\n\nIf anything it’s generous.  They could just as easily add charges if he tried to interfere with immigration enforcement.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "OGstupiddude",
                                    "body": "So if the governor of a conservative state were to get charged with corruption, and Biden were to hold these charges over his head in order to get him and his state to comply with gun legislation that Biden passed or something, you would say that this an appropriate use of the DOJ?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zealousideal_Air3931",
                    "body": "Is it at all concerning to you that Trump-appointed judges have resigned over this DOJ directive?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "No.  But I respect the fact that if they can’t support their boss they quit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "observantpariah",
            "body": "The Biden administration decided to retaliate against him because he spoke out about his migrant problem and vocally requested federal funding ... Which wasnt the image they wanted portrayed.\n\nWhen Trump took over, he stopped the charges... Notably without prejudice and also forcing him to give up future immunities..... Putting him even more \"at risk\" if he doesn't \"play ball\" until after it comes back under review.\n\nSo in other words..... Both administrations abused/are abusing him.",
            "score": -31,
            "replies": [
                {
                    "author": "Specific-Wolverine75",
                    "body": "If the Biden administration decided to retaliate against him why did the prosecutor appointed by Trump 3 weeks ago that is part of the federalist society and clerk d for Scalia, Danielle Sassoon, decided to resign instead of dropping the charges because Major Adams was guilty beyond a reasonable doubt or why did 7 prosecutors resign due to this? Some being republicans, more resignations than watergate, does that make you think it was retaliation from Biden?",
                    "score": 42,
                    "replies": [
                        {
                            "author": "observantpariah",
                            "body": "I don't see the connection.  Someone can still be guilty and also only be targeted as retaliation.",
                            "score": -31,
                            "replies": [
                                {
                                    "author": "Specific-Wolverine75",
                                    "body": "The investigations started in 2018 and as a New Yorker, I can tell you that guy is corrupt. However if the evidence is so strong for all of those prosecutors do you think that might warrant it wasn’t political prosecution? The letter Danielle Sassooon wrote is quite amazing and even details why they shouldnt drop the case, do you think a lawyer with such a bright future ahead of her, appointed 3 weeks ago would have resigned if she thought there was a case that the major was being politically prosecuted?",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "author": "basedbutnotcool",
                                            "body": "I’m a different user but I have this theory about political persecutions and lawfare, which is that they’ll start an investigation into someone, but the results won’t come out until that person has either gone against the uniparty or stopped being useful. \n\nThis seems plausible by the fact that the investigations started 7 years ago and are only coming out now",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Specific-Wolverine75",
                                    "body": "And just so you know this guy was so corrupt that he was friends with a big hotel developer and he would basically house homeless, prisoners or illegals in his hotels for the original prices, while the guy then fired all staff and basically had no hotel expenses but was getting a marked up rate. He would then remodel the hotel and  move the people staying there to another hotel from this same developer, it was like so obvious that I genuinely did not understand how he wasnt charged before, does that help clarify the picture of who he is?",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "bigspecial",
                                    "body": "Is it fair to say that when people put themselves more into the spotlight of public life that they naturally invite more scrutiny? That scrutiny could come from internet sleuths, doj,  journalists, etc.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "imperialistpigdog",
                    "body": "Lets suppose Adams is simply a corrupt mayor who had a bunch of charges against him due to his corruption in various forms (mostly accepting bribes and performing bribery).\n\nWhat do you think would be different from your own perspective as an outside observer, in this scenario?",
                    "score": 31,
                    "replies": [
                        {
                            "author": "observantpariah",
                            "body": "I have no idea what you are asking.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "imperialistpigdog",
                                    "body": "Use your imagination. What would you or I, as observers and not active participants in this, see differently, if Adams is just a corrupt SOB?\n\nDo you think only innocent people think to trade fealty to Trump for pardons?",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gsmumbo",
                    "body": "I think this is what I have a hard time understanding. Regardless of who’s using who (as you mentioned, both administrations used him), is he actually corrupt or not? Has he committed crimes or not? And if he has, what does any of the administration stuff matter?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "sielingfan",
            "body": "These timelines leave out [when Adams clashed with the Democrat federal government in September 2023](https://www.nytimes.com/2023/09/07/nyregion/adams-migrants-destroy-nyc.html?smid=nytcore-android-share), which seemingly prompted an immediate exploratory investigation less than a month later. \n\nI don't have any special insights, but NYC prosecutions on behalf of the Biden administration are going to be viewed with a *lot* of circumspection around here.",
            "score": -29,
            "replies": [
                {
                    "author": "OGstupiddude",
                    "body": "Are you implying that the charges against Adams are phony? What are your thoughts on Deputy Attorney General Bove not commenting on the strength of the evidence against Adams, but rather his ability to address the migrant issue in NYC? Sounds like there weren't any problems with the charges themselves, otherwise this would have been established and proven by now, no?",
                    "score": 28,
                    "replies": [
                        {
                            "author": "sielingfan",
                            "body": "I'm only adding context. Perhaps it's a complete coincidence,  but the investigation began immediately and spontaneously after Adams said something Biden didn't like. As I said, I have no insight on the validity of the charges.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "OGstupiddude",
                                    "body": "Well, to be clear, a probe into Adams' campaign donation/gift activity had already begun back in 2018. But regardless, you really have no opinion on whether or not the charges or valid? What are you thoughts on Bove not mentioning the strength of the evidence for the charges? Does that make you lean in any direction in regards to the validity of the charges?",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "sielingfan",
                                            "body": "I have no reason to doubt it's all true. Seems like Trump offered him a deal in exchange for cooperation, which is a regular outcome of investigations (on TV, which are the only investigations I'm ever privy to). His cooperation,  in this instance, is enforcing immigration law. The arrangement makes sense for the Trump camp, and Adams is DOA in the next primary, so there's an easy off ramp.\n\n>Well, to be clear, a probe into Adams' campaign donation/gift activity had already begun back in 2018.\n\nWell that's different, isn't it",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "OGstupiddude",
                                                    "body": "\\>Seems like Trump offered him a deal in exchange for cooperation, which is a regular outcome of investigations (on TV, which are the only investigations I'm ever privy to). His cooperation, in this instance, is enforcing immigration law. \n\nWell, I'm glad you said it. It's kind of exactly what you were alluding to Biden potentially doing, except the inverse. You don't think it's at all wrong for the DOJ to drop corruption charges on local lawmakers so long as they push the administration's agenda? Doesn't this sort of greenlight corruption as long as you're a team player for MAGA/Trump? This just seems to me like an incredibly inappropriate way to run your justice department.",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "sielingfan",
                                                            "body": ">Doesn't this sort of greenlight corruption as long as you're a team player for MAGA/Trump?\n\nNah. It's a unique leverage position in a critical strategic location. That's a pretty exclusive pass.",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "OGstupiddude",
                                                                    "body": "So, to be clear, if Adams were to not fulfill his promises in regards to immigration, and Trump's DOJ were to bring the charges back, you would say that this behavior from the DOJ is completely legitimate and appropriate?",
                                                                    "score": 13,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sielingfan",
                                                                            "body": "I would hope they got something more out of it than a few weeks of fake play-along. He was in a position to know a lot of things about a lot of people, potentially aiding some future DOJ endeavor -- but again I have no insight. If Adams doesn't pony up, it's a bad look for sure. If you have any other ideas about how to compel NYC to follow the law, I'm sure the DOJ is all ears.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "EkInfinity",
                                                                                    "body": "Are there any crimes Adams could commit that you would want the charges for maintained even if he offered to enforce immigration laws more or whatever other procedural thing Trump might ask for?",
                                                                                    "score": 12,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "sielingfan",
                                                                                            "body": "Sure. It's even possible that the corruption case gets unsealed, it's worse than I expect, and I'm no longer okay with the deal. For now, 'Democrat complies with the law' makes me feel nice, that's all. I'm not giving anyone carte blanche here.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "EkInfinity",
                                                                                                    "body": "But to be clear accepting bribes from foreign governments is not sufficient to warrant the charges being maintained, it would require a more sinister crime, correct?",
                                                                                                    "score": 6,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "sielingfan",
                                                                                                            "body": "I have no idea what the nature of the charges are, and neither do you. It's sealed. It's entirely possible that I'm not okay with what he did. I don't know what he did. You don't know what he did. I know what he's doing now is enforcing the law until he gets primaries out or otherwise fired, and presently,  that's an arrangement I'm okay with. Further information could change my mind.",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "eowbotm",
                                                    "body": "That cooperation is usually something along the lines of being a witness for the prosecution of your co conspirators (like, a drug dealer giving up his supplier).  An unwritten deal to use a position of authority to further a political agenda (in exchange for deferred prosecution) would be a bit of a stretch from what you see on Law and Order, no?",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "sielingfan",
                                                            "body": "He's literally being strong-armed into enforcing the law. It's weird to me that this is what it takes to get NYC to enforce laws.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "wolfehr",
                                                                    "body": "Should local governments be responsible (both legally and fiscally) for enforcing federal laws? \n\nIf yes, how should they prioritize resources for enforcing federal laws vs local and state laws?",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "j_la",
                                                    "body": "Isn’t that a quid pro quo? \n\nAnd doesn’t a dismissal without prejudice mean that the DOJ can hold this prosecution over his head in case he doesn’t do their bidding?\n\nIt seems incredibly corrupt.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Specific-Wolverine75",
                                    "body": "They actually had been investigating him for a while, however seeing that a Trump appointed Prosecutor, Danielle Sassoon decided to resign among 7 others does that make you wonder how Trump is weaponizing the DOJ?",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 16,
                    "replies": [
                        {
                            "author": "sielingfan",
                            "body": ">So it's ok to commit crimes so long as you align yourself politically against the Democrats?\n\nIn *precisely no way whatsoever* was anything remotely resembling this said in my response.",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "jjjosiah",
                                    "body": "Can you understand how your response could be construed to mean that? Since you said all Biden-era federal prosecutions should be viewed with suspicion, and since Trump just let Adams off the hook for obvious corruption immediately after he agreed to cooperate with Trump's immigration agenda?",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sielingfan",
                    "body": ">Can you understand how your response could be construed to mean that? Since you said all Biden-era federal prosecutions should be viewed with suspicion, and since Trump just let Adams off the hook for obvious corruption immediately after he agreed to cooperate with Trump's immigration agenda?\n\nNo, I said NYC investigations at the Bidens' request would be viewed with circumspection here. Feds pushing NYC investigations into Biden's political opponents is kinda how we got back here in the first place. Second place? Whatever.  But that's a whole other conversation.  My point is, I ain't said that shit.",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "TooWorried10",
            "body": "If he helps with deportations then I’m fine with him skating by.",
            "score": -2,
            "replies": [
                {
                    "author": "ArrantPariah",
                    "body": "What is he going to do to help deportations?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -32,
            "replies": [
                {
                    "author": "Necessary_Sand_6428",
                    "body": "What if he denounced Trump?",
                    "score": 18,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Necessary_Sand_6428",
                                    "body": "Nice to hear that.  How long have you been following the Eric Adams ordeal?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Necessary_Sand_6428",
                                                    "body": "Me too, you don’t care that he was taking bribes? Or that he was illegally receiving funds from foreign nations?  If Kamala did what Eric Adams did, would you be embarrassed watching them tear down a black woman?",
                                                    "score": 18,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ilosesoothersmaywin",
                                    "body": "Who is the most critical person of Trump that you respect, admire, listen to or watch, value their opinion, etc?",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OGstupiddude",
                    "body": "Do you think the evidence against Adams was phony?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "riskyrainbow",
                    "body": "Are you asserting that they were persecuting him for his race or some other illegitimate reason? Do you have evidence for this assertion?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "notapersonaltrainer",
                            "body": "New York City has had two Black mayors out of 110 in its history. \n\n50% of the black mayors have received criminal charges, much higher than the rate of white mayors. \n\nErgo, by the rules of contemporary Democrat Logic™, this is irrefutable evidence of systemic racial persecution and racist to deny.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "riskyrainbow",
                                    "body": "I know you're trolling but have you ever had a competent person explain to you what democrats generally believe systemic racism to be? A single statistic with a sample size of 2 is insufficient to demonstrate a systemic issue of any kind. In this instance, there is evidence that Adams committed a crime. An analysis to demonstrate systemic racism would have to show that black mayors are charged at a higher rate after controlling for factors like criminality. Are you able to engage in this conversation seriously or would you like to continue changing the subject?",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "riskyrainbow",
                                                    "body": "Given that it's a counterfactual, one can obviously not say with much certainty whether Adams would've been charged if he were white, but given that you are making the definitive assertion, the burden of proof is on you to show that they wouldn't have.\n\nWhat are the specific statutes under which you think DeBlasio should be charged? The fine DeBlasio owes is just that, a fine, and he's taken legal channels to try to get it withdrawn. He'll either have to pay up eventually or face further consequences but there's no reason to think he should've already been criminally charged unless you can provide me with one. Also, accidentally dropping a beloved animal isn't even a crime.\n\nDo you have any evidence that Adams' being charged is due to his race?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "riskyrainbow",
                                                                    "body": "Good one.\n\nAre you unwilling to defend your claim that the indictment of Adams was racially motivated?",
                                                                    "score": 8,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "CC_Man",
                                    "body": "So your only reason for thinking the charges were phony is because there would be a racial similarity among prosecutions?\nUnless tongue in cheek, in which case is there a legitimate answer?",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DisorganizedSpaghett",
                    "body": "Is it \"tearing down\" when the guy has taken hundreds of thousands of personal dollars (aka money not dedicated to the taxpayers) from a foreign government to give those people favorable treatment over Americans?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "tnic73",
            "body": "The democrats are out of office so the lawfare is on pause.",
            "score": -15,
            "replies": [
                {
                    "author": "BoppedKim",
                    "body": "Have you read the case and evidence against him?\n\nDid you come to the determination it was lawfare after your own reading of the case and situation?",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "JackOLanternReindeer",
                    "body": "If an administration goes “cooperate with the executive branch, and we will drop your charges”, is that potentially lawfare?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "tnic73",
                            "body": "unclear?",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "JackOLanternReindeer",
                                    "body": "Are you unclear on my question or if it would be lawfare if such a thing were to happen?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "tnic73",
                                            "body": "both",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "JackOLanternReindeer",
                                                    "body": "How should criminal investigations and trials be handled when the accused is running for reelection in your opinion?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "tnic73",
                                                            "body": "Handle it the same as we have handled it in the past.\n\nObama killed a US citizen without charges or a trial how was that handled?\n\nThe FBI covered up the crimes of the Biden family how was that handled?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "JackOLanternReindeer",
                                                                    "body": "Taking that to its conclusion sounds like you are saying no politician or anyone running for office should ever go to jail or be investigated for a crime, since that would be interference in the election?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tnic73",
                                                                            "body": "Is it just politicians you don't like that should be held accountable or should Obama be serving a life sentence for murder?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "JackOLanternReindeer",
                                                                                    "body": "Well, apparently the supreme court says Obama had immunity on his actions as president so apparently not though I didnt support his use of drone strikes nor did I support Trumps use of them.\n\nCan you answer my question now, its not a gotcha- i want to understand what you think the process should be moving forward?",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "tnic73",
                                                                                            "body": "so you support presidential immunity?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "JackOLanternReindeer",
                                                                                                    "body": "Not particularly- it is the law of the land though - it doesn’t extend to mayors last I checked either but thats my personal opinion.\n\nHow would you like to see crimes investigated and tried when committed by politicians running for office?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "tnic73",
                                                                                                            "body": "what do you call a crime? \n\nwas it a crime when harry truman (d) dropped two atomic bombs on civilian populations\n\nwas it a crime when FDR (d) interned ameriacan citizens in concentration camps?\n\ndid they stand trial?\n\nyet we are going to imprison donald trump for over estimating the value of his property?  \n\nutter madness",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "JackOLanternReindeer",
                                                                                                                    "body": "Notably you listed all presidents, and Im asking about other politicians at this point who the courts haven’t ruled have immunity- how should those crimes be investigated and tried when someone is running for office? Or are you not particularly sure how it should be handled?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "tnic73",
                                                                                                                            "body": "they should be conducted fair handily or not at all",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "JackOLanternReindeer",
                                                                                                                                    "body": "So since prior ones weren’t handled fairly in your opinion, we should let everyone off with every crime moving forward if they are running for reelection?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "tnic73",
                                                                                                                                            "body": "tell me your opinion \n\nhow should we have handled Obama or Bidens crimes",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sketchy_Uncle",
                    "body": "Do you know what political party the mayor of New York originates from?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "tnic73",
                            "body": "if you need to deal with your apostate go ahead and do it",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Sketchy_Uncle",
                                    "body": "We tried - but your crew called off the entire thing.  Does that make sense?",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "What was the extended timeline? Wasn't he only investigated after being against Illegal migrant sanctuary cities or something? \n\nI remember thinking it was funny that the left was eating their own when this was first breaking news, so the charges being dropped is probably long overdue.",
            "score": -13,
            "replies": [
                {
                    "author": "OGstupiddude",
                    "body": "A probe into Adams' campaign activity had started years prior, and the deputy attorney general made no comment on the strength of the evidence against him, but rather that Adams' ability to fight the migrant crisis would be inhibited. Wouldn't that mean that the evidence and the charges were legitimate?",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "No, it just means my memory on the timeline about a situation I really don't care about might not be correct.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "OGstupiddude",
                                    "body": "Do you think the charges against Adams were legitimate or not?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Lucky-Hunter-Dude",
                                            "body": "I have no idea and I don't care.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "riskyrainbow",
                                                    "body": "Why don't you care? If the charges were legitimate, wouldn't you agree that Trump had prosecutors ordered to drop real charges by threat of firing in order to gain local power? Is that not an entirely unprecedented and inappropriate use of presidential power?\n\nFurthermore, if you don't care, why bother responding in the first place?",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Lucky-Hunter-Dude",
                                                            "body": "New York is not my circus. If it's inappropriate then impeach him over it. \n\n>Furthermore, if you don't care, why bother responding in the first place?\n\nThis is the most important part. You need to realize and understand. I don't care about this bullshit.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "riskyrainbow",
                                                                    "body": "But the United States is your circus, correct? And Donald Trump is the president of the United States; this isn't simply an instance of quid pro quo between two local officials.\n\nDid you similarly not care when the Barisma controversy involving Biden was taking place because Ukraine is not your circus?\n\nI would quite like him to be impeached for this, but it seems like you disagree and I'm trying to understand why. Do you see his actions as appropriate? Do you just not care if Trump obeys the law in general? Do you care if he acts justly?\n\nI don't understand your other response either. Are you saying you joined this conversation simply so that people who didn't know you existed know that you don't care about the conversation? Why do you think this is bullshit?",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "OGstupiddude",
                                                    "body": "To be clear, you only cared when it was something that could have potentially made Biden look bad. But now that it seems like the inverse (Trump holding charges over Adams' head in order to get him to further his immigration agenda) you all of a sudden don't care. Do you recognize that you have this very clear bias that's making you look the other way?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Lucky-Hunter-Dude",
                                                            "body": "No, I didn't care, and I still don't care. Do you realize you have insane bias in attributing positions and opinions on people given approximately zero information about them?",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "OGstupiddude",
                                                                    "body": ">What was the extended timeline? Wasn’t he only investigated after being against Illegal migrant sanctuary cities or something?\n\nThis was the first thing you said. Guess this was just you not caring?",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lucky-Hunter-Dude",
                                                                            "body": "Yep, apparently I cared so little my memory of it was wrong.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BoppedKim",
                                                                                    "body": "It’s okay to say you don’t care about the actual charges… Is part of Trumps appeal to that he does operate like this to get his agenda done?",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TrippyWiredStoned",
                    "body": "Is the timeline still relevant? Are the origin of the charges still relevant?\n\nDid you see the acting \"Border Czar\" and Adams essentially admit to quid pro quo on their media tour? Adding that they're seeking a dismissal *without prejudice*, in case Adams ~doesn't play ball down the road~? The charges being dropped is not what you think it is.. Right?\n\nThe charges will be held over Adams head. If it's all a sham it would be with prejudice, so the DoJ can't play with the indictment later.. No?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "I have no idea, and I seriously don't care. New York is not my circus.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "pimmen89",
                                    "body": "But these are federal prosecutors, couldn't federal prosecutors working for Trump's DoJ do the same wherever your circus is?",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Specific-Wolverine75",
                    "body": "Maybe the left did not politicize the DOJ? However for me the idea that Danielle Sasson among 7 prosecutors resigned because they did not want to drop the case because the evidence was to big, does that make you question your thoughts?",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}