{
    "title": "What do you think of Trump's/Bondi's release of the \"Epstein files\" to a select group of influencers?",
    "author": "VeryStableGenius",
    "subreddit": "AskTrumpSupporters",
    "rank": 35,
    "score": 94,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 134,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1j092ow/what_do_you_think_of_trumpsbondis_release_of_the/",
    "id": "1j092ow",
    "selftext": "[AP's take](https://apnews.com/article/jeffrey-epstein-files-pam-bondi-trump-1a6af3e9fa1cfb6d267985a971a4929a): \"No new bombshells in Justice Department’s release of Jeffrey Epstein files ... The small batch of documents included copies of flight logs from Epstein’s private plane, which have long been available in multiple court cases, and a heavily redacted photocopy of an address book purportedly compiled by Epstein and his longtime confidante Ghislaine Maxwell, which has been cited in media accounts for many years.\"\n\nThe House Judiciary GOP even [rick-rolled their twitter followers](https://newrepublic.com/post/192117/gop-rick-rolls-jeffrey-epstein-files).\n\nDo you think there is an ongoing coverup of Epstein? By whom, and why?\n\n----\n\nedit: I did not tag this 'Israel'.  I don't think post submitters can submit tags.\n\n----\n\nedit: Could this have something to do with that time [Trump said he might keep the Epstein file sealed - \"you don’t know, you don’t want to affect people’s lives if it’s phony stuff in there, because it’s a lot of phony stuff with that whole world.\"](https://www.yahoo.com/news/fox-news-edited-trump-saying-205750634.html)?\n\nFox edited this part of the answer out of their televised interview, but it's available in the full version.   [Video here](https://www.youtube.com/watch?v=HVKRNcQUbRY&list=PLlTLHnxSVuIzi_tPVKjt5y7KMgvlch5o6&t=2119s).",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "goldmouthdawg",
            "body": "No bones about it, this was an L by the administration. They promised big and didn't deliver.\n\nThe house judiciary twitter team needs to be fired.",
            "score": 38,
            "replies": [
                {
                    "author": "OGstupiddude",
                    "body": "What exactly do you think is happening? Some sort of cover up? Do you think Trump is involved?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Ok_Motor_3069",
                            "body": "We know Trump isn’t implicated because that would have been used some time from 2015 to now if so.\n\nI’m trying to figure out what is the strategy behind this bit of theatre. I expect it’s to pressure the FBI or crooked parts of it. But I don’t know for sure.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "OGstupiddude",
                                    "body": ">We know Trump isn’t implicated because that would have been used some time from 2015 to now if so.\n\nMaybe there’s a bit of a situation where releasing dirt on Trump would also release dirt on others, such as the Clintons, and so keeping it all concealed was the best option? And maybe vice versa as well in that maybe Trump by not wanting to release dirt on himself is forced to conceal dirt on others? Is this plausible?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Ok_Motor_3069",
                                            "body": "No, because the Clintons are over. What use are they to anyone now?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "OGstupiddude",
                                                    "body": "Still a large part of the dem party though. Both campaigned with Harris, no?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Ok_Motor_3069",
                                                            "body": "The Clintons I assume still have money, so people will still try to get some of it from them. People on their payroll will still protect them I suppose. But they don’t have the juice they used to have.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ok_Motor_3069",
                                                            "body": "Did she pay them an appearance fee? Don’t these ex-politicians all register with “talent” agencies so they can be paid?",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ok_Motor_3069",
                                                            "body": "The Dem party is over too. No one is afraid of them any more.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "OGstupiddude",
                                                                    "body": "Then where are all the files? Does this not make Trump looks suspicious to you at all?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ok_Motor_3069",
                                                                            "body": "It makes the FBI look suspicious. Which tracks with what I already think I know.\n\nI realize I said some pretty provocative things, but I can’t think of a single person the Dems love more than they hate Trump. They would burn the whole world down to get rid of him. We watched them try to  start WW3 on the way out.\n\nMy analysis could be wrong, sure. It’s just my opinion.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "OGstupiddude",
                                                                                    "body": "Dems transfer of power to Trump was more peaceful and less contested than the republicans in 2020/2021 so I disagree. \n\nHere’s something that we can agree on: liberals were delusional about Biden’s mental health. Even I defended him early on until I couldn’t anymore. Having to come to terms with something negative about someone you’re actively rooting for is difficult. There was this obvious elephant stomping around the room and many dems, myself included, were in denial and kept looking in every other direction instead of just acknowledging the elephant. This seems to be happening right now. \n\nI mean, think of Epstein dying while Trump was president. Think of Trump’s incredibly suspicious answer [this interview](https://youtube.com/shorts/ZJorAVgHy7Y?si=nYCkfM54FFWV6JU9). Think of Epstein saying Trump was his [good friend for years](https://www.theguardian.com/us-news/2024/nov/01/trump-jeffrey-epstein-tapes). Think of [Epstein describing the ins and outs of Trump’s White House](https://youtu.be/f3KIO6VfxpU?si=XpUZDlF8mlt1Hrpv) implying that he was still friends with Trump when he was still president in his first term. Think of the completely bizarre releasing of these documents. Think of the fact that Trump rarely brings up Epstein despite being a focus of many of his supporters. Is it really the case that this is all made up deep state lies and fake news? I mean there’s a very very clear through line here. Do you think this might be MAGA’s elephant? Genuine question.",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ThisOneForMee",
                                                    "body": "How is that relevant to the conjecture that there is incriminating evidence on BOTH Trump and Clinton, which is why full evidence has not been released? The Clintons' political careers being over doesn't stop them from releasing damaging information if they have it, no?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Ok_Motor_3069",
                                                            "body": "People would throw them under the bus if it would get Trump. That’s what I believe. They would throw anyone or anything under the bus.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "goldmouthdawg",
                            "body": ">What exactly do you think is happening? Some sort of cover up? Do you think Trump is involved?\n\nI do not know and I'm not going to speculate because for all I know the other supporter is right and it has to do with the people that wear hats with no brims.  All I know is that Patel and Bondi went on and on about it and Bondi said she had the list on her desk. Now we're getting \"phases\" nothing real so far.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "OGstupiddude",
                                    "body": "But if you had to guess? Why not speculate? Do you think it has something to do with both Trump and Elon having Epstein connections? Epstein, who was killed in federal prison while Trump was president? I’m sure you’d agree that MAGA can be fairly conspiratorial sometimes. Is there a theory here that might involve Trump?",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "VeryStableGenius",
                                    "body": "> or all I know the other supporter is right and it has to do with the people that wear hats with no brims. \n\nWhat do Brooklyn hipsters and winter sports enthusiasts have to do with Epstein?\n\nWhy is Trump supporting them?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "goldmouthdawg",
                                            "body": "If that's who you think I'm talking about, bless your heart and have a good day.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "VeryStableGenius",
                                                    "body": "Could you explain in greater detail?   I'm genuinely interested in why the Epstein files weren't fully released.    Trump cares only about US interests, right?",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GuyHomie",
                    "body": "When did trump promise to release the epstein files? I remember him saying he wasn't going to release them. I feel like trump has promised and not delivered on a ton of things so far but this is certainly not one of them.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "VeryStableGenius",
                    "body": "> The house judiciary twitter team needs to be fired.\n\nDo you think there is a House Judiciary 'twitter team' that works independently of its elected representatives?    \n\nIs this like when \"Ted Cruz's Twitter intern\" 'liked' some MILF porn?",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "justfortherofls",
                    "body": "Let’s say they had “delivered” at least some relevant information.  Does the fact that they passed it out to influencers to distribute weird?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "goldmouthdawg",
                            "body": "Didn't I just say it was an L by the administration?\n\nThe entire rollout has been an L. It happens.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "justfortherofls",
                                    "body": "Apologies.  I wasn’t sure if you were saying it was an L because nothing was released or the fact that they released said nothing through influencers or a combination there of.\n\nHow was your day?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Horror_Insect_4099",
            "body": "This is sad.  Powerful people are being protected.  We'd long been told Epstein had video cameras everywhere, yet the FBI has not even confirmed the existence of these tapes, the criminal activity that was recorded, or the wealthy people involved.\n\nThe rick-roll thing isn't funny IMO.  It's insulting to Americans and a slap in the face reminding us of our two-tiered justice system.\n\nPam Bondi is supposedly still trying to get info from the FBI, but Trump needs to follow-through and declassify this stuff.",
            "score": 33,
            "replies": [
                {
                    "author": "OGstupiddude",
                    "body": "Do you think something shady is happening, like a cover up by the admin? And do you think Trump is involved?",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Horror_Insect_4099",
                            "body": "There was plenty of media speculation that Epstein regularly used blackmail as a source of income.\n\nIf our government has footage of crimes, they now have leverage over those same billionaires.\n\nAs just one example, Bill Gates is one of the famous people alleged to have visited Epstein Island many times.  Epstein threatened to expose his affair with a 20 something Russian bridge player.\n\n[https://www.forbes.com/sites/anafaguy/2023/05/21/jeffrey-epstein-threatened-to-expose-bill-gates-affair-report-says/](https://www.forbes.com/sites/anafaguy/2023/05/21/jeffrey-epstein-threatened-to-expose-bill-gates-affair-report-says/)\n\nBut consider there are likely many more (maybe less famous) rich people still married that slept with Epstein's trafficked girls.  Thats's a lot of donor money at stake.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "VeryStableGenius",
                                    "body": ">  Thats's a lot of donor money at stake.\n\nAre you saying that Trump is protecting rich billionaires pedophiles so he can get more donor money?  Can't he just self-fund like he promised in 2015?  Heck, why does he need funding?\n\n(not that Gates was a pedo - the alleged-and-unproven woman was 20-something)\n\nWhat about [Trump's own legendary partying with Epstein, including parties with just Trump, Epstein, and  28 calendar girls?](https://archive.is/kQ1lc)   Could that have something to do with the flaccid data dump?",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "OGstupiddude",
                                    "body": "So you think the government might be concealing valuable material to use as leverage? Do you think Trump is involved, considering he’s the president and is also somewhat implicated?",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "420catloveredm",
                    "body": "I agree that the Rick Roll isn’t funny and that powerful people are being protected. Glad we can find some common ground. How do you think Trump supporters in general will respond to this? And how would you feel about Trump if he doesn’t declassify?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "VeryStableGenius",
                    "body": "> This is sad. Powerful people are being protected. \n\nWho is being protected?  What rich people associated with Epstein could Trump and Bondi be protecting?  And why?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "andhausen",
                    "body": "> Powerful people are being protected.\n\nAnd you are surprised by this?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "basedbutnotcool",
            "body": "A massive publicity stunt. That’s what this is.\n\nLet’s be honest for a minute, we are never getting these files in their entirety. All these influencers who walked out like fucking idiots doing stupid dances, proclaiming how they had the binders in a photo shoot now look like complete idiots.\n\nNow they’re all making excuses online about how they were played. **No shit**, that was obvious to literally everyone who saw this situation unfolding. \n\nThese documents go beyond Trump, there are some very very powerful people who have an interest in making sure the full unredacted documents never reach the light of day. And Pam Bondi’s incompetence, or purposeful lack of integrity has meant that we will probably never see these documents released. \n\nShe apparently saw the documents in entirety, but when it came to release it was redacted? How does that happen? Why was it released to a bunch of conservative influencers instead of being released to the media or released via a press conference?\n\nAnd whoever runs that GOP judiciary account needs to be fired. Today. Their actions are completely unacceptable.",
            "score": 6,
            "replies": [
                {
                    "author": "VeryStableGenius",
                    "body": "Trump is POTUS.   He's innocent of any Epstein shenanigans (...right?)\n\nSo why doesn't he put his foot down, and release all the docs?    He has full power to declassify, as he pointed out numerous times.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "basedbutnotcool",
                            "body": "I presume he’s innocent of any Epstein stuff, if he was guilty I imagine it would have come out years ago. \n\nJust because he has the power to say the full Epstein docs should be released, it doesn’t mean they realistically can. There are some very powerful and influential people on this list, and they would have various ways to prevent the list from seeing the public eye. \n\nI don’t think it’s a stretch to say that there is the government that we see (president, congressmen, etc) and the government we don’t see or aren’t supposed to see (powerful interests, lobby groups). And that government we don’t see is preventing the release by any means possible.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "VeryStableGenius",
                                    "body": "> I presume he’s innocent of any Epstein stuff, if he was guilty I imagine it would have come out years ago.\n\nWhy?   Would you say that \"if they had anything on Clinton it would have come out years ago\"?\n\nWhat about [his party with Epstein and 18 calendar girls and nobody else](https://archive.is/0BjRu)?  Or  (same source) Trump's statement that Epstein was a 'Terrific guy' who \"likes beautiful women as much as I do, and many of them are on the younger side\"?  Are we sure there's no fire behind all this smoke?   \n\n> There are some very powerful and influential people on this list, and they would have various ways to prevent the list from seeing the public eye.\n\nAren't they all weaker than Trump?   It seems to me that Trump could pull the trigger *if he wanted to*.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "basedbutnotcool",
                                            "body": "No because the Clintons are very influential and are also establishment. \n\nThose parties and statements were before the Epstein stuff was known about, and once trump knew he distanced himself. \n\n> Aren’t they all weaker than Trump?   It seems to me that Trump could pull the trigger if he wanted to.\n\nNo offence to you, but if you genuinely believe this you’re naive. This is not how power works in politics, while Trump is the face of the president, the issue is with the people you can’t see.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "VeryStableGenius",
                                                    "body": "So what would happen if Trump were to say \"release the files!\"?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "basedbutnotcool",
                                                            "body": "He did already announce that, and we got a redacted bullshit version of the documents that reveals nothing new. \n\nThese documents will never see the light of day, no one will ever be held accountable, this is the reality we live in.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "VeryStableGenius",
                                                                    "body": ">  no one will ever be held accountable, this is the reality we live in.\n\nIf Trump can shrink the federal government, throw out illegal immigrants, and Make America Great Again, why can't he just release a bunch of papers about a crook?\n\nWhat's so damned hard about it?\n\nHe has no trouble firing people for other reasons.  Just keep firing people until somebody hands him the papers right?\n\nWhy doesn't he just say \"Have the papers on my desk, tomorrow!\" and then give them to Fox News?    Is he really this weak?",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "basedbutnotcool",
                                                                            "body": "Well I do think you’re enthusiastic, which is good. \n\nTrumps barely deporting anyone, the deportation numbers are abysmal. \n\nI do think you’re missing the whole point, which is that if Trump did that, it would almost certainly be blocked, and it would also not result in those documents being released. No fucking way",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "VeryStableGenius",
                                                                                    "body": "> I do think you’re missing the whole point, which is that if Trump did that, it would almost certainly be blocked\n\nWho would block it?  Trump is POTUS, the Numero Uno Big Honcho in the world.\n\nSeriously, if Trump says \"put the documents on my desk\" who would stop him?   Couldn't Trump fire them just like he's fired a shipload of people already?\n\nHelp me out here!",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "basedbutnotcool",
                                                                                            "body": "Haven’t you seen all the judges blocking his executive actions?\n\nI think the missing part is this: there are people way, WAY more powerful than the president in the United States. And that Epstein doc would ruin them, so that means it can never come out",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "VeryStableGenius",
                                                                                                    "body": "So why don't we *SEE* a judge blocking his Epstein release?     He hasn't even tried!\n\nWhat if he ordered the FBI to put the docs on his desk, and then he literally handed the to Fox?  Easy-peasy, right?  Who could block him?\n\n>  there are people way, WAY more powerful than the president in the United States.\n\nThat's a weird conspiracy, IMHO.\n\nLike billionaires?  Like Trump himself?  Like the richest man in the world, literally working right next to him?\n\nWho *are* these mysterious people?\n\nI'm sorry, but this is beginning to sound a little kooky.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "basedbutnotcool",
                                                                                                            "body": "You’re welcome to think that, I don’t think there’s any chance of changing your mind on this",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "VeryStableGenius",
                                                                                                                    "body": "OK, so *who is this secret cabal*, more powerful than Trump, preventing him from ordering that the documents appear on his desk?\n\nOr would they prevent him from handing them over to his friends at Fox?  \n\nWhat would they do?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "basedbutnotcool",
                                                                                                                            "body": "It’s funny, when you used the term cabal it reminded me of this show I watched called the Blacklist. Have you seen it?\n\nAnyways, it wouldn’t be much of a secret if I knew who was in it would it?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "VeryStableGenius",
                                                                                                                                    "body": "OK, so there's a *secret* list of people who are more powerful than POTUS.\n\nAny *speculation* on who they are?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Dijitol",
                                                                                                    "body": ">Haven’t you seen all the judges blocking his executive actions? \n\nThe fear of a judge blocking an EO never stopped Trump creating EO’s in 2016 and in 2025. Why do you feel he’s worried about a judge, now?",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cchris_39",
            "body": "Not at all satisfied.  She said she had the files for a week - did she even bother to look?\n\nGiving them to select “infuencers” is total BS too.  Post the whole thing on a public website for everybody to see together at the same time.  Stop trying to control the narrative.\n\nThis has Deep State coverup all over it.  We will now find out if Pam and Kash are in on it or not.\n\nIf there is a legitimate national security concern (some have mentioned Israel) ok, we still need that explained too.",
            "score": 9,
            "replies": [
                {
                    "author": "VeryStableGenius",
                    "body": "> We will now find out if Pam and Kash are in on it or not.\n\nTrump is their boss.  Why doesn't he put his foot down and release everything?\n\nHe's pointed out numerous times that he has the power to declassify anything.\n\nAnd what 'legitimate national security concern' could require protecting a pedophile?    If <foreign nation> trafficked sex slaves on US soil, there's no excuse, and they should be called out, right?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "Good questions.  I fully expected the New York office to resist, no surprise there.  But her rollout of this is not very impressive.\n\nWe’ll see what happens next.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shaabloips",
                    "body": "Should Trump fire Bondi now?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "No but he should start firing the New York office and close it if they don’t cough up the evidence.  And she should start prosecuting them.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Shaabloips",
                                    "body": "How would you address privacy concerns for victims in what you release?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "smiley_kat",
            "body": "This was super poor judgment on their part. It would’ve been better if Pam Bondi would have called a press conference, said that what she had was basically the same information to be posted online but a whistleblower had revealed that FBI NY was hiding thousands of documents and they would get to the bottom of it. Not whatever fiasco yesterday was.",
            "score": 15,
            "replies": [
                {
                    "author": "VeryStableGenius",
                    "body": "Why doesn't Bondi just send someone to New York to ransack the place?  She's the boss!",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "sshlinux",
            "body": "As expected. Called it in a previous post. it was given to Zionist influencers and the \"release\" of the files have redacted text. Can't be exposing Jews, Zionists, CIA and Mossad. Wake up people. Epstein, Jfk, and 9/11 files will never be released. Having pages redacted and mostly blacked out isn't releasing anything.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KnownFeedback738",
            "body": "Any Trump Supporter who thinks one of the most Jewish major political movements ever in the US is going to burn a very successful Mossad operation like Epstein is an idiot.",
            "score": -30,
            "replies": [
                {
                    "author": "NedryWasFramed",
                    "body": "I've never heard Epstein was connected to Mossad before today but this morning I've seen a few people posting about it. I'm generally curios so would you mind elaborating for me?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "pcoppi",
                            "body": "Just adding that I've heard this outside of right wing places... so this isn't just a rightwing talking point.\n\nWhat Ive heard goes something like this:\n\nGhisleine Maxwells father was a rich British businessman who was also jewish. He had close ties with the Israeli government and maybe mossad specifically because he helped with funding or something.\n\nTheory goes that Epstein got connected to Mossad via the Maxwells and his asset status let him get away with all those crimes.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Liftedhigh069",
                            "body": "His girlfriend Giselles dad basically helped start mossad...",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "KnownFeedback738",
                            "body": "A lot of it stems from the career and strange death of ghislaine Maxwell’s father, Robert Maxwell. He had a long running feud with Pulitzer winning journalist seymour hersh. Hersh wrote a book or two detailing maxwells early career and connections with efforts to clandestinely arm a nascent israeli nation. Maxwell fought him in court with considerable resources and won a few cases in Britain but not in the US. Upon the explosion of a particular story in British media, Robert Maxwell was found dead in the Mediterranean after having allegedly fallen from his yacht, Ghislaine. His funeral was a full Israeli state funeral on the Mount of Olives and was attended by the PM and the president of Israel, along with the current and 6 former heads of the Mossad. His eulogy included thanks for his extraordinary service to the state.  Epsteins connections to high powered jews, particularly at the beginning of his very strange career, along with his long time partnership with apparent Mossad royalty form the root of the story but it’s about high society and finance, so things aren’t always so A —> B. It’s extremely complex and there is a lot of dubious thought circulating around it but i think the basic facts are pretty inescapable. \n\nId recommend the hersh book, The Samson Option (about the nuclear arming of Israel). Gordon Thomas’s book, Robert Maxwell, Israeli Superspy. \n\nI’d recommend the 5 hour martyrmade podcast on the topic if you like audio. https://open.substack.com/pub/martyrmade/p/epstein-the-full-series-pts-1-3?r=7wbqz&utm_medium=ios\n\nThe podcast gets much more into the ghislaine and epstein connection but i think the Maxwell legacy is very important to the story as well",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "VeryStableGenius",
                    "body": "> one of the most Jewish major political movements ever in the US\n\nI am so lost.\n\nWhich movement is this?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "KnownFeedback738",
                            "body": "It’s a tight race but it’s MAGA.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VeryStableGenius",
                                    "body": "How is MAGA 'one of the most Jewish major political movements ever '?  I thought about 70% of Jewish Americans voted against Trump.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "KnownFeedback738",
                                            "body": "Jewish Americans aren’t an important voting bloc. They are a HUGELY important donor bloc. Care to look into what percentage of Trumps biggest 20 donors were jewish last cycle?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "rci22",
                                                    "body": "Why are you even bringing Jewish people into this conversation at all?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "KnownFeedback738",
                                                            "body": "Hard to not bring Jewish people into the Jeffery Epstein conversation 😂😂",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Intotheopen",
                                                                    "body": "Why, do you think we all know each other?\n\nYou ever talk to Jews? We don’t agree on anything except air conditioning and delis. \n\nJeffrey Epstein having a Jewish last name meaning he’s part of some vast Jewish plan would need to climb about 7 rungs on the ladder to only register as completely insane.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "KnownFeedback738",
                                                                            "body": "I don’t think that. Silly question and irrational assumption to make on your part. Do better. \n\nMy wife is half Jewish and i live in a very Jewish neighborhood and I’ve spent many years in elite academics, so yea, i know a lot of jews.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "KnownFeedback738",
                                                                                            "body": " You asked me if i ever talked to jews, hence my response.  I don’t have to prove that i don’t believe the thing you irrationally premised your question on, though. This is very low verbal reasoning on display by you.  Are you sure you’re Jewish?",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "AskTrumpSupporters-ModTeam",
                                                                                            "body": "your comment has been removed for violating rule 3. Undecided and Nonsupporter comments must be clarifying in nature with an intent to explore the stated view of Trump Supporters.\n\nPlease take a moment to review the [detailed rules description](https://www.reddit.com/r/AskTrumpSupporters/about/rules/) and [message the mods](http://www.reddit.com/message/compose/?to=r/AskTrumpSupporters&subject=Comment+Removal) with any questions you may have.\n\nThis prewritten note was sent manually by one of the moderators.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "VeryStableGenius",
                                                    "body": "> Care to look into what percentage of Trumps biggest 20 donors were jewish last cycle?\n\nI don't know where to find this information.   Do you have a link?\n\nI recall that Mrs. Adelson was kind of big, but that's it.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OGstupiddude",
                    "body": "Do you think Trump is involved?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "KnownFeedback738",
                            "body": "I care much more about who is controlling the US govt through blackmail. The failure of any administration or local body to divulge this information in multiple decades makes me care much more about who has been manipulating U.S. govt with blackmail for that time than who is being blackmailed because Its clear that it’s basically everyone in power either implicated or afraid of those who are/the blackmailers",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "OGstupiddude",
                                    "body": "If this is one huge blackmail scheme, why do you think Epstein was ever arrested in the first place? It’s not like some bombshell story dropped that forced the FBI’s hand. What do you think happened?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "KnownFeedback738",
                                            "body": "Why was he arrested then let off on what amounted to house arrest a decade ago? Why did he eventually get tossed in prison where he immediately ended up dead before anything really came out? Who knows. Seems like it ran its course and some loose ends were tied up but it’s such a mythological story at this point that it’s hard to just bury.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ChallengeRationality",
                    "body": "Um…. What?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Intotheopen",
                            "body": "When you drift far enough left or far enough right eventually it’s the Jews fault. It’s always our fault. \n\nHow was your lunch?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ChallengeRationality",
                                    "body": "Wise insight but unfortunate.  \n\nIt was nice, I ate cheeses and fruit, and yours my friend?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Quiet_Entrance_6994",
                    "body": "Yep. I'm with Candace Owens on this. \n\nWe won't get anything because certain people or places will be implicated and that won't happen.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "OGstupiddude",
                            "body": "Do you think Trump is implicated in whatever it is that you’re talking about?",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Gigashmortiss",
                                    "body": "Nope",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "author": "OGstupiddude",
                                            "body": "Why not? Don’t you think a decent theory can be made to connect Epstein to Trump?",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Gigashmortiss",
                                                    "body": "Not at all. I think if the establishment had anything on Trump it would have come out. They did everything in their legal power and then some to try to stop him and failed. I think it's more likely that this administration thinks that they can extract some value from continuing to protect certain individuals/entities.",
                                                    "score": -13,
                                                    "replies": [
                                                        {
                                                            "author": "OGstupiddude",
                                                            "body": "What if the establishment wanted to protect “their” people on the list which forced them to have to protect Trump as well? What if that’s happening now but in the other direction? \n\nI mean do you think there’s *anything* suspicious about Trump’s role in all this?",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "Gigashmortiss",
                                                                    "body": "Nope for all the above reasons.",
                                                                    "score": -7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OGstupiddude",
                                                                            "body": "Here’s something that we can agree on: liberals were delusional about Biden’s mental health. Even I defended him early on until I couldn’t anymore. Having to come to terms with something negative about someone you’re actively rooting for is difficult. There was this obvious elephant stomping around the room and many dems, myself included, were in denial and kept looking in every other direction instead of just acknowledging the elephant. This seems to be happening right now.\n\nI mean, think of Epstein dying while Trump was president. Think of Trump’s incredibly suspicious answer [this interview](https://youtube.com/shorts/ZJorAVgHy7Y?si=nYCkfM54FFWV6JU9). Think of Epstein saying Trump was his [good friend for years](https://www.theguardian.com/us-news/2024/nov/01/trump-jeffrey-epstein-tapes). Think of Epstein [describing the ins and outs of Trump’s White House](https://youtu.be/f3KIO6VfxpU?si=XpUZDlF8mlt1Hrpv) implying that he was still friends with Trump when he was still president in his first term. Think of the completely bizarre releasing of these documents. Think of the fact that Trump rarely brings up Epstein despite being a focus of many of his supporters. Is it really the case that this is all made up deep state lies and fake news? \n\nForget all the dirt actually. Let’s pretend for a second that any potential dirt on Trump has been destroyed or something. Do you feel that there’s a clear through line here? Do you think this might be MAGA’s elephant? Genuine question.",
                                                                            "score": 13,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Gigashmortiss",
                                                                                    "body": "I think it’s too soon to tell.",
                                                                                    "score": -4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OGstupiddude",
                                                                                            "body": "But do you at least think this is a possibility? I mean you can't ignore the red flags man. If this were a democrat, would you not make these connections instantly?",
                                                                                            "score": 5,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Dijitol",
                                                            "body": "Not calling trump guilty of anything but do you not believe Epstein and Trump were more than acquaintances?",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Gigashmortiss",
                                                                    "body": "I don’t think Epstein had any dirt of Trump. I think it’s abundantly obvious that if he did, it would have come out over the last 10 years. The deep state threw everything they had at him from fake dossiers to assassination attempts. Nothing short of direct irrefutable evidence could ever move me off this position. Hope that helps.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Dijitol",
                                                                            "body": "So what I’m hearing is that you do believe they more than acquaintances but nothing illegal happened?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Gigashmortiss",
                                                                                    "body": "I didn’t say that and there is no reason to infer anything beyond my exact words. They are more than clear enough to convey my position.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MakeGardens",
                                                    "body": "Not a chance they are connected. We would know about it. I believe Trump is truly the most scandal free politician because we already know everything, there’s nothing else. That’s why his enemies have resorted to just calling him and his supporters Nazis. That’s the best they have.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "OGstupiddude",
                                                            "body": "What if the establishment wanted to protect “their” people in the docs which forced them to have to protect Trump as well? What if that’s happening now but in the other direction? Wouldn't that explain the botched releasing and confusion?\n\nHere’s something that we can agree on: liberals were delusional about Biden’s mental health. Even I defended him early on until I couldn’t anymore. Having to come to terms with something negative about someone you’re actively rooting for is difficult. There was this obvious elephant stomping around the room and many dems, myself included, were in denial and kept looking in every other direction instead of just acknowledging the elephant. This seems to be happening right now.\n\nI mean, think of Epstein dying while Trump was president. Think of Trump’s incredibly suspicious answer [this interview](https://youtube.com/shorts/ZJorAVgHy7Y?si=nYCkfM54FFWV6JU9). Think of Epstein saying Trump was his [good friend for years](https://www.theguardian.com/us-news/2024/nov/01/trump-jeffrey-epstein-tapes). Think of Epstein [describing the ins and outs of Trump’s White House](https://youtu.be/f3KIO6VfxpU?si=XpUZDlF8mlt1Hrpv) implying that he was still friends with Trump when he was still president in his first term. Think of the completely bizarre releasing of these documents. Think of the fact that Trump rarely brings up Epstein despite being a focus of many of his supporters. Is it really the case that this is all made up deep state lies and fake news?\n\nDon't you think that there’s a clear through line here? Do you think this might be MAGA’s elephant? Genuine question.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "MakeGardens",
                                                                    "body": "I do not think Trump was involved with Epstein in any way related to the sex trafficking and other crimes Epstein was a part of. I think there is literally zero chance of that. \n\nI don’t think Trump is involved in this. The FBI seems to be the ones who might be trying to protect their people.",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OGstupiddude",
                                                                            "body": ">The FBI seems to be the ones who might be trying to protect their people.\n\nI don't understand what this means. Can you explain?",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MakeGardens",
                                                                                    "body": "As I understand it, the FBI are the ones who were ordered to release the files and they have not. There are a lot of levels of management in the 37,000 member organization. I have no idea what their problem is or why they are not releasing the information. It looks suspicious to me.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OGstupiddude",
                                                                                            "body": "If that's the case, why did the FBI arrest Epstein in the first place?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "jjjosiah",
                            "body": "So if you're right then this whole buildup to a release is a total lie, right? Why would trump allow this charade?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "handyfogs",
                                    "body": "humiliating, infuriating, and disgusting. many people need to be fired.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "jjjosiah",
                                            "body": "Who would fire them though? Aren't these all people Trump personally placed in exactly these roles in the last few weeks? Pam Bondi and the new hand-picked white house press corps? Dont you think he probably selected these people precisely because they'd go along with this kind of thing?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "handyfogs",
                                                    "body": "I mean obviously the last time he was President he picked a number of people who ended up being incompetent or disloyal, and he was not afraid to fire them. Whoever he appoints is not a clone of himself; they are individuals with differing beliefs and agendas.\n\nThat said, I never thought Pam Bondi was competent to begin with, and perhaps she should at least be investigated– But she was humiliated by this as well, and may actually be a victim in this situation. The people I was actually referring to are: 1) whoever organized the weird publicity stunt (I assume it wasn't actually her), 2) the people at SCNY who are allegedly blatantly ignoring orders and withholding the files, and 3) ESPECIALLY the House Judiciary GOP social media intern behind that disgusting rick roll. \n\nWhoever's fault it was (likely multiple teams of people) they made the President look bad by giving the Administration its first major L and they've got to go...\n\nI also think they need to cut ties with all of those insufferable influencers who showed up to that thing because it's poisonous to be associated with them and they make the entire Administration look bad lol",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "jjjosiah",
                                                            "body": "Do you think those insufferable influencers just showed up at the White House uninvited? Isn't it obvious that it was a planned stunt and they were part of the plan? And how could such a plan be carried out without Trump's approval?",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "handyfogs",
                                                                    "body": "I don't think it's a requirement that he approve the plan knowing the full details, and honestly, I don't know what the plan was or who was behind it or what their intentions were *at all* so it's a bit ignorant of me to have an opinion on it. \n\nAll I know is that it looked horrible, and that someone (or a group of people) made a bad judgment in associating with those influencers, and that I don't like it lol.",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "blah_blah_bitch",
                            "body": "Same. I also think it's possible Epstein isn't even dead. That much money and power, it would be easy to make happen. But I could be conspiracy, what do you think?",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "whateverisgoodmoney",
            "body": "All I need is primary sources.",
            "score": -8,
            "replies": [
                {
                    "author": "VeryStableGenius",
                    "body": "What 'primary source' would you like?\n\nWould this [DOJ data dump released by Bondi](https://www.justice.gov/opa/pr/attorney-general-pamela-bondi-releases-first-phase-declassified-epstein-files) qualify?    It seems to be old stuff that was known already, just bundled together.\n\nDo you think this release fulfills any promises or demands for transparency with respect to the Epstein affair?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": "This is perfect. Thank you.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OGstupiddude",
                    "body": "If you had to speculate, what do you think is happening? And do you think Trump is involved?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": "I do not speculate, hence primary sources.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "Israel?",
            "score": -11,
            "replies": [
                {
                    "author": "VeryStableGenius",
                    "body": "Could you explain in greater detail?  How are they involved and why is this preventing the Trump administration from releasing all the files?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "I have no idea. I was wondering why you tagged this question as \"Israel\".",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "VeryStableGenius",
                                    "body": ">  I was wondering why you tagged this question as \"Israel\".\n\nWow!  I don't even have the ability to tag.  I wasn't even thinking of Israel.\n\nDo you think a TS or non-TS mod did the tag?",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nomosolo",
            "body": "It was very obviously a last second pivot after finding out the FBI office in NY was purposefully withholding files from the DOJ.",
            "score": -7,
            "replies": [
                {
                    "author": "VeryStableGenius",
                    "body": "What do you mean by 'last second pivot'?     Didn't Bondi release these documents with full knowledge that they had nothing new?   Why the theatrics of giving those binders to the influencers?\n\nDo you believe that Bondi will release everything as she promised?   The DOJ controls the FBI.   She should be able to swoop into New York, right?",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "ThisOneForMee",
                    "body": "Then why did Bondi say she read the documents at her desk and they were disturbing?",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Enlightened_Patriot",
            "body": "I don’t care about the Epstein files much at all.\n\nI doubt Alan Dershowitz was lying when he defended Epstein and said many of the allegations against him are false. \n\nThe problem is when you deal with a subject like pedophilia, weak people are so afraid of being labeled a “pedophile defender” themselves that they rush to a mob mentality and try to be the most “anti-Epstein” person they can. They disregard all due process.\n\nWas Epstein involved in some bad stuff and a pedophile? Idk. Probably. But was he the Super Villain that he’s become in most people’s minds? Probably not.\n\nI doubt the government is hiding “bombshell secret information” about tons of well known people being pedophiles. This all sounds like Qanon bullshit to me. I bet most of the files haven’t been released to simply protect informants, victims. \n\nAlso it may be kept private to protect innocent people who have been accused of bad behavior but do not deserve to have their name dragged through the mud. These people may be paying a lot of money to avoid being associated with this toxic pile of shit.\n\nRelease the files for all I care. Or don’t. It’s not a major issue and is just becoming a distraction for Trump admin.",
            "score": -2,
            "replies": [
                {
                    "author": "VeryStableGenius",
                    "body": "> I doubt Alan Dershowitz was lying when he defended Epstein and said many of the allegations against him are false. \n\nSo why not release everything and put all doubts to rest?\n\n>  It’s not a major issue and is just becoming a distraction for Trump admin.\n\n*So why the big show of giving those binders to MAGA influencers?*\n\n> I bet most of the files haven’t been released to simply protect informants, victims. \n\nDoes Trump care deeply about informants and victims?  Why not just redact the names?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}