{
    "title": "How do you feel about Denuclearization in regards to Russia as a threat?",
    "author": "FoST2015",
    "subreddit": "AskTrumpSupporters",
    "rank": 16,
    "score": 23,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1j2pk07/how_do_you_feel_about_denuclearization_in_regards/",
    "id": "1j2pk07",
    "selftext": "The President is looking to Denuclearize because Russia is no longer a threat.\n\n\nhttps://thediplomat.com/2025/02/trump-wants-nuclear-arms-control-talks-with-china-and-russia-heres-where-to-start/\n\nhttps://www.armscontrol.org/act/2025-03/focus/making-sense-trumps-talk-denuclearization\n\nhttps://thenewsglobe.net/?p=8897\n\n\nDo you agree?\n\nDoes SECDEFs recent order to stand down cyber operations against Russia influence your opinion in anyway?\n\nhttps://therecord.media/hegseth-orders-cyber-command-stand-down-russia-planning",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "G0TouchGrass420",
            "body": "Nuclear weapons are still the same problem they were in the cold war. We just forgot about them.\n\nIm always reminded of the TSAR bomba basically so large that russia had to actually cut the power in half so the pilot could fly out of the blast range. This was in the 60s.\n\nTheoretically with enough material a country could actually build a bomb large enough to nuke the planet.\n\nThe nuclear bombs we can make now with modern technology could destroy 1/4 of the planet.\n\nChina is also looking for parity with the USA and Russia......they have also never been a party to the nuclear treaties. \n\nWhen more nukes enter the world thats a bad thing.....the world should be losing nukes.",
            "score": 0,
            "replies": [
                {
                    "author": "moorhound",
                    "body": "In the hypothetical scenario that the US and Russia end up in a military alliance, is having 99% of the world's declared nukes on one side a good thing? Does removing the nuclear duopoly (and thus, the basis of MAD) and turning it into a nuclear monopoly make the world more or less safe?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "yewwilbyyewwilby",
                            "body": "China has a lot of nukes and are building many more. More than enough to continue MAD with their delivery system tech",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "moorhound",
                                    "body": "The DOD estimates about 600 Chinese nukes. This info is spotty, and is reminiscent of the 60s, when we were pumping out nukes like crazy under the impression that the USSR was doing the same when in reality they had less than 10% of our warhead stockpile and had like 2 functional nuclear delivery systems that could threaten us.\n\nEven if our 600-nuke estimate is correct, the US and Russia have over 6,000 a piece. China's not estimated to hit 1,500 nukes until 2035-2040. Even if they went full mask-off nuclear production, they wouldn't be able to catch up to parity with the US or Russia for another decade.\n\nIn an all-out nuclear war scenario, China doesn't have the arsenal to wipe out *every* strategic target in a country in the same way the US or Russia do, and they won't have that ability for quite some time.  If the world went back to nuke-threat scenario, don't you think this paints an unbalanced picture?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "yewwilbyyewwilby",
                                            "body": "It really doesn’t matter after a certain amount. China has a modern stockpile and plan on 1000 by 2030. \n\nWhen you have the type of currently unstoppable delivery systems that China has you don’t need numerical parity to teach effective parity. You think a few hundred nuclear warheads smashing into the country isn’t enough for MAD doctrine to apply. I definitely disagree",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BurnerObvi23",
                    "body": "Would you agree that an even worse thing than more new nukes is too few of them given that the principles of mutually assured destruction have never failed as it regards nukes—the only time they were ever used was when on only country had them?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ZarBandit",
                            "body": "I believe Russia has roughly 3000 nukes.  I think they could cut that to a quarter and it would be a significant deterrent.  There seems to be diminishing returns by 500.  Consider how many cities and hundred of millions of people could be taken out with that number alone.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BurnerObvi23",
                                    "body": "Well, it’s not just the raw number that matters for deference purposes. You also have to consider missile defense systems, delivery systems, etc. Basically you have to be able to guaranty that if you get hit, the aggressor will get hit back. If Russia is continuing to improve their nuclear weapons/defenses (and they are, as Putin loves to mention), don’t you think we should at least keep pace?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ZarBandit",
                                            "body": "That’s a different issue.  There’s a delivery system arms race against countermeasures.  We should keep pace with that.  But 2000 nukes in total is more than sufficient.  We don’t need 1000 more of the same variety.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BurnerObvi23",
                                                    "body": "I mean, if all we’re really doing is disposing of some of some of our stock pile while simultaneously continuing to increase our nuclear capabilities, then we’re not really denuclearizing? What’s the point (other than a headline)?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ZarBandit",
                                                            "body": "I think we can reduce significantly in accordance with a bilateral treaty.  I was making the case against increasing our stockpile, since I think it gets us nothing of increased value.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TrippyWiredStoned",
                                    "body": "Do you think Russia still has their stockpile, and that it's still functional? Their display in Ukraine is laughable at best when you look beyond the racheting of war.. I truly don't think Russia is to be feared.. because their army is a joke and they have empty threats like \"my dad knows karate\". I wouldn't believe a word that comes from an adversary to American corporate interests.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "yewwilbyyewwilby",
                                            "body": "Russia has deployed a variety of hypersonic missile systems that we have no way of intercepting as of now",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ZarBandit",
                                            "body": "I’m not willing to bet my life on that being correct.  Also, Russia is winning in Ukraine, despite our significant efforts and flushing hundreds of billions down that toilet.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}