{
    "title": "How can Netflix spend $320,000,000 on a movie without it being released in theatres for any chance to earn the money back? Surely they can't expect to bring in 32,000,000 new account signups to recoup the cost?  What's going on here?",
    "author": "urumqi_circles",
    "subreddit": "NoStupidQuestions",
    "rank": 2,
    "score": 5047,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 388,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1jdx21r/how_can_netflix_spend_320000000_on_a_movie/",
    "id": "1jdx21r",
    "selftext": "Yes, this question is about The Electric State.",
    "comments": [
        {
            "author": "Nuts4WrestlingButts",
            "body": "Netflix reported over 300 million paid subscribers at the end of Q4 2024. If you take a monthly subscription cost of $10 (super conservative average to account different tiers) for as an average, that's 3 billion dollars a month in revenue.",
            "score": 4113,
            "replies": [
                {
                    "author": "GrouperAteMyBaby",
                    "body": "Yeah they'd love new subscribers but a big deal is just maintaining existing ones. They have to invest more than, say, gyms (who about 67% of their subscription-based membership never use), because unsubscribing from Netflix is just a few clicks of a mouse or taps on a phone. \n\n  \nSo they try to aim for new stuff every month and it's worked.",
                    "score": 2058,
                    "replies": [
                        {
                            "author": "bllueace",
                            "body": "I would have preferred season 2's or whatever for like 3 shows that were great but they dropped it for some dumb reason",
                            "score": 854,
                            "replies": [
                                {
                                    "author": "Letstreehouse",
                                    "body": "Mindhunter",
                                    "score": 212,
                                    "replies": [
                                        {
                                            "author": "Full_Improvement_844",
                                            "body": "Came here looking for this!! Same with Marco Polo.",
                                            "score": 75,
                                            "replies": [
                                                {
                                                    "author": "Late_Presentation103",
                                                    "body": "Warrior Nun",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "Putrid-Ferret-5235",
                                                            "body": "The OA",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "Dangerous_Ad_7042",
                                                                    "body": "Yes, I want more of that goofy ass dancing",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "zed857",
                                                    "body": "It's an older cancelation but it checks out.",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "1stltwill",
                                                            "body": "I was about to let them through.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "realeyesrealeyes",
                                                    "body": "I am not okay with this is another one i would’ve like a season 2 for",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SchmeatDealer",
                                                    "body": "that show was beyond excellent. the actor who played the Khan did a PHENOMENAL job",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "International_Lie485",
                                            "body": "Watched this twice and expect to watch it again every couple of years.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "metal_elk",
                                                    "body": "Santa Clarita diet",
                                                    "score": 31,
                                                    "replies": [
                                                        {
                                                            "author": "DogsDucks",
                                                            "body": "Came to say this. It’s an absolute TV tragedy, they’ve made so many compromises on quality to retain the lowest common denominators.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "metal_elk",
                                                                    "body": "The weird smart shows have a rapidly declining audience pool as the world loses weird smart people",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "OoooHeCardReadGood",
                                            "body": "That was the creator pulling out",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "datnero_",
                                                    "body": "yeah I'm a recent netflix unsubscriber and I'm very happy to dunk on netflix but that was basically 100% fincher's decision, all of the cast was down and afaik netflix still hasn't actually formally cancelled it",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "yellowsubmarinr",
                                                            "body": "Fincher did everything on season 1, and the plan was for him to take a smaller role but still oversee it from a higher level. They tried it, Fincher wasn’t pleased and pulled a Thanos (“fine, I’ll do it myself”) and he didn’t think it was worth all his time ",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "BearCubDan",
                                                    "body": "That's what your mom said when you asked why you were an only child...bazinga!",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "undercooked_lasagna",
                                                    "body": "Well he should put it back in I'm not satisfied yet",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "FjortoftsAirplane",
                                            "body": "Final Space",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "donkeyrocket",
                                            "body": "Just pointing out that this one wasn't completely on Netflix. Fincher has admitted that each episode took immense amount of effort to produce both from an expense standpoint but also creative.\n\nAllegedly, five seasons were mapped out but cost and surprisingly low viewership (relative to cost to produce) were the real deciding factors. Netflix didn't want to pay that much to sustain the high caliber production and Fincher didn't want to concede on doing it more cheaply as it was so taxing to do.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Oatmeal_Savage19",
                                            "body": "Season 3 is coming finally",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Letstreehouse",
                                                    "body": "No way, really?\n\nEdit: yeah...no...no its not.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Oatmeal_Savage19",
                                                            "body": "From what I've been hearing yes - should be released sometime next year \n\nEdit - nevermind, poster that has been circulating is false. Sorry to get our hopes up",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Letstreehouse",
                                                                    "body": "Its cool. Got me happy for a moment. Feels good to be happy.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Oatmeal_Savage19",
                                                                            "body": "Truer words have never been written right now",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "terayonjf",
                                    "body": "It's all about actor contracts.  If they can lock in actors to shit level multi season contracts then if the show gets views they will do the show for the length of the contract.  It's when those contracts expire is when Netflix pulls the plug on a lot of shows because actors rates can explode and Netflix hates paying triple or more for an extra season knowing it's not going to be worth it regardless of views. It's why the number of shows that go beyond the original contract is so low",
                                    "score": 312,
                                    "replies": [
                                        {
                                            "author": "rctshack",
                                            "body": "Sometimes… but with shows like Santa Clarita Diet and 1899, they just cancelled the shows because Netflix didn’t want to move forward. I understand viewership matters, but at the very least let a show film enough episodes to end the series or discuss ways to make it economical to continue. Netflix is synonymous with just blindly cancelling shows that the show runners wanted to continue.",
                                            "score": 78,
                                            "replies": [
                                                {
                                                    "author": "audible_narrator",
                                                    "body": "1899 was such a good show. I'm still frosty about it being canceled.",
                                                    "score": 37,
                                                    "replies": [
                                                        {
                                                            "author": "rctshack",
                                                            "body": "It kills me knowing that Netflix doesn’t really mass advertise its less well known IP’s, so unless the story/book is already well known, or the showrunner or star is super famous… then the shows need to organically create an audience and do it within a few months or it will be on the chopping block. 1899 is a prime example of a show most people didn’t even know existed and it got the chop within months of its first season coming out. It was just set up for failure on a service like Netflix that has 50+ shows and movies releasing a year. I still hold out hope that divine intervention allows Netflix to sell off some of its IP’s it didn’t care to keep investing in and other streamers are allowed to pick up where they left off. Highly doubtful, but I can dream I guess.",
                                                            "score": 25,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "gnilradleahcim",
                                                            "body": "Yessss. Still makes me sad when I think of it or see it listed somewhere. They earned their dues with Dark, they should have MINIMUM got a s2 and then they could evaluate and decide if they want to keep it going. \n\nHaven't seen anything like the way they used different languages in that series, I thought it was brilliant and the story was utterly engrossing. \n\nHas to do with the \"second screen\" nonsense philosophy. The full English dub was probably terrible, and so the average 12 year old who threw it on probably hated it and turned it off. It's not a show you can understand/follow if you aren't paying attention.",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "HisFaithRestored",
                                                                    "body": "I can never understand the whole \"second screen\" thing. How does anyone take anything in from a movie or show without actively watching it? If I'm playing a game or doing work or whatever and my focus is not on the show, I'll have no idea what happened in it.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "gnilradleahcim",
                                                                            "body": "That's what YouTube is for lol. I like throwing something random on for white noise if I don't want music, but I think it's crazy for a production company to be aspiring to create content that fills that void. That should be what they're trying to avoid at all costs. Why would they want to be daytime TV? I think it's just an excuse to cut costs etc. Make content for the lowest common denominator which just happens to be the cheapest content with the worst / cheapest writing and the actors.",
                                                                            "score": 8,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Shigeko_Kageyama",
                                                                            "body": "It depends on what's on. If it's something with a lot of visuals then no, you don't know what's happening. If it's something like a documentary with a lot of narrating it's just like being in school. You read while the teacher talks but you still get a good grade because your brain put the information away properly.",
                                                                            "score": 6,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "agnisflugen",
                                                                            "body": "I don't get the \"second screen\" thing either...when I'm watching something I really want to immerse myself in it. Even if there's a gap in the dialogue or action there's always something interesting to take in...an item on the desk, pictures on the wall, stuff on the shelf for example. Some set designer picked out those items for a reason...all of it, even the tiniest detail is telling a story. I'm interested in that. There's a ton of thought and planning that goes into filming, camera placement, lighting, music selection...I want to take all that in as the director intended.\n\nHaving said that I recognize I may be the minority and Netflix is all about making moneys so they are going to cater to a demographic that engages with their media in a multi tasking sort of way.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "YoungBockRKO",
                                                                            "body": "My wife does this with EVERY show, yet somehow manages to pick things up more than myself. She says it’s got something to do with her ADHD. She just needs to listen to what’s going on and she’ll only miss the visuals when it’s silent. \n\nDrives me nuts that she’s playing a game on her phone the entire show but somehow can then predict what’s going to happen or have much more accurate theories on the ending than myself. \n\nSome people are just wired differently, crazy shit.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Viperbunny",
                                                            "body": "Same! I want to know where it was going!",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "RndmAvngr",
                                                            "body": "Dark is one for my favorite shows ever. Was waiting till after the holidays that year to binge 1899 and those asshats canceled it. So now I'm like, do I watch this shit knowing it's gonna end on an unresolved cliffhanger? Or just re-watch dark?",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "CK_1976",
                                                            "body": "I will consider putting Elon back on the good list if he finances production for the remaining two seasons.",
                                                            "score": -8,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "runnerofshadows",
                                                    "body": "Even a Netflix original finale movie would be better than just ending on cliffhangers.",
                                                    "score": 9,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Suitable-Name",
                                                    "body": "Viewership matters... If you're getting more expensive every year, whole quality drops more and more, while those shows, people like, get dropped after two seasons, because they cost too much... yeah, you've lost another subscriber.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "the_peppers",
                                                    "body": ">Netflix is synonymous with just blindly cancelling shows that the show runners wanted to continue.\n\nThis is the truly damaging aspect of the situation they've landed themselves in. \n\nNetflix movies already had a reputation as direct-to-video slop, now their original dramas are tainted by the constant cancellation threat that this algo-above-all approach has created.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BearCubDan",
                                                    "body": "What would it cost to create an animated finale should Netflix pull a Netflix as Netflix is wont to do?\n\nEven if we had to suffer with quasi-Timothy Olyphant and faux-Drew Barrymore voice actors, couldn't they wrap up Santa Clarita Diet that way? Can we demand, at the very least, a guaranteed animated finale before we invest in any new show?\n\n**Mr. Ball Legs Lovers Assemble!!**",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Miamime",
                                            "body": "It is not “all about” actor contracts.\n\nNetflix tracks all sorts of data because you are willingly giving it to them. How long does it take a person to finish an episode/season? How long does it take people to see the show has been released to start it? How many people click the like it button at the end? What percentage click don’t like?\n\nThey also track all sorts of online data. How many people are talking about the show on social media? How many people are searching it? How many blogs, etc are talking about it? What are people writing?\n\nThere are of course considerations of cost. Shows like Sense8 were filming all over the world. Others are costly because they use a lot of CGI. They will keep making a show if the above indicators are good, but if they’re bad or just so so, they’ll move on. There’s shows like Mindhunter where all the data is good, the press is good, and they cancel because they just can’t get actor/director production schedules to align; when a show is popular they want to strike while the iron is hot but if it takes three years to make a season (ahem, Stranger Things), they’ll release the actors from their contracts. \n\nThey give these reasons often when a show gets cancelled. The fact of the matter is, a lot of shows are well-liked but only a small number of people are watching them and they’re not sharing their interest/love enough online.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "aurorasearching",
                                                    "body": "I usually won’t even bother with Netflix originals if they don’t have a couple of seasons already unless it sounds really really good to me. I don’t want to waste my time on a show that has 5 episodes and no ending.",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Flincher14",
                                                    "body": "It might be difficult to detect long term viewer metrics when no one trust the completion of a series anymore. How many people now wait for the full release.\n\nHow many people hear about a show that had an amazing 3rd season from others then decide to start watching the whole show.\n\nThe problem going on is the absolute metric ton of shit half finished shows. There is no reason to invest time into them. Especially when Netflix has the most expensive subscription fee around.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "GeoHog713",
                                                            "body": "I wont even start a series until the second season is out",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Suitable-Name",
                                                    "body": "Yeah, push out something new, fuck quality. Quality got worse and worse since the own productions of Netflix, while the price went higher and higher. Canceling the subscription really wasn't a loss. At least not for me.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sleepbud",
                                            "body": "That’s the thing, when the contracts expire and the actors/actresses gained more value from being cheap nobodies to being household names, Netflix isn’t gonna wanna pay that triple/quadruple on additional seasons that a percentage of a percentage of their members are gonna watch. It’s a percentage of members watching seasons 1 through X until that contract runs out with each season dropping more viewers as more investment is needed to watch it and know the backstories and character dynamics. Very rarely this will be in the positive but an example is Stranger Things. That pulled me as a non-viewer to watch it and binge all the way to completion because all the hype around it finally got me to give in. Unfortunately, not all series are Stranger Things level quality on all production fronts and end up losing Netflix money.",
                                            "score": 40,
                                            "replies": [
                                                {
                                                    "author": "TheCh0rt",
                                                    "body": "I’m not sure about that. Maybe. I work in film music and have worked on many Netflix productions and they pay very well. Some of my highest paying clients who are all happy to match my rates and also do a lot of productions with union orchestras — something only big studios normally do. So they’re willing to pay out a lot of royalties. Many streaming services do as well, like Disney+ which does a lot of union music production. So they’re willing to keep contracts open indefinitely.\n\nEven after shows are cancelled they will be paying those union contracts.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "flybypost",
                                                            "body": "> I’m not sure about that.\n\nThere's been a few reports about why Netflix cancels a series after about two seasons:\n\nhttps://deadline.com/2019/03/netflix-tv-series-cancellations-strategy-one-day-at-a-time-1202576297/\n\n> Instead, Netflix’s deals include bump/bonuses after each season that are getting progressively bigger. While the payments are relatively modest after Season 1 and a little bigger after Season 2, I hear they escalate after Season 3, especially for series owned by Netflix — sometimes from hundreds of thousands to millions of dollars — as the studio starts to pay off the shows’ back-end. For series from outside studios, which I hear cost about 20% more than their Netflix-produced counterparts, I hear the built-in payment increases do not skyrocket as much but still are bigger after Season 3, Season 4 and beyond.\n\nThere's also something about actors' contracts having (automatically?) significantly higher rates after season 2 for why cost increase a lot. I think it has something to do with union contracts and how that works.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MakinBac0n_Pancakes",
                                            "body": "It's like baseball. Netflix is the minor league for actors.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "audible_narrator",
                                                    "body": "snort. You're not wrong",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AbyssBreaker28",
                                            "body": "Is this what happened to Marco Polo's cancellation?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DinoRoman",
                                            "body": "And someone who actually works in Film I can tell you the truth is because if a show isn’t binged that’s when they cancel. shows that get binged straight through are the ones that they deemed addictive enough to come back Netflix is one of the only few streaming services left that releases the full season in one swoop if that season isn’t binged watched they don’t see it necessary to make more",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Remarkable-Host405",
                                                    "body": "Fuck Amazon",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TurtleKwitty",
                                            "body": "If they had a setup where shows get two seasons by default/or one if it's meant as a standalone, and they can decide whether they want a third ahead of time so we can at least get some fucking closure on these shows rather than no one I know wanting to ever watch their shows because they aren't going to finish them anyways .... \n\nMake contracts for two seasons, if the show is a hit to warrant a third then great they can renegotiate, if it's not then great we get shows with a finale so watchers can start wanting to watch their shows",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "SchmeatDealer",
                                            "body": "netflix has openly stated that they cancel shows after 2 seasons because new shows drive up resubscription numbers when announced, but that keeping the show running is too expensive. \n\n  \nweird how they cant learn anything from the success of stranger things",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Former_Foundation_74",
                                    "body": "Kaos. The show is Kaos and I'm still salty they cancelled it",
                                    "score": 84,
                                    "replies": [
                                        {
                                            "author": "selfmotivator",
                                            "body": "I remember watching the first episode. It was soo different from their usual trash. I immediately told myself \"They're 100% gonna cancel this\". The bastards!",
                                            "score": 37,
                                            "replies": [
                                                {
                                                    "author": "rctshack",
                                                    "body": "Nail on the head, Netflix only keeps shows with extreme mass appeal going… which makes sense on paper… but also keeps any shows that are different and uniquely focused from continuing. This is the overall problem with entertainment/art, the numbers now 100% dictate everything so only generic shows that appeal to 100% of people will survive… which will get stale and repetitive.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Bobblefighterman",
                                            "body": "I had to convince my gf that the cat is still ok",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "GinnyS80",
                                            "body": "I loved Kaos !!",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "hunbakercookies",
                                            "body": "I loved it so much :(",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "londonschmundon",
                                            "body": "My older kid (graduated college, not a child) is salty too. A lot of people were salty about it being cancelled; an even greater amount of people never watched it and didn't care. It's all about the metrics, baby.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Bimlouhay83",
                                            "body": "God DAMNIT",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Prof_Acorn",
                                            "body": "OA",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sleepypossumster",
                                    "body": "Still mad about GLOW and Mindhunter (yes, I know, that was more of a Fincher thing, I guess)...",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "phillyfanjd1",
                                            "body": "Can't forget The OA!",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "Opening-Abrocoma4210",
                                            "body": "Glow was a covid thing as well. Seemingly the scripts etc were all written and they’d already started s4, which if anything makes it sorer. Release the scripts!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jess_S13",
                                    "body": "Be careful what you wish for with Netflix shows. I loved the first season of Altered Carbon, I would also happily get a concussion if I could ensure it would make me forget they ever made a season 2.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "sachimi21",
                                            "body": "This. I don't think Joel Kinnamon is a particularly great actor, but DAMN he killed it in Altered Carbon. Anthony Mackie just did not do the character justice after that. He might be the better actor between the two, but this was not the project for him.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "lewisfrancis",
                                            "body": "I remembered being disappointed with season 2, but rewatched both recently and this time around I was quite happy with it.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Freakin_A",
                                            "body": "The books are quite good, and a screen adaptation is always going to struggle to capture a story where the main concept is that your consciousness is all that matters. I’d definitely recommend them if you liked S1. \n\nThe first two audio books on audible are good (if that is your thing), but the third (narrated by Dufris) is absolutely awful and caused me to cancel my audible membership after I wasted a credit on it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MonkeyBreath66",
                                    "body": "Wall Street doesn't give a shit what viewers like. They're about meeting earnings targets and growth.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "appleturnover",
                                            "body": "You would think they should… since that’s exactly how they make money.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MonkeyBreath66",
                                                    "body": "Not if making the second season doesn't meet their metrics.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "appleturnover",
                                                            "body": "Then the viewers don’t like it enough..?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "MonkeyBreath66",
                                                                    "body": "It doesn't matter how many people like a show if a second season isn't projected to meet certain revenue or growth it's not going to get renewed. Like game studios cancelling sequels.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "MonkeyBreath66",
                                                                    "body": "Not enough viewers or viewers of the right demographic don't like it.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "NotYourScratchMonkey",
                                    "body": "One thing I heard is the main litmus test Netflix uses when deciding to renew or cancel a series is how many people watched the entire season.  For example, if their data shows a lot of people tuned into episode one (and now the show is a \"hit\" and there is buzz\") but most of those people don't actually watch all the episodes of that season, Netflix will cancel the show.\n\nIf most people watch all the episodes, they renew it.  Or if enough people do.\n\nNetflix has data on every show you watch, how long you watch it, if you fast forward through parts, if you rewind and re-watch parts of shows, if you re-watch shows, etc... they know exactly how you, specifically, are consuming their service.  I'm sure, mostly, they aren't looking at YOUR specific habits but I would be pretty sure they have all sorts of amalgamations of data to reveal what people watch on the platform.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Cultural-Ambition211",
                                    "body": "They were likely dropped for the same reason as this post. \n\nThey didn’t get enough views to make it worthwhile making a further season.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "bllueace",
                                            "body": "That's the issue with modern shows, you can't expect season 1 to gain crazy numbers. You need to give it time to gather a following. At this point they just need to fully move to mini series model. Am sick of there not being a conclusion to best shows and waiting for 2+ years for the follow up season.",
                                            "score": 48,
                                            "replies": []
                                        },
                                        {
                                            "author": "Duck8Quack",
                                            "body": "A lot has to do with how their contracts are structured.  Usually it’s season 4 that they start having to increase salaries and payments to creators.\n\nPersonally, I think Netflix is often short sighted and churns out a ton of low quality slop while canceling quality shows that could stay in their catalogue forever gaining viewers and fans.  They have a history of paying well known creatives top dollar for their worst ideas.  \n\nAnd while things are going well now, things can change fast.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "tenniskidaaron1",
                                                    "body": "I believe it's after season 8 which allows SAG actors to renegotiate contracts.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Exact-Switch-363",
                                                    "body": "Ie. Kevin Spacey and House of Cards.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Esqulax",
                                    "body": "I actually read an article about this!  \nSerialised shows on network TV were usually released 1 episode per week, intertwined with other shows, news ads etc. \nWhen that is being shown, the team are already working on filming/editing/writing future episodes - So it was like.. well, a normal-ish job. You were contracted for 22 episodes, so you knew that you'd have work for that time. Once all your filming/editing is done and you have 3 or 4 in the bank, the showrunners approach the network to see if they are renewing for another season. If so, Awesome. They'll probably have a break of a few months to get stuff sorted, but they've secured their jobs for the time being, plus all the sets are already built - Might need a bit of a set dressing update, but the room and 4th-wall facing couch is already there.  \nIn that scenario, the network can monitor the success of the show and base their decision on that.  \n\nNowadays, with streaming services - Theres no need to be vying for a timeslot on a channel. The streaming company can be all like 'Yeah, just get it all made before September, and we're golden'  \nSome DO get released weekly, but many don't anymore - they drop the whole season so it can be binged - I also read a comment where someone mentions that not everyone has the time to binge, especially if each episode is an hour or more, which is fair which could skew the watch stats, but I don't know about that.  \n\nThe issue with this is that by the time the editing gets done, subtitles translated and all that, a lot of the people involved (actors, VFX companies and film crew for example) have moved on to other projects, and getting them all back to film another season a year or so after the first one can sometimes be logistically impossible.\nYou'll notice this when shows have a much higher production value vs shows that were still being worked on a few weeks before release. This results in a show needing more money, which in turn reflects how much they'd need from the streaming service, which will then comes down to profitability.  \n\nAll that being said, I'm stoked for the next season of Wednesday, but disappointed that there will be no more Kaos. (Jeff Goldblum as Zeus? I mean... just that alone is gold, and throw in Killian Scotts incredible music... Daaamnn!)",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Head_Haunter",
                                    "body": "Yeah, a lot of people would. \n\nBut a lot of those people don't unsubscribe. And when the next big show/movie with various big name actor comes out, we go flocking in to watch just to find out it's a bad show/movie... and then content creators go and make a crapton of videos on why the new content was bad.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "dagnammit44",
                                    "body": "Netflix has a lot of stuff, but holy crap is there a lot of trash on there.  Their documentaries are a joke and the \"facts\" used in a lot are just very unreliable.\n\nAnd as you say, the stuff that is good they don't end up renewing.  \n\nI hate trying to find something to watch when i'm bored.  There's so much choice and i can end up turning off something 1/4 of the way through as it's so bad.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Donny_Krugerson",
                                    "body": "The Peripheral.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "folstar",
                                    "body": "The dumb reason is that streaming bosses have used box-office-type metrics for years—an \"Opening weekend\" mentality in a service expressly catering to people watching at their convenience. Like many things, it's a mind-numbingly stupid holdover from the old ways.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "I_love_sloths_69",
                                    "body": "Archive 81.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Hot_Raccoon_565",
                                    "body": "When you get to season 2 you have to start giving benefits to your crew such as vacation days, sick days, holiday pay, etc. many shows get cut because the studios don’t want to pay these expenses to crew. \n\nSource: am grip",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Oberon_Swanson",
                                    "body": "If Netflix announced they had a \"complete finish policy\" going forward where any existing show that was getting canceled had something like 25% of the show's current run time to wrap it up that would be so killer. So say there was a 24 episode show they decided not to renew, they would be given a six episode season to wrap things up. Or at least be told going i to to final season that it was going to be the ending. Imagine if they had a library of shows where everything had some some of satisfying conclusion.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ninjababe23",
                                    "body": "Everything sucks",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "kingofthesofas",
                                    "body": "> I would have preferred season 2's or whatever for like 3 shows that were great but they dropped it for some dumb reason\n\nscavengers reign",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ALLST6R",
                            "body": "**Netflix:** We gotta lot of subscribers. We gotta entertain them.\n\n*drops $320mill*\n\n**Netflix:** ARE YOU NOT ENTERTAINED?!\n\n**Subscribers:** A little bit\n\n**Netflix:** THEY ARE ENTERTAINED. RAISE THE SUBSCRIPTION\n\n*drops subscription price increase*\n\nRinse and repeat",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "BearCubDan",
                                    "body": "But they might cancel and take their business to Amazon Prime Video...\n\nHAHAHAHAHAHAHAHAHAHA!!!!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "OinkMcOink",
                            "body": "Maintaining subs was the business model when they were gaining momentum. The current plan is to attract new subs, because study shows that when you join, you usually stay. Part of the tactics is to attract those that haven't join the bandwagon yet by making least popular TV shows that's not great in quality but might attract those on the fence. That's why when Netflix was a kid growing, there was a ton of quality shows, now quality shows are needles in a haystack.\n\nSource: [Land of the Giants](https://podcasts.voxmedia.com/show/land-of-the-giants)",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "Bheks",
                            "body": "So many people were so sure that they would crumble when they started hiking prices and introducing an ad tier. \n\nThey had teams of people do the cost analysis and it was clear that they would make way more money with the price hikes coupled with ad rev. On top of it they still had a bunch more countries they could see growth.\n\n$3 billion in revenue a month plus ad revenue just leads to ridiculous numbers.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "spirit-bear1",
                            "body": "They don’t have to make you like all their content, each person just has to like only enough to make them want to watch something once a month.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Jlt42000",
                            "body": "I got a gym membership in October and have been twice. Thanks for the reminder lol.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Actual_Hyena3394",
                            "body": "I hope it had worked better if they made better content.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "MaybeTheDoctor",
                                    "body": "But that would cost $400,000,000",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -43,
                                    "replies": [
                                        {
                                            "author": "Hermanthe1eyedGerman",
                                            "body": "The majority aren’t upset content that features lgbtq topics, just assholes are.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "Space-Dementia",
                                                    "body": "It's not about being upset, it's about being relatable. If it's not relatable to the majority of your audience people aren't going to watch it.",
                                                    "score": -23,
                                                    "replies": [
                                                        {
                                                            "author": "CryptographerIll3813",
                                                            "body": "The highest grossing movies of all time list would disagree with you. This might be the stupidest comment ever.",
                                                            "score": 9,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Hermanthe1eyedGerman",
                                                            "body": "Yeah you know how all those people don’t watch super hero movies because they’re not super heroes. It’s just not relatable. Same thing with action movies, I can’t even begin to watch one because I’ve never been in a shoot out. And don’t even get me started on Harry Potter or Lord of the Rings or Game of Thrones. They are all so in-relatable no one ever watched them.",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "NotMadDisappointed",
                                                                    "body": "Ok I agree, but! \n\nIf I’m watching say a romance, I would probably be rooting for and putting myself in the shoes of the me-like character. For better or worse that means the straight male in a boring old male-female romance. If there isn’t one e.g. because the leads are both male, then that is one enjoyable element of watching a romance that isn’t present. \n\n\nI’ll no doubt still pick a favourite, enjoy the film and maybe get a little distracted from the main storyline worrying about logistics like stubble on stubble issues. What if one guy has curly stubble? Can there be Velcro? \n\n\nAnyway, of course a variety of sexual orientations within all genres of film need to exist, or the element I said could be missing for me in my example, would always be missing for someone. No single type should entirely drown out any other.",
                                                                    "score": -8,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Space-Dementia",
                                                                    "body": "The things mentioned there were made a long time ago, like Harry Potter and Lord of the Rings (my favourite movies), before this problem started happening. There are a whole swathe of modern superhero movies that are unrelatable nonsense, or something like Rings of Power is a great example of a total trainwreck.",
                                                                    "score": -21,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Hermanthe1eyedGerman",
                                                                            "body": "The top 10 box office movies last year in order were about\n1. Talking emotions\n2. Super heroes \n3. A girl who the ocean picked to help a god defeat a lava monster\n4. Little yellow alien dudes\n5. A witch\n6. A talking lion\n7. A sci-fi universe with giant sand worms\n8. A 400 ft tall lizard\n9. A talking panda that does king fu\n10. A talking hedgehog that runs really fast. \n\nI don’t think the fact the Harry Potter came out twenty years ago has anything to do with your point. People like movies that interest them and allow them to suspend disbelief and get wrapped up in the movie. It doesn’t have to directly relate to people to be engrossing to them.",
                                                                            "score": 20,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "candymaster4300",
                                                    "body": "Normal people don’t want to see homosexual sex. They should at least put a specific warning before such programming, so people can choose to not watch it",
                                                    "score": -33,
                                                    "replies": [
                                                        {
                                                            "author": "Hermanthe1eyedGerman",
                                                            "body": "There’s not gay porn on Netflix…",
                                                            "score": 14,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "powdered_dognut",
                                                            "body": "You have a remote in your hand and eyelids. If you don't want to watch something, change the channel or close your eyes.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "throwawayzies1234567",
                                                                    "body": "This is a pretty disingenuous response, since it is well known that only like 6% of the world is LGBTQ+. I don’t even agree with the guy you’re responding to, but this comment seems purposefully obtuse. My country elected a facist because half the country didn’t want to hear about trans people anymore. I think you know full well that your comment does not reflect reality.\n\nETA: also, there is totally a warning on any content that contains sexual themes.",
                                                                    "score": -8,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "numbersthen0987431",
                            "body": "Also, Netflix has an end goal to limit what they have to pay for rights to show content on their platform. Every Netflix show costs them nothing to show, since it's theirs to stream, and so they're just trying to build a catalogue of content that they don't have to pay for.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "guildedkriff",
                            "body": "They have historically focused on New subscribers, not maintaining Existing ones. This year is the first year they will not be reporting subscriptions in their Earnings Calls/releases because they’re shifting focus to bottom line growth (profit) instead of top line growth (gross revenue). Something they should have done years ago imo. \n\nFor additional context, over the last decade or so, investors valued streaming services (especially Netflix) on how much growth they had which was based on New Subscribers and New monthly content supports New Subscribers more than it supports Existing Subscribers. This is why marginally successful shows get the axe after 1-2 seasons instead of a full run like they’ve historically had pre-streaming. They didn’t bring in enough New subscribers to justify the expense and this has been an extremely common complaints form Existing subscribers. While shows like Stranger Things get a full run because they’ve been guaranteed to bring in subscribers every season. \n\nAdditionally, they’ve began to shift to cheaper to produced shows like Reality TV as well because they’re more profitable than other content due to production costs being substantially lower.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SilasX",
                            "body": "Haha yeah a while ago I had the shower thought that gyms are like Netflix for exercise equipment. The same accounting issues arise for deciding which equipment to buy, since it doesn’t directly translate to revenue.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ShakespearesHoratio",
                            "body": "Wait, is that a real gym stat??? Do roughly 67% of people who have a gym membership never go???",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BearCubDan",
                                    "body": "Gyms know they literally lack the space and equipment should a decent amount of their members all show up at any given time.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "John_Tacos",
                            "body": "One new movie isn’t going to keep subscribers.\n\n20 new series with a dozen episodes each will (as long as they don’t end on a cliffhanger after the first season)",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "robrt382",
                    "body": "Don't forget to factor in advertising and product placement revenues",
                    "score": 73,
                    "replies": [
                        {
                            "author": "AggravatingMud5224",
                            "body": "90%+ of Netflix revenue is from subscriptions. They make very little money from the advertising tier comparatively",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "robrt382",
                                    "body": "It's about $2 billion a year though ",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "MobileArtist1371",
                                            "body": "So advertising alone can make 6 of these movies each year\n\n\"very little\" is funny. Ya in the grand scheme of things for Netflix it is, but it's a massive amount of money that you can't just ignore.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "superdupergasat",
                                    "body": "But advertisement and product placement is a good way to cut costs of a movie budget; they dont pay the whole cost of the movie budgets that way.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Icy-Mortgage8742",
                                    "body": "not literal ads, but product placement within the movie or tv show. A zoom in on a particular car brand, everyone using Microsoft Surface laptops, everyone drinking a particular tea, etc.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Icy-Mortgage8742",
                                    "body": "not literal ads, but product placement within the movie or tv show. A zoom in on a particular car brand, everyone using Microsoft Surface laptops, everyone drinking a particular tea, etc.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zorbacles",
                    "body": "Per month. So that's 36 billion per year. \n\nNo need for media costs. No distribution costs and in all honesty doesn't matter if people watch it",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Attic81",
                            "body": "There are distribution costs... they must pay a hefty amount for resilient and fast cloud services but I'm sure it's not as much as shipping goods worldwide would be.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "reddithenry",
                                    "body": "bandwidth costs are significant... cloud infra is not cheap either, and they also deploy custom hardware to big ISPs as a cache for their content to try to reduce bandwidth costs, which cant be cheap either",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "toddthefrog",
                                            "body": "They’re VERY cheap compared to bandwidth.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Ghigs",
                                                    "body": "Netflix is big enough they don't really pay for bandwidth per se.  They ship their own servers to the ISPs directly that put them inside the ISP networks.  When you watch Netflix it's not coming from Netflix, it's coming from inside your ISP.\n\nhttps://openconnect.netflix.com/en/\n\nAnyway none of this infrastructure is free for Netflix to maintain, but at the same time, they really aren't paying anyway for literal bandwidth.  If an ISP doesn't get openconnect appliances they are going to probably do settlement-free peering (neither side pays).\n\nIt boils down to, once you are big enough, the ISPs don't want to charge you for bandwidth, they want an arrangement that avoids needing external bandwidth in the first place.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "reddithenry",
                                                            "body": "That's what I was hinting at above - I think this only works at a certain scale, and there is still content distribution from central servers rather than edge only?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ghigs",
                                                                    "body": "Yeah but Netflix is big enough that even if they don't get the CDN in they can get settlement free peering with most big ISPs.  \n\nBasically the ISPs need Netflix as much as Netflix needs the ISPs.  If an ISP played hardball instead of working with Netflix, Netflix can just say \"let's see how your customers like not being able to watch netflix\".",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "reddithenry",
                                                    "body": "I realise, but still.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ok_Confection_10",
                                    "body": "I’m sure they also pay licensing fees to host third party shows and movies that they don’t own",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "professor-i-borg",
                                    "body": "Video streaming infrastructure is some of the most expensive to run, there’s a reason you don’t see too much competition from smaller companies or startups.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "NaturalSelectorX",
                                            "body": "The reason you don't see too much competition is licensing costs. Everybody wants their own exclusive content or big money to carry their content. Netflix spends most of their money on licensing and marketing.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Tratiq",
                    "body": "Welcome to Reddit where basically multiplication or division is a super power lol",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Unable_To_Forward",
                    "body": "....and the actual monthly subscription (at least in the US) is at least double that.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "hunbakercookies",
                    "body": "Then I am double pissed that they cancelled Kaos and Santa Clarita Diet. Jerks.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "spdelope",
                    "body": "$10 is way too low, bob",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Costyyy",
                            "body": "Poorer countries have quite low subscription prices",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "LanceShiro",
                                    "body": "I pay $10 per month in Mauritius for ad-free.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "MAValphaWasTaken",
                                            "body": "I prepaid $80 for a year in the US, although that's still with ads. (Thanks, Verizon.) That's under $7/month.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Objective_Slide2807",
                                    "body": "Can confirm, the Premium plan in South Africa is like $11 if you convert.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "KaleRevolutionary795",
                    "body": "So the math works out perfectly. And that's not even counting they own the ip now so the show could be published over any network later as well. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RedScud",
                    "body": "Revenue, not profit, how about all the costs? If netflix has been raising prices and adding Ads to lower subscription tiers, that doesn't tell a tale of healthy finances. I've cancelled mine now, third price increase in two years, they can fuck right off",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "myverygoodusername12",
                    "body": "I wonder what the cost breakdown is for subscribers who get “free” Netflix via their cell phone plan or other bundle. Surely TMobile is getting a huge discount to offer it as a perk to their customers which likely lowers the Netflix average subscription cost down while also increasing subscribers",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KanadianLogik",
                    "body": "The real question is how the fuck did that movie cost over 300 million to make? Chris Pratt's wig looks like it was bought at a dollar store.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vashoom",
                    "body": "If you count all subscribers for this though, wouldn't you be comparing it against the budget of procuring all their content, not just one program?\n\nI think OP's question still stands.  $320 million is an absurdly high budget even for a traditional film release in theaters.  Even a super popular and successful one.  That's Infinity War / Endgame budget.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "beerleaguecaptain",
                    "body": "There's a documentary on creative accounting where a movie can gross 700 million and lose money like when they said avatar 2 won't make money.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EVOSexyBeast",
                    "body": "They’re a public company, you can just look up their revenues. \n\nTheir revenue for December of 2024 was $10.25B.\n\n$1.87B of that was net income.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kirklennon",
                            "body": "> Their revenue for December of 2024 was $10.25B.\n\nDid you ask some LLM and it just made up an answer? Their annual revenue for 2024 was $39 billion. Operating income for the year was $10.4 billion.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "stigsstupidcousin",
                    "body": "Last year they got 39 billion in revenue.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Remote_Independent50",
                    "body": "So they should stop producing anything for a year, and pay off their massive debt.  They haven't made anything good in years anyway",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KettlebellDan",
                    "body": "Exactly! With over 300 million paid subscribers, Netflix has a massive monthly revenue stream. That $3 billion a month gives them the financial flexibility to invest in big-budget movies without worrying too much about direct box office returns. The real goal might not be just recouping costs, but increasing user engagement, attracting new subscribers, and keeping current ones happy with fresh content",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Castod28183",
                    "body": "Not to mention, they don't need to gain 32 million subscribers to recoup that $320,000,000. They just need to gain 2.6 million subscribers that keep their account for 1 year. \n\nSeeing as the gained 18.9 million subscribers in Q4 2024 alone, that doesn't seem like a far-reaching goal.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IronSeagull",
                    "body": "The thing is though, not sure about Netflix but some streamers do put their better movies out in theaters. That leaves the impression that the ones that don’t get theatrical releases are on par with a straight to DVD release of the past. They also miss out on buzz from a theatrical release not to mention the money. \n\nThe reality is many of these movies just aren’t very good and people mainly watch them because they’re included with the monthly fee.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "muchnnessa",
                    "body": "They're essentially buying giant billboards that say \"ONLY ON NETFLIX\" to keep subscribers hooked longer than cancellation thoughts last.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Thecravenkingmad",
                    "body": "Fraud is the answer. On top of them paying top billings to people and having to pay staff as well. If I remember correctly they always operate in the red",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "oldfoundations",
                    "body": "Ya, Netflix made 8.7 bill in PROFIT last year. More than enough to make a movie for 320 mill. More than enough considering they don’t pay dividends",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Interesting_Pen_8030",
                    "body": "I have Netflix free from tmobile",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Bronze_Bomber",
                    "body": "Still dumb and a really bad business decision. If you want content you don't dump it into a single shitty movie that nobody cares about.",
                    "score": -28,
                    "replies": [
                        {
                            "author": "Thin_Ad6414",
                            "body": "Yeah you’re right, you know more than the $500 billion dollar company. Netflix needs to take notes from you.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Thin_Ad6414",
                                            "body": "You alright buddy? I’m not sure if you know how business works, but Netflix and any corporation of that size would have a team of advisors constantly researching and analyzing to see what’s working for them and what’s not. You don’t get to be a $500 billion dollar company without having that.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "urumqi_circles",
                                    "body": "You say this sarcastically, but it can actually be true that the consumer \"knows more\" than the \"successful company\". \"The free market\" will tell us if this is true in due time.  Just look at Blockbuster, Sears, Blackberry, etc.\n\nWhat worked once, might not always work.  So while spending $320M on a movie to \"retain subscribers\" might have worked a decade ago, this \"business model\" might end up failing in the long run.  Consumers like the previous commentator might give a good 'market indication' that people are tiring of this sort of behaviour from Netflix.",
                                    "score": -27,
                                    "replies": [
                                        {
                                            "author": "CapitalNatureSmoke",
                                            "body": "I’m not sure what your point is here.\n\nSure, the market could change such that it becomes a bad idea some time in the future. But then they could just stop making such big productions at that point.\n\nWhat bearing does that have on whether it is a good business decision today?",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "candymaster4300",
                                    "body": "Netflix has its own agenda. It seems to be a bit different to customers desires. They will pay for it in the long run.\n\nConsider how much homosexuality they push on their majority normal customer base",
                                    "score": -32,
                                    "replies": [
                                        {
                                            "author": "somehiguy",
                                            "body": "just cancel your sub and quit worrying about it? why are u even here?",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "RobertKerans",
                                            "body": "> Consider how much homosexuality they push on their majority normal customer base\n\nThere isn't that much & if you're specifically being recommended lqbqt stuff, that's based on your viewing preferences, which kinda raises a few questions re. what you keep posting here. You seem pretty worried and disgusted about depictions of gay sex in particular, but you ain't going to get recommended content specifically dealing with that unless",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "toddthefrog",
                                            "body": "I always laugh at comments like yours because I mentally replace the homosexuality with inanimate objects like a toaster.  They push too many toasters on us.\n\nAlso you’re an inanimate object.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "kyriebelle",
                                            "body": "You…don’t have to watch it?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Concise_Pirate",
            "body": "That's about 3 days revenue for Netflix.\n\nThe theory is that these special products *retain* users, getting them to keep paying Netflix's even-rising subscription fee instead of cancelling.",
            "score": 590,
            "replies": [
                {
                    "author": "Rex_Digsdale",
                    "body": "Whenever Netflix raises their fee I cancel for a month or two and get another streaming service.",
                    "score": 68,
                    "replies": [
                        {
                            "author": "pm-me-nothing-okay",
                            "body": "by your wording, it suggests you do come back and end up paying the new prices anyways.",
                            "score": 144,
                            "replies": [
                                {
                                    "author": "Nydus87",
                                    "body": "Not sure if Netflix does this or not, but with services like Hulu and Max, you should definitely cancel every couple months because you'll get the emails a little while later saying \"Come back for $2.99 a month for three months!\"     \nI binge netflix in bursts to avoid paying for it all year round.   I'll binge watch my comfort shows that they still have, cancel my membership for another six months, and then come back when I need my fix.",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "TYGRDez",
                                            "body": "I used to pirate all of my media before streaming services were a thing, stopped for quite a few years because Netflix was so convenient, slowly subscribed to more and more services to watch what I wanted, watched the prices increase for all of them... and then cancelled all my subscriptions and went back to pirating everything because I was tired of getting nickel-and-dimed 🙃",
                                            "score": 50,
                                            "replies": [
                                                {
                                                    "author": "Mr_Quackums",
                                                    "body": "Cable sucked so people pirated.\n\nNetflix was easier than pirating so people stopped pirating and went to streaming.\n\nNow streaming is worse than cable was (standard cable packages have on-demand viewing and most TVs have built-in ways to save shows to watch later).  What do you think people are going to start doing?",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "TYGRDez",
                                                            "body": "Nobody wants to build a reasonably priced streaming service that has everything I would possibly want to watch on one app?\n\n[Fine, I'll do it myself.](https://www.plex.tv/)",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "BloodiedBlues",
                                                            "body": "Piracy isn't a pricing issue, it's a service issue. -Gabe Newell",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LukarWarrior",
                                            "body": "Yeah, I did the same thing with ISPs until AT&T offered me a \"lifetime\" contract at my promo rate (basically I can keep that rate for as long as I live at that address). Take Spectrum's one-year promo rate, then swap to AT&T, and repeat never having to pay full price for the service.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Nydus87",
                                                    "body": "Xfinity has a near monopoly in my city. Once the fiber guys get more coverage here, I'm guessing XFinity is going to start hemorrhaging customers.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "5litergasbubble",
                                                    "body": "I managed to cut my internet bill by over 50% just by lying to my company that their competitor offered me a better deal. I was paying 95 bucks a month through shaw, and told them that telus was going to offer me a plan for 60 bucks. So they offered me a 2 year deal at 45 bucks a month and a 150 dollar bill credit. Telus had never even contacted me at that point",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LynJo1204",
                                            "body": "I've done BET+ free trial like three times now. I just binge what I want in the 10 days they allow and then cancel. Wait about three months, go back and do the same thing all over again.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "NoCardio_",
                                    "body": "Way to stick it to the man, lol.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ptb4life",
                                    "body": "But he skipped 2 or so payments. So his yearly out of pocket is equal or less",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DeDodgingEse",
                            "body": "I'm so proud of you",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "405freeway",
                            "body": "You should only have 1 subscription at a time. You sign up, don't autorenew, then when it expires decide if you want to renew or switch to a different service",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "armoured_bobandi",
                                    "body": "Okay? And what about wanting to watch programs that aren't on the streaming service you currently have?\n\nI grew up with digital cable. $40 a month is nothing compared to what it used to cost for a sliver of what is available now",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "405freeway",
                                            "body": "Wait a month.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "armoured_bobandi",
                                                    "body": "Why? I'm an adult, I can afford it. I have multiple people in the same home that watch TV\n\nJust because something works for you doesn't make it a universal truth.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CumStayneBlayne",
                            "body": "🫴🍪",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Traditional_Betty",
            "body": "One thing that stuns me about Netflix movies is at the very end, during the credits, they have like 10 minutes worth of \"and here's the team that translated it into Spanish and here's the team that translated it into Portugese and here's the team that translated it into…\" Language after language after language after language. I think something about this relates to the economics of it. They have a global reach.",
            "score": 158,
            "replies": [
                {
                    "author": "Evening-Cricket",
                    "body": "heaps of other films are dubbed in to many different languages but you only get the dubbing credits on the cuts for those regions so I actually think this is netflix saving money and not redoing the credits for each region not sure if they do more languages then is typically of other studios though",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Pdxmtg",
                    "body": "I worked for a localization firm that did some work for Netflix. In the US, those folks are making $20 an hour, and one person can do a movie in less than a day. If they get the labor outside the US I’m sure it’s way cheaper.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "flingebunt",
            "body": "Netflix adds 6 million subscribers every month, and remember most of them stay around for more than a month. If all of them pay for the basic service with adds at $7.99 and stay with Netflix for 12 months, that would be over $500 Million. So yes, the economics adds up very well. \n\nRemember, Netflix has a range of subscription prices, so they can earn more than that. Plus they have to stop people from unsubscribing and joining other platforms, so they need something and compelling each month to keep on going. So they are trying to retain their current 300 million subscribers who are pumping at least $28 billion into the company every year. \n\nPlus, there is the old Hollywood accounting tricks. You can make profit on something with the project not actually making a profit. The company pays other companies that they own or the management team own or are shareholders in, so that the company can lose money but the people in charge make money.",
            "score": 454,
            "replies": [
                {
                    "author": "Evening-Cat-7546",
                    "body": "My favorite thing to do with streaming services is every 6-9 months I go through the cancellation process. Almost every time they offer me a free month to stay. Jokes on them because I wasn’t really going to leave in the first place.",
                    "score": 127,
                    "replies": [
                        {
                            "author": "flingebunt",
                            "body": "And if you do go through the process, you can just rejoin after trying another service for a while. Doesn't really impact on their $28 Billion in annual revenue though.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "Evening-Cat-7546",
                                    "body": "Tbh, I actually don’t pay for streaming services anymore. I had Max for Dune series and some nights were practically unwatchable due to the server lag. That was the day that I decided paying for streaming was bullshit. I hacked a firestick for free streaming. I have an app that looks like Netflix, but pulls all the free links for you. Movies, TV, live TV, live sports, and porn. The only downside is you can’t watch shows the day they come out. Usually takes a day for someone to upload it.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "IAmABonobo",
                                            "body": "Interesting! Can you share info on how to hack a firestick?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "SealtielH",
                                                    "body": "r/FireStickHacks",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Evening-Cat-7546",
                                                            "body": "Best me to it lol",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Minotaur830",
                            "body": ">Jokes on them because I wasn’t really going to leave in the first place.\n\nIs the joke really on them? 😅",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "yepitsatyhrowaway2",
                            "body": "my favorite thing to do with streaming services is laugh at people who pay for them  \n  \nI set up a 64TB media server with a larger library than Netflix (easy to do when you only need 1 language supported) Now I dont have to worry about price hikes, surprise removals, feature loss, late additions, ads, or any of that nonsense ever again.\n\n🏴‍☠️ - \"the seas may be treacherous, but they are bountiful\"",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "B3owul7",
                                    "body": "So what was the cost of setting up a 64 TB media server? You paid like thousands of dollar for the setup.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "yepitsatyhrowaway2",
                                            "body": "I detailed it in another reply in this chain, but yeah I spent a little and now I am saving a ton",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "um_wtfisgoingon",
                                            "body": "Can set up like 10TB (which is still a fuck ton of space) and a mini PC for like $300",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "um_wtfisgoingon",
                                            "body": "r/Plex",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "SexySmexxy",
                                            "body": ">ou paid like thousands of dollar for the setup.\n\nfor some hard drives what/?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Kirk_Kerman",
                                            "body": "You can get disk drives for about a penny per GB, so you could get 64TB of disk for less than a grand. Netflix at the standard tier runs you $18/mo, which will outprice the media server after 5 years, but with the media server you immediately have full ownership of the media instead of losing it when you cancel Netflix. Also, it's not just Netflix. Disney+? That's $16/mo. Prime Video? $15/mo. Apple+? $10/mo.\n\nWith only the most popular streaming services, the media server breaks even after less than 18 months, on top of never losing access to any content. If you're big into streaming content and have any technical affinity it's certainly cheaper.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Stormdude127",
                                    "body": "When you say media server, does that mean you just predownloaded a bunch of movies and shows onto your hard drives and then it serves that media to your devices?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "yepitsatyhrowaway2",
                                            "body": "Well basically thats it, but with a few more steps.  \n  \nHead over to r/selfhosted if you are really interested. I use a combo of the \\*arr stack, qbittorrent, ombi and Jellyfin to serve content. \n\nEverything gets custom theming using CSS so mine looks much different than the demos, but here is a demo for the Ombi - which is how users request content.  \n[https://app.ombi.io/discover](https://app.ombi.io/discover)  \nusername: beta  \npass: (leave empty)\n\nHere is a jellyfin demo - how users watch content   \n(again mine looks much different, but functions the same.)  \n[https://demo.jellyfin.org/stable/web/#/home.html](https://demo.jellyfin.org/stable/web/#/home.html)  \nusername: demo  \npass: (leave empty)",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "WolvReigns222016",
                                            "body": "Yeh, Plex and Jellyfin are the popular options.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Guh_Meh",
                                    "body": "~~I set up a 64TB media server with a larger library than Netflix (easy to do when you only need 1 language supported) Now I dont have to worry about price hikes, surprise removals, feature loss, late additions, ads, or any of that nonsense ever again.~~ I am poor.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "yepitsatyhrowaway2",
                                            "body": "So am I bro, thats why I did it.   \n  \nI used old pc's + refurbed drives and upgraded when I was able to. My friends and family started pitching in when they ditched their subscriptions and now we are sitting pretty. If everyone had kept all their subs for all these years we would have spent way more and had nothing to show for it. ($25/month  = $300/yr for JUST NETFLIX for 1 person)   \n  \nI had netflix for 10+ years, so thats almost $3k I spent on just netflix alone, now add in my friends and family for that same period and it could easily be over $20k. Just for **Netflix**! I am sure they paid for other services too! So yes it looks like alot, but in the grand scheme of things this pc cost me $1200 - 10 years ago and I have spent around $700 on drives over the years. So $1900 in all - for total freedom from the greedy corporate fucks that slurp our data, enshittify their services and raise our prices in return.\n\nNow I pay $5/month for a usenet acct and maybe $6/month on electricity and have been doing that for almost 5 years now, it is a much better deal IMO",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "medisherphol",
                                                    "body": "Only 2 more years and you'll start saving more than what it costs to build and run your server!",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Bagelator",
                                                    "body": "How is the company producing stuff greedy? They use money that they earn to create content to earn more money. They provide a service and it is voluntary to pay for it. You're the greedy one here - thinking that you're entitled to steal every piece of media in the world for free. Miss me with that shit rationale",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Agreeable-Fill6188",
                            "body": "Idk how, they just let me cancel",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "KaraPuppers",
                            "body": "I do it for the signup bonuses.  I had an account on a site when they offered a signup that was a package for more than what I had for less than I was paying.  Asked them if I could just switch to that and they told me to piss off.  Canceled, made a new account \"ImNotKaraPuppers\", got free month and all bonuses.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Longjumping-Box5691",
                            "body": "I just use the old high seas to begin with.\n\nOnce they started with commercials for the product I was paying for.. get fucked I'm outta here",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "EvaSirkowski",
                            "body": "This is the way.\n\nBut I keep thinking one day they'll introduce a cancelling fee.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LongLonMan",
            "body": "I worked for a FAANG streamer a couple years ago (have extensive experience with all the major industry providers, content creators, platforms, etc). The reason you spend money making original content (as opposed to license content, which Netflix does both) is to have unique enough content (content that you can’t find anywhere else) so that keeps subscriptions from lapsing and ad inventory CPMs high. High engagement (MAU, HPC) means the customer perceives value and does not leave the service and advertisers having to make ad buys because they can’t reach a Netflix MAU anywhere else.\n\nYour question now is the wrong perception, it’s not how Netflix is going to get paid back for the cost of content (it generates revenue through subscriptions and ad revenue), it’s how much content do they have to make, how much it costs, and the right portfolio to keep the existing subscriber metrics consistent, lapses down, and new subscriber count up. Original content also means that Netflix has some pricing power if they ever want to tweak pricing and/or play with ad frequency on their ad model.\n\nThis is the exact reason why just 10 years ago, Netflix was mostly licensed content, such as Disney, Marvel, The Office, etc and they pivoted to original content such as House of Cards, Stranger Things, etc. Netflix knew that eventually if they didn’t start creating their own content, the business would collapse as licensing got quickly pulled in favor of new streamers such as Disney+, Peacock, etc.\n\nSeparately, you typically have a portfolio of content, there’s your expensive high budget flagship movies and series and then there’s your cheaper reality tv like content to round it out.\n\nFun fact: What I remember about Netflix is that they are the one of very few services that don’t spend on any advertising for user acquisition, they are a behemoth and even without advertising, customers expect that they are only 1-2 clicks away from opening the app on any platform (FireTV, Roku, Chromecast, AppleTV, etc). The only other service I know with this much power is YouTube. YouTube is easily the most watched service in the entire world and Netflix is second.",
            "score": 113,
            "replies": [
                {
                    "author": "l34sh",
                    "body": "This is the correct answer.\n\nTo add some more complexity on top of this, internally there are ways (read: statistics mumbo jumbo) to attribute retention/growth metrics (and by extension revenue) to individual content performance (engagement). \n\nYou measure and make decisions on what you can actively move, which are called leading indicators (like how many users watched this content in its first week of release, how many users completed the content, how much content did you release in a month, subscription prices etc.) which is correlated with stuff that you can measure but cannot actively influence, called lagging indicators (new subscriptions, cancellations, retention).\n\nThis is why Netflix is so aggressive with cancelling shows. These leading indicators tell them that the show isn't \"worth the investment\" - it's a system that is meant to work as an aggregate, over a large period of time.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "2xpubliccompanyCAE",
                    "body": "Best answer so far. Everyone else is doing the monthly arithmetic and saying that’s the answer.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "SavlonWorshipper",
                    "body": "High-budget flagship movies should at least make some cultural impact or have enduring value. \"The Irishman\" and \"All Quiet on the Western Front\" aren't perfect movies, but they will always have tangible value. With Rebel Moon they are at least trying to establish their own space opera.\n\n\nThe weird disconnect is when they spend a lot of money to make movies that have very little scope to be particularly relevant or enduring even if they are well made. \"The Grey Man\", \"Red Notice\", \"Lift\"... for hundreds of millions of dollars, Netflix get two hours of fairly forgettable content in fairly crowded genres. Even if they succeed, where does it get Netflix? I won't be researching any of them 5 or 10 years didn't the line. I could well watch a sequel, but they will cost even more for Netflix! It's lose-lose.\n\n\nFar better to make more stuff that might be unicorns, like Squid Game or Stranger things, or continued support for very good shows that haven't captured the public yet (for instance Santa Clarita Diet, Happy, I'm Not Okay With This\"), and for films do more low-medium budget and keep big budgets for films that might attain some sort of legacy.\n\n\nHell, if the spent that 320 million dollars on a first season for three shows, even if the shows weren't great Netflix would have denied their competitors 30 hours of screen time, rather than 2 or 3.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "MoonlightHarpy",
                            "body": ">High-budget flagship movies should at least make some cultural impact or have enduring value.\n\nWhy, though? The person above explained how Netflix model works and not much of it relies on cultural impact. It surely doesn't hurt, but still. The movies you listed - Gray Man, Red Notice and so on - are among the most watched Netflix movies of all time. The genre might be crowded, but those project rose above the crowd. So where's the lose here?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thicckar",
                    "body": "This sounds like such a cool field",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LongLonMan",
                            "body": "Definitely an interesting and complex one, had a fun time experiencing the ups and downs during Covid",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jamintime",
                    "body": "> it generates revenue through subscriptions and ad revenue\n\nDoes Netflix make a significant amount of ad revenue? How?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LongLonMan",
                            "body": "Netflix’s ad tier subscription, has about 70M subscribers on this cohort. They likely have a high CPM ($40-60) with their unique reach. They prob make a materially significant amount from ad revenue.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TravisJungroth",
                    "body": ">What I remember about Netflix is that they are the one of very few services that don’t spend on any advertising for user acquisition\n\nThey advertise shows, billboards for example. I imagine they find that more effective than straight up \"Buy Netflix\" advertising.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PackOfWildCorndogs",
                    "body": "This was super interesting to read, great explanation",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LowDownTrebleSeeker",
                    "body": "This is the correct answer",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Taliesin_AU",
            "body": "Its why your monthly subscription keeps going up.",
            "score": 70,
            "replies": [
                {
                    "author": "six_six",
                    "body": "People should just subscribe for a month and watch things they want to instead of leaving it subscribed month after month.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "muchnnessa",
                    "body": "They're not trying to recoup costs on day one. Subscribers pay month after month for quality content that keeps them hooked!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "urumqi_circles",
                    "body": "Surely they aren't making $320,000,000 in increased subscriptions, just for this one movie.",
                    "score": -27,
                    "replies": [
                        {
                            "author": "A1sauc3d",
                            "body": "Netflix has way more subscribers than you may realize, 277 million people subscribed and the average revenue per user is $11.64* per month, so over $3.2 billion in subscription revenue a month to play with and make content. So that movie only cost like a tenth of their monthly revenue from subscriptions.\n\n (My math is rough, if you want an exact breakdown of the financial side of their business you can read about it here https://www.muvi.com/blogs/how-does-netflix-make-money/)\n\nBut Netflix provides a service to users who expect new content. It’s not just about getting that many new subscribers, it’s also about fulfilling their duty and keeping their current subscribers happy and satisfied so they stay subscribed. Big blockbuster-esque movies like The Electric State with big name actors and broad appeal do just that. Doesn’t matter if critics or Redditors think it’s a good film, it just needs to entertain the average Netflix subscriber enough to make them feel good about paying X dollars per month for the service. For that they need a consistent drip feed of new content. And occasionally they need some big splurges like this. Netflix is the dominant streaming platform for a reason. They know what they’re doing, despite how much shit Reddit talks about them and their original content lol.",
                            "score": 35,
                            "replies": []
                        },
                        {
                            "author": "macaroni_ho",
                            "body": "You’re looking at it the wrong way. This works specifically BECAUSE they don’t just release in a theater. Netflix is a content library whose income is comprised of monthly fees, not pay per view like theater releases. As long as the flow of money brought in from all subscribers all year is larger than the money spent to create and license all content that year, then they are positive. They can choose to blow a giant chunk of that budget on creating one movie or they can create a lot of smaller shows, or they can license more catalogues from other sources. As long as the overall platform is retaining subscribers then they kind of have complete freedom in producing content from all of that subscriber money flowing in.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Jussttjustin",
                            "body": "You aren't looking at this on a macro enough level. It isn't about the return on one piece of content.\n\nNetflix has an estimated \"original content\" budget of $18 billion for 2025. \n\nWhether then do $300m x 60 series/movies, or $30m x 600 series/movies, or somewhere in between, that $18 billion is going to be spent with the intent of creating the most robust library of streaming content out there to beat out competitors like Disney+, Hulu, HBO, etc for your subscription dollars.\n\nThey wouldn't do it if they didn't think they needed to in order to increase profits.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Roar_Intention",
                            "body": "They don't need to bring in 32,000,000 new accounts, they are trying to maintain that many accounts.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "urumqi_circles",
                                    "body": "Seems like there's gotta be a better and cheaper way to do this than spend $320M on a botched movie.",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "author": "A1sauc3d",
                                            "body": "Just because the critics and Redditors didn’t like it doesn’t mean it flopped. It’s got a 75% audience score. Thats 3/4 people (who leave rotten tomato reviews) that liked the movie. The average viewer doesn’t care what critics or Redditors think. Hell, the average Netflix viewer doesn’t even KNOW what critics and Redditors think. They just see a new movie pop up on their Netflix homepage and sit down to watch it with the fam. And as a fun adventure film to watch with your family and make you feel good about keeping your subscription, I bet the electric state succeeded. Your average viewer liked it. Your average viewer is also not comparing it with the source material or reading other people’s reviews. There’s a reason Netflix doesn’t display any reviews/ratings on their app lol. It’s so their subscribers are shielded from outside influence. I don’t like that at all, I personally wanna see the reviews, but I’m guessing it helps with people’s overall satisfaction with the content, because it doesn’t sour the experience before it even starts.\n\nYou seem to be asking your question in somewhat bad faith. You *really* want the answer to be that Netflix is run by idiots and is flushing hundreds of million dollars down the drain on worthless content. But that’s not remotely the case. There’s a reason Redditors/critics aren’t the ones running a half trillion dollar company ;) If they only put out content by your standards it wouldn’t be nearly as successful. They bring in over $3 billion a month and keep growing more subscribers year by year. They know what they’re doing.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "urumqi_circles",
                                                    "body": ">You seem to be asking your question in somewhat bad faith. You *really* want the answer to be that Netflix is run by idiots and is flushing hundreds of million dollars down the drain on worthless content. \n\nClose.  I actually just think it's excessive money laundering, with kickbacks to friends of executives.\n\n$320M is a fucking ridiculous amount of money on a movie that will have no lasting cultural impact.",
                                                    "score": -16,
                                                    "replies": [
                                                        {
                                                            "author": "Ok-Interaction-3788",
                                                            "body": "Is the same true for all expensive movies, or just the ones you don't like?",
                                                            "score": 11,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "curtcolt95",
                                                            "body": "lol the classic reddit \"money laundering\" that makes absolutely no sense and isn't how it ever works",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ZenithRepairman",
                                                            "body": "You really didn’t like this movie, huh?\n\nIt’s not money laundering or kickbacks. \n\nNetflix has to pay the big actors more money, because there are no backend points on the box office. \n\nNormally, instead of paying Chris Pratt or Millie Bobby Brown $50m for the role, they might pay $20, and then offer points on the back end - Pratt and brown would then only get more money if the movie makes money. Since there’s no box office, they have to throw more money at them. And throwing money at bankable big names ensures people will watch the movie, good or bad.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Maleficent_Task_329",
                                            "body": "Oh, so your question is really, “why did they make a movie I don’t like?”",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "BalooBot",
                                            "body": "They pump out a lot of shitty \"filler\" content too, but they need some high quality block busters for people to justify their monthly payments",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "literallyacactus",
                                            "body": "They make a ton of other content at all price points including for international markets. Consider the bigger picture of a massive number of existing subs, Netflix revenues, and that just bc you don’t like the film a thousand others did. Don’t event have to like it btw just a view is good enough for the Flix",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Roar_Intention",
                                            "body": "If you have a better more profitable way to do what they do, you should get in contact with them.  They would probably pay you well if you are going to make them millions of dollars.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "jonasshoop",
                                            "body": "Every blockbuster movie Netflix makes is going to cost them more due to there being no backend residuals for the creators. Netflix wants top talent. Top talent wants to get paid and get a percent of gross sales and residuals in licensing. With Netflix there is neither of those, so Netflix has to pay more up front. They wanted the Russo Brothers and paid for them.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Turbulent-Stretch881",
                            "body": "You’re very “1 is to 1” in your assessments.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "nokvok",
                            "body": "They also need to retain their subscribers, you cannot just expect them to stay with no investment on your side.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Bilboswaggings19",
                            "body": "That is the thing though\n\nThey can subsidize expensive productions with the low budget stuff\n\nThe benefit of a subscription platform like this is that they don't have to make money back on everything",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jManYoHee",
            "body": "They need to continue having new content for people to watch to keep existing subscribers. And beause it's a subscription, it's monthly cash flow.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Wild-Wolverine-860",
            "body": "Why does op think 32million signups are required to recoup costs?\n\nMy figured will be wrong but actually as a visualisation.\n\nLet's say netflix has 300m subscribers and brings in 200m a month\nThat's 2400m a year\n200m on admin and advertising\n200m in projected profits \nThat leaves 2000m for buying/producing films documentrys shows etc.\nMortgage of the money is going in smaller budget things but the odd blockbuster is good advertising, helps keep subscribers, get people talking etc.\nAll companies have loss leaders Costco sell millions of rotisserie chickens at a loss to get you in, supermarkets sell lots of stuff at a loss.\nCadalac is joining F1, it's not going to het those 100ms back in tech for cars, but advertising, changing car reputation, pride, so it's all good for GM share price they hope.",
            "score": 3,
            "replies": []
        },
        {
            "author": "WasterDave",
            "body": "Netflix continues to exist because their subscribers watch it. So, if it were me, I would ascribe an actual dollar value to \"viewer hours\" and use that as guidance. They probably do something a tad more complicated in practice.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Ta-veren-",
            "body": "Why are you focused on new accounts?",
            "score": 9,
            "replies": []
        },
        {
            "author": "Spiritual-Matters",
            "body": "It’s a bit risky imo, but movie theaters have a lot of overhead costs that Netflix doesn’t.\n\nThey’re not paying exclusively for new subs, they’re also trying to keep their current base entertained.\n\nI personally think that’s way too much for a movie that not everyone will like. There’s a lot of movies or shows that could’ve been made with that.",
            "score": 6,
            "replies": [
                {
                    "author": "alphaDsony",
                    "body": "Yeah but what is the harm in releasing it in the cinema first for literally just a month, cash in a few millions before releasing it in the streaming service,",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Spiritual-Matters",
                            "body": "The Reddit post from that would probably be, “I spend $20/mo on Netflix and they release in theaters instead?! What’s the point of this stupid subscription if I’m just gonna have to go to the movies anyway? No one wants to talk about a movie months after they were hyped 😡”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Karfedix_of_Pain",
            "body": "> How can Netflix spend $320,000,000 on a movie without it being released in theatres for any chance to earn the money back? \n\nNetflix has over 300 million subscribers paying $8+ USD/month.  That gives them $2.4 billion USD/month at a very, very conservative guesstimate.  They can certainly afford to blow a few million on a new movie.\n\n> Surely they can't expect to bring in 32,000,000 new account signups to recoup the cost? What's going on here?\n\nIt's not about luring-in new subscribers, it's about keeping the old ones.  You need a hefty catalog to keep people around.  With a few exceptions, folks aren't routinely re-watching the same show over and over and over again.  Most shows/movies are a one-time watch.  So then you need something new to watch.  If you ever start running out of new stuff to watch on Netflix you start eying their competitors.  Maybe Hulu or Max has something you want to watch.  Maybe you cancel Netflix and switch over to one of them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Knightfires",
            "body": "Still angry they thought it was too expensive to make more seasons out of Altered Carbon. And now spending money left and right for shitty content.",
            "score": 3,
            "replies": []
        },
        {
            "author": "hartstyler",
            "body": "They will just raise the price of existing users",
            "score": 3,
            "replies": []
        },
        {
            "author": "MyMonte87",
            "body": "Also that movie becomes their property to rent out to other platforms, TV channels etc. for the next 50 years.",
            "score": 3,
            "replies": []
        },
        {
            "author": "WillingLeague",
            "body": "Instead of 320,000,000 for 1 movie, I think I’d rather see 20 different movies with a $16,000,000 budget, imagine how many unknown directors,cinematographers,set designers, actors, writers composers would be revealed.",
            "score": 3,
            "replies": []
        },
        {
            "author": "UnstableConstruction",
            "body": "It's not about getting new customers, it's about keeping your current customers and about future revenue from selling the rights.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SamuraiJustice",
            "body": "Netflix is so big it's essentially socializing entertainment. The income from all subscriptions helps fund new content. New content is designed to keep you subscribed. But like all governments it needs an ever expanding base to continue to grow.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GoldenEagle828677",
            "body": "They need to create exclusive content to keep current subscribers. \n\nAfter they are running it for awhile, they will likely sell the broadcast rights to someone else.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Skull8Ranger",
            "body": "In 2024, their operating income was over 10 billion - helped along by 19 million paid ads... not all subscriptions are ad free anymore",
            "score": 3,
            "replies": []
        },
        {
            "author": "BiggsDiesAtTheEnd",
            "body": "The up front cost is huge but they maintain the rights forever with no license fees. When they first opened and within the first 5 years licensing fees were exponentially increasing. Not only do they pay zero for this but making their own content gives them leverage in licensing negotiations.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MalaysiaTeacher",
            "body": "You don't need new subscribers. You just need to keep existing ones.",
            "score": 3,
            "replies": []
        },
        {
            "author": "rkie58",
            "body": "My wife and I are drawn toward “limited series” where you can have multiple seasons, but each season is a different story. Think Slow Horses, CB Strike, White Lotus, Reacher. If it gets cancelled, you can still watch a complete “show” and not have that horrible unfulfilled cliffhanger getting in the way of a good watch.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SmashesIt",
            "body": "You pay a monthly subscription until you cancel. They don't need new subscribers they need you to keep paying them every month.",
            "score": 3,
            "replies": []
        },
        {
            "author": "herqleez",
            "body": "Ads\n\nTax write-off",
            "score": 3,
            "replies": []
        },
        {
            "author": "OctoMatter",
            "body": "The main reasons are already mentioned, just wanted to add that they will eventually license that movie to TV channels, markets where they don't operate or for Blue Ray distribution.",
            "score": 5,
            "replies": []
        },
        {
            "author": "llynglas",
            "body": "Such an awful movie.  I love scifi, but this was just slow  confusing and boring.",
            "score": 4,
            "replies": []
        },
        {
            "author": "belowthesaleprice",
            "body": "I asked this question many years ago when they spent $8 BILLION! in one year on content.  I learned my lesson.  Let Netflix do what Netflix does.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Miliean",
            "body": "You saw \"new account sign ups\" but that's not what they are looking at.  They are more so looking at retention of existing accounts.\n\nWhen netflix makes it's own content, they own it forever, they can show it forever.  Subscribers want content, they want new content and they want old content that they haven't seen.  Netflix now has this movie to show them forever and ever.",
            "score": 2,
            "replies": []
        },
        {
            "author": "iPuffOnCrabs",
            "body": "How did this movie cost more than fucking DUNE 2",
            "score": 2,
            "replies": []
        },
        {
            "author": "reddit455",
            "body": ">What's going on here?\n\nmathematics.\n\n\n\nThe streamer’s ad tier, which saw membership grow by almost 30% quarter over quarter, will now cost $7.99 a month.\n\n[https://www.marketingbrew.com/stories/2025/01/22/netflix-clearing-300-million-subscribers-plans-another-price-hike](https://www.marketingbrew.com/stories/2025/01/22/netflix-clearing-300-million-subscribers-plans-another-price-hike)\n\n  \nThe streamer added nearly 19 million new subscribers in the final quarter of 2024.\n\n\n\n>Surely they can't expect to bring in 32,000,000\n\n19,000,000 \\* 7.99 *(minimum)*\n\n\n\n>released in theatres\n\nthat's not for money. \n\nit's to make the movie eligible for an Academy Award.\n\nneeds to run for X days in certain markets.\n\n[https://www.oscars.org/oscars/rules-eligibility](https://www.oscars.org/oscars/rules-eligibility)\n\n\n\n> this question is about The Electric State.\n\nthey're probably not submitting it for an Oscar to begin with. theatrical release not important at all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BigMax",
            "body": "It's not just about new subscribers, right?\n\nYou're paying money every single month.  They have to keep existing subscribers too.  So even if they never signed another new customer, they'd still spend a lot on new content to retain the old ones.\n\nAlso - a movie like that adds to the catalog, so even after it's first week, it's still going to get views.  For weeks, months, years.  \n\nNot the same in viewership obviously, but the money they spent on Stranger Things season 1 is still making them money, right?  People are still watching the first season, years later.\n\nSo this movie is for new people, existing people, and to keep people watching down the line too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sensei888",
            "body": "Netflix is a meat grinder content machine that needs to be constantly fed. They don't care, mostly, about the quality of the series/films they produce as long as they have regular \"events\" that can bring people to the platform or keep existing customers subscribed. Then those contents are forgotten a couple of weeks later.\n\nIn the age of binging entire series on a single weekend, how can you constantly keep people interested without offering something new all the time? That explains the quality of some of that content...",
            "score": 2,
            "replies": [
                {
                    "author": "Mac_Jomes",
                    "body": "Netflix used to make high quality content because they could take their time and be selective of the projects they wanted to fund since they had a stacked library of content that people already loved. So it didn't matter if Netflix only released a handful of originals for the year because they had a massive library to fall back on. \n\n\nNow that library has thinned considerably and I think the only networks they have a reliable deal with is the CW and AMC. The rest have packed up their shit and taken it to their own streaming platform. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "throw123454321purple",
            "body": "Don’t call me “Shirley,” OP.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kind-Pop-7205",
            "body": "Most people don't subscribe for only one month, and they'll own this content forever.",
            "score": 4,
            "replies": []
        },
        {
            "author": "scientician85",
            "body": "I'll electrify *your* state. >:(",
            "score": 3,
            "replies": []
        },
        {
            "author": "Large-Investment-381",
            "body": "Let's get some data on this. Anyone have an article or information from a source?",
            "score": 4,
            "replies": []
        },
        {
            "author": "arroyoshark",
            "body": "You should know that when Netflix produces it's own content Netflix is paying itself to produce that content. A whole lot of that money stays *in house*, ya?",
            "score": 3,
            "replies": [
                {
                    "author": "mr_miggs",
                    "body": "That’s not quite how that works. They are paying for people and services to produce the movie. Some of those people might be Netflix employees, some may be contractors. But it is an expense.\n\n ",
                    "score": 4,
                    "replies": [
                        {
                            "author": "arroyoshark",
                            "body": "It's mostly true. Source: I've done 3 Netflix tv series, 2 mini series, 3 films. Of course they pay for services and employment and materials, but it's all literally in house.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Maxibag",
            "body": "All them lovely ads they introduced is going to make it so much easier for them to throw another 320 mill around for another shit truck a few times a year",
            "score": 2,
            "replies": []
        },
        {
            "author": "HydroPpar",
            "body": "That movie was dumb as shit too",
            "score": 2,
            "replies": []
        },
        {
            "author": "Slight-Marketing5406",
            "body": "To put it simply: The value of a catalogue of this magnitude is immeasurable. The EBITA of a film catalogue is between 12-18X, so when you look at the pure value of licensing revenue over the next 100 years, diversification factors, and even borrowing power… you see they have a financial behemoth on their hands.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoodDoctorB",
            "body": "Simple, the goal is not to gain anything new to begin with. You're thinking of this like an individual product rather then part of a larger service.\n\nMovies need to make back their own cost of production hence being released in theaters then on home video to double up on income. They are an individual product that while it might have crossover with parts of a franchise is a financial success or failure purely on it's own performance. \n\nNetflix however is a service so they don't need to bring in millions of new accounts with a film like this to make money. Instead they need hype that keeps the current audience interested so they don't cancel their service, if that happens the movie pays for itself and then some in a mere two months. Netflix already has around three hundred million subscribers paying $10 a month to have access to their library so two months of continued subscriptions paid from all those viewers. \n\nThe point is not to make enough money on it's own to be worth it but to keep enough attention that the library of content makes money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NewPower_Soul",
            "body": "No way did it cost that amount. How could it? It's just PR to attract new customers to Netflix.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CleanAxe",
            "body": "Big movie studios spend just as much if not more than that on major releases all the time. One of the biggest movie studios, Universal, grossed about $3billion for all of 2024. That includes a year with Wicked, Twisters, and Despicable me which probably cost about half a billion including marketing.\n\nNetflix makes that much money EVERY month. So it’s well within the size that it can afford to throw big money around just like the majors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mckenzie_keith",
            "body": "Good entertainment can generate revenue for decades. Netflix MUST maintain its portfolio of good entertainment if it hopes to survive because the days of Netflix being a filmed entertainment aggregator are over. HBO, paramount, disney, showtime, etc, etc all are trying to maintain their OWN streaming platforms and they are not inclined to share with Netflix. So, Netflix is basically a studio now and they have to make their own content.\n\nIf netflix stopped producing new content, or produced only mediocre content, they would cease to exist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JayTL",
            "body": "They don't care if a movie is good or bad...just that it gets seen.\n\nAnd there are people very very high up in Netflix who don't care if you've seen it or not, as long as you maintain your subscription.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Open_Mortgage_4645",
            "body": "You're not accounting for future profits. It's not a linear equation. They are able to make relatively accurate predictions of profits over time to determine if a particular program makes fiscal sense. It's not a perfect science, it involves some speculation just like the rest of the movie industry, but if they get it right then it's a profitable decision.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DepartmentNatural",
            "body": "https://youtu.be/HnXKE0nfAjI?si=cLRAKtRevEbI3NwY\n\nIt's all about merchandising! That's where the real money is",
            "score": 1,
            "replies": []
        },
        {
            "author": "i_really_h8_mondays",
            "body": "From what I hear, they are not doing that well actually. Production costs are massive, and the streaming infrastructure costs are probably insane",
            "score": 1,
            "replies": []
        },
        {
            "author": "thatdani",
            "body": "When you hear a number as the budget for a movie, that number isn't accounting for all the revenue streams it produces, such as:\n\n- product placement \n\n- merchandising options\n\n- cross-platform promotions\n\nAfter a quick google search, found this excerpt from [The Verge review](https://www.theverge.com/movie-reviews/629787/the-electric-state-review-netflix):\n\n> all this clunker of a movie really has to offer is nostalgic vibes and **groan-inducing product placement**.\n\nAlso what a coincidence that the designs are so quirky and cute, here's the merch link.\n\nEDIT. Actually, removed the merch link, no free shout-outs from me. You can just google it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "johnnyzli",
            "body": "And probably it's overinflated, no way that move cost more then 100 mil, good special effects but don't look that expensive",
            "score": 1,
            "replies": [
                {
                    "author": "lizzpop2003",
                    "body": "Because of the lack of box office, they can't make back-end deals for profit sharing for the directors and stars. This means they tend to pay more upfront for the talent involved. I believe the total spend also includes any attempts at advertising, though that is still minimal compared to other studios that don't disclose that amount at all. Still, 320 million is an insane number for what is, essentially, a forgettable sci-fi romp.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DragonFuelTanker",
            "body": "It got a 15% on RT lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "RajOfSiam",
            "body": "Here in India, the cheapest Netflix subscription plan starts from US$ 2.50 per month.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ABigFatPotatoPizza",
            "body": "Netflix has discovered that the main appeal of a streaming service isn't that you can watch old movies and shows on demand; viewers eventually get bored of rewatching the same things. It's having a consistent stream of new movies and shows that you can only watch on that service. Netflix exclusives are what keep viewers still subscribed, even if they aren't watching constantly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jcsamudio",
            "body": "They make a couple Billion, every month, on subscriptions alone. I'm dead serious, a couple Billion. Then there's ads, self-promotion, sponsorship, on and on. \n\nThey're making it rain. Technically they flipped the production script. Traditionally A movie is made, then its distributed to find an audience and make a profit. In Netflix case the distribution, audience and profit already exist...then they make the movie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arkyja",
            "body": "Why would it need new accounts? The people that are already subscriped bring pay just as much, and if yiu dont release new content for people they're gonna unsub",
            "score": 1,
            "replies": []
        },
        {
            "author": "JM3DlCl",
            "body": "I feel like all these streaming services only care about getting \"new\" subscribers over maintaining their base",
            "score": 1,
            "replies": []
        },
        {
            "author": "EconomyProcedure9",
            "body": "Still annoyed that Netflix seems to refuse to put more Stranger Things on DVD/Blu-Ray after season 2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImpressionOwn5487",
            "body": "I think no one correctly answered your question. You are asking about recoup cost. They don’t have to bring in new subscribers. First they have to make their subscribers stay, for that they invest in new content. And this way they expand their catalogue, even if people don’t watch it now they might subscribe to Netflix for it in the future",
            "score": 1,
            "replies": []
        },
        {
            "author": "newtoallofthis2",
            "body": "$350m on the film and $20 on the script. Always the way with Netflix films.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PsychoticMormon",
            "body": "Its not just sign ups, its generating enough \"value' that customers don't cancel. \n\nIf no new content is uploaded on a regular basis, or content that can be considered valuable their existing customer base will cancel at a higher rate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wishdog2049",
            "body": "In my city, the mayor and his friends keep building apartment complexes that mostly sit empty. How do they make money? They're the ones getting paid to build them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LookinAtTheFjord",
            "body": "That movie was paid for by subscriptions before it ever even got made.",
            "score": 1,
            "replies": []
        },
        {
            "author": "neck_iso",
            "body": "People going nuts explaining how they have the money ignoring the fact that the 320M figure is based on estimates.\n\nIt may very well be that it includes compensation due to directors and actors that may not occur if viewing numbers are sub-par.  It may not include tax write-offs if the thing bombs, etc.\n\nThe underlying point is of course valid, it is _very_ expensive, but take the number with a grain of salt as there is no confirmation of it anywhere that I can find.",
            "score": 1,
            "replies": []
        },
        {
            "author": "modrinihner",
            "body": "Have you ever seen The Producers? It’s like that",
            "score": 1,
            "replies": []
        },
        {
            "author": "loopuleasa",
            "body": "man you're bad at maths\n\na subscriber does not stay on netflix for just one month on average...\n\nit's multiple months",
            "score": 1,
            "replies": []
        },
        {
            "author": "JellicoAlpha_3_1",
            "body": "Yes\n\nThey can afford that\n\nThe problem they have is that they don't have a lot of solid movie producers working for them...so you end up with shit like the Electric State",
            "score": 1,
            "replies": []
        },
        {
            "author": "_i-cant-read_",
            "body": "It's Hollywood accounting.\n\nNothing about that number matches anything close to the actual money spent on the movie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rosarino356",
            "body": "It's more about retaining existing customers than onboarding new ones. You want to make sure you have enough content so people don't look elsewhere.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MenudoMenudo",
            "body": "If someone were so inclined, they could probably build a spreadsheet that gave a rough estimate of the value creation they expect.\n\nInputs would be:\n\n- Estimated number of subscribers from this project specifically.\n- Estimated average duration of each subscription\n- Estimated number of existing subscribers that are more likely to remain subscribers because they like this title\n- Estimated number of subscribers who expect periodic high quality exclusive films as part of their subscription, and then apply a discount to their future revenue.\n\nThen when you map out the NPV of all those expected revenue streams and compare it to the next alternative use of $320 Million, you get your answer. Business is almost always making estimates and educated guesses based on the best available data, but you're also not wrong - those numbers would need to be really high for the $320 Million to pencil out. I suspect the original budget was smaller, but sometimes paying the added costs of an overbudget project is \"cheaper\" than scrapping it once they've used up their budget.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical_Room5091",
            "body": "My guess is eventually Netflix will have a channel on TV that plays their shows on a schedule like traditional TV. They have so much content. Netflix also will rent and sell movies eventually. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "bearkerchiefton",
            "body": "It's a fat tax write off the industry lobbies to keep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "goldstat",
            "body": "Well, I don't know anything about how they can justify spending that much. Watching the movie, It wasn't bad and it honestly felt like they spent a lot of money on it",
            "score": 1,
            "replies": []
        },
        {
            "author": "galaxyapp",
            "body": "The million dollar question, what is the minimum effort required to retain a subscriber...\n\nBudgets are often inflated.  Binning a ton of fixed operations cost to the project just to get earned media exposure.  If they had not made the film, odds are their cash flow is not improved by 320million.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spookyjibe",
            "body": "Yes, they can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "old_qwfwq",
            "body": "Unrelated to the question but I watched that flick with my kids and it ruled. Exactly the kind of movie I loved as a kid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PastaRunner",
            "body": "It's more like user retention rather than user acquisition. If they don't generate new content people will leave their platform.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tmac_79",
            "body": "They know what subscriber view time earns them. Using made up round numbers in example.  Let's say the average subscriber pays $20 a month and watches 10 hours of content. That's $2 hour.  If they spend $100m on an hour long piece of content, they know they break even at 50m hours of watched time.\n\nWhen they greenlight a project, they can estimate how many people will watch and how much revenue they can attribute to it.\n\nIt gets more complicated when you consider that it's a subscription and the customer pays anyhow and would just watch something different if not that new expensive content.  So you probably gauge success by the watched time of the contentx along with whether the new content increased engagement for the platform overall.  Ie they watched more content, or more people were searching for it, etc. new subscribers would just be a small part of the calculation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Temporary_Tune5430",
            "body": "inflated tax write offs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Calm-Maintenance-878",
            "body": "It wasn’t a good movie for all that money😒",
            "score": 1,
            "replies": []
        },
        {
            "author": "HoosierHoser44",
            "body": "To add on what some have brought up, Netflix doesn’t have to pay for licensing for movies they made. Sure, making movies is expensive. But a catalog full of movies they don’t own the rights to is expensive too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spirited-Feed-9927",
            "body": "It's more than new subscribers.  They have to motivate current subscribers to stay with a stream of steady content.  So it plays into that equation as well.  Like hey look at the quality programming we are adding, please stay.\n\nI watched it by the way.  Not great.  Not bad.  Mainly a movie aimed at 8 year old kids.  It reminded me of a mix of Ready Player One and Real Steel (Hugh Jackman).  It was made for a young audience in mind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GinnyS80",
            "body": "I-zombie, good witch and many other sci-fi shows i really miss.\nWarehouse 13, Lost, manifest, umbrella academy, many others that i just can't remember the name of...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Business-Lock4411",
            "body": "There is an amortization strategy to this. Over years it much cheaper for Netflix to maintain its own content. It’s about having a lot of content forever. They are thinking long term of retaining that customer 10 years from now that will still watch electric state or whatever movie they fancy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CanadaSoonFree",
            "body": "They raised their subscription costs for stuff like this…no?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Incontinento",
            "body": "Is it any good?",
            "score": 1,
            "replies": []
        },
        {
            "author": "blind-octopus",
            "body": "What I've heard, and I don't know shit, is that Netflix has an advantage over other subscription services.\n\nApparently, other subscription services suffer from people subscribing to watch one show, then cancelling immediately after. On and off. But netflix somehow keeps people subscribed.\n\nSo I would guess Netflix wants to do everything it can to keep that advantage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwaway3113151",
            "body": "Think about it in terms of opportunity cost. If they don't spend 320M themselves, what are the other options to acquire content?\n\nAlso keep in mind that they will own global rights in perpetuity. It's not about a one-time hit. Rather it's about building a catalog of films for decades.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Critical-Ring3168",
            "body": "It's ridiculous how horrible Netflix movies are. I don't know if it's the directing, the script or the plot or just all but they are terrible. What happen to movies that were actually captivating?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substantial-Cow1088",
            "body": "A: The people running netflix are morons",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thermite1985",
            "body": "Netflix doesn't need to \"make that money back\" all it needs to do it maintain current customer base even at the ad tier, they're silly generating probably somewhere in the range of 60 billion per year.  Keep customers happy with new and exciting stuff the money keeps flowing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ay-foo",
            "body": "They have money coming out of their dickholes and need to have something exclusive on their platform",
            "score": 1,
            "replies": []
        },
        {
            "author": "connorgmac",
            "body": "Not satisfied with the product for the price tag tbh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Euphoric-Ferret7176",
            "body": "It’s simple math. \n\nNetflix says they have 361,063,000 global subscribers. Even if everyone only had the standard with ads plan, which they don’t, Netflix would be making almost $2.88 BILLION dollars a MONTH.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeavyDT",
            "body": "It's not just new accounts you have to worry about but maintaining what you have. Keeping the income you have coming in is just as important as new sign ups. Big names attached to big style movies does that. They will get thier money back even if the movie ie is crap people are talking about it and will at least try it for themselves. It keeps people paying amd watching.",
            "score": 1,
            "replies": []
        },
        {
            "author": "edwardniekirk",
            "body": "Netflix has about $13 billion in bond debt which it’s used to finance it’s library acquisition and productions.  Long-term I have no idea how Netflix expects to stay in business  as the initial success was based on being able to rent old movies people still wanted to see.",
            "score": 1,
            "replies": []
        },
        {
            "author": "70swerebetter",
            "body": "Omg! That movie cost $320,000,000 to produce! What! 🤯 I watched it over the weekend, it was not worth that kind of money!",
            "score": 1,
            "replies": []
        },
        {
            "author": "mortalcoil1",
            "body": "When I heard The Electric State cost $320 million my conspiracy theory brain went haywire.",
            "score": 1,
            "replies": []
        },
        {
            "author": "illgot",
            "body": "it's not about making the profit back in a single film, it's about building a library of content people will want to subscribe to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nofocusgiven",
            "body": "…. Money laundering is complicated",
            "score": 1,
            "replies": []
        },
        {
            "author": "Downfall_of_us_all",
            "body": "The real goal is not immediate box office returns but increasing their overall subscriber base and keeping current users engaged.The cost of production, in this case, is partly to build that brand, positioning Netflix as a leader in entertainment.\n\nSo, while it may seem like a risky move, Netflix is betting on long-term engagement, brand-building, and the power of exclusive content to justify those massive budgets. Even without the traditional box office revenue, they can still expect substantial returns through growing and retaining their global subscriber base.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedKing36",
            "body": "I walked into this thread and there's just dozens of \\[deleted\\] accounts and posts.\n\nWhat... what happened here?\n\nCome on, Blue, let's look for clues!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emeraldus999",
            "body": "I hope they didn't give Chris Pratt a big paycheck because the dude basically phoned his performance in. The robots were better actors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emeraldus999",
            "body": "I hope they didn't give Chris Pratt a big paycheck because the dude basically phoned his performance in. The robots were better actors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "megamanxzero35",
            "body": "I believe something that inflates these production costs is actors and directors can demand more money since there is no ability to get a percentage of the box office. Chris Pratt probably is paid less for being in Jurassic World or Guardians of the Galaxy but probably makes a chunk of money from box office. Can’t do that with Netflix so actors get paid more to make up for that and thus Netflix movies had giant budgets that seem out of whack with a typical Hollywood box office movie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snuzzyo",
            "body": "What happened here?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legitimate_Dare6684",
            "body": "I thought it was ok. This will be my answer to what movies did you like that no one else liked. Its a perfectly good movie. Idk.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Tradition8738",
            "body": "Money laundering",
            "score": 1,
            "replies": []
        },
        {
            "author": "-stefanos-",
            "body": "They do actually expect 32.000.000 new signups.\n\nHowever, they won't get these signups and they'll end up raising the subscription price again.\n\nProblem solved!",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Masterpiece-6026",
            "body": "Just canceled my Netflix.",
            "score": 1,
            "replies": [
                {
                    "author": "kloomoolk",
                    "body": "Political reasons?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "hanselpremium",
            "body": "can they at least buy a good script for that kind of money. most of their content is shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "kremlingrasso",
            "body": "I'm pretty sure all these balooning media (game/show/movie) production costs are some kind of accounting/finance scam. \n\nSalaries are down accross the board, talent being laid off and available in tens of thousands everywhere, CGI technology is more efficient, cheaper and quicker, countries are competing in tax cuts for media production, distribution channels are consolidating and getting leaner and shorter, AAA stars are eager and willing to taking smaller roles in TV...\n\nEverything pointing at production supposed to get cheaper and movies like Godzilla minus one or The Creator shows that it is actually true if you want it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkFaithlessness2652",
            "body": "How can one of the biggest ‘movie’ companies pay a lot of money.\n\nGood question. You can fill in your own answer.",
            "score": 0,
            "replies": []
        },
        {
            "author": "SeanLeeCuisine",
            "body": "Large scale money laundering is easy when your politicians are crooks",
            "score": 0,
            "replies": [
                {
                    "author": "Cebothegreat",
                    "body": "It’s also legal",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DiceRuinsBattlefield",
            "body": "this is swhy i pirate all of their stuff. i pay the rest of the services but will never pay for netflix.",
            "score": 0,
            "replies": []
        },
        {
            "author": "psychotic_samurai",
            "body": "Money laundering",
            "score": 0,
            "replies": []
        },
        {
            "author": "red_purple_red",
            "body": "The purpose of a system is what it does.",
            "score": 0,
            "replies": []
        },
        {
            "author": "baconslim",
            "body": "Money laundering",
            "score": -1,
            "replies": []
        },
        {
            "author": "paxbene",
            "body": "My understanding of Netflix is that it has become a tax break for the larger corporation that owns it. It is no longer creating content for the viewers: it is creating financial losses for the tax write off. We think it exists for us but that's not the case. This is why amazing content gets canceled.",
            "score": -1,
            "replies": []
        }
    ]
}