{
    "title": "Why was “bacon” such a meme in late 00s/early 10s",
    "author": "ybfelix",
    "subreddit": "NoStupidQuestions",
    "rank": 9,
    "score": 426,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 65,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1jdyob2/why_was_bacon_such_a_meme_in_late_00searly_10s/",
    "id": "1jdyob2",
    "selftext": "Speaking as a non-native, iirc there was a time when anything “bacon!”  automatically got upvotes on English webs, like you know, the “narwhal bacon”. It seeps into pop culture too, for example there was, of all things, a bacon camo for guns in Call of Duty Black Ops. This seems had mostly died down, but why did it became a fad in the first place.",
    "comments": [
        {
            "author": "milk16",
            "body": "Epic mealtime  helped.",
            "score": 536,
            "replies": [
                {
                    "author": "cwryoo21",
                    "body": "In my social circle this was THE reason bacon was a meme lol. Bacon strips and bacon strips and bacon strips and bacon strips",
                    "score": 169,
                    "replies": [
                        {
                            "author": "thankdrugsforgod2",
                            "body": "and \"gay bacon strips\" for sour rainbow gummies!",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "GyrKestrel",
                                    "body": "I still call them gay bacon strips to this day.",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dry_System9339",
            "body": "I think the pork farmers association had a successful marketing campaign.",
            "score": 421,
            "replies": []
        },
        {
            "author": "personnumber698",
            "body": "I always wondered too. The early 10\\`s were filled with le epic bacon meme stuff and i never really got it.",
            "score": 179,
            "replies": [
                {
                    "author": "numbersthen0987431",
                    "body": "The early 2000's were filled with a LOT of random shit. Like...a lot.\n\nWe all forgot shit like \"Shrek is love, Shrek is life\", and the Badgers Badgers song, or Homestar Runner. But it was an unhinged time of just pure randomness.",
                    "score": 108,
                    "replies": [
                        {
                            "author": "earbud_smegma",
                            "body": ">Badgers Badgers song\n\nSnaaaaake, snaaaaaaaake, ooh it's a snake",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "numbersthen0987431",
                                    "body": "MUSHROOM MUSHROOM",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "audible_narrator",
                                    "body": "Someone in my local ring keeps trying to use badger as a  racial slur, so I bombard the post with Badger badger badger SNEK SNEK",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ReturnOfFrank",
                                            "body": ">badger as a  racial slur,\n\nWhat does that even mean? Slur for who?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "audible_narrator",
                                                    "body": "Instead of saying \"Saw a ______ person at intersection of XYZ, they use the word badger. My area is sadly full of racist jerks, so I keep defusing their posts by endlessly quoting badger mushroom snek.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ReturnOfFrank",
                                                            "body": "Jesus what the actual fuck is wrong with people like that.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "optionalsilence",
                            "body": ">we all forgot\n\n\nSpeak for yourself. Shrek and trogdor are integral parts of my adulthood. ",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "numbersthen0987431",
                                    "body": "\"I said CONSONATE v's damnit!!!\"",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "MillorTime",
                                            "body": "He wouldn't know majesty if it hit him in the face",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Shmebber",
                                                    "body": "That happened once!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RubrobarbusSuperbus",
                                            "body": "consummate\\*",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nykirnsu",
                            "body": "Shrek is Love isn’t even from the 2000s, let alone the early 2000s",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "alexengrish",
                                    "body": "Yup definitely a mid 2010s meme, I remember teachers banned that phrase in middle school",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AssCrackBanditHunter",
                    "body": "It's still around. But now it's people pretending to be obsessed with monkeys. Monkey movies, bored apes, return to monkey",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Superb_Ad_9394",
                            "body": "Gorillas and monkeys rotate in and out every so often tbf",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Dash_Harber",
                            "body": "I think even that one is starting yo become dated.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "BadgerMusic469",
                            "body": "Does this mean people will finally start appreciating the best podcast of all time, Prime Mates?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Snakefist1",
                    "body": "Might be because of EpicMealTime.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Natural_Ad_1717",
            "body": "In the 80's and 90s, it was targeted as being unhealthy.  The same thing happened with egg yolks.  People ate less and less of it, then were \"reminded\" later on that it tastes amazing and it came back with some force",
            "score": 243,
            "replies": []
        },
        {
            "author": "philman132",
            "body": "Most memes usually don't make sense when you try and analyse or explain them. \n\nThat era the memes relied a lot on supposed randomness, and bacon was memed as the \"best\" food and just became ubiquitous online as adding bacon would make anything better.",
            "score": 83,
            "replies": [
                {
                    "author": "andtheotherguy",
                    "body": "A lot of memes and online humour is still \"random = funny lol\". Tik Tok used to mostly be \"look at me dancing in a place where people usually don't dance\". I think it's just that this kind of thing is popular with tweens and teens who spend a lot of time on those platforms.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "videogamesarewack",
                            "body": "yeah everything is basically the same framework wise just the content literally swaps. So like how in 2008 things are \"so random\" but in 2025 it's \"so unhinged\" or whatever",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "landlon",
                    "body": "I also feel like it was a response to the rise in veganism in the 2010's.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Princess_Spammi",
            "body": "Dunno but it lined up with the mustache meme too",
            "score": 27,
            "replies": []
        },
        {
            "author": "bewastvns",
            "body": "In the early 2010s one of my favorite songs from this trend was “Rub some bacon on it” by Rhett and Link on Youtube. I miss this era of youtube and media 🤣",
            "score": 23,
            "replies": []
        },
        {
            "author": "BlueRasuberry",
            "body": "Does NO ONE remember the bacon dog treat [commerical](https://youtu.be/Ug_iluxQ1IQ?si=H5bleJPhDxMPmexJ)?\n\nBACON? Gotta have that bacon! Smokey bacon, crispy bacon, tasty bacon!\n\nI swear that commercial played a role in it.",
            "score": 23,
            "replies": [
                {
                    "author": "graboidologist",
                    "body": "Agreed.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "LarsAlereon",
            "body": "[Bacon Mania](https://en.wikipedia.org/wiki/Bacon_mania) was a fad in the late 90s ending around 2006. At the time there was a focus on meat and protein-based low-carb diets, and bacon was a relatively low cost meat product because pork in general was cheap and bacon in particular was low-value because it was high in fat. It largely ended when bacon prices rose because pork became more of a luxury meat on par with beef.",
            "score": 89,
            "replies": [
                {
                    "author": "Rather_Dashing",
                    "body": "This isn't what OP is talking about, its not about buying bacon itself, and it wasnt during the time period you mentioned. About a decade or so ago bacon itself was a meme, as OP points out. It even hit shops, I remember you could buy lots of bacon themed gifts. \n\nI dont think there is much more to it then a fad though.",
                    "score": 53,
                    "replies": [
                        {
                            "author": "ringadingdingbaby",
                            "body": "It was just like the moustache thong, a meme that caught on for a while.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "csonnich",
                                    "body": ">moustache thong\n\n\nI completely missed the moustache thong trend. Was that uncomfortable? ",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "ringadingdingbaby",
                                            "body": "*Thing haha",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "KingoftheUgly",
                            "body": "There was a masculinity trend at the time involving both bacon and facial hair. I’m sure it was some sort of response to something else, but from what I can recall, it was about hyper masculinity.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "xiaorobear",
                                    "body": "Nah, there were two different mustache trends at the time. One was a masculine one, like a Ron Swanson type of thing, but I think more popular was the hipster mustache trend, where not only would some men wear dated little curly mustaches, but it was common to have a picture that kind of mustache on mugs, accessories, or [even to get a finger tattoo of it, for men and women.](https://www.vice.com/wp-content/uploads/sites/2/2020/04/1586213787897-GettyImages-148988299.jpeg) This one I don't think was about hypermasculinity, was more linked with hipsters, steampunk people, maybe that brief little resurgence of 1920s appreciation with things like 'electroswing' music.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Adelaidey",
                                            "body": "When the rideshare service Lyft first started, they would ship every driver a big pink curly mustache to put on their car. The idea was that you would identify the rideshare by spotting the giant pink mustache. So ridiculous.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Casharoo",
                            "body": "Bacon bandaids, bacon scarves, bacon air fresheners, bacon candy, bacon soap... where has it all gone?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "colonelf0rbin86",
                            "body": "Unfortunately a decade ago is 2015... it was more like 15 years ago",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "victorian_vigilante",
            "body": "There’s a Garfield comic where he’s got earphones in and dancing like he’s at a rave for several panels; Jon asks him what he’s listening to and he replies that it the sound of bacon frying.",
            "score": 11,
            "replies": []
        },
        {
            "author": "goodboiuwu",
            "body": "a lot of memes back then were just random = funny",
            "score": 4,
            "replies": [
                {
                    "author": "Shmebber",
                    "body": "hi every1 im new!!!!!!! \\*holds up spork\\* my name is katy but u can call me t3h PeNgU1N oF d00m!!!!!!!! lol…as u can see im very random!!!! thats why i came here, 2 meet random ppl like me \\^\\_\\^… im 13 years old (im mature 4 my age tho!!) i like 2 watch invader zim w/ my girlfreind (im bi if u dont like it deal w/it) its our favorite tv show!!! bcuz its SOOOO random!!!! shes random 2 of course but i want 2 meet more random ppl =) like they say the more the merrier!!!! lol…neways i hope 2 make alot of freinds here so give me lots of commentses!!!!\n\nDOOOOOMMMM!!!!!!!!!!!!!!!! <--- me bein random again \\^\\_\\^ hehe…toodles!!!!!\n\n\n\nlove and waffles,\n\n\n\nt3h PeNgU1N oF d00m",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bmrtt",
            "body": "People claiming \"marketing campaign\" are hilarious to me. We're talking about an era of intermet where it was just wild fucking west, big corpos hiring bot farms to astroturf communities is a relatively recent development.\n\nAs for the question, a lot of humor back in the day relied on randomness. It just so happened that there were a lot of Americans on the internet and they really liked bacon, so it was just one of those things that stuck around.",
            "score": 12,
            "replies": []
        },
        {
            "author": "garyisonion",
            "body": "Was it because of the \"Knowledge is power, France is bacon\"?",
            "score": 4,
            "replies": []
        },
        {
            "author": "bangbangracer",
            "body": "The pork farmers association had a really successful ad campaign that coincided with memes, mostly the \"lol, so random\" memes, which kind of magnified both.",
            "score": 3,
            "replies": []
        },
        {
            "author": "charmanderaznable",
            "body": "Insanely effective guerilla marketing at a time when nobody considered that to be a possibility",
            "score": 6,
            "replies": []
        },
        {
            "author": "FoxxyRin",
            "body": "I think it was just sort of an overlap in pop culture, from Epic Mealtime (probably the biggest factor) to that one episode of Adventure Time with the bacon pancakes. I don’t think there was much else to it other than that.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Additional-Guide-586",
            "body": "Have you ever had bacon?",
            "score": 6,
            "replies": []
        },
        {
            "author": "magiundeprune",
            "body": "It was a reaction to the 90s-00s dark ages of heroin chic extreme diet culture. Everyone realised food actually rocks again and went crazy for bacon and nutella.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cheetuzz",
            "body": "when they decided to add bacon to chocolate, that was the beginning of the end",
            "score": 4,
            "replies": []
        },
        {
            "author": "Feetdownunder",
            "body": "Pizza/Beer/Nutella was peak those milennials who wore skinny jeans 👖 flannel shirts 👕 and some form of a weirdly worn beanie and a moustache something",
            "score": 2,
            "replies": []
        },
        {
            "author": "whomp1970",
            "body": "[Could this commercial have something to do with it?](https://www.youtube.com/watch?v=2vnit_xL1hE)\n\nNom nom nom nom nom nom!",
            "score": 1,
            "replies": []
        },
        {
            "author": "shyguyshow",
            "body": "On that topic, Why is Bacon praised like the best eatable thing in the world. It’s just pretty good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "graboidologist",
            "body": "I remember the famous \"It's BaCoN!!!\" Beggin Strips commercials since the late 80s/90s, it was very popular, so maybe that was in our collective zeitgeist when we got to be major media creators in the 2000s, when we became adults and put on our own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "craigtamatea",
            "body": "Big pork pushing their agenda",
            "score": 1,
            "replies": []
        },
        {
            "author": "bread93096",
            "body": "I remember growing up in that era, bacon was mostly thought of as a breakfast food. Bacon cheeseburgers existed, but that was about it. Going to restaurants and seeing bacon mac and cheese, bacon wrapped veggies, deserts with bacon bits, was novel to me. I’d always eaten bacon on its own, like as a side with eggs and toast, but it’s a flavor that works with many other flavors too. For a while I enjoyed trying dishes that used bacon in new and exciting ways, but eventually it became an obnoxious meme, and I started getting annoyed as I encountered increasingly unnecessary and disgusting uses of bacon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CorvidCuriosity",
            "body": "Are we pretending that Bacon doesn't make everything taste better?  That didn't change in 10 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flippytheweirdone",
            "body": "I remember the whole bacon trend. Anybody else remember bacon vodka?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Desperate_Owl_594",
            "body": "IIRC it had to do with the popularity of parks and rec (a show) and a specific character. A caricature of what a man is. He loved bacon. I think a lot of people missed the fact that it was a joke. Kinda like they missed Tyler durden and American psycho guy were not something to look up to. \n\nSame with the Rick and morty people who idolize Rick when the point was that he's terrible and horribly flawed character. \n\nTl;dr people are fucking stupid.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Gaymer7437",
            "body": "A successful marketing campaign.",
            "score": -1,
            "replies": []
        }
    ]
}