{
    "title": "Trump Gives Elon Musk’s DOGE More Power To ‘Make The Federal Workforce More Efficient And Effective",
    "author": "Flashy-Brain",
    "subreddit": "Conservative",
    "rank": 10,
    "score": 268,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 73,
    "url": "https://www.dailywire.com/news/trump-gives-elon-musks-doge-more-power-to-make-the-federal-workforce-more-efficient-and-effective",
    "id": "1inqo53",
    "selftext": "",
    "comments": [
        {
            "author": "chances906",
            "body": "Getting rid of government corruption and waste means another leftist meltdown in 3.. ..2...",
            "score": 35,
            "replies": [
                {
                    "author": "Slainlion",
                    "body": "![gif](giphy|l0HlCqV35hdEg2GUo)",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "cliffotn",
                    "body": "I LOVE how Trump now a bull in a china ship this go around.  He’s full steam ahead, damn the torpedoes, redline all the way, absolutely maxed out.  Just fucking go for it and get shit done mode.  The media and the left have gone wild about Elon Musk, any other Politician would be all defensive and spend methodical time defending Elon.  Trump says they’re mad?  Ok.  Let’s give them more to be mad at!!!",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "bozoconnors",
            "body": "Good.  Previous admins and the entirety of congress have proven they are unwilling or unable to accomplish a fraction of what DOGE has already.  \n\nlol - 19 comments, two visible.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Conscious-Toe-4220",
            "body": "Bring on efficiency, reduce government waste. I just wish it was more transparent. We keep getting sound bites about what they've found. Just publish it and include a breakdown of the reductions. It'll go a long way in getting more people on board. Rule number one in business: scream load about your accomplishments.",
            "score": 15,
            "replies": [
                {
                    "author": "SeemoarAlpha",
                    "body": "Every cut should include a summary description and a comprehensive impact analysis that details any possible compromise to national security and international diplomatic relationships.  My understanding is that DOGE does have attorneys on the team and for those items that are blatant fraud, they need to be referred to the DOJ for prosecution.  DOGE should also have a legislative liaison to the GOP leadership to feed them data to bake in the cuts on a permanent statutory basis.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "starriiieee",
            "body": "We needed this EO for the activist judges trying to hold up the agenda voted for by the American people.",
            "score": -9,
            "replies": [
                {
                    "author": "spezeditedcomments",
                    "body": "Nah, just rush it to the Supreme Court. I also don't want the executive trying to overrule activists judges with a pen while the courts aren't totally fucked yet",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Slainlion",
            "body": "We need the names of these AG's",
            "score": -6,
            "replies": []
        }
    ]
}