{
    "title": "Viral Video: Muslim Cleric in Germany Says Women Will Be Stoned When an 'Islamic Führer' Takes Over",
    "author": "nimobo",
    "subreddit": "Conservative",
    "rank": 20,
    "score": 94,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 12,
    "url": "https://rairfoundation.com/viral-video-muslim-cleric-germany-says-women-will/",
    "id": "1inruaa",
    "selftext": "",
    "comments": [
        {
            "author": "Humble_Poem_2257",
            "body": "Aah religion of peace... I mean how is allowing million+ immigrants with totally different view of the world not a huge red flag for any county right away? Still doesn't make sense and it never did make sense.",
            "score": 45,
            "replies": [
                {
                    "author": "plastimanb",
                    "body": "I wish this was more studied.  I have no reason why their religion is booming.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "dottedoctet",
            "body": "Then I guess we need to make sure that never happens 🤷‍♂️",
            "score": 14,
            "replies": []
        },
        {
            "author": "onemanmelee",
            "body": "I honestly don't even know how to feel about Europe anymore. This slow takeover has been more and more obvious for literally about 2 decades now.\n\n20 years ago, it was worrisome. 15 years ago, it was terrifying. 10 years ago, it was urgent. By now it is so far passed urgency and emergency, and they're *still* doing nothing about it. \n\nI really used to think \"oh man, when Europe wakes up and rises up!!!\" But now, I genuinely have zero hope that they will. \n\nThe most beautiful cultures and civilizations in the world, and they just let a vague guilt complex get in the way and let tens of millions of people who hate their values march in and take over. \n\nIt's gone from scary to frustrating to bewildering to just blah...",
            "score": 6,
            "replies": []
        },
        {
            "author": "Beware_the_silent",
            "body": "I mean we put Germany in their place before....",
            "score": 4,
            "replies": []
        }
    ]
}