{
    "title": "\"But what about the eggs?!\"",
    "author": "Ok-Science3599",
    "subreddit": "Conservative",
    "rank": 24,
    "score": 59,
    "upvote_ratio": 0.72,
    "num_comments (reported by reddit)": 61,
    "url": "https://www.reddit.com/r/Conservative/comments/1inu1km/but_what_about_the_eggs/",
    "id": "1inu1km",
    "selftext": "In all fairness, no one gives a shit about the eggs or grocery pricing nexus at the moment. There's massive amounts of corruption that is being exposed in this country in real time, almost daily, and on top of all that, we're reducing government spending to the tune of billions of dollars. \n\n\nDemocrats and your average rot brained redditor keeps harping on the eggs. Day one initiatives take a while. Economic recovery is a process that requires longevity. Further that, if Democrats are going to cling onto this one line item for the entire four years....oof. Not a good or successful look.",
    "comments": [
        {
            "author": "hey_ringworm",
            "body": "Eggs started skyrocketing in 2024, primarily because [the Biden admin ordered over 100M chickens euthanized due to concerns over bird flu](https://www.foxbusiness.com/politics/white-house-biden-admins-killing-100m-chickens-contributed-skyrocketing-egg-prices.amp).\n\nRedditors are faking outrage over egg prices because the entire purpose of their lives is to be antagonistic towards conservatives and President Trump. ",
            "score": 78,
            "replies": [
                {
                    "author": "Ok-Science3599",
                    "body": "Exactly.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "woailyx",
            "body": "It's actually kind of funny to see posts on r/cooking like \"what should I cook with my very last egg\"",
            "score": 17,
            "replies": []
        },
        {
            "author": "ITrCool",
            "body": "They’re desperate, looking for something to get a foothold on to distract people from the corruption revelations by the DOGE and spending cuts going on, trying to get President Trump’s approval numbers back down.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Tough_guy22",
            "body": "Its not the eggs that are the issue. Bird flu infects and kills laying hens. Chicken raisers try to limit the spread by culling sick chickens and ones that may have been exposed. Therefore less chickens to lay eggs. So less eggs. Unless Trump can waive his hands and make a bunch of laying age hens appear, he can't make the price go down",
            "score": 9,
            "replies": []
        },
        {
            "author": "Local_Painter_2668",
            "body": "Inflation just hit 3% and continues to go up. It’s not like we can just hand wave away",
            "score": 4,
            "replies": []
        },
        {
            "author": "Shadeylark",
            "body": "It took four years for Biden to fuck up the economy.\n\nIt took six decades for the left to fuck up the government.\n\nThe economy will be a far easier thing to fix than the government... I'm happy the effort is being put into fixing the biggest problem first.",
            "score": 9,
            "replies": []
        },
        {
            "author": "chillthrowaways",
            "body": "Also .. dozen eggs is say $6. That’s 50 cents per egg. Two eggs make a meal. $1 per meal. Try that at McGarbage oh also add a couple pieces of toast that’s what 10 cents?",
            "score": 1,
            "replies": []
        }
    ]
}