{
    "title": "Trump going back on non interventionist policy",
    "author": "SynapticSignal",
    "subreddit": "Libertarian",
    "rank": 492,
    "score": 242,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 106,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ii1hg1/trump_going_back_on_non_interventionist_policy/",
    "id": "1ii1hg1",
    "selftext": "I really dislike this decision. \nI thought the US was supposed to stay out of international Wars and now what they're proposing is basically Nation building taxpayer dollars.\n\nHow are libertariansand Ron Paul still backing him on this?",
    "comments": [
        {
            "author": "Artifycial",
            "body": "You mean trump lied? How is that possible?",
            "score": 376,
            "replies": [
                {
                    "author": "LostActionFigure",
                    "body": "The fact that anyone here is astonished is hilarious. I think we still have another month at the very least of people still bringing up Biden as the bad guy even as Trump gives us brand new examples of interventionist bad takes and executive overreach.",
                    "score": 133,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Non libertarian but I respect the ideology and its adherents. A massive problem is the massive number of people who think they are libertarians or like the term because it gives them warm fuzzies of when John Boehner used to cry and republicans claimed to hate Obama cause of the constitution and liberty.\n\nI think it’s basically impossible to sincerely claim to be a libertarian yet support Trump, or even very many of his individual actions. But I’d love to hear why I’m wrong.",
                            "score": 30,
                            "replies": []
                        },
                        {
                            "author": "ecoop3r",
                            "body": "One month? At least 3yrs11months. Heck Obama had a 3rd term the same time as Trump's 1st.  Teflon.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Silky_Mango",
                    "body": "Too many people drank the koolaid, and will come up with any excuse except they were played",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Kolundenator",
                    "body": "![gif](giphy|3kzJvEciJa94SMW3hN)",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "New_Manufacturer5975",
                    "body": "He has no political experience compared to sleepy Joe so of course he never lies 🤥",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Tacoshortage",
                    "body": "Lying or not, it is the exact opposite of the type of position he's consistently taken since the Iraq war.  The position is puzzling.  He's very predictable and this is a departure from that.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "webguynd",
                            "body": "> He's very predictable and this is a departure from that.\n\nHe's pretty much the opposite of predictable and seems to change his mind based on the last person he had a conversation with. Trump has no hardline stances on anything and is prone to swift changes of mind.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "txeagle24",
            "body": "This is very bad, and I hope most of the country agrees.",
            "score": 130,
            "replies": [
                {
                    "author": "Short-Exercise-8374",
                    "body": "Half the country think whatever he does is a good idea.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "jankdangus",
                    "body": "Most of the country do agree, more than ever we need the right and left to unite on this issue otherwise it’s gonna be Iraq and Afghanistan all over again. Israel is using the exact same fucking playbook that got us into endless war. I despise Israel, and now I’m more sympathetic to the anti-Zionist movement and wiping them off the face of the Earth because the Middle East will probably be more peaceful if that happens.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "txeagle24",
                            "body": "I've seen too many saying this is a chess move. I call bullshit.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "jankdangus",
                                    "body": "Yup, I don’t know what goes on in Trump’s head, but I would bet more on that’s he not playing 4D chess. It’s the cult wing of MAGA that is coping and giving Trump the benefit of the doubt.",
                                    "score": 26,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Canthinkofnameee",
                            "body": "Claims to be a libertarian only to turn around and 'seemingly' support the genocide of millions of people that aren't a threat to us. That makes so much sense.\n\nPersonally i'd say Jews have the right to live how they want, without neighboring Muslim nations waiting to genocide them once they put their guard down; or Hamas lobbing missiles at them thanks to Iran's funding.\n\nBut that's just me i guess, regardless of their questionable leadership and military tactics.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "5HTjm89",
                                    "body": "Even during his campaign he made it quite clear he would materially support Israel and invade Palestine. So I don’t know where this idea comes from that he’d be non interventional. He was actively antagonistic to Palestine the entire campaign and stated he would ‘cleanse’ it.",
                                    "score": 32,
                                    "replies": []
                                },
                                {
                                    "author": "jankdangus",
                                    "body": "Nah, it was just hyperbole for the frustration I feel. To be clear I’m against the Israel government, not the Jewish people themselves who are a victim of the far-right fascist government that is causing the whole world to hate them and leading to the rise of anti-semitism.\n\nAnti-Zionist would be exactly what Israel is doing to Palestine. It can’t and shouldn’t be done, but it’s just Israel getting a taste of its own medicine which is why I said I’m more sympathetic to why people feel that way.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HelloImTheAntiChrist",
                            "body": "Had me in the first half...ngl",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aebulbul",
            "body": "There isn’t a single iota of Trump that stands for libertarian principles. All these actions to cut this, that and the third is to pander to his base, and line his pockets.",
            "score": 196,
            "replies": [
                {
                    "author": "twoferjuan",
                    "body": "It’s a good thing a huge chunk of this sub voted for him. It was basically just another conservative sub leading up to the election.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "TruthLiesand",
                            "body": "This is my first time back on this sub in at least 6 months.   I have been a card-carrying Libertarian since my first presidential election.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "twoferjuan",
                                    "body": "Then that comment wasn’t directed at you. Leading up to the election there was a HUGE surge of nothing but pro MAGA stuff in this sub. For whatever reason it was allowed to fly. Most likely because they were trying to use the best talking points and name dropping to entice the libertarian vote. Which it seems to have worked.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Which-Supermarket-69",
                            "body": "At the end of every election “the lesser of two evils” argument creeps into everyone’s brains",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mega_Exquire_1",
                    "body": "True. I've been saying it since the beginning, you cannot claim to be a libertarian and support Trump while maintaining a logically consistent political worldview. He's a liar and grifter who has gone back on just about every campaign promise that would matter to the people in this sub, and he's promised things (like the ICE raids) that should disgust libertarians. Yet I still see people on libertarian subs talking about what a great job he's doing.",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "kidcrazed2",
            "body": "Can you please show me where maga x is melting down? Because I follow a lot of them and I’m not seeing it. I expected more hands off the Middle East but I’m not seeing that at all",
            "score": 20,
            "replies": [
                {
                    "author": "SunnySpot69",
                    "body": "Seems whatever he does they still think they are winning. It's interesting but not in a good way.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "TheRollingLax",
                    "body": "They don’t care as long as it “owns the libs”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "murararararagi",
            "body": "The man who ran on isolationism and was supposed to be all about \"America First\" is now stating that the US will take over Gaza. Did his voters vote for him for more Middle East involvement? They should feel absolutely betrayed by this and not defend it. How is this even real? Every day there is something new with this guy.",
            "score": 82,
            "replies": [
                {
                    "author": "Canthinkofnameee",
                    "body": "Considering he claims to want Canada, Greenland, the Panama Canal and now Gaza they should have a lot of questions to ask themselves. They guy is sounding a lot like Putin, but between him and Elon i'm questioning whether they want an empire or to destroy the US as it stands, in one way or the other.",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "LCDpowpow",
                    "body": "They won’t though. I honestly think he could do anything and they’d find a way to support it. I’ll never get it, imagine supporting any politician or businessman that much. We shouldn’t idolize anyone in that position.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "jankdangus",
                    "body": "A significant portion of MAGA are feeling betrayed and not defending it. They are having a meltdown on X right now.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "jankdangus",
                                    "body": "Fair enough, Trump still likes being popular though so hopefully the pressure is enough for him to change course.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "xelduderinox",
                                            "body": "Nah. That’s all a facade. He’s a soulless autocrat who got what he wanted from the suckers who put him back in the White House and kept him out of the big house and now fuck ‘em. The fact that his (not-cult) voters couldn’t see this coming is something history will have a field day with in the coming decades. Should Trump allow history to still exist, of course.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "jankdangus",
                                                    "body": "Damn, I still have some hope that he’s that much of a narcissist where he doesn’t want to give up his popularity. Didn’t he back away from the tariff plan because of the stock market though?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "xelduderinox",
                                                            "body": "Who knows. The man has no guardrails now. Every single appointee is a stooge whose balls are sitting on Trump’s desk. The guy could literally order police to use live ammunition on peaceful protestors and there would be nary a word from the right wing. The cancer has spread to the entire Republican Party. There’s no next election for him (for now) so why would he give a shit? The cultists will love him until the end of time. You step outta line? He’ll sick the MAGA cult on you. Plenty of Republicans have learned that the hard way.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "jankdangus",
                                                                    "body": "Yeah, you are correct that a significant portion of MAGA is a cult. This time around it’s less of a monolith, but I’m not sure if that counteracting force is strong enough to overpower it.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OpinionStunning6236",
                    "body": "He ran on strongly supporting Israel. People in the comments keep acting like he said he wouldn’t be involved but he was very clear on this.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pancakesex",
            "body": "oh no! fell for it again :/",
            "score": 14,
            "replies": []
        },
        {
            "author": "Superfan234",
            "body": "Panama, Canada, Mexico, Greenland and now Gaza\n\nIt's been two weeks of the peace President",
            "score": 10,
            "replies": []
        },
        {
            "author": "Illustrious-Radio-55",
            "body": "You got played if you trusted a snake like trump…",
            "score": 28,
            "replies": []
        },
        {
            "author": "Fuck_The_Rocketss",
            "body": "Are libertarians and Ron Paul backing him on this?",
            "score": 33,
            "replies": [
                {
                    "author": "rushedone",
                    "body": "No",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Fuck_The_Rocketss",
                            "body": "Didn’t think so.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AbolishtheDraft",
            "body": "If Trump follows through on this, it will be cancel out any of the good things he's done or might do for the rest of his term. America occupying Gaza is a disastrous idea, libertarians should be as loud as possible in opposing it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "AlphaTangoFoxtrt",
            "body": "[A summary of Trumps principles and positions](https://y.yarn.co/1f42a19c-bb28-4b67-9cc6-ed914ec2312d_text.gif)",
            "score": 31,
            "replies": [
                {
                    "author": "jankdangus",
                    "body": "He has no fucking principles. He’s an empty suit. He only cares about himself. This shouldn’t be a surprise to anyone, he has always been a pathological liar, so you can’t trust a single damn thing he says.\n\nI’m curious if we get into a war with Iran because Israel ordered us to do so, will Trump gaslight everyone that he has always been pro-war and that’s an America First position. And of course the cult faction of his base will eat that shit up because they have no principle either, they just love Trump.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "AlphaTangoFoxtrt",
                            "body": "Did you not click the link?",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "jankdangus",
                                    "body": "Oh nah I’m agreeing with you.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DEPMAG",
            "body": "Because the fake tuff guys want to act tuff.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mecheterp96",
            "body": "Because most libertarians don’t actually care that much about foreign policy as much as they pretend to. It’s just a way for them to hate otherwise moderate candidates and engage in moral grandstanding the same way leftists do.\n\nWhat libertarians really seem to care about is defeating “wokeness” and stopping immigration. Just look at Dave Smith or Angela McArdle’s Twitter feeds.",
            "score": 8,
            "replies": [
                {
                    "author": "RCDP_Kennedy",
                    "body": "This saddens me but I have to agree that this reflects libertarianism in 2025. I first got engaged with libertarianism because of foreign policy, but the movement today is a far cry from those days. Now it’s just republicans that smoke weed crowd.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "serpicowasright",
            "body": "There is a certain nation that starts with an I that has deep pockets, and he is in those pockets.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PM_ME_DNA",
            "body": "Trump isn’t libertarian at all but this is quite the escalation even for him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "epoch-1970-01-01",
            "body": "Pro-Israel lobbies and don ors need to be abolished. This manipulation for 50 years has costed Trillions of dollars and hundreds of thousands lives and countless more injured. Zionism is a selfish manipulative movement.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rude_Hamster123",
            "body": "So, you remember in high school how there were cliques? \n\nAnother clique of Oligarchs just took over. Nothing is going to meaningfully change.  The rich will get richer (especially the clique that just took over), the middle class will continue to disappear, my kids hope of buying a nice home will flicker into nonexistence (as will mine).\n\nWatching the liberals lose their shit is great, tho, amirite? \n\nJust imagine if Ron Paul wasn’t screwed out of the 2016 race…..",
            "score": 7,
            "replies": [
                {
                    "author": "AffinityForLepers",
                    "body": "If this administration looks exactly the same to you as previous ones, you aren't paying attention. Like, at all.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "TopKekBoi69",
            "body": "Hoping it’s a bluff just like the tariffs seem to be. Time will tell",
            "score": 2,
            "replies": []
        },
        {
            "author": "Steerider",
            "body": "This is just the negotiation. Wait to see what he actually *does*. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "StopWhiningPlz",
            "body": "More like territory building. It'll be owned by the US",
            "score": 3,
            "replies": []
        },
        {
            "author": "quillua0",
            "body": "Your wording signals that you are vaguely sympathetic to Trump and right-wing policy. Trump is nothing but an egomaniac and is no better than anyone else in Washington.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rocknthenumbers8",
            "body": "You can’t take on the deep state and the Israel lobby at the same time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaMerde",
            "body": "Remember, Trump is not a politician.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dabloominonyun",
            "body": "This comment section would suggest that liberals got confused on the way to their group and wound up here. Most influential libertarian advocates and libertarians that I know off Reddit while they don't support this particular move, overall have a somewhat approving view of Trump at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Short-Exercise-8374",
            "body": "Nobody actually has core values, they want to stay in power.  Even Rand has convinced us he’s a libertarian, we fell for it.  Buckle up",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Affect-3852",
            "body": "I don’t think any libertarian leaning people that voted for trump expected him to be a libertarian president, just that he would be less damaging than Harris. It’s a low bar, but those are the times we’re living in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nocommentacct",
            "body": "What proposals are you referring to? I heard some stuff about Iran sanctions again but where is the nation building?",
            "score": -1,
            "replies": [
                {
                    "author": "Dramatic_Tea_4940",
                    "body": "Gaza",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JohnTheSavage_",
            "body": "\"But mister president! What about all the money!\"\n\n\"Oh, right. The money. Well, I guess we could have a little foreign war. As a treat.\"",
            "score": 0,
            "replies": []
        },
        {
            "author": "homestead_potatoes",
            "body": "I don't know. Creating a demilitarized zone in Gaza would become the best excuse to not be involved in sending Isreal money anymore. They can't ask if the threat is no longer able to launch rockets from their backyard.\nThere is no Palestine, it's not a state or nation.",
            "score": -17,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 19,
                    "replies": [
                        {
                            "author": "homestead_potatoes",
                            "body": "No official military, but they do have several armed factions that are essentially the same, not to mention the military ordnance like the ROCKETS that we constantly hear about being fired at Isreal.\nWhat's the difference besides the level of organization or competence?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "homestead_potatoes",
                            "body": "Demilitarized, in my sense, means completely unoccupied.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "ralbert",
                                    "body": "Well that's one way to be non-interventionist, just gotta make sure nobody's left to intervene with.\n\nBrilliant, 4D chess as always /s",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "homestead_potatoes",
                                            "body": "Sorry, I'm not sorry to be a realist in acknowledgment that two factions of people want to kill each other on principle.\nAmerica should take over Gaza, force all inhabitants to leave, and then sell it to Isreal for..... all the money we ever spent on their defense.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "Kilted-Brewer",
                                                    "body": "Twisty tiddlywinks in a Texas tornado… No.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ralbert",
                                                    "body": "> Sorry, I'm not sorry to be a realist in acknowledgment that two factions of people want to kill each other on principle.\n\nWhat does that have to do with America? You're not being a realist, you're being an *imperialist*.\n\nIf you're just some clueless kid, please read a history book on US interventions. America is not the world police.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "homestead_potatoes",
                                                            "body": "*yawn* I don't care about Gaza. I don't want to own it. Quite the opposite is that I don't want to be paying for it at all.\nEver think it's kind of fucked up that we fund Isreal defense AND provide aid to \"Palestine\"?\nTalk about playing both sides!\nThe best intervention is shock and awe, scaring people into believing that retaliation will result in immediate destruction.\nYou want to drag this out forever with more and more deaths every day instead of doing something drastic or major to end it for good.\nYour systems do not work, will not work, and only perpetuate the problem.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "3_Thumbs_Up",
                    "body": ">I don't know. Creating a demilitarized zone in Gaza would become the best excuse to not be involved in sending Isreal money anymore.\n\nSo is it all about money to you? Do you have no ethics beyond what's good for your own wallet? You're judging whether displacing 2 million people from their home is good or not based on the net effect on your wealth.\n\nAnd it's not even your own personal wealth that matters. It's not like the US government would steal less from you if they stopped sending aid to Gaza.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "homestead_potatoes",
                            "body": "Correct, I only care about MY family and MY home and MY country.\nI don't want my resources going to shit and people I don't care about. What's wrong with that?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "3_Thumbs_Up",
                                    "body": "What's wrong with that? It makes you a completely amoral and horrible human being. But hey, at least you're open about it.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "homestead_potatoes",
                                            "body": "I think that those who put others they don't know or don't connect with over that of their own family and neighbors are the ones lacking morals and principles.\nFacts are Jews and Muslims are very open about wanting to take over the world and imposing their ideology on the entirety of the human race.\nOne wants you as a slave, and the other wants you as fertilizer. I don't show sympathy or especially empathy to those who impose their will on mine.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "3_Thumbs_Up",
                                                    "body": ">I think that those who put others they don't know or don't connect with over that of their own family and neighbors are the ones lacking morals and principles.\n\nYou're moving the goal posts.\n\nThere's a very significant difference between caring about your friends and family more than you care about people on the other side of the world, and not caring about other people at all.\n\nThe first opinion is completely normal, and anyone who claims they don't value people differently is straight up lying. The second opinion s\nIs what you expressed though, and that's what makes you lack a moral compass.\n\nIt's entirely possible to care about your family the most without advocating for straight up genocide of 2 million people.\n\n>Facts are Jews and Muslims are very open about wanting to take over the world and imposing their ideology on the entirety of the human race. \n\nThis is collectivist thinking. Fact is Jews and Muslims are individuals with individual thoughts and individual opinions. Libertarians care about the individual.\n\n>I don't show sympathy or especially empathy to those who impose their will on mine.\n\nThis was not your original position. You literally said \"you only care about YOUR family and YOUR home and YOUR country.\" \n\nYou've now introduced a new qualifier that you don't care about people who wish to impose their will on you. Pick one position.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "homestead_potatoes",
                                                            "body": "You didn't make any points besides Libertarians caring about the individual. For that, I 100% agree. However, you don't want to take into account that the Jews and Muslims of the world that may share your or my views are the microscopic minority that holds no power.\nGoing a little farther, if they speak up, they will be retaliated against to varying degrees.\nThe majority and the people that hold all the power are never going to be our friends. They have nothing but exploitation of all others on their minds cause they think they rule the world by divine mandate of God.\nTwo names you are called: Infidel and Goyim.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "3_Thumbs_Up",
                                                                    "body": "You've contradicted yourself and there's no point in discussing this any further until you clarify your stance.\n\nThis is the original statement you made that I objected to:\n\n>You only care about YOUR family and YOUR home and YOUR country.\n\nThis statement implies that you'd be fine with the death, torture and abuse of billions of people on the other side of the world if it gave you a slightly better life. You don't care at all about them anyway. They're not your family or country. Is this truly your belief? You don't care the tiniest bit about anyone who is not your country or family?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "homestead_potatoes",
                                                                            "body": "Seriously, the fuck is wrong with your logic?\nI don't want involvement with foreign nations besides trade.\nI'm not advocating for death for a better life for myself, I'm advocating for zero involvement and to not care about the plights of others, at least to the extent where tax payer money is involved. If the shoe were in the other foot, we would get the exact same treatment of not worse. \nI did say that if I'm forced to be in a situation that I don't want to be in I would go for total domination and destruction to get the conflict over a soon as possible the the most costly thing is TIME. As in the longer these things drag out, the more money spent and death there is.\nDon't get into conflict. If you are forced to be, then be brutal and efficient.\nI think that caring for people you don't know or that affects your personal life in any way is disingenuous and should only be reserved for loved ones.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "3_Thumbs_Up",
                                                                                    "body": "You can try to change what you said as much as you want, but this conversation is in writing. \n\nI asked you very clearly if you had no ethics whatsoever beyond what's good for your wallet, and you responded affirmatively. Your refusal to clarify afterwards leads me to believe that's your still your stance.\n\nMy post:\n>So is it all about money to you? Do you have no ethics beyond what's good for your own wallet? You're judging whether displacing 2 million people from their home is good or not based on the net effect on your wealth?\n\nYour response:\n>Correct, I only care about MY family and MY home and MY country. \n\nSo when asked if you have no ethics beyond personal interests you said \"correct\". I'm just holding you to the logical implications of what you stated yourself.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "homestead_potatoes",
                                                                                            "body": "My family, home, and country should have nothing to do with the funding or displacement of any person or place.\nYou are trying to justify saying I have no ethics and attaching that to money cause none of this shit can happen without taxpayer funds, and I don't support foreign aid and war.\nI don't like funding Isreal defense to have then to provide aid to the ones that are the quintessential reason we are funding Israeli defense in the first God damn place.\nFuck all that my family has to pay taxes to fund both sides of a war during massive inflation and you want to cry about people being displaced for something we shouldn't be involved in.\nI just don't care about other countries, people, and that even includes my own blood relatives I don't speak to.\nMy wife and kids, my home, and my community are all that matters to me, and forcing money out of me for shit I don't believe in just makes me resent everyone involved with that money and I do not care of they live or die.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AbolishtheDraft",
                    "body": "It costs taxpayer dollars to station US troops as well. You're presenting a false dichotomy, we should bring our troops home *and* cut off all foreign aid, that's the true America First position",
                    "score": 3,
                    "replies": [
                        {
                            "author": "homestead_potatoes",
                            "body": "Hey dude, I agree. For that, I'm all for scorched earth tactics over land invasion anyways since I don't want to keep the land, just make it uninhabitable.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Stinking_Badges85",
                    "body": "Cause everybody knows you'll just stop accepting free money from the 15 million+ christian zionist cult members from another country. You're tax dollars are going to be paying them for the rest of your life.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "eico3",
            "body": "Still better than we would have had with Kamala",
            "score": -24,
            "replies": [
                {
                    "author": "DumbledoresAtheist",
                    "body": "No it isn't. \n\nJared Kushner has been foaming at the mouth for years to develop Gaza and turn it into a new Dubai. Trump hosted Netanyahu shortly after the elections. I'm sure all of this was discussed, then, and nobody took notice. \n\nTrump's not rebuilding a nation with taxpayer dollars, he's developing a resort city that he and his son-in-law will make billions off of with taxpayer dollars, and he'll use United States soldiers to secure it. \n\nThe, \"better off than with Kamala,\" responses are lazy and tired. Argue facts not gotcha statements. Besides, it's patently untrue. Trump views his presidency as a giant money-making scam, that's all it's ever been, and maybe with a sprinkling of staying out of prison on top.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "eico3",
                            "body": "I do think we are better off with Kamala. One way or another the U.S. is going to fight wars, not a lot I can do about it. Just like when Obama kept fighting wars then Trump kept fighting his wars then Biden kept fighting his wars. With Kamala we would have been fighting wars, with Trump we’ll be fighting wars. \n\nWith Trump we get better domestic policy. So yes it is better than it would have been with Kamala. My point stands.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AbolishtheDraft",
                    "body": "I disagree. Trump may end up not following through on this, in which case we can have that debate. But if Trump sends American troops to Gaza, then we can undoubtedly say that he's worse than Kamala.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "eico3",
                            "body": "If trump sends troops to Gaza it will be because aipac wants him to, and if aipac wanted him to, they would have gotten Kamala to do it also.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}