{
    "title": "Unbelievably DUMB!!!",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 482,
    "score": 981,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 245,
    "url": "https://i.redd.it/ifu93gvtk9he1.jpeg",
    "id": "1ii3uug",
    "selftext": "",
    "comments": [
        {
            "author": "Theonitusisalive",
            "body": "![gif](giphy|9LPjXFCA3Bwgo)",
            "score": 195,
            "replies": []
        },
        {
            "author": "EmperorDolponis",
            "body": "So much for America first",
            "score": 344,
            "replies": [
                {
                    "author": "Wordshurtimapussy",
                    "body": "Make Zion great again",
                    "score": 88,
                    "replies": []
                },
                {
                    "author": "umpteenththrowawayy",
                    "body": "Israel’s been put before American interests for a long while now, and they’ve made damn sure not supporting them is a death sentence for one’s career in politics. It’s frustrating, since I really can’t fathom a means to *peacefully* remove the parasite from our government.",
                    "score": 60,
                    "replies": []
                },
                {
                    "author": "Vegetable_Nobody8323",
                    "body": "Gaza is America now",
                    "score": 34,
                    "replies": [
                        {
                            "author": "EmperorDolponis",
                            "body": "How many Americans live in Gaza",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "HelloImTheAntiChrist",
                                    "body": "None with that attitude....but give it 10 or 15 years and we'll have a bunch living there seasonally. \n\nDisclaimer: This comment sarcasm. America has no business being in the Middle East.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "timmayrules",
                                    "body": "It’s about to be 100% American soon technically lol",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Vegetable_Nobody8323",
                                    "body": "How many americans lived in Hawaii",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "RireBaton",
                                            "body": "Quite a few actually at the time.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cows-go-moo19",
                            "body": "You know perfectly well we are just going to give it to Israel",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "HelloImTheAntiChrist",
                                    "body": "100% . We'll use the US military to pacify and control it and then hand it over to Israel in 20 ish years ...with the condition that we get to put a permanent military base and green zone within it.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "cows-go-moo19",
                                            "body": "With the condition that they don’t release the Epstein tapes.\n\nFear and favor.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Business_Pretend",
                                            "body": "British tried something like that.\nDidn't work out so well.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "HelloImTheAntiChrist",
                                                    "body": "I'm not surprised. It's likely not going to work out for the USA either",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "irondumbell",
                    "body": "Zion first",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "ProjectGenX",
                    "body": "By owning Gaza, the US will have it's own version of Dubai! It'd be great! Millionaires and billionaires can have fantastic vacations there!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "freerangemary",
                    "body": "Dude. He’s going to be emperor of the New Trumpland. He’s setting himself up. \n\nHe’s going to have cronies by the land, which non of us can afford, and be rich. Look at his meme coin scam. \n\nAlso, lots of pain, suffering, and death.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Corrosive_salts",
            "body": "What happened to “America first” lmao 🤣",
            "score": 469,
            "replies": [
                {
                    "author": "sadson215",
                    "body": "Gaza is America now.  As is Canada and Greenland.  I'm altering the deal pray I do not alter it further",
                    "score": 166,
                    "replies": [
                        {
                            "author": "HelloImTheAntiChrist",
                            "body": "Don't leave out Panama. They want to be a vassal state of the USA too (huge f**king sarcasm)",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "LMicheleS",
                            "body": " **I've just made a deal that'll keep the Empire out of here forever.**",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "RotbloxBoi21",
                            "body": "Nerd",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SnakeHisssstory",
                    "body": "Hate to be the “9D chess” guy, and Trump is definitely pro Israel, but this is textbook Trump guys. Threaten something insane with no intention of actually doing it. Swing your balls around to try to get what you want.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "SealTeamEH",
                            "body": "This was the same sentiment people had about whether or not trump would accept an election loss, when will people stop underestimating the guy and realize he REALLY IS this batshit insane and intends on doing exactly what he says.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SnakeHisssstory",
                                    "body": "He did accept the election loss",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "tinyDinosaur1894",
                                            "body": "Eventually when it suited him. Now we have people submitting bills to allow him a 3rd presidency and Tennessee proposed one making it illegal to vote against his policies.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "SnakeHisssstory",
                                                    "body": ">When it suited him\n\nAh yes when it suited him. As in, prior to January 20th when he moved out of the White House and surrendered power of the federal government like every president does. \n\nAnd some random republicans proposing unconstitutional bills is pretty much par for the course in American politics.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "inyuez",
                                                            "body": "He physically complied with being fired but he did not admit that he lost the election. He still continues to deny it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SnakeHisssstory",
                                                                    "body": "I fail to see why that matters. He has a hissy fit and touted opinions about widespread election fraud. I have no way to confirm or deny these claims. \n\nHe moved out of the White House and relinquished power prior to the next president. That is, unmistakably, accepting the election loss imo.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "apeshitcrayy",
                            "body": "In negotiations this is called an anchor. Make your initial demand so outlandish that when you say, \"Well I guess this less crazy thing would be suitable instead \" the other side breathes a sigh of relief and acquiesces without much fight. Same thing he's doing with Canada being the \"51st state\" and Greenland (maybe less so this one).",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "SnakeHisssstory",
                                    "body": "Exactly. And while the left falls for it and loses their mind every single time, there is absolutely no reason libertarians should.\n\nDid everyone forget his first term? This is literally one of like 2 maneuvers he has in his playbook haha.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PrincessSolo",
                            "body": "It does tend to make the last, slightly less crazy idea suddenly seem more reasonable",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "inyuez",
                            "body": "It’s “9D chess” and “just a joke” until all of the sudden it’s not. I don’t think he’s actually serious in this case but he’s a loose cannon and you never know what his real opinion is. We shouldn’t have to sit around wondering if the president is sharing is real plan of just joking around.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SnakeHisssstory",
                                    "body": "I don’t disagree, and I never said I support his methodology. This is his MO though and people have no excuse to flip the fuck out over everything he says. He’s flippant, impulsive, and exaggeratory with his language. It would be a surprise if he wasn’t already president for 4 entire years before",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SnakeHisssstory",
                                    "body": "I mean, if there’s one country on earth that has the ability to piss off the whole planet and get away with it, it’s the US. \n\nHe’s swinging his weight around. Agree or disagree, Mexico, Canada, Colombia, and Guatemala have all capitulated to his demands due to his threats in these few short weeks",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PM_ME_DNA",
            "body": "This is how we get another war",
            "score": 121,
            "replies": [
                {
                    "author": "HelloImTheAntiChrist",
                    "body": "Of course. The Military Industrial Complex has to keep their profit margins as high as possible.... forever wars in the Middle East are a integral part of that goal.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "liberty_is_all",
                            "body": "Note from the DOGE stuff there is absolutely not a whisper of touching the DOD? What a coincidence.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "HelloImTheAntiChrist",
                                    "body": "Yep, War Mongers have taken over Washington DC.\n\nUS citizens need to stop letting their kids join the military. Defense industry engineers and scientists need to quit in protest. \n\nThe US electorate needs to demand accountability from the Congressmen and Senators....lest they all be voted out. This goes for Democrats and Republicans .",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OpenSourcePenguin",
                    "body": "Guess what his billionaire masters want.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "sadandshy",
            "body": "Even if you support Israel, this is a bad, bad thing.",
            "score": 114,
            "replies": [
                {
                    "author": "hopbow",
                    "body": "I'm a Jew, but do not support Israel in it's current operation. I support the country existing, but also the two state solution.\n\n\nThis is disgusting and despicable ",
                    "score": 63,
                    "replies": [
                        {
                            "author": "OpenSourcePenguin",
                            "body": "Israel wasn't exactly good before this operation \n\nIt was just flying under the radar and had incredibly well oiled propaganda machine.\n\nThey tried the same old trick on social media and screwed up.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Last-Potential1176",
                    "body": "Explain how it's bad. Is the status quo working?  Isn't the definition of insanity trying the same thing over and over and expecting a different result.  How can a Hamas-led Palestine live side-by-side with Israel for the next 100 years and not expect war to break out every decade like it has been for the past 70 years?  I'm not the biggest fan of Trump, but relocating the Palestenians may be the best way for peace for both sides.  The Palestinians can live in Jordan or Egypt and live in peace with people who support them and practice the same religion.   If you're going to tell me I'm wrong, at least offer your plan for peace.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "Body4Language",
                            "body": "Jordan, Egypt and Saudi Arabia already rejected this.  What are you even talking about?",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Last-Potential1176",
                                    "body": "Just shows you their hypocracy.  They talk about how much they love the Palestinians, but when time comes to walk the walk, they turn their back on the people they say they love.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Last-Potential1176",
                                    "body": "All the buildings in Palestine are destroyed. Why not rebuild them somewhere else in the world where Palestenians won't be right next to Israel. \n\nWhat's your plan?  You got something better?",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Body4Language",
                                            "body": "You know that you're advocating for the same thing the Americans did to the Indigenous tribes?  It's nothing new, emulating cruelty and immorality is the same old bullshit.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Last-Potential1176",
                                                    "body": "Quit dodging the question. What's your plan?  You keep hiding behind criticizing other plans but got nothing yourself.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Economy_Wall8524",
                                            "body": "So kick people out of their native land is your solution. How would you take that? If someone kicked you out of your place.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Last-Potential1176",
                                                    "body": "It's what happens when you lose a war.  The winners get the spoils.  Morality aside, it's how the real world works.  If Palestine didn't want this problem, they shouldn't have poked the dragon.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheKonan",
                            "body": "If we’re talking about breaking the cycle, maybe it’s time to put pressure on Israel for a change. Real pressure. Netanyahu’s policies have clearly prioritized keeping Palestinians divided - supporting Hamas to block even the faintest hint of a unified Palestinian state is a prime example. Twisting Israel’s arm to stop settlements, respect borders, and work toward a real solution might actually give peace a shot.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Last-Potential1176",
                                    "body": "Hamas' charter was signed in 1988 calling for the destruction of Israel, well before Netanyahu was in power.  How can peace exist when two sides exist side by side who, for decades, have been committed to destroying each other. It's time for one to relocate.  Move these people away from each other.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "TheKonan",
                                            "body": "Palestinians are not synonymous with Hamas. Ramallah and Gaza are worlds apart in terms of governance and priorities. Netanyahu and Israel should have worked with the Palestinian Authority in Ramallah to build trust and cooperation, but instead, they expanded illegal settlements and undermined moderate factions, effectively empowering Hamas through their policies, including alleged funding to keep Palestinian divisions alive.\n\nEthnic cleansing is never a solution. If you think time will erase the grievances, consider how Jews refused to assimilate fully into their host societies after the Galut and preserved their identity for over 2,000 years. Displacement only deepens wounds and reinforces cultural identity. Peace requires engagement, not eradication.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Last-Potential1176",
                                                    "body": "So what's your solution? Rebuild all those buildings in Palestine, send Netanyahu a book on how to win friends and play kind, and then take votes at the UN to resolve all future conflicts?  I've heard no solutions from you that are grounded in reality.  You want to repeat failed practices.  The definition of insanity is trying the same thing over and expecting a different result.  Put forward a real plan on achieving peace.  Let's hear it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TheKonan",
                                                            "body": "There’s no magical solution, but one thing that’s never been tried is real pressure on Israel to commit to a two-state solution. The U.S. could condition aid—and maybe even consider sanctions (not that it ever would)—on halting and rolling back settlements. This could create space for Palestinians to see real, incremental progress that builds trust. Let’s not forget, back in the 1970s through the 1990s, Palestinians weren’t fighting a religious war; they were secular nationalists, a bunch of hippies with AK-47s. The whole religious war narrative is a recent development, largely born out of desperation and the lack of any tangible path forward.\n\nKey performance indicators should be set for both sides—not just one. Holdouts in the Palestinian Authority are on their way out, and the U.S. and its allies have an opportunity to bring the next generation of Palestinians onside through small but consistent wins. Even Saudi Arabia is ready to let bygones be bygones if Israel would actually commit to a two-state solution. Are you really unable to see the big picture here?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ContextImmediate7809",
                            "body": "Well, I don't think it's justified but given how many Palestinian civilians Israel has killed it makes sense that Palestine wouldn't want peace with them. I think if both Israel and Palestine united into some sort of secular republic and all of the citizens' rights were respected, the situation may get better, but at present it's FUBAR.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "sadandshy",
                            "body": "Hamas has to go. Full stop. The only way for there to be a lasting peace is for Palestinians to agree to be a part of Israel, not a separate country. I doubt they are interested, though.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "1127_and_Im_tired",
                            "body": "It's bad because it's none of our business. Let them figure it out. Why do you want your money and mine going to foreign countries that hate us? We tried in Afghanistan and Iran. And they hate us more than ever. Going into another middle eastern country and trying to intervene is the definition of insanity. It's time for Americans to mind our own business and stay out of foreign affairs.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sneakthief13",
                                    "body": "I agree in principle, but the reality is that foreign affairs is super nuanced. I don't have very many answers, but I don't think a 100% isolationist policy is feasible",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Xumayar",
            "body": "Do you want another 9/11?\n\nBecause this is how you get another 9/11.",
            "score": 270,
            "replies": [
                {
                    "author": "DuhFluffinator2",
                    "body": "Because the Middle East loved America before this…",
                    "score": 13,
                    "replies": [
                        {
                            "author": "_JustAnna_1992",
                            "body": "Most of the Middle Eastern based terrorist organizations have shifted most of their objective to capturing and holding territory in their own regions. The more the US gets involved directly, the more likely they are to start prioritizing attacks in the West again. They've always been meant to be retaliatory.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "oceanofice",
                    "body": "Why would Israel attack us again if this is what they want?",
                    "score": 33,
                    "replies": [
                        {
                            "author": "cows-go-moo19",
                            "body": "lol\n\nOctober 7th was basically a 9/11 - A suspiciously convenient terrorist attack that enables a superpower to violently achieve its imperialist aims while somehow claiming to be the victim.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "OpenSourcePenguin",
                                    "body": "Wasn't Israel warned with the intelligence?\n\nIsraeli leadership wanted this to justify bombing and eventual encroachment of Gaza.\n\nNetanyahu was uncomfortable because Israel has dibs.\n\nIsrael has been caught being happy attacked multiple times. It's a good justification for disproportionate killing.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "cows-go-moo19",
                                            "body": "Based on history, Israel probably planned this themselves.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "cows-go-moo19",
                                            "body": "Don’t make me pull up images of Gaza. \n\nAlso quick question: do you celebrate Christmas?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "cows-go-moo19",
                                                            "body": "When discussing an ethnostate, I generally disregard the opinions of those in the group that created and defend it. Because of the obvious potential for bias.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cows-go-moo19",
                                                                            "body": "I don’t live in NH, but I do reject the left wing libertarians. Libertarianism is an inherently right wing ideology.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[deleted]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "cows-go-moo19",
                                                                                            "body": "People on the left don’t love Israel either buddy",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "everyoneisnuts",
                    "body": "That’s not why you don’t do this. They will never stop wanting another 911 so nothing has changed there.You don’t do this because we are in N America and it’s in the fucking Middle East! We have no business being there or getting in the middle of that complete shit show. I would worry more about the exponentially higher risk of large scale war now that America is in the thick of it. This could be catastrophic. There will never be peace there and now we will be wrapped up in the mess even more. Unimaginably dumb move here.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Katzenpower",
                    "body": "imagine believing cave dwellers somehow managed to fly planes into skyscrapers with no help from intelligence agencies lmao",
                    "score": -69,
                    "replies": [
                        {
                            "author": "SwoleJolteon",
                            "body": "Al-Qaeda [held a summit](https://en.wikipedia.org/wiki/Kuala_Lumpur_al-Qaeda_summit?wprov=sfla1) in anticipation and planning for several attacks. Cave dwellers don't use cell phones, put themselves into operational cells to avoid detection, and plot events months or years in advance. Underestimate international jihadi terrorism at your own risk.",
                            "score": 50,
                            "replies": [
                                {
                                    "author": "cows-go-moo19",
                                    "body": "Yeah we just got “lucky” that we received justification to invade all those countries we wanted to invade. \n\nReally?",
                                    "score": -19,
                                    "replies": [
                                        {
                                            "author": "AruthaPete",
                                            "body": "Can you help me understand the (ulterior) motives for America to invade Afghanistan?",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "HelloImTheAntiChrist",
                                                    "body": "Control of the Opium fields so we can flood the streets China, Iran, North Korea and Russia with cheap Herion.\n\nThe height of warfare is asymmetrical warfare. \n\nOne of the largest if not the largest Lithium deposits on planet Earth is in Afghanistan. In addition Afghanistan is fairly rich in various precious metals and rare Earth elements.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "AruthaPete",
                                                            "body": "Ok, so why did they pull out? ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HelloImTheAntiChrist",
                                                                    "body": "Money and Politics is the short answer.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AruthaPete",
                                                                            "body": "Can you be more specific? Lithium is still wildly valuable, and the countries you named are still rivals",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "mmmhiitsme",
                                                    "body": "Lockheed and Raytheon, et al. do much better when there's an active war happening.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AruthaPete",
                                                            "body": "Ok, so why did they pull out?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MaliciousPrime8",
                                                    "body": "What other reason than to install a puppet government and central bank?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "AruthaPete",
                                                            "body": "Ok, so why did they pull out?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "cows-go-moo19",
                                                    "body": "You cannot be serious. \n\nYou are asking our motives for military occupation in the Middle East? Where have you been man.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "AruthaPete",
                                                            "body": "Imagine I've been locked in a cave, and I'm honestly asking a question! ",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Katzenpower",
                                    "body": "Yeah Bro. They totally learned to fly commercial planes from a laptop in their caves 😂 holy shit how gullible can you be",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheBannedLibertarian",
            "body": "Dumb? Absolutely\n\nUnbelievable? Not at all",
            "score": 24,
            "replies": [
                {
                    "author": "katiel0429",
                    "body": "Yeah but “Unsurprisingly DUMB” doesn’t have the same ring to it.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "sirweevr",
            "body": "Can't wait to see people argue that displacing an entire population from their home permanently isn't that bad.\n\nDoesn't matter if he closes USAid or frees Ross Ulbricht - this should put him up there with the worst authoritarian tyrants currently on this planet.\n\nI hope he'll be up to the task when dozens and dozens of Americans pointlessly die for this utter stupidity.",
            "score": 267,
            "replies": [
                {
                    "author": "OpenSourcePenguin",
                    "body": ">Can't wait to see people argue that displacing an entire population from their home permanently isn't that bad.\n\nMAGA audience is literally that meme where the magician shits on the stage and people clap. I don't know how to find it.\n\nThe blind following of anything is insane. Trump says TikTok good, it's good, he says bad, it's the worst. He has hijacked the Republican party and only way to survive for them is kiss the ring.\n\nImagine stirring up the middle east terrorist groups for absolutely no reason. Especially when absolute idiots are in charge of military and intelligence. Might as well do things directly from Putin's wishlist.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Faladorable",
                            "body": "https://www.memedroid.com/memes/detail/1500006\n\ngot you",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "OpenSourcePenguin",
                                    "body": "What did you search ? I have wasted hours 😭",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Faladorable",
                                            "body": "\"magician poops on stage meme\" and went to images and it came right up lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Brocks_UCL",
                    "body": "Bold to assume it will only be dozens",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "hopbow",
                    "body": "Why wouldn't he be up to the task? Trump has never had an issue denigrating the \"suckers and losers\" who die for America",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "ScumbagLady",
                    "body": "My mother, die-hard Trump supporter and also retired minister, who tries twisting all the bad Trump does into good by repeating his BS or putting her own holy twist on it- said it's (the buying of Gaza) for the Palestinians lol When I told her Israel has been wanting control over Gaza since the beginning she said well, there's nothing left of it now for them to return to now that it's all been blown up... I'm just so done trying to get her to see the light about who she loves so very dearly. \n\nAbout time to find a shit nursing home for her I think. I'm going on 6 years of being her caregiver and I at least need a break until Medicare gets hacked",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -58,
                    "replies": [
                        {
                            "author": "sirweevr",
                            "body": "Displacement is 100% a subtext of his latest proposal, regardless of what other nonsense he says. Setting aside the childish idea that he can create \"unlimited jobs and housing\", once you move an entire population out of a territory for \"10-15\" years they are not coming back.\n\nI don't know why we are so determined to take whatever this idiot says at face value when it changes every week.",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "hopbow",
                                    "body": "Because he follows through often enough that you have to.\n\n\nTheoretically its also because the President shouldn't be such a blow hard, but for some reason half the country can tie themselves in knots to talk about what a 4d chess movement this is",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thunder_blue",
                            "body": "Read the transcript for yourself. He talks about housing Gazans in neighboring countries, and how they can't go back.\n\n[https://rollcall.com/factbase/trump/transcript/donald-trump-press-conference-joint-benjamin-netanyahu-israel-february-4-2025/](https://rollcall.com/factbase/trump/transcript/donald-trump-press-conference-joint-benjamin-netanyahu-israel-february-4-2025/)",
                            "score": 33,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "John-of-Arc",
            "body": "Mar-A-Gaza now open with a beautiful 18 hole championship golf course. Go offroading in Rafa. Or take a quick taxi ride to drop off your note in the Western Wall. All while leaving your passport back in the states. US residents only need a Real ID for travel and entrance. Book now and receive a free MyPillow airplane pillow for the flight over. \n\nSome people are acting surprised in the comments. Oh but he freed Ross why is he doing this now?! He slashed XYZ federal agencies why would he do this?! Because he's a fucking big government statist and in bed with Israel like all the others are. Idk what it will take or how long it will take for folks to realize it. \n\nFor every tiny victory libertarians have had in the last two weeks it seems like his next immediate move after has been the ultimate state enhancer.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Beginning-Shoe-9133",
            "body": "\"America first\" my fucking ass!!",
            "score": 51,
            "replies": []
        },
        {
            "author": "StuntsMonkey",
            "body": "This is why we can't have nice things",
            "score": 14,
            "replies": []
        },
        {
            "author": "International_Fig262",
            "body": "The Trump love here was always inexplicable. Yes, Trump will wreck some parts of the government that need to be wrecked. However, he's a big government fanboy at his core. He thinks that as long as he is in charge that he can leverage unlimited power to solve literally any problem. \n\nWe still have a decent chance of this term being a net positive because Democrats will go to hell and back to thwart him. But I wish we could have gotten almost any other GOP contender instead.",
            "score": 102,
            "replies": [
                {
                    "author": "natermer",
                    "body": "If libertarians got their way none of this would even be possible. \n\nThere would be no Fed, no massive military, no foreign involvement. \n\nIt is the \"conservatives\" or \"progressives\" that try to argue that this sort of behavior is great when it is their Party in charge and terrible when it is the other Party.\n\nLibertarians argue that is terrible when anybody does it.  Also that we need to restrict the government so that it isn't even possible.\n\nBecause the problem isn't the people running the system.  The problem is the system.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "International_Fig262",
                            "body": "Yeah, I've noticed the same, so I was genuinely confused by responses saying they have seen hardly any MAGA posters here. \n\nI'll try to be fair and point out the good as well as the bad with Trump, but his cheering section can be insufferable. I don't care for Ted Cruz, but even I felt a bit bad for him watching him try to debate a Trump fan: \nhttps://youtu.be/TwqpiDZlcCE?si=HEps5vgVHJk9AHAV",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gatornatortater",
                    "body": "Like you, I'm still waiting for the other boot to come down, but very few Republican candidates would be preferable from a Libertarian perspective.  There are only so many Rand Pauls, Vivek's and DeSantis's.  Many are Bushes, McCains and Cheneys.\n\nAs cynical as I am, I did vote for Trump (or against Biden/Harris), and I am quite shocked that we are seeing as many gigantic movements in a libertarian direction as we are.  I mean, the defederalization of the Dept of Ed.  The destruction of USAID, probable end to the harassment of Russia, and the fucking freeing of Ross!  \n\nMainly I am concerned with the increase of the mass surveillance system.  The LLM hype and effort to build the infrastructure for it is a much bigger concern.  The failed \"ai\" tech can't implode in on itself quickly enough.",
                    "score": -9,
                    "replies": []
                },
                {
                    "author": "Fuck_The_Rocketss",
                    "body": "Love is a strong word many simply believed he was worth voting for to make sure Harris didn’t win. I thought so. I still think so. This is a regrettable move. Harris 100% would have made it too. And Trump is doing a handful of good things she never would have.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "International_Fig262",
                            "body": "There were plenty of people here saying Trump was the lesser of two evils. I am not talking about those people. I am talking about the people talking about Trump being a great candidate and, more importantly, their preferred candidate from the GOP primaries. \n\nHarris was awful. No argument here. But Trump v most of the field of GOP contenders (obviously not someone like Bolton) was a no-brainer.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Fuck_The_Rocketss",
                                    "body": "I have seen little to none of that on this subreddit.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Liandra24289",
            "body": "We knew this was going to happen, and here he is confirming it.",
            "score": 32,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "As usual, doesn’t matter who we elect, they all serve Israel. Out with the old puppet, in with the exact fucking thing.",
            "score": 161,
            "replies": [
                {
                    "author": "SANcapITY",
                    "body": "No matter who you vote for, you always wind up with John McCain.\n\n\\-Tom Woods",
                    "score": 53,
                    "replies": []
                },
                {
                    "author": "Short-Exercise-8374",
                    "body": "Nobody should be surprised, but it seems like some people were genuinely fooled into thinking this guy has libertarian values.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "stonedlogic",
                    "body": "Same bus, different driver",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Wh00ligan",
                    "body": "I don’t know why anyone’s surprised. He always said he would support Israel.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "[Not all of them…](https://youtu.be/74ZA-GdeQP4)",
                    "score": 12,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Oh yes you right, forgot about my goat Thomas Massie. He’s actually principled and can’t be bought.\n\nShout out to Ron and Rand Paul too.",
                            "score": 31,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Keem_Surazal",
                    "body": "Joe Biden didn't do shit for Israel!",
                    "score": -27,
                    "replies": [
                        {
                            "author": "therodeingcowboy",
                            "body": "Also didn’t take over Israel",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Keem_Surazal",
                                    "body": "What are the different cultures in the Middle East? What do Muslims value the most? Why do the Muslim sects want to kill Jews? Haven't the jews suffered enough? \n\nIf having a small government like what Israel has is one of the factors of why so many jews or Israelis die, then wouldn't annexing Gaza back into Israel eventually make Gaza safer for the people that live in Gaza? Also, with the Israel military having a lack of personnel to cover all of Israel's borders, wouldn't it be to their benefit and safety for the US government to offer AID and protection to them?\n\nDifferent approach, if you moved into a region where you eventually found out that those who lived there before you are extremely hostile to outsiders and those hostile inhabitants often threaten your livelihood, life, liberty, family, and property slowly breaking down all of those five things, plus your mental state. Wouldn't it be wise to do what you have to in order to protect yourself and those around you from harm and enslavement? Slavery in the Middle East outside of Israel is legal in the other Middle Eastern nations (a statement, not necessarily a fact; a quick Google search can either validate or discredit my statement). \n\nDon't the violent prey upon the weak? If the weak doesn't seek out protection from the strong, will they not meet a tragic end? The US government/military comparably is a very strong nation to Israel, which hasn't been around for eighty years. If the strong doesn't help out the weak, how are we any different from those who prey upon the weak?",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "lumnicence2",
                                            "body": "Neoliberal hot take. \n\nWe don't help Israel because we're righteous, we help them because we get something out of it. Specifically a presence in an area where we lack allies.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "Keem_Surazal",
                                                    "body": "If that is true, what does the US government get out of aiding Israel?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "lumnicence2",
                                                            "body": ">Specifically a presence in an area where we lack allies. \n\nBut also a lackey that will get engage in proxy war on our behalf.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KriegerKrieg",
            "body": "We all knew it was just a matter of time before this utter stupidity.",
            "score": 10,
            "replies": []
        },
        {
            "author": "cTron3030",
            "body": "Blowback in 3…2…",
            "score": 9,
            "replies": []
        },
        {
            "author": "izza123",
            "body": "You’re gonna pay for ethnic cleansing and then gift it back to Israel as a strip mall",
            "score": 11,
            "replies": []
        },
        {
            "author": "LawlessCrayon",
            "body": "Dementia Donny at it again... Never was and never will be anything but an authoritarian and anyone in here who supports him can get the fuck out.",
            "score": 78,
            "replies": []
        },
        {
            "author": "SuspiciousMeat6696",
            "body": "220 U.S. Marines in Lebanon unavailable for comment.",
            "score": 8,
            "replies": []
        },
        {
            "author": "E_MusksGal",
            "body": "You all don’t realize gaza is prime waterfront real estate",
            "score": 7,
            "replies": []
        },
        {
            "author": "confusedjame",
            "body": "Nets lil play boy",
            "score": 3,
            "replies": []
        },
        {
            "author": "daggersIII",
            "body": "So call your reps",
            "score": 3,
            "replies": []
        },
        {
            "author": "EasyCZ75",
            "body": "It’s nothing but a ploy to accelerate peace talks.",
            "score": 3,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "I hope you’re right, but the side that is living under the open-air, apartheid-interment camp isn’t the side that needs to be convinced of peace…",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Express_Bath4632",
            "body": "its crazy how everyone takes things for face value these days... Its a bluff. \n\nnot a single arab nation has stepped up to assist Gaza but use Israel's advancements as a victimization point.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Bigfatmauls",
            "body": "He’s just been going off the rails recently",
            "score": 24,
            "replies": [
                {
                    "author": "EngagedInConvexation",
                    "body": "Recently since 1986.\n\nEDIT: he's *exactly* who he claimed to be doing the things he said he'd do.\n\nEDIT2:  *...Again.*",
                    "score": 80,
                    "replies": []
                },
                {
                    "author": "whawkins4",
                    "body": "“Recently”?   Really?",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Bigfatmauls",
                            "body": "It’s getting worse",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChitteringCathode",
                    "body": "Every time the dude talks lately it involves taking over something.  Dude's obsessed with having a legacy that involves taking something over.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Sometimes good but most of the time bad.\n\nIn his 2nd term he’s been good whenever he’s following **Javier Milei** and bad whenever he’s following **Conservatives**.\n\nFreeing Ross Ulbricht was good.  \n\nEliminating government agencies and firing government workers is good.\n\nReducing EPA regulation enforcement is good.\n\nJust about everything else he’s done is bad.",
                    "score": -35,
                    "replies": [
                        {
                            "author": "Melanzanna",
                            "body": "If you take any singular action per se, there is nothing to say either then put some moral judgment over it. The analysis is clearer if you put things together. And how is firing ~1% of the federal workers good? Do you really think doge is cutting to put aside or redistribute?",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": ">”*And how is firing ~1% of the federal workers good?*”\n\nFiring ~1% of federal workers in under 2 weeks isn’t good\n\nIt’s **GREAT**.  Unfortunately, 1% of federal workers haven’t been fired yet.\n\n>”*Do you really think doge is cutting to put aside or redistribute?*”\n\nThis far, it seems like DOGE has good intentions to reduce government spending.  Their approach has been libertarian with their (minute) recommendations thus far.\n\nThe bigger problem is that **government cannot be trusted not to grow government in the future.**\n\nAnything that DOGE accomplishes temporarily will inevitably be undone by more Republican/Democrat spending; likely by the time Trump finishes this term.",
                                    "score": -29,
                                    "replies": [
                                        {
                                            "author": "Melanzanna",
                                            "body": "Dude, how is DOGE any different from government? And how is it libertarian to shut down critics?",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": ">”*Dude, how is DOGE any different from government?*”\n\nWhat does that have to do with anything you or I said previously?\n\nD.O.G.E. is focused on making government more efficient.\n\nWhich government agencies have the mission of making government more efficient?\n\n>”*And how is it libertarian to shut down critics?*”\n\nCritics as in spoiled, useless government employees?\n\nAll government workers are “**public servants**.”  Private taxpayers—including D.O.G.E. **Volunteers**—have every right to criticize useless parasites.\n\nhttps://preview.redd.it/jncxwsjyiahe1.jpeg?width=1284&format=pjpg&auto=webp&s=cb9c020bbd4bb697be44702fd3a1cf333af58236\n\nIf they can’t stage the heat then they should get out of the kitchen and get a real job in the private sector.",
                                                    "score": -21,
                                                    "replies": [
                                                        {
                                                            "author": "Melanzanna",
                                                            "body": "The assumption doge=public is wrong. The doge = Musk's 500 billion dollars interests vs. people is more reality oriented",
                                                            "score": 21,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "OpenSourcePenguin",
                            "body": "No, even broken clock is occasionally right.\n\nLiterally nobody is benefitting from this absolute chaos than his puppet master oligarchs.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConfusedScr3aming",
            "body": "\\*Manifest Destiny Intensifies\\*",
            "score": 2,
            "replies": []
        },
        {
            "author": "Luchis-01",
            "body": "I guess he owns the Jewish Elite some favors",
            "score": 2,
            "replies": []
        },
        {
            "author": "luxurious-tar-gz",
            "body": "I'm sure the tensions that have been creating conflict will be so much better when America takes the entire place. No way that could ever to wrong! Nothing like that has ever gone wrong in the past!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rare_Tea3155",
            "body": "This is a great strategy. Arab countries in the Middle East will now step up with new ideas for how to govern the area in attempts to make a deal with Trump to avoid it. Just like the tariffs, they will resist for 1-2 days and then give in. Trump is master negotiator. This is a very good tactic - if you are unwilling to secure the area, we’ll just send the world’s most powerful military in. That will get Saudi Arabia, Qatar, and the other power players in the region to finally step up and work with the west to put a permanent plan in place that will get rid of Hamas for good.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bigpappahd77",
            "body": "I think it's a ploy to get all the middle east countries together to come up with a deal for this not to happen. I truly believe Trump is bluffing and doesn't actually want the US there.",
            "score": 10,
            "replies": [
                {
                    "author": "pdogmillionaire",
                    "body": "How do you truly believe he is bluffing? \n\nI’m trying to understand this common defense of Trump. “He didn’t mean that” “He’s bluffing” “Don’t worry just yet, he has a greater plan” \n\nI don’t see this defensive narrative with any other politician. IMO we should be able to take anyone serving the public and overseeing our tax dollars words literally. So really trying to understand here.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "bigpappahd77",
                            "body": "I get what you are saying. But Trump was for the most part keeping us out of conflict and trying to end wars and he has a track record of it too not just rhetoric like other politicians. Putting US troops in Gaza would certainly escalate a conflict or likely bring us into full scale war. No promises though, he is a politician and I only trust him as far as I can throw him.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hopbow",
                    "body": "Lol ok",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NetZeroSun",
                    "body": "There is definitely a strategy with bluffing and good cop / bad cop and all. And Trump is no stranger to tough negotiations (good or bad). \n\nProblem is you are gambling on winning. And every time you do. You burn a tiny bit of the bridge in negotiations with the other party. \n\nGreenland, Panama, Canada, Denmark for example won’t fully trust the US in negotiations in the future. And in some cases are now diversifying their economy to unhook from the US as a repercussion to some bluffs/strong man negations. Didn’t mean to talk about other countries so much but as an example to future blowback on international decisions. And for Gaza? Not clear why the US needs to put itself right in the middle of that shit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DowntownVisit77",
            "body": "Is this real or a deepfake",
            "score": 3,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Unfortunately it’s real.  We are living in a 🤡 🌎.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "DowntownVisit77",
                            "body": "I just googled to confirm. I’m horrified",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CheakyMonkee",
            "body": "Still haven't figured out what he's doing?   Watch how quick the war stops.  Lol.  \n\nLemme guess....you thought we were invading Panama.",
            "score": 5,
            "replies": [
                {
                    "author": "cows-go-moo19",
                    "body": "My favorite solution to war is ethnic cleansing. \n\nLook how quickly the war ended. All we had to do was massacre and expel all the civilians! Nobel peace prize incoming",
                    "score": 17,
                    "replies": [
                        {
                            "author": "CheakyMonkee",
                            "body": "Enjoy that not happening.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cows-go-moo19",
                                    "body": "It already has. Don’t make me pull up the images of Gaza",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "CheakyMonkee",
                                            "body": "Do it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CheakyMonkee",
                            "body": "Weren't we gonna invade Panama, Greenland and Canada.....or was it just a negotiating tactic?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CheakyMonkee",
                                            "body": "Wow  what hole have you been living in?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CheakyMonkee",
                                                            "body": "Go watch the Hegseth senate hearings and watch the Dems grill him and learn something.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CheakyMonkee",
                                                                            "body": "Can't the work n YOUR own.   Got it. Have fun being wrong AND lazy.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CheakyMonkee",
                                                                                            "body": "Even that was lazy.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "I hope you’re right…[but I’m not optimistic](https://www.timesofisrael.com/miriam-adelson-gives-100-million-to-trump-campaign-making-good-on-reported-pledge/amp/).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RireBaton",
            "body": "Hmmm, I think many Palestinians want to come to America. How about they bring America right to them? How convenient!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Several-Cheesecake94",
            "body": "And now all the neighboring countries are presenting their plans to secure and rebuild themselves.  When are you guys gonna wake up and realize this is how the man negotiates?",
            "score": 2,
            "replies": []
        },
        {
            "author": "rainbowclownpenis69",
            "body": "Guy at work was like “you see the left lose their mind!? Hahaha!”  I asked if he really wanted the US to take that area and send people and money there. He said it was just to “get other countries to keep Iran in check”. Bro, what?\n\nThe guy is obviously a Trump worshipper who loves seeing the “woke mob” in shambles, but damn. Surely smaller government and fewer regulations no include empire building in foreign countries?  Folks out here go out of their way to make sense of these ramblings.",
            "score": 2,
            "replies": []
        },
        {
            "author": "VARunner",
            "body": "I didn't expect the war crimes to happen: 1) in the first 30 days, 2) be announced publicly.\n\nIt's textbook ethnic cleansing.\n\nEveryone else has already rolled over and kissed the ring so \"Hey Nobel Committee. Where's that Peace Prize for Donnie?\"",
            "score": 5,
            "replies": [
                {
                    "author": "gatornatortater",
                    "body": "If he was going to get one, then he would have gotten it back in 2015.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kamadojim",
            "body": "Does anyone believe Trump is actually serious about this?",
            "score": 2,
            "replies": [
                {
                    "author": "madmedic22",
                    "body": "You don't? He's literally doing all the things he said he would. Fuck's wrong with you people...",
                    "score": 13,
                    "replies": [
                        {
                            "author": "kamadojim",
                            "body": "Trump thrives on chaos. This is a repeat of 4 years ago (to a certain extent). He talks all the time. He thinks out loud. He gets everyone to react to what he says, whether he's serious about it or not. So no, I don't believe this any more than I believe he's going to take over Greenland or annex Canada.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "mmmhiitsme",
                                    "body": "He was reading from a script... Assuming he can read.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gatornatortater",
                    "body": "Some people want to believe that he is.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "natermer",
                    "body": "Nobody even knows what it means. \n\nIt is literally people reacting to a single sentence.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "kamadojim",
                            "body": "https://preview.redd.it/32ezb52ceche1.png?width=500&format=png&auto=webp&s=3df0eac5e3119f888e9cfd12802140d134761497",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NetZeroSun",
                    "body": "I think some of it is posturing to draw attention elsewhere from rapid major changes internally for the US. But maybe also a strategy to throw shit on the wall and see what sticks. \n\nI mean it’s not trumps own money at risk or sending a trump family member as a soldier.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "kamadojim",
                            "body": "It could also be part of his negotiation strategy. He says the most outrageous stuff, so when he actually says what he really wants, it sounds much more reasonable by comparison.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dalamar437",
            "body": "I think this is just a negotiating tatic to get neighboring countries involved to help.  I think the last thing the middle east wants/needs is a US presence.   We'll see.",
            "score": 1,
            "replies": [
                {
                    "author": "DRpatato",
                    "body": "Using ethnic cleansing as a negotiation tactic should be condemned.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "halfageplus7",
            "body": "And this is how we inspire a generation to fly planes into our buildings (9/11).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Theotherfeller",
            "body": "Is this for real or just some random twitter stuff. I mean Trump if a profoundly uninformed border line special needs nut bag, but I'd have problems believing he is that much beyond the bend.  \nThat being said I am 100% sure that his cultists on a Canadian forum I follow will to a man back him up on this as a good idea 100% totally ignoring how they bitched about how the dems brought wars and Trump was a man of peace because unlike them I respond to reality.",
            "score": 1,
            "replies": []
        },
        {
            "author": "snowman226",
            "body": "Anyone who believes this is a possibility has not paid any attention to anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WillMarzz25",
            "body": "I still see homeless Americans and here we go with Israel and the Middle East. Bro I say let them kill each other while we feed our own citizens and rebuild our cities.\n\nYou wanna see rubble? Go to Detroit. You wanna see poor living conditions? Go to downtown LA or go to Baltimore Maryland. This is absurd.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OniTYME",
            "body": "Taking down NSAID was a great move but this was in the deep shits of stupidity and humiliation. I always told hardcore MAGA types that all these so-called \"America First\" people are actually \"Israel First.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikeeyboy22",
            "body": "When Disney bought ESPN, Vanguard owned ESPN. Same shit. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "44lbs",
            "body": "let him cook - we just stopped hyperventilating over tariffs",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectronicRhubarb845",
            "body": "I mean what else has worked all these years?",
            "score": 1,
            "replies": []
        },
        {
            "author": "plebbtard",
            "body": "Zion Don strikes again",
            "score": 1,
            "replies": []
        },
        {
            "author": "narasadow",
            "body": "![gif](giphy|X0bnTmo4izNfi|downsized)\n\nFlorida man in the WH",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ssimboss",
            "body": "Nope. Sorry, it is a repost of a repost of some comment on other platform. A literal definition of a swamp for keyboard warriors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Empty-Entertainer-42",
            "body": "https://preview.redd.it/sswwyrnwaqie1.png?width=439&format=png&auto=webp&s=70af532be75792415945dd94e1ff7675b0a3f4ab\n\nAccording to Stocktwits satir against Jews is a motive to be banned while the USA government promotes xenophobia. This is Zionism",
            "score": 1,
            "replies": []
        },
        {
            "author": "Short-Exercise-8374",
            "body": "As long as they build their own roads, amiright?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HAIKU_4_YOUR_GW_PICS",
            "body": "If he’s serious, it’s fucking stupid. And I’d prefer we fully back out of the area. But idk, it kind of strikes me as a parent calling a bluff on a pain in the ass teenager.\n\n“You don’t want to eat my two state solution? Fine, go to your room with no state solution. And your brother gets your dessert. “\n\nThis has pretty much been the Trump playbook in his personal, business and political lives for decades: make absurd claim, double down, get concessions, back down. You can argue its validity or effectiveness, but it is what it is and is who he is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SlowIsSmoothie",
            "body": "I agree, send all the Palestinians back to their pile of rubble. America first. They can figure it out themselves.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Hack874",
            "body": "Normally I’d say wtf that’s a waste, but I’m so sick of the perpetual Gaza victim complex that at this point I don’t care either way",
            "score": -20,
            "replies": [
                {
                    "author": "Grumpylumberjack",
                    "body": "“We should have an occupying force in the Middle East because I personally can’t stop being annoyed that these people complain about being occupied and killed”",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Hack874",
                            "body": "Where did I say anything like that lmao",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "Grumpylumberjack",
                                    "body": "Username appropriate",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Hack874",
                                            "body": "You don’t have much reading comprehension do you",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "OpenSourcePenguin",
                                    "body": "Literally above.\n\nIt's not \"victim complex\" if they are constantly being victimized.\n\nAnd your immeasurable pain and suffering from reading the reporting will be recorded for the history to see, because clearly you are the biggest victim",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "This is what happens and continues to happen when average Redditors “*don’t care either way*”:\n\nhttps://preview.redd.it/rhi4p2kikahe1.jpeg?width=1290&format=pjpg&auto=webp&s=060ac0b3c961c3de827482bb5f29392e220512d8",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Hack874",
                            "body": "The Palestinians voted a terrorist jihadist group into power. \n\nI’d rather not spend the money, but I ultimately don’t care what happens to them [when the majority of them saw nothing wrong with October 7th.](https://www.reuters.com/world/middle-east/poll-shows-palestinians-back-oct-7-attack-israel-support-hamas-rises-2023-12-14/)",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "**History didn’t start on October 7th**; despite what Zionists like Ben Shapiro *might* lead you to believe.\n\nA better question to ask [is why would a “majority” of them see nothing wrong with October 7th](https://original.antiwar.com/abdelhalim_abdelrahman/2024/10/06/october-7th-in-retrospect-why-hamas-attacked/)?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Hack874",
                                            "body": "History doesn’t start on any date. I don’t see how that’s relevant.\n\nSure America antagonized the Arab world, but do you also justify 9/11?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": "Libertarians belief in the **Non Aggression Principle**.\n\nWe believe that violence against civilians is never justified—whether it be purported by the U.S., Al-Queda, Mossad, the IDF, or Hammas.\n\n**Understanding why** doesn’t equate to **condoning violence**.\n\nI highly recommend watching the [SoHo Forum Debate between Scott Horton & Bill Kristol](https://youtu.be/LxdXqAkgOVs?si=_dhApoX1lluAQ0PR).\n\nIt highlights the difference between libertarian versus Military Industrial Complex approach to nation-building extremely well.\n\nOne side **learns from history**….while the other says **“this time is different”** every time.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Hack874",
                                                            "body": "Like I said, I’d rather not spend the money. But you seem to take offense (and an interventionist opinion, might I add) when I said one side was at fault.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "ENVYisEVIL",
                                                                    "body": ">”*But you seem to take offense (and an interventionist opinion, might I add)*”\n\nWhat part of anything that I wrote indicated an “interventionist” opinion?\n\nThat is hypocritical of you to say that; especially since your original comment **blamed the Palestinians** for “*voting in a terrorist jihadist group.*”\n\nBy your same logic…**do innocent Israel civilians deserve** Hammas-terrorist attacks given that [Benjamin Netanyahu also funded and supported Hammas](https://www.antiwar.com/blog/2023/11/30/conflicts-of-interest-how-netanyahu-aided-and-used-hamas/)?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Hack874",
                                                                            "body": "Your post is about anti-interventionism. So why are you so rabidly defending one side?\n\nYou throwing a hissy fit over me saying “I don’t care either way” shows you have an entirely misguided view of libertarian foreign policy.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ENVYisEVIL",
                                                                                    "body": ">”*Your post is about anti-interventionism. So why are you so rabidly defending one side?*”\n\n**One side (Israel)** has the backing of the U.S. Militarily Industrial Complex, IDF, and a deranged president wanting to demolish and steal 100% of the land of the **other side (Gaza).**\n\nIsrael controls Gaza.  **Gaza is an apartheid, open-air prison that is not allowed to have any airport, free trade, or shipping routes.**\n\n“**The other side (Gaza)** has 2 million civilians that have been ruled by a terrorist group for 2 decade that was proposed up by Benjamin Netanyahu.\n\nDespite that, you think that one side has the right to completely annihilate the other?\n\nLet me make this simple to you: **Actual Libertarians don’t want anything to down to with the Middle East**.\n\nThe more the U.S. gets involved with any foreign affairs, the worse off everyone gets.\n\nIt’s none of our business, no U.S. tax dollars should be funding either side, and there is zero libertarian argument to support Trump’s moronic goal to demolish and claim Gaza as U.S. territory.\n\n>”*You throwing a hissy fit over me saying “I don’t care either way” shows you have an entirely misguided view of libertarian foreign policy.*”\n\nMillions of innocent civilian casualties are more significant than your weak ad hominem attacks\n\nIt’s not that you don’t care either way.  It’s all of your warmongering, statist comments that you said after that that show that you are in lockstep with the pro-war lobby.\n\n**”Not caring”** is incompatible with all of your arguments.  **It’s a contradiction**.",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Hack874",
                                                                                            "body": ">Let me make this simple to you: Actual Libertarians don’t want anything to down to with the Middle East.\n\nThis sentence is nonsensical but I’ll try my best. I literally said I’d rather we stay out of it. I have no idea how you’re drawing any other conclusion.\n\n>It’s not that you don’t care either way.  It’s all of your warmongering, statist comments that you said after that that show that you are in lockstep with the pro-war lobby.\n\n…What? How does saying I’d rather not engage and save the money mean I’m a warmongering statist? Are you feeling okay?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ENVYisEVIL",
                                                                                                    "body": ">”*I literally said I’d rather we stay out of it. I have no idea how you’re drawing any other conclusion.*”\n\nAlso you:\n\n>”*but I’m so sick of the perpetual Gaza victim complex*”\n\nStill **no idea how I’m drawing a conclusion?**”\n\n>”*…What? How does saying I’d rather not engage and save the money mean I’m a warmongering statist? Are you feeling okay?*”\n \nDon’t gaslight.  Actually refute my last response instead of ignoring it.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Hack874",
                                                                                                            "body": "You do know you can have an opinion while also not wanting to spend money on it, right?\n\nIf you were a true libertarian you wouldn’t have your panties in a bunch about my opinion as long as I don’t want to intervene.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Toaster_Toastman",
                                                                                                                    "body": "Dude has a hard on for Israel. It's weird, not my country, I don't care, don't get involved, don't send money. Pretty simple",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "machyume",
                                                                            "body": "As an outside observer, I think you are quoting him out of context here.\n\nHe is saying that these people voted their interests, and their vote led to the current outcome, and that's for them to ensure, not for America to fix.\n\nYou decoupled his A therefore B logic, and is saying basically that \"A is misunderstood because it has history\".\n\nBut ultimately, what does history even mean here when historical bounds are arbitrary? What is the point that bringing that up is even trying to address? \n\nAre you against the original logic opinion that says that America should not be involved in dictating future outcomes? Because it sounds like you do.\n\nBy staying short your silence makes an implied outcome.\n\n\"Because history justifies A...\"\n\n... then what? His original point is wrong and that America should intervene?\n\nHence why he brought up the interventionist. Which you denied. Either you implied that by negating his overall point, or your logic is wholly pointless and you are simply picking and choosing parts of words.\n\nOr you are disingenuous.\n\nI will note that is logically sound to blame both sides in this perpetual conflict because both sides have done actions deserving of blame. The OP can blame Palestinians simply because using history in a bloody conflict is arbitrary. You cannot absolve public acts of terror using context and calling it war. It isn't a war if the force difference is so asymmetric that one side has to use civilian shield tactics.\n\nThis isn't a war. It is colonial suppression and ethnic cleansing. The population is a sub-group of an asymmetric sovereign power.\n\nNone of this matters anymore because we are rapidly approaching rule by might. Might makes right. And might is derived from the mandate of the people, in this case, the popular plurality of the people of the empire.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "3_Thumbs_Up",
                                                                    "body": ">Like I said, I’d rather not spend the money. \n\nYou're not spending any money. You are a separate entity from your government. The money is already stolen from you, and equating government spending to your own spending is unlibertarian thinking to begin with.\n\nThe money stolen from you, the terrorist act on october 7th and the potential displacement of 2 million Gazans are 3 different moral wrongs perpetuated by different people.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "OpenSourcePenguin",
                                    "body": "Oh no, constant harassment and killing didn't make them a fan of Israel? Very surprising.\n\nIsraeli actions are radicalizing people. When you make people have nothing to lose, you make them dangerous.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hack874",
                                            "body": "Justifying terrorism is REAL weird but you do you mate",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "OpenSourcePenguin",
                                                    "body": "I'm not justifying it, I'm explaining it. \n\nJust because you close your eyes and ears doesn't mean the world ceases to exist. This is how radicalization happens and we need to understand it before attempting to solve it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Hack874",
                                                            "body": "You are attempting to justify it though. Otherwise why would you defend terrorist supporters?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "OpenSourcePenguin",
                                                                    "body": "Your Israeli mind games aren't fooling anyone",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OpenSourcePenguin",
                    "body": "Oh no, \"victims are victims, how dramatic\"\n\nYour problem is their \"victim complex\" not Israel and US MIC keeping the chaos alive to suck the governments dry?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Terrorist be losing their shit infighting",
            "score": -6,
            "replies": []
        },
        {
            "author": "JohnTheSavage_",
            "body": "Imagine the 4d chess move:\n\n\"Alright, Bibi. Gaza is the US now. I'd suggest you get your fucking troops and settlers out of it. Unless you plan on invading us?\"",
            "score": -5,
            "replies": []
        }
    ]
}