{
    "title": "What does a libertarian do when confronted with a group that ignores his rights?",
    "author": "JoanTheSparky",
    "subreddit": "Libertarian",
    "rank": 495,
    "score": 16,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 82,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iicms4/what_does_a_libertarian_do_when_confronted_with_a/",
    "id": "1iicms4",
    "selftext": "as per title..  say it's about a parcel of land somewhere.  A group comes and is able to use (lethal) force to take the land from the libertarian.  What does he do?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuchAd4969",
            "body": "You make a decision. Do you stay and fight, perhaps to the death, or do you submit and walk away?\n\nAs the other poster said, this is the exact scenario of property tax.",
            "score": 15,
            "replies": [
                {
                    "author": "JoanTheSparky",
                    "body": "OK, but what about your 'right to own land' in that case.. unless you win it isn't really a 'right' you can rely on - obviously - as you seem to lack the means to enforce it against others who think it is \"their right\" to take what they want when they want by any means they got at their disposal.\n\nDoesn't that mean that (natural) 'rights' are only concepts you can rely on when they are enforceable?\n\nYou know what you BUY with property tax? You pay a bigger / stronger group to enforce your right to property - as you alone are not able to enforce it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SpeakerOk1974",
                            "body": "Hmm except you actually don't own your property. If you don't pay taxes your property is seized. A private protection force would just not show up if you didn't pay. See the difference?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "When the priv prot frc doesn't come, because you didn't pay - does that mean that you are fair game for anyone that wants to try and thinks that they can overcome you?  I mean, somehow the corrective market forces need to work here..  you can't have it both ways.\n\nEither those rights require there to be a paid force that enforces them against groups that are larger than you (otherwise they will be not valid property-rights you can count on)\n\nor\n\nyou have to explain how you plan on enforcing those property rights successfully against a stronger force on your own (reliably).",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Errororoeoe",
                            "body": "Is your argument that unless you can protect a right successfully, then you do not have said right? If so, rights simply do not exist. What if someone cuts out your tongue? No freedom of speech anymore! What about when the government tear gases a peaceful protest? No more right to assembly! \n\nOn top of that, your next argument is that property tax is paying a bigger guy to protect you. What happens when an even bigger guy takes on your group? What happens when the government decides it has no duty too protect you (Town of Castle Rock v. Gonzales)? The government is also forcibly taking your property (money) via the property tax under threat of the said bigger group taking your property. So, you aren't strong enough to protect your property (money) from this bigger group. Meaning once again we loop back to property rights don't exist.\n\nRights are not things that cant be forcibly taken, as that would mean no rights could ever exist while humans are still mortal.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "*\"\\[So\\] unless you can* *~~protect~~* *\\[exercise\\] a right successfully, then you do not have said right?\"*  Yes, pretty much.\n\n*\"..so, rights simply do not exist.\"*  When you can exercise a right it obviously exists.\n\nMy point is that a libertarian can only rely 24/7 (and exercise) libertarian (natural) rights if a majority of the populace 1) agrees with him on those rights and 2) are there with him to enforce those rights AGAINST minorities or individuals who do NOT adhere to them, who do not follow them, who oppose them.\n\n*for example* \\- What about my (natural) right to be able to take what I want when I want where I want with the means at my disposal and at the cost of others if opportune?  This \"right\" is what nature, what wilderness operates under..  everybody else probably doesn't want me to have this right, sure, but still, I think I have that right.  So can I rely on it or will I have a problem when I try to exercise it?  And why is that?  Because it exists (in nature) or because a majority is opposing it?\n\nJust because libertarian (natural) rights more or less look OK to you doesn't mean that they are the will or mindset of everybody.. I mean, your threat of using lethal force to exercise your rights against somebody else who has a different view on the rights that he wants to exercise is a sign that those rights are neither objective NOR natural.  They are arbitrary and have a goal - probably even based on the majorities mindset (and what a soceity is actually about).. but still, without the majority actually confirming this and enforcing them SUCCESSFULLY against orther-minded minorities / individuals you can't rely on them.\n\nYou as a individual libertarian are UNABLE to rely on the set of rights you think are applying to you.  You can wish for them, but without a majority of the populace enforcing them successfully against opposers they will not be rights, but wishes or desires at best.\n\nPS:  *\"What happens when an even bigger guy takes on your group?\"*  Well, guess how the natives lost their right to roam \"their property\".  It's all about strength in numbers and having the bigger stick and enforcing ones will against opposing groups.. libertarian (natural) rights, just like any other rule-set relies on a superior power to be rights, that an individual can count on (or not, if it has different ideas about what is right & wrong).\n\nPPS: *\"What happens when the government* *~~decides it~~* *has no duty too protect you?\"*  Well, obviously the legal experts found that the rules didn't cover this case, which means the assumed right actually didn't exist.  Exactly what I'm trying to tell you.  Rights only exist when they are being enforced by the majority.\n\nPPPS: Look at 'human rights' for example and violations of those rule sets.. can all the humans on the planet count on those right applying to them or not?  What does it actually take for those 'rights' to be reliable for a human who expects they apply to him, no matter what?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "You're conflating concepts here. Just because someone can walk up and murder me doesn't mean that I don't have a right to life. They've just violated my right.\n\nAlso, there is nothing in this world that can be 100% \"relied on.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "No, they violated your desire/wish to stay alive, not your right.  It only becomes a right if they are being punished for this violation by the rest of us..  as you have been unable to enforce it on your own - obviously.\n\n\\[edit\\]\n\nright:  a moral or legal entitlement to have or do something",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "My definition of rights (the one you shared at the bottom) is consistent, yours is not. Rights are not rights if they are dependent upon the will of others to exist. They are also not defined by the enforcement of them any more than mathematics are defined by people's ability to write equations.\n\nMorality transcends individuals and groups. It is immutable.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "Are you really sure that 'morals' means what you think it means?\n\nI counter your view by quoting this:\n\n*As we can see, the Oxford English Dictionary defines ethics and morals similarly, both dealing with the principles of right and wrong. The key difference is that ethics concerns rules from an external source and* ***morals are based on each person’s own principles around right and wrong.***\n\n* ***Ethics*** *– Rules of conduct in a particular culture or group recognised by an external source or social system. For example, a medical code of ethics that medical professionals must follow.*\n* ***Morals*** *– Principles or habits relating to right or wrong conduct,* ***based on an individual’s own compass of right and wrong.***\n\n*Source:* [*https://www.oxfordcollege.ac/news/ethics-versus-morals/*](https://www.oxfordcollege.ac/news/ethics-versus-morals/)\n\nI guess you subscribe to the notion of an 'objective morality' there somewhere.. I don't.\n\nAs per above definition (and plenty like it made by philosophers / the social sciences) can individuals morals be different **and more importantly opposites.**  What you think is right and wrong does not need to match what I think is right and wrong and that of anyone else.  \nEthics now (for me) are what all our common / compatible morals become WITHIN a society.  And especially under this scenario can we all have the moral conviction - for example - that other races, ethnicities, genders, etc. than the one we represent are less worth, not equal to us.. and if we are the majority and carry a bigger stick we can then enforce this morale within our society against any minority or individuals that thinks otherwise.\n\nSee how this is going to work?\n\nSee how this applies to libertarian (natural) rights vis a vi groups or individuals who have different rights and wrongs on their mind?\n\nThe absolutist view of your morals for me is a relative thing and not realistic.  For it to become a dominant ethic of a society (for me) relies on a majority with a bigger stick standing behind it, not more, not less.\n\n*PS:  this argument also puts to rest the notion of an 'objective morality'.  There isn't one.  Societies made up of individuals have Ethics based on the common Morals of it's members (like a Venn-diagram) and are organizational constructs whose whole purpose/function is to suppress morals of minorities/individuals that oppose the majorities ethics.  In the case of our human societies their goal is to enable cooperative work sharing specialists to be an evolutionary superior form of existence for a human than the generalist, who is capable of surviving in wilderness, which doesn't enforce common morals (Ethics).*\n\nPPS: this view of things also is consistent with the morals of a thief, or sociopath. Those morals are simply not compatible with the morals of a cooperative work sharing (I assume, but do not declare) MAJORITY who wants to be able to specialize to enjoy the gains of higher efficiency and what that means for the individuals (now easier) acquisition of resources for survival, reproduction and comfort.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "He shoots them",
            "score": 8,
            "replies": [
                {
                    "author": "Hot_Most5332",
                    "body": "This is just describing property tax, so that’s clearly not true as otherwise every single person in this sub would be dead or in prison.  I’m just going to assume that no one here could take on their respective governments in a firefight and win.\n\nEven if you don’t own land this logic applies to a plethora of things.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "GGM8EZ",
                            "body": "You by yourself can't. this is why we wait for midwits to start shooting then we organize it. that's literally how the rev war started",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "PS: the rev war was about 'no taxation without representation', which should give you a clue.  Representation where?  To what end?  What was 'being represented' actually about?\n\nPPS: this is actually what I'm trying to angle for with my original post, but which is made very complicated by the way (most?) libertarians think about (natural) rights, how they expect them \"to work\".  In a nutshell I'm trying to argue that a 'monopol on force' (biggest group that is successful enforcing their will) is a natural occurrence, esp in a libertarian society and that the problem you have with it (state, government) are actually not its existence, but by the way that society (over time) gets to the rules that this monopol enforces, which leads to non-libertarian ideals being enforced against all odds - reliably over the history of humankind.\n\nThe nut we have to crack is the process by which we get to the rules as it is clear that a monopol will naturally form that enforces it and it obviously will be capable of enforcing rules that benefit a few at the cost of the rest.. so, how does the rule creation and maintenance process look like, which obviously sooner or later deviates from libertarian ideals and serves a few only.  Does libertarianism has got an answer to this problem?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "JoanTheSparky",
                                    "body": "\"then we organize it\"  .. so you form a group that figures out the common ground-rules among its members, which then goes and enforces them against other groups, which naturally can only be successful if your group beats the other group - for which the chances are the highest if that other group is a minority or individuals.. so in a sense you become a sort of organization that enforces its rules on the ones who do not want to follow them, correct?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "GGM8EZ",
                                            "body": "TLDR ; Forcing people to stop forcing themselves apon you isn't governmental or authoritarian. They're mutually exclusive\n\nIntent\n\nthe government and people who like government have the intent to force people to do something against their will for control and monopoly of power.\n\nMe and libertarians alike just want people to fuck off our property so we can be at peace for our lives and live them how we want with the abilities we have.\n\nif fighting for consent is \"forcing your rules on them\" and fighting against it is also the same to you then we are just arguing semantics since we just don't agree on definition and the debate is useless\n\nbut either way\n\nfighting to force people to do things and fighting to stop your own consent being violated isn't bad and is objectively good.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "PS: there is no objective good or bad rules IMHO.  Just look at wilderness - that is nature and works - that is survival of the fittest individual by any means available and at the cost of other individuals if opportune.  You want to label that bad?  OR good? By what measure?  By what authority?\n\nWhat this natural darwinistic modus operandi is NOT COMPATIBLE with is the more efficient way of cooperative work sharing among specialists who VOLUNTARILY exchange products on markets.  Them specializing is what takes from their ability to be a good generalist who is capable to exist in a wilderness, to successfully defend himself and his stuff.\n\nAnd here comes the rub.. this specialized work sharing existence requires the enforcing of rules that forbid (natural) opportunistic behavior.. this is what leads to personal freedom and private property to be required concepts individuals can rely on and want to have.  Nothing objective about it. Those principles lead to a more efficient existence (turning lifetime into resources for survival, reproduction and comfort) than the alternative (which has no such rules) - wilderness.\n\nThis is what makes those principles 'good' in your eyes, because you need them.  And it requires their enforcement against 'wild' individuals who do not want to adhere to those rules, who are able and willing to exist 'wild' - which then leads to the can of worms of a rule enforcing service provider I've been trying to detail in the other reply?!?",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "Forcing people to leave you alone and being SUCCESSFUL at it requires your force to be overwhelmingly bigger than that other force - otherwise you can't rely on it.  This is why you team up (organized militias has been suggested) and eventually even figure that OUTSOURCING this 'rule enforcing' job to a 'rule enforcing supplier' is more efficient than you doing it yourself with your musket.  *Because you actually got better things to do that you are more adept at - which is what cooperative work sharing specialists on free markets who voluntarily exchange products with each other is all about.  This is what automatically, naturally leads to 'a government'.*\n\n\"Authoritarianism\" is another fish of kettle.\n\n*\"people who like government have the intent to force people to do something against their will\"*   Listen, there are people out there who naturally appear and LIKE to control others, who want to force others to provide them with the necessities of life FOR FREE.  That is THEIR WILL.  THEY WANT TO DO THAT - all day long.  Do you agree that such people exist?\n\nIf so.. it is your will (to be left alone) against their will (to not leave you alone).\n\nWhat do you do?  What does this lead to?\n\n*\"we are just arguing semantics since we just don't agree on definition and the debate is useless\"*  No we aren't.  I want you to realize that libertarian (natural) rights are only existing if libertarians team up and enforce those rights VIOLENTLY against minorities or individuals who have a different mindset, a different will - and this will lead, due to economies of scale to 'a structure' that takes in taxes to be paid for it's specialty service, which is providing (natural) rights the libertarian (taxpayer) can rely on.\n\nThis is inevitable IMHO.\n\n**But if it is inevitable, what is the actual problem then that leads to this 'structure' sooner or later starting to enforce rules that benefit a few at the cost of the rest?   How does that happen?   I think because of people who WANT others to provide them with 'things for free' get in charge of that construct and start to enforce rules to that goal..**\n\n**So, how do libertarians want to prevent that structure from being controlled by a few only, if it forms naturally in the first place and whose function is to successfully enforce rules against minorities / individuals against their will? Isn't that the very problem you're facing right now?  Well, how do you avoid it as soon as a libertarian militia has liberated everything and is starting to specialize in 'rule enforcing services for libertarians'?**",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "You got me. Libertarian theory is incoherent because it's possible for one group to overwhelm another. 🙄\n\nBtw, that also applies to statism though, since states are toppled all the time by larger states.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JoanTheSparky",
                            "body": "OK, so you accept that (natural) rights require a majority of people who are able to enforce their common beliefs about what is right and what is wrong against minorities or individuals who do not subscribe to them.\n\nThis means libertarians would need to have a way to figure out AND ENFORCE natural rights as a group - as the individual clearly will not be able to do this on his own, least be unaware which of his personal rights are actually common (in the majority) and which ones are in the minority?  Yes?\n\nWhat does that look like, if you do not subscribe to the idea of a government?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "\"OK, so you accept that (natural) rights require a majority of people who are able to enforce their common beliefs about what is right and what is wrong against minorities or individuals who do not subscribe to them.\" - No, no I don't. Rights are intrinsic to our humanity, that's what makes them natural. \n\n\"What does that look like, if you do not subscribe to the idea of a government?\" - There have been countless books written on this topic that go into exhaustive (and exhausting) detail and prove the case compellingly.\n\nDavid Friedman, Hans-Hermann Hoppe, Robert Murphy, Rothbard, etc all have entire books about this. If you are here in good faith, I recommend you look into the arguments on your own.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "JoanTheSparky",
                                            "body": "Have you looked at wilderness or what happens between tribes?  Do you call what is possible there natural rights that are \"intrinsic\" to our \"humanity\"?\n\nWhy do you need arms (to enforce those rights against other humans) if those rights are intrinsic to humans and our humanity?\n\nThose right are anything but natural.  Nature (wilderness) doesn't have liberty or property.  Such rights do NOT exist in nature, ergo they are NOT natural.\n\nThey are artificial. A species of two legged apes that stumbled into the efficiency gains that cooperative work sharing among specialists brings NEEDs those rights.  That is why we have them.  It's a societal requirement for individuals in a society / group that is about to voluntary exchange resources among each other to have those rights (rules) and apply them to each other.  That is what they are about and what they are for.\n\nNatural, LOL.\n\nNeither Friedman, Hoppe or Rothbard have delved into this afaik (not even Ms Rand, at least she was smart enough to realize police and army are needed, but not exactly how and why).  Because if they had, they would have figured out that another \"feature\" that emanates from those rights being a requirement for specialists who OUTSOURCE tasks they are not adept at (which increases their efficiency of turning lifetime into resources for survival, reproduction and comfort in what they are adept at) is strength in numbers, that they HAVE TO team up to enforce those rights (against opposing minorities / individuals) and that this right enforcing construct sooner or later becomes a monopol on force.. and further that it is not the monopol on force itself that is our problem (because that thing actually is a \"natural\" phenomenon for a society) - but the way it creates and maintains the rules that it enforces for all are what is the problem.\n\nYou want to bear arms because not all (or most) humans have those intrinsic values in them.. well, what do you think will be the intrinsic humanity of the humans who are creating and maintaining the rules that this inevitable monopol on force is going to enforce?  That is our problem - the rule creation and maintenance process is NOT COMPETITIVE enough.  Too few are in control of it and are PERSONALLY INCENTIVIZED to create and maintain rules that benefit them at the cost of the rest.\n\nAnd a libertarian society will run into that very same problem IMHO as strength in numbers is inevitable creating a monopol on force whose job it is to enforce libertarian (natrual) rights for specialist  libertarians AGAINST minorities or individuals who oppose those rights.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "\"Those right are anything but natural. Nature (wilderness) doesn't have liberty or property. Such rights do NOT exist in nature, ergo they are NOT natural.\" - Again, you are conflating concepts here. Natural in the context of rights refers to \"by design\" not \"in every observable circumstance in nature.\" To use the terms of the American founders, it means \"endowed by our Creator.\" What you are referring to with tribes doing heinous things to each other is just wide-scale violations of those rights, and is wrong.\n\n\"They are artificial. A species of two legged apes that stumbled into the efficiency gains that cooperative work sharing among specialists brings NEEDs those rights. That is why we have them. It's a societal requirement for individuals in a society / group that is about to voluntary exchange resources among each other to have those rights (rules) and apply them to each other. That is what they are about and what they are for.\" - With all due respect, this is a very weak worldview. If your justification for why I shouldn't steal from you and burn your house down is \"I don't like it, and it's not socially beneficial,\" that's really not persuasive and is just a subjective matter of opinion. It's also, more importantly, just not true. You are created in the imago dei, which is why it's wrong to harm you and violate your property. That fact transcends everything else and is the only objective grounds of personal liberty that exists. Without that fact, then you're right, rights mean nothing and it's not wrong to r\\*pe, kill or steal.\n\nAs for your points about rights enforcement agencies becoming monopolies on force, I disagree. Why is there a greater risk of monopoly in that specific context than in any other business? Natural monopolies rarely form and never actually last long when they do. The only way that enduring monopolies are created is through criminal action that disregards human rights, which is what we refer to as the \"state.\" \n\nIf your biggest critique of libertarian theory is that it could theoretically eventually devolve into what we already have currently, then I'll take it, lol. This is the reason that Jefferson said what he said about the \"tree of liberty.\" It needs to be maintained, and often that maintenance requires force against tyrants. Nobody is claiming that anarchy would be 100% stable and impossible to overturn. As far as I'm aware, nobody has ever claimed such a thing. But it's preferable to what we have right now, even if it's temporary.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JoanTheSparky",
                                                            "body": "So wilderness-rules are not 'endowed by the creator' then?  And why do you think that other people believe in a creator in the first place?  And if he's been so powerful to create all this - wtf do you need arms to enforce rights that the creator has endowed us all with?  Did that fella forget to endow all of us?  What for?  So you can bear arms?  How psycho is that?\n\n*\"If your justification for why I shouldn't steal from you and burn your house down is \"I don't like it, and it's not socially beneficial,\" that's really not persuasive and is just a subjective matter of opinion. It's also, more importantly, just not true.\"*  You know what those tribes conflict over and do heinous things for with other tribes that they are in conflict over?\n\nA cooperative society, made up of more-or-less selfish (by their nature) INDIVIDUAL beings, who compete with each other over resources for survival, reproduction and comfort.. well, it is clear that they figure that work sharing is MORE EFFICIENT than everybody on their own, its obvious.  Other species do it too.. sea lions, orcas, dolphins, all the big apes, etc, pp.   You think those have no rudimentary rules about how they go about with each other?  Ever watched chimps? Or gorillas?\n\nWe got speech, we are a bit more sophisticated.. but overall the same stuff.  So yeah.. tribes already figured that work sharing among members is more efficient and that this means that other tribe members need to be treated differently than other tribes that they are in competition with over resources.\n\n*\"If your biggest critique of libertarian theory is that it could theoretically eventually devolve into what we already have currently, then I'll take it, lol.\"*   So you want to repeat history over and over?  To what end?   Masochism?  Sadism?\n\nWe only need those rights to be able to exist as cooperative work sharing specialists to be able to gain efficiencies and enjoy a higher comfort of living compared to the alternative that has no rights - wilderness.  This most likely also is where Religion comes from.  Stories about powerful beings and other stuff that captivate tribes people and \"incentivizes\" to behave socially..  the better and more convincing the story, the better the for the tribe - socially..  it's a simple evolutionary thing.  The more efficient, the better adapted, the better working concept/framework is more likely to succeed and prevail.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "\"So wilderness-rules are not 'endowed by the creator' then?\" - That is a silly question and makes me think that you're not engaging in good faith here, but I'll bite. If you know anything at all about the Bible, you know that all of the \"wilderness rules\" you're referring to came into the world after the fall of man, they are not an inherent part of creation, unlike humanity and the rights inherent within us.\n\n\"And if he's been so powerful to create all this - wtf do you need arms to enforce rights that the creator has endowed us all with?\" - Another odd question. You're on a roll today. Self-defense is an allowance given to us by God explicitly in scripture. I'm also not convinced that you know what the word \"endow\" means, maybe google terms next time before you start going off half-cocked.\n\n\"You know what those tribes conflict over and do heinous things for with other tribes that they are in conflict over?\" - I had a stroke trying to read this.\n\n\"it is clear that they figure that work sharing is MORE EFFICIENT than everybody on their own, its obvious\" - Yes... and?\n\n\"You think those have no rudimentary rules about how they go about with each other? Ever watched chimps? Or gorillas? We got speech, we are a bit more sophisticated.. but overall the same stuff. So yeah.. tribes already figured that work sharing among members is more efficient and that this means that other tribe members need to be treated differently than other tribes that they are in competition with over resources.\" - Bro what are you going on about? This is mind-numbing.\n\n\"So you want to repeat history over and over? To what end? Masochism? Sadism?\" - And your alternative suggestion is...? No, that's not what I want. I want freedom. I just recognize that freedom requires diligent, bloody maintenance.\n\nThat last paragraph makes me think you're just arguing for the sake of arguing but don't have an actual point.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JoanTheSparky",
                                                                            "body": "\\#1/2\n\nThat is not 'bad-faith' - that is a lack in believing of what the Bible states or similar frameworks (before it and besides it) which IMHO are about inspiring/incentivizing socially supportive behavior among its believers - giving the group/tribe it affects an evolutionary advantage over groups/tribes that do not have this - which is why they prevailed.  Which means I acknowledge religions evolutionary function, but also realize that it has been surpassed in its efficiency by modern concepts - it's been a long way from natural religions over polytheism to monotheism - which (you won't like this) will also fade and all of it eventually dominated by 'rule-of-law-made-by-men'.  And no, that is neither a clean nor a straight-forward process and from within a personal - say 100 year - observation window that an individual has it naturally looks way way more static.  I'm talking several 100.000 years here.\n\nAll that being said - I believe what the natural sciences figured out via reasoning and deduction examining the evidence for what they found around us.  And there it is biology that (based on physics and chemistry) tells us how individual life \"behaves\" which then should become the foundation for the social sciences, esp. political science and economic science.  Alas this is NOT the case yet afai-can-tell, which is why compared to the other natural sciences that underpin social sciences are its thesis only partially useful theories..  not good but also not too bad, it all just takes time.\n\nSo, to keep rolling - I don't need God's approval to defend my existence - this is rather a defining feature of life, which makes life what it is - it survives.  That is what 'survival instinct' is about and logically will lead to the demise of a living being if it wouldn't have it..  I mean, if it is not up to trying to survive itself (and this includes defending its existence) then it will cease to exist, it will stop being alive.  \nIf you need approval by a god for this feature of life that you represent to feel better / quench your doubts, by all means, go for it.  I don't need that.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "JoanTheSparky",
                                                                            "body": "\\#2/2\n\n*\"And your alternative suggestion is...?\"*  not an alternative at all.  Maybe an alteration / modification?  I'm modest after all.  What we have mostly works.  What doesn't work and how and why that is is what I'm after - to see if we can do something about it or if it is not on the cards, due to how life / nature works.\n\n*\"I want freedom.\"* And others want that you provide them with the necessities for their live at no cost to them - approved by (their) God or not.\n\n\"*I just recognize that freedom requires diligent, bloody maintenance.*\"  So why do our societies delegate this maintenance to a few only, who per biological sciences and how life works will try to get ahead of the rest of us at the cost of the rest of us?  \nNeed it spelled out of how this ACTUALLY works?  Here you go:\n\n*\"The interest of the dealers \\[referring to stock owners, manufacturers, and merchants.. anyone really\\], however, in any particular branch of trade or manufacture, is always in some respects different from, and even opposite to, that of the public.  To widen the market and to narrow the competition, is always the interest of the dealers.  To widen the market may frequently be agreeable enough to the interest of the public; but to narrow the competition must always be against it, and can serve only to enable the dealers, by raising their profits above what they naturally would be, to levy, for their own benefit, an absurd tax upon the rest of their fellow-citizens.\"*\n\n*&*\n\n*\"The proposal of any new law or regulation of commerce which comes from this order, ought always to be listened to with great precaution, and ought never to be adopted till after having been long and carefully examined, not only with the most scrupulous, but with the most suspicious attention.  It comes from an order of men, whose interest is never exactly the same with that of the public, who have generally an interest to deceive and even to oppress the public, and who accordingly have, upon many occasions, both deceived and oppressed it.\"*\n\nAdam Smith, Wealth of Nations, chapter 11, part 3, last paragraph\n\nThis is why libertarians want competition **and my point is that a libertarian society will wind up with a monopol on force controlled by a few who then do what individual living beings ought to do - trying to get ahead of the rest of the pack by any means available and at the cost of others if opportune.. evolution says 'Hi'.**  *No idea what the God's say about it, they don't talk to me (sarc).*",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "Ok, well I have no interest in arguing with status quo warriors, so have a nice day, sincerely.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "JoanTheSparky",
                                                                                            "body": "See, that is what I'm talking about - your morals, wishes and mindset colliding with my morals, wishes and mindset.  That is how that looks like.  I hope you learned something about morals vs ethics vs rights and how those inter-act with violence / force.\n\nAnyhow, all the best to you too.\n\nPS:  \"status-quo-warriors\"?  Like dude, we're in a subreddit labelled 'Libertarian'.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "You said \"what we have mostly works.\" That means that you're mostly fine with the way things are... but you also previously stated that the big \"risk\" of anarchy is that it devolves into a state, which is what we currently have. So presumably, you're fine with both statism and anarchy, because they eventually end up in the same place. So yes, you're essentially defending the status quo, and I don't really have the time, energy or desire to argue with you about that, that's all. No ill-will from my end, we just have a fundamental disagreement about the nature of things and I don't see the value in arguing about it when we could just agree to disagree.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "JoanTheSparky",
                                                                                                            "body": "Huh, I was understanding 'status quo warrior' to mean \"fighting the status quo\", so the opposite what you obviously meant.\n\nSomebody else in this thread was stating: *\"Yes. I'm a libertarian, not an anarchist. \\[..\\] Improving from what exists, through tinkering, is how we got to where we are as humans, and how we will improve.\"* [*https://www.reddit.com/r/Libertarian/comments/1iicms4/comment/mbaajjc/*](https://www.reddit.com/r/Libertarian/comments/1iicms4/comment/mbaajjc/)\n\nI agree with that if it helps?\n\nSo are you an anarchist then?\n\n*\".. we just have a fundamental disagreement about the nature of things and I don't see the value in arguing about it when we could just agree to disagree\"*  If you're an anarchist and believe in the concept, then yes.  But how does an anarchist society avoid \"Might makes Right\" / \"Strength in Numbers\"?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "\"Huh, I was understanding 'status quo warrior' to mean \"fighting the status quo\", so the opposite what you obviously meant.\" - Fair enough, no worries, I could have been clearer.\n\n\"So are you an anarchist then?\" - Yes, I am.\n\n\"But how does an anarchist society avoid \"Might makes Right\" / \"Strength in Numbers\"?\" - There's nothing about an anarchist society that prohibits cooperative action/defense. Strength in numbers can still apply just as easily as under a state, and in fact, without a state, you don't have to worry about a monopoly coming in and prohibiting you from defending yourself and your particular clan. Waco is a good example of this... in a stateless society, for one, nobody would likely be trying to go after Koresh's group in the first place, but if they were, there wouldn't be virtually infinite resources able to be allocated toward going after them (as was the case with the ATF). It would actually be prohibitively dangerous and expensive to wage attacks like that, whereas, $10 million here and there is nothing to a government.\n\nIdk if that clears anything up.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "JoanTheSparky",
                                                                                                                            "body": "If Anarchy would work - why did we not stick with tribes / clans in villages and find ourselves in nation states instead?  I mean, modern Anarchists can't be the first to figure such a system.. right?  Why are there no 'survivors'?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "None",
                                                                                                                                    "body": "I don't have an answer for that. I just believe it's a better than statism, especially in a post-industrial world.\n\nIt's worth noting though that there are still tribal societies today.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "JoanTheSparky",
                                                                                                                                            "body": "Kudos, that is an answer I can live with. It shows wisdom, modesty and humbleness.  I appreciate that very much.\n\nYou mean post-scarcity?  My whole logic is based on starting from natural sciences.. esp biology and how life functions, how nature works.  Libertarianism (parts of it at least) just appear out of that logic - if one assumes that the more efficient life/organism/system prevails (given enough time). So I (an atheist) essentially base my \"libertarian\" moral convictions on science, not on a God that granted them to me at birth.  \nAre there any atheist libertarians around here?  I might have to ask that I guess..  I wonder what the reactions will be ;-)\n\nAs for tribal societies still existing, yeah, but they are not the ones that influence the Globe, do they?  It's more like an ant-hive in your backyard that is being tolerated (IMHO).  Not to say they can't prevail over the centuries.. just right now they don't play in the top league so to speak.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "None",
                                                                                                                                                    "body": "There's plenty of atheist libertarians out there, it's very common. I'm not one, but yeah they just have a different foundation for the NAP than theistic libertarians tend to. I don't personally believe it holds up under scrutiny (I don't think any atheistic moral system does, but that's a separate debate), but yeah they're definitely out there.\n\n\"As for tribal societies still existing, yeah, but they are not the ones that influence the Globe, do they?\" - Well that's kind of in the nature of tribes, lol. I would say though that anarchistic societies likely wouldn't grow into something the size of a global empire like the US federal government, and that's totally fine. I take a more idealistic view than a practical view about it. I'm less concerned about implementation of hypothetical anarchistic systems than I am about the philosophical underpinnings. I found the most \"just\" and moral theoretical form of society and just use that as a personal \"north star.\" \n\nOn a personal note, I'm not trying to overthrow the state or anything (we have that in common), but I pursue any move away from centralization and toward self-sufficiency, voluntary exchange, loving my neighbor, etc that I can and I celebrate wins that I see in that direction. I just try to use those principles to guide my decision making. As a Christian, I don't think the purpose of Christianity is to \"establish a Christian nation.\" I think that misses the point completely. Jesus didn't come as a political operative to establish an earthly regime, but to save His people from their sins and establish a spiritual kingdom. That transcends nations, governments, tribes, etc. That's fundamentally why I'm an anarchist, because I reject the legitimacy of human authority.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JoanTheSparky",
                    "body": "Why do you expect only the 'good guys' to own guns?  He might get one or two.. but a group will be more than that and if determined will do what they have the means for if it is worth it for them.\n\nSo no, that won't work.  Your natural right to own property can not be relied up on by an individual on it's own (against a group that has other ideas about what is 'right and wrong').",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "...I don't...\n\nAnd what's your point? Are you asking if there's a 100% foolproof way to protect yourself and property from aggression? Welp, ya got me. I'm unaware of any libertarian that has ever claimed that it would be a perfect utopia. Are you trying to argue that it's somehow a better idea to trust a lot of potentially \"not good guys\" (cops) to own guns and have a monopoly on the legitimate initiation of force? Get real. At least in ancapistan, private security would be a booming industry that's merit-based, unlike cops.  \n  \nNow follow your own standard. Are cops 100% effective at protecting innocent people from aggressors? I think we both know the answer.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "*\"Are you asking if there's a 100% foolproof way to protect yourself and property from aggression?\"*  No.\n\n*\"Are you trying to argue that it's somehow a better idea to trust a lot of potentially \"not good guys\" (cops) to own guns and have a monopoly on the legitimate initiation of force?\"*  No.\n\n*\"\\[Then\\] what's your point?\"*  My point is that libertarians (just like any other ideological group) will need to team up if it faces more than a lone individual libertarian can handle reliably on his own - which is pretty much anytime.  My point is that libertarian (natural) rights - like the right to own property - require there to be an overwhelming force of libertarian rights enforcers to be anywhere close to be reliable for the individual libertarian to be able to claim that he owns property and that no one else has the right to take it from him. An individual libertarian is simply not able to enforce this right - which means the lone-libertarian-protecting-his-homestead is a dream, not reality.\n\nFrom an organized militia of libertarians to a service provider that offers libertarian rights enforcement for libertarians for pay to 'a government that enforces property rights for property tax' it's just a matter of time, not if.  That is my point.\n\n*PS: 100% guaranteed safety and rights enforcement is not possible, which is why I regard that as a straw-man?!*",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "\"My point is that libertarians (just like any other ideological group) will need to team up if it faces more than a lone individual libertarian can handle reliably on his own - which is pretty much anytime.\" - Ok, well yes I agree with that. That's easily provided by the market.\n\nAlso, I wasn't trying to straw-man you, I just didn't understand what you were driving at, sorry about that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "No worries, I grew a thick skin over the years being both attacked from the left and .. hm.. lets say capitalist side for my view on things.  Kinda tells me that I'm smack on in the middle of the road and can't be very wrong.. ;-)\n\nLibertarianism - if being based on the natural sciences (mostly appreciating the concept of 'survival of the fittest individual by any means available and at the cost of others if opportune' that biology provides) - would be the most EFFICIENT sociological ideology there is.   But this concept of (natural) rights (given by a deity) simple blends this avenue out and robs libertarians of a way to actually DEPLOY libertarian ideology and OUTCOMPETE what exists.\n\nWe are (to varying degrees) selfish individual living beings who are in evolutionary competition with each other for survival, reproduction and comfort - for which we require resources.  Wilderness is one way to \"solve\" this.  Cooperative work sharing among specialists the other.  The former works without rules.  The latter not so much.\n\nNature prefers efficiency over all else - survival of the fittest (species, individual, social construct, etc.)  - see what I'm getting at?\n\nOur problem is that it is evolutionary advantageous for individuals to get others to spend their time to provide them with the resources.  But for a society, made up of such individuals, it is required that all (specialist) individuals have their outcome.  Per my logic all societies are based on a monopol on force (to enforce the rules equally), which provides an opportunity for individuals to benefit at the cost of the rest - if the society provides positions of power - in our case, how we create and maintain the rules that the monopol on force enforces.\n\nThat is the next evolutionary barrier nature is trying to over come.  It managed that before - namely when individual competing single cells were able to come together in a multicellular organism that is capable of much more than the individual cell.  Social organisms are made up of individual beings and the same concept applies..  nature is fiddling with this for a while now - it's time we get it working, don't you think?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Exciting_Vast7739",
            "body": "Form a well-regulated militia, enforce the rule of law.",
            "score": 4,
            "replies": [
                {
                    "author": "JoanTheSparky",
                    "body": "So in essence you become a .. government?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Exciting_Vast7739",
                            "body": "Yes. I'm a libertarian, not an anarchist.\n\nThe sole purpose of government is to protect the rights of the citizens, including life, liberty, and property.\n\nIf government becomes injurious to these ends, there's a whole document about what to do in that case called \"The Declaration of Independence.\"\n\nIt involves dissolving the former government and creating a new one, more suited to its proper job.\n\n\\- Edit to answer one of your other questions: one of the major issues that plagued the Demcratic party this year is that it became captured by abstract thinkers who were out of touch with pragmatic realities. \n\nFrom an abstract, logical sense, you could conceive of a perfect world without police. Or a perfect police officer. A moral and just system. \n\nThey forgot about human limits, human error, human shortsightedness, and human individuality/selfishness. And they advocated for a bit of a fantasy land where you can end wars without hurting populaces. Or abolish policing. \n\nI think you're getting lost in ideals and \"no-error/no-loss\" scenarios. \n\nIn the real world, a system of government designed to rely on competing self interest (balance of powers between the branches) and the rule of law is the best at delivering the most liberty to individuals. We guide it with principals and ideals of liberty, but we understand the first rule of political science: \n\nA government doesn't exist to create justice and harmony - it exists to create the predictability and stability needed for most of the population to experience peace, if not justice. \n\n90% is a passing grade. Heck, 80% is a passing grade. Compared to the rest of human history, what we have is more free and more prosperous and more just than it was. \n\nDesigning for perfection, from abstraction, is a great way to fail. \n\nImproving from what exists, through tinkering, is how we got to where we are as humans, and how we will improve.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "You reacted more like I would have expected from all of the attending \"libertarians\", so kudos.  I think most of them are actually anarcho-capitalists and not libertarians. And I'm not *\"getting lost in ideals and \"no-error/no-loss\" scenarios\"*, but rather want to examine the fundamental assumptions and prerequisites of the libertarian ideology and it's blind spots, which seems to require edge-cases/extremes to realize them IMHO.\n\nAnyhow..  *\"purpose of government is to protect the rights of the citizens, including life, liberty, and property\"*\n\n1. as a monopol on force, correct?\n2. what about **the state of competition regarding what kind of rights this construct creates, maintains and then enforces** against individuals / minorities that do not subscribe to those rights (in the name and in service of the citizenry)?\n3. further, can you imagine that this construct (due to being a monopol on force) is capable of enforcing rules that benefit a few select citizens at the cost of the rest of the citizenry?  I think you can as you state: *\"\\[if\\] government becomes injurious to these ends\"*\n4. further, what most likely constellation / setup would lead to this (ab)use of the monopol on force when you examine it on the basis of every individual citizen assumed to be selfish (to varying degrees) and if given the opportunity will seek to get ahead of the other citizens by either introducing or maintaining rights that benefit him at the cost of the rest?\n5. Do you think that electing \\~1 in 1,000,000 into a position of lawmaker will suffice to allow for this avenue for failure (over a couple decades, maybe even centuries)?  Do you think that this construct (with this ratio of \"yin vs yang\") can self-correct if the result of rules (that benefit a few at the cost of the rest) will grant those few with the means and incentive to hold onto and improve the status quo that benefits them?\n\nPS: I'd rather avoid the 'DoI' solution and know if libertarianism has got a solution to the problem I just laid out or figure one out on the basis of libertarian / capitalist / democratic ideals that is able to counter-correct these issues way way earlier - which IMHO is following this principle: *\"Improving from what exists, through tinkering, is how we got to where we are as humans, and how we will improve.\"  ;-)*",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Exciting_Vast7739",
                                            "body": "These are interesting questions. I'll kind of split them apart and answer them as I can: \n\n1. Does the state have a monopoly on force? \n\nA - Not really. If the people can form their own well-regulated militias, the state does not have a monopoly on force. I'ma subsidiarian minarchist, which is a fancy way of saying I think goverments should be as local as possible (local sovereignty) and do as little as necessary (minarchy, as opposed to anarchy - like governmental minimalism). \n\nThe Declaration of Independence says that governments derive their power from the consent of the governed. This matches the idea that a national government is an entity that has a monopoly on the *legitimate* use of force. \n\nBut if we think about a nation like the US, where the right of people to form their own militias is enshrined in law - we have a nation where the legitimate use of force can belong to the state, or to the people. The right to keep and bear arms (in libertarian constitutional theory) belongs to the people AND the government, and the history of militias is that of self-organized military units, rather than state-controlled military units. \n\nCurrently we don't really have an use of that, but in theory, should the state frustrate the governed, or fail the governed, the people can step in and solve problems for themselves. The state's monopoly on violence is optional. \n\nOf course, we haven't seen a need to resort to home-grown violence and home grown institutions, out of sort of a \"mutually assured destruction\" theory. The federal government knows that its monopoly on force and law and order rest on them not transgressing to far on its constituents wishes. They recognize that there is a FAFO limit on their monopoly, and they don't push certain boundaries. They let the Malheur Wildlife Refuge people avoid an actual confrontation. They didn't push COVID requirements on states from the national level. They don't fire bullets into crowds of protestors who are throwing rocks. They back down when the Governor of Texas has issues with what feds are doing at the border. \n\nThey don't want to pick a fight they can't win, so they prudently avoid big exercises of the state's de facto monopoly on violence.\n\nSo oddly enough, the US doesn't have a monopoly on violence. The people do, through the institution of militias, they just haven't used it in a long long time.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "\\#1/3\n\nYou have described the (natural) fall-back mechanism of what happens (in the USA) when the rule-enforcing-service-provider of a society \"malfunctions\" / deviates from the intended goal (that the majority employs to enforce their will) and starts to create, maintain and enforce rules that go AGAINST the majorities - let's say wishes - to benefit a few at the cost of the rest (now enforcing the wishes of a few who are naturally incentivized to hold onto that status quo and now have the means to improve on it - which by how the dynamics work usually doesn't defuse the construct, but rather the opposite).\n\nSo for all practical purposes (either when it works or when it doesn't) is the construct (either in the form of a citizen-serving government or in the form of organized militias made up of citizens) an overwhelming majority that disciplines / suppresses minorities or individuals who do not want to follow the rule-set of that majority (if those rules shall be the \"law-of-the-land\").  This is what I mean when I say 'monopol' there.  Any other congregation of - say individuals and their mind-set of how things should be organized - becomes a minority in this picture.  If their mindset, say wants to prevail against the wishes of the current 'ruling' mind-set, they would (to be successful) need to be a bigger force (\\*), a bigger stick, need to be able to overcome (ultimately violently) the part of the populace that wants something else.  \n*\\*) At a 1:1 ratio of \"red vs blue\" the outcome is not given. At a 1:2 ratio it starts to become less of a gamble..  at 1:3 and higher it's very unlikely that the smaller group will be able to force the larger group to dance per their wishes. Another way to say '1:3' is 75%..  which means that what the 75% wish for is what they are going to enforce against others - this can be described as a monopoly-situation IMHO.  What the 25% or less want (if it goes against what the 75% want) doesn't really matter (esp if they want different things).. there is no chance they can enforce it without being severely punished/disciplined for it, so the smart move there is to knuckle under and accept the rule of the majority (and what they commonly want) - the monopol on force that this represents.*\n\nDoes that make any sort of sense for you, or is that 'gibberish'?\n\nMy whole point of the OP and successive replies here aims to establish the argument that:\n\n1. societies are based on a monopol on force (as per above explanation) and\n2. the rules that this monopol enforces - if only a few get to create and maintain them - will guaranteed (sooner or later) benefit a few at the cost of the rest\n\nI'm not knocking the USA, the DoI or it's constitution or the achievement it represents, but for me it's just one example of many all over the planet and in history.  I'm interested - esp as we are in the 'Libertarian-sub' - how a (theoretical?) libertarian society is charting this malaise?  The fall back of organized-militias, that reigning in of a berserk-government for me is the least desirable way to solve this problem when it is apparent WHAT kind of mechanism is responsible and HOW it could be countered way less destructive and more humane.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Exciting_Vast7739",
                                                            "body": "Honestly I am having a hard time understanding what you're saying.\n\nI'll note two things:\n\nYou seem to be in danger of 'reifying' - of treating abstract things as if they are real things. So you talk about monopols and other abstractions as if they are single, unitary things instead of the manifestation of lots of individuals taking actions.\n\nGK Chesterton once said:\n\n\"Most of the machinery of modern language is labour-saving machinery; and it saves mental labour very much more than it ought. Scientific phrases are used like scientific wheels and piston-rods to make swifter and smoother yet the path of the comfortable. Long words go rattling by us like long railway trains. We know they are carrying thousands who are too tired or too indolent to walk and think for themselves.\n\n\"It is a good exercise to try for once in a way to express any opinion one holds in words of one syllable. If you say “The social utility of the indeterminate sentence is recognized by all criminologists as a part of our sociological evolution towards a more humane and scientific view of punishment,” you can go on talking like that for hours with hardly a movement of the gray matter inside your skull.\n\n\"But if you begin “I wish Jones to go to gaol (jail) and Brown to say when Jones shall come out,” you will discover, with a thrill of horror, that you are obliged to think. The long words are not the hard words, it is the short words that are hard.\"\n\nI think your writing might benefit from using more direct language and examples. At least that would help me understand what you're trying to say. It can be a really challenging but really rewarding writing excercise.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "JoanTheSparky",
                                                                    "body": "Fair enough..  so the 'monopol on force' as 'the manifestation of lots of individuals taking \\[similar, with the same goal\\] actions' you don't accept yet as an abstract 'monopol'?\n\nExample..  a group of say 100 people - with you being one of them.  You all got different wishes, mindsets, morals - essentially what each member thinks is right and wrong.  Now the group as a whole.. what kind of morals, wishes, mindsets will it represent?  \nIf it is an egalitarian group it will represent the COMMON morals, wishes, mindsets for which there is a MAJORITY(\\*) within the group.  Any morals, wishes or mindsets there is no majority for within the group will NOT BE represented by the group as a whole - simply because why should individuals of the group WITH DIFFERENT (maybe even OPPOSING) morals, wishes, mindsets do that?  Further, the group (the majority(\\*)) will suppress / eliminate morals, wishes and mindsets that actually OPPOSE the common majority view.\n\nThe result now is that you as an individual (with an opposing mindset) will experience this as a monopol that doesn't allow you to deviate.  For a certain moral, wish, mindset there is only one variation allowed - anything else gets you disciplined by the group.\n\nAn example of this could be that you are morally wired to have no qualms about acquiring  what you have the opportunity and means to acquire - even if the object of acquisition could (or even obviously) was somebody else's \"property\" (lets call this stealing).  If you act on this and get found out - your moral view and subsequent action will be disciplined by the majority(\\*), by the monopol.\n\nYou can apply this to any type of moral conviction that you have and how this works out in different groups the world over - all the way from very small groups like model-train-associations up to nation-states and everything between.  Relevant to us now is the upper end of this - the nation-state and where it is about the MOST BASIC and FOUNDATIONAL morals, wishes and mindset of 'a people'.\n\nMy point from the beginning (OP) was and still is that any society - which includes a libertarian society - will wind up with this monopol on what is right & wrong and that libertarian (natural) rights are only reliable valid rights an individual libertarian can COUNT ON if a monopol (on force) stands behind them, **not by wielding arms himself.**\n\nAnd now - the finale - that this construct now (perversely, once established) is able to also enforce morals, wishes and mindsets of minorities **that go against the morals, wishes and mindsets of the majority** \\- IF MINORITIES CAN GET IN CONTROL OF IT.  And in our real exiting societies this happens via the way we transform personal morals, wishes and mindsets into rules, into law, into rights that individuals can depend on.  Because a minority of (elected) lawmakers has the final say, not the majority(\\*).\n\n\\*) 'majority' needs clarification.  I'll do that if you want to.  For simplicity (and I can argue it and provide examples) it means at least 66.7% of the group, at least 2 out of 3, at least 2 against 1 - because it needs to be reliable and obvious to the minority that it is OUTGUNNED and the logical, smart, life-sustaining move is to KNUCKLE UNDER peacefully.  If the inferior minority view carrying individuals or groups don't do that the majority will discipline them, ultimately violently.  \nThis logic is what stands behind RELIABLE rights an individual can count on and which differentiates rights that you wish you had and rights that you actually have.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Exciting_Vast7739",
                                                                            "body": "Question 1: why do you keep using the word \"monopol\" instead of \"monopoly\"? \n\nObservation 1: You are treating the nation state, or the group, as capable of quashing dissent perfectly. Like a computer program or a robot which, once the majority inputs a decision, must be carried out by the majority. It reminds me a physics equation that starts with \"Imagine a frictionless plane\" or \"assume a spherical cow\".  \n\nThis is not how human societies work. Humans are capable of monkey-wrenching political apparatuses by shirking, hiding, or simply making forced compliance too burdensome. Every social structure can be ground to a halt through friction, and compliance can only be enforced on a very small minority, and even then humans are just stubbornly resistant and compliance can never be completely forced. \n\nThis goes back to my original point about the \"consent of the governed\". Mechanisms for enforcing the power of the state are inefficient - there's a lot of friction. Any more than token dissent grinds the entire thing to a halt. \n\nTake the original example. You have a person who owns their own land. Someone comes to take it. That person resists alone. They are killed or imprisoned and the land is seized. \n\nBut let's say that it's a community - like communities that resist policing in inner city America. People are cooperating with each other to conceal identities, run from the cops, re-enter land after it has been seized. \n\nOr it's taken to another level - barricades are set up, police cars are vandalized, precincts are firebombed...\n\nA determined minority can make the nation state back down. It can increase the cost of enforcement to the point where the majority realizes that it's not worth it. \n\nSee - Malheur Wildlife Refuge. CHOB Portland (or Seattle?). The Occupy movement. \n\nSo - you are under-estimating the power of dissent, and over-estimating the power of a majority to actually coerce a minority, even with the power of a state. \n\nObservation 2: I'm still not sure I understand what you're trying to say here: \"My point from the beginning (OP) was and still is that any society - which includes a libertarian society - will wind up with this monopol on what is right & wrong and that libertarian (natural) rights are only reliable valid rights an individual libertarian can COUNT ON if a monopol (on force) stands behind them, **not by wielding arms himself.**\"\n\nUnless what you're saying is this: you can't resist the state alone. In which case I agree, that's why you would form a militia with your friends to resist the state.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "JoanTheSparky",
                                                                                    "body": "Monopol is German for monopoly and using the latter caused comments on YT to vanish, after I argued too much with 'progressives' about 'free market capitalism', 'supply & demand'  and 'profit-wash-loss' ;-)\n\n*\"capable of quashing dissent perfectly\"*  Nope. Just much better than an individual is able to 'quash' others who got an opposing moral conviction.\n\n*\"Mechanisms for enforcing the power of the state are inefficient - there's a lot of friction. Any more than token dissent grinds the entire thing to a halt.\"*  Yeah, this is another way of saying that what is being enforceable as rules among 'a people' requires the overwhelming majority of 'the people' to be on board with it.  \nYou say a government relies on the 'consent of the governed'.. yes, absolutely. But this means the rules that govern can only be based on the common moral convictions of the majority of 'the governed'.. which is a mono thing, not a multi or plurality thing.  It's those rules and no other rules, in your case only libertarian rules.  That's mono.  And if the governed outsource the governing to a entity that does that and apply those rules to all it's a monopol(y) that enforces those rules - and this has to happen, so that all that are being governed are exposed to the same rules, so they are equals.\n\nIf you got a group that enforces Libertarian-Anarchism rules and another that enforces Libertarian-Socialist rules.. aso asf.. where is the equalness?  Which rules apply to whom when and where?  You assume 'libertarian natural rights' are it.  I doubt that.  Just look at some threads on this Libertarian sub alone and figure all the different moral convictions (which even change over time by some accounts) regarding this or that.. no unity = no equalness.  \nYou will only get equallness for the common moral convictions for which there is an overwhelming majority..  and my question is - how do you get there?  How do you figure this common set of 'libertarian moral convictions' out among 'a people'?\n\nVia elections?  Via voting?  What?\n\nAnd what I want to say is - our current political systems the world over figure those common sets of moral convictions via a process that puts a few into the position of lawmaker and this is a problem (lacks competition).. as they are a minority who will care for its benefit.  What I learned so far is that libertarianism isn't looking into that. You define some mini-gov or no-gov libertarian situation, but per my above explanation do I not understand how that can be libertarian for all if the rules are not for all equally enforced, if everybody does it himself.. well, there is different (even opposing) moral convictions among 'a people'.\n\nWhat is your political process for that?  All I get so far is - there is none.  Well, hos do you then figure the common moral convictions if not by a political process?\n\n*\"you can't resist the state alone. In which case I agree, that's why you would form a militia with your friends to resist the state\"*  Fine, how do you and your friends figure out what ethics your militia is going to enforce against that 'state' thing?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "AutoModerator",
                                                                                            "body": "\nLibertarian socialism is an oxymoron. The core tenet of libertarianism is private property beginning with the recognition of ownership of self and your own body and extending to ownership of that which is self-acquired and self-produced with that body.\n\nSocialism and communism deny private property rights, and the right of ownership of what is self-acquired and self-produced.\n\nThis means they deny the ownership of self, and someone who does not own themselves is a slave.\n\nSocialism and communism are totally incompatible with libertarianism, and are nothing more than forms of chattel slavery dressed up in pretty words to serve collective masters. Wealth robbery by the collective is just as immoral and unjust as much being robbed at gunpoint by an individual.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "JoanTheSparky",
                                                                                                    "body": "That view is the moral conviction of the people who run this subreddit.. but there are obviously people out there who have a different opinion on this and thus different moral convictions.  \nLabelling their moral conviction an oxymoron might satisfy your intellect, but nonetheless are that people.. what do you want to do about them and their conviction?  How do you deal with them?  How will they deal with you?\n\nA libertarian society runs into that exact problem.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Exciting_Vast7739",
                                                                                            "body": "Thanks for the clarification on \"monopol\".\n\nI still think you're trying to over-abstract this.\n\n\"What ethics will your militia enforce?\"\n\nMilitias, and states, don't enforce ethics. You don't form a militia to create a pure ideal state, you form a militia to solve a problem by killing, or threatening to kill, someone. \n\nSocieties (and governments) don't operate like computers or logic machines. You don't \"install\" an ethic at the top and then all actions are taken according to that ethic.\n\nRather, you have lots and lots of individuals, and groups, deciding to do specific things. Sometimes when I go out to eat, I pick a salad. This aligns with my overall intent to eat healthy. But sometimes, in other situations, I chose the cheeseburger. Ethics and principles are attempts to constrain or make our individual decisions predictable, but there's no direct line in any government from \"ethics/principles\" to \"decisions\" and \"actions\".\n\nDecisions are made the way actual humans make them, by talking, and then agreeing, and then doing. We hope that our decisions are good, we try to guide them with principles and ethics, but ultimately we use guesswork and consensus to make decisions and then...we see what happens!\n\nWe do have institutions and laws based on libertarian ethics. Which is IMHO the best way to constrain governments and majorities. The rule of law protects basic liberties from the power of the majority: we don't let people enslave other people. That's against the law. We don't let the government regulate speech. We don't let rights to property be revoked without due process of law. We don't allow taxation without representation. And we have a good legal system to back these things up and enforce them on the majority.\n\nThese laws are the basis of our libertarian society. And should my militia of friends decide to resist the state, we would probably publish a Declaration of Independence or a manifesto so people would know why we are doing what we are doing. Generally, the threat of rebellion is enough to keep the things we want to rebel against from happening. Much like Mutually Assured Destruction, the threat of uprising keeps the state from doing stupid things that would cause an uprising.\n\nFinally: \"You define some mini-gov or no-gov libertarian situation, but per my above explanation do I not understand how that can be libertarian for all if the rules are not for all equally enforced, if everybody does it himself.. well, there is different (even opposing) moral convictions among 'a people'.\"\n\nWho cares? We aren't trying to create a perfect utopia. We are trying to preserve a really good libertarian system that we have (the current US system) and maybe improve it a little bit.\n\nThe best way we have found, so far as a race, to protect individual liberties from the tyranny of the majority, is the current US system. Strong constitutional protection for individual life, liberty and property. Strong, decentralized legal system to rein in tyranny with the Rule of Law.\n\nYou can try and find an abstract perfect system all day long - and argue over the color of the unicorns in that system.\n\nBut we don't live in a world of abstract principles and pure theory. We live in a world with friction and compromise and messiness and \"good enough.\"\n\nAlso, I don't believe in pure individualism - I think that libertarianism isn't an attempt to destroy the individual's dependence on society, I think it's an attempt to create protections for individual liberty so that an individual's necessary, natural dependence on other people doesn't turn into the tyranny of the other people.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "\\#2/3\n\nThis is why I ask for *\"the state of competition regarding what kind of rights this construct creates, maintains and then enforces\"*. I know how the USA works in this regard and for a lot of other societies on this planet, now and in the past.  So Nature (the process of societal evolution) obviously hasn't yet figured out a \"fool-proof\" way to come up with a construct that does NOT rely on the basic fall-back mechanism that organized-militias represent.\n\nLibertarian ideology is based on PERMANENT cooperative competition among equals. For every citizen to be an equal (no matter man, woman, ethnicity, race, gender, etc.) the rules that 'govern' them necessarily need to be the same everywhere where those citizens exist - which for me is a 'monopol'.  This now means that any change or addition of rules ALSO requires the approval of the majority of the people to be sustainable.\n\nDo we achieve that by electing a few into positions of power (lawmakers) or is that rather an odd move?  I mean, putting (to varying degrees selfish) individuals into such a position - IMHO - asks for trouble.  Especially if the deviation that a rule change brings that benefits a few at the cost of the rest at first is minuscule and most likely not recognized as such - even by experts.\n\nAdam Smith described this \"theoretical problem\" in his Wealth of Nations very clearly (and I could give you real world examples of how this works right now, but first I have to clarify this more to convey the logic of this for you to accept the concept):\n\n*\"The interest of the dealers \\[referring to stock owners, manufacturers, and merchants.. anyone really\\], however, in any particular branch of trade or manufacture, is always in some respects different from, and even opposite to, that of the public.  To widen the market and to narrow the competition, is always the interest of the dealers.  To widen the market may frequently be agreeable enough to the interest of the public; but to narrow the competition must always be against it, and can serve only to enable the dealers, by raising their profits above what they naturally would be, to levy, for their own benefit, an absurd tax upon the rest of their fellow-citizens.\"*\n\n*&*\n\n*\"The proposal of any new law or regulation of commerce which comes from this order, ought always to be listened to with great precaution, and ought never to be adopted till after having been long and carefully examined, not only with the most scrupulous, but with the most suspicious attention.  It comes from an order of men, whose interest is never exactly the same with that of the public, who have generally an interest to deceive and even to oppress the public, and who accordingly have, upon many occasions, both deceived and oppressed it.\"*  Wealth of Nations, chapter 11, part 3, last paragraph\n\nHow does Libertarian ideology deal with this problem?  A representative democracy (or in your case a constitutional republic) doesn't really deal with it at all either (otherwise we wouldn't be discussing it right now, doh) - it IGNORES it straight out and more or less relies on the basic fall-back mechanism of organized-militias to counter it (with or without a DoI).  That the USA does and did behave and work the way it does is based on the rule enforcing mechanism benefiting a few at the cost of the rest (HOW that exactly works I can/will explain in future) pretty much from the start.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "\\#3/3\n\nPS: *\"\\[..\\] is so entrenched that any changes I suggest will not come to pass.\"*  I'm not talking about constitutional changes, far from it.  Evolution doesn't work top-down.  Evolution works bottom-up.  Revolutions (of which the DoI is just 'the program') are blank-sheet reactions to a framework having become unsustainable.\n\nMy goal / approach is to figure out HOW the rules actually benefit a few at the cost of the rest (which I found to be a result of disabling competition, i.e. creating and maintaining rules that are anti-competitive) and see if this can be reverted where it matters (and has the most impact for least effort) - in the niches that are being covered by those anti-competitive rules.  You see, this would REVERSE the effect and REINSTATE competition and by addressing them one by one not require a \"restart\" of the whole operation for it to become sustainable again.\n\nAnd why I think this can work is based on the paradigm of the free market - the most economical / efficient \"commodity\" should prevail.  The clue to realizing that this can work is the simple fact that anti-competitive rules prevent more efficient / economic \"commodities\" to be on offer.. or in other words - if we figure out WHAT kind of competition the currently enforced rules exactly prevent and then (against all odds) provide that commodity more economically / efficiently anyway - we can nudge the whole thing, bit by bit.\n\nI'm 90% convinced that this can work, but I might have blind spots and it's kinda hard to figure those on your own - which is why I discuss stuff like this with other people.  Does that make sense?\n\nPPS: I read the other 2 replies and regard their content as covered within this 3-part reply.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Exciting_Vast7739",
                                            "body": "2. Well this is sort of a \"life sucks and never works as designed, but we shouldn't let the Perfect be the enemy of the Good\" thing. The purpose of government, as established by the US Dec of Ind. and Constitution, is to protect individual rights and restrain the power of the state. \n\nBut in practice, it took a long time for those rights to be extended to black people and women and gay people. \n\nDr. MLK Jr. quite famously said that the Civil Rights movement was an attempt to \"cash a check that the founders wrote.\" The idea being they were owed rights, but the bank (society) kept refusing to give them what they were owed. \n\nBut he did endorse the foundational idea (the purpose of the state is to protect individual rights, promote peace, and provide a stable and predictable legal system in which people can thrive). \n\nThis goes back to idealism vs. pragmatism: our Justice System is absolutely not just. It favors the wealthy and well lawyered, and it has been used to persecute  minorities and the poor by the rich and majority. *As has every legal system ever invented. all the way back to Hammurabi's code,* which defined different classes of people who got different levels of justice. \n\nWe have a system of justice that violates its own ideals, but does so in a way that provides a lot more justice than the past. In somewhat the same way that Communism aims for equality, but actually creates inequality and poverty - but free market capitalism, acknowledging self-interest and capturing it for the common good, creates more wealth for everyone. \n\nAnd in turn, with more people being wealthy, more people are able to protect themselves from injustice and provide for their own needs, minorities and the poor are actually better off than they are in societies that aim to be utopian. \n\nSo the ideals and the aim of an institution can be opposite its effect - in a weird way, ignoring social programs and improving economic opportunities by getting out of the way can help minorities and the poor secure their own civil rights by self-empowerment through wealth. But attempting to help people through government run programs creates dependency upon a state, which is inevitably seized by people who want to abuse minorities and the poor.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Exciting_Vast7739",
                                            "body": "No comments on the rest - because I think the DoI and Constitution that we have is the best solution we have come up with so far, and is so entrenched that any changes I suggest will not come to pass. \n\nI don't foresee any major revolutions coming soon - not in the US at any rate. What might cause those revolutions is the metamorphosis of humanity into a more virtual, digital reality (people living in the cloud, so to speak) - and what lies on the other side of that revolution is un-imagineable to me, and also outside of my lifespan. \n\nI will say that I think what the US is doing now is undergoing a bit of a revolution. My hope is that the Supreme  Court's recent decisions limiting its power (through overturning Roe v Wade and returning that decision to the legislature and the states, and refusing to take part in presidential candidate screening/interfering with Democracy) will force Congress to do its job. \n\nAnd I hope that people terrified by Trump's use of executive power will begin stripping the Executive Branch of power, returning it to Congress and the States. \n\nI hope that abolishing the Department of Education will encourage the states to step in and do that locally. \n\nAnd I hope that abolishing USAID will be part of a move to change the structure of charity from national government based to voluntary social organization based. Everything USAID does as a large organization can be done by the Gates Foundation. or another large private charitable organization, without the political infighting and corruption. \n\nAnd those are fundamentally libertarian positions: private charity, self-governance, local governance preference.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "JoanTheSparky",
                                    "body": "PS: that most on here are 'anarcho' is deductable from the downvote I must have gotten on that initial reply to you, to which you replied essentially - yes, we become a government.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SpeakerOk1974",
                            "body": "Government is a gang of thieves with a monopoly of coercive force over a region. Not a government to organize with others to protect your property on a small scale. No taxes means no state.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "How do you organize this property protection scheme on a small scale efficiently'?  Would you outsource?  Will others outsource?  It's efficient to do that, you just pay for protection services by a young well trained and equipped fella and his friends who will protect you, while you keep specializing and gain efficiencies that way - living a more comfortable live as if you would need to spend hours on training yourself (up to which age?) and keep up with equipment maintenance and stuff (up to what caliber / technology?).\n\nWho says that this protection service won't enforce rules that benefit a few at the cost of the rest sooner or later?  You have the right to bears arms, sure.. but going up against well trained and equipped young men whose task is to enforce rules against the will of others.. no chance.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DinoFeliz",
            "body": "Well, I always like the definition of Libertarian that Milei gives: \"Liberalism is the unrestricted respect for the life project of one's neighbor, based on the principle of non-aggression (PNA) and in defense of the right to life, liberty, and private property.\" (understanding Liberalism as Libertarianism). \n\nSo, in your case, this group would be against my private property. I would shoot them.",
            "score": 5,
            "replies": [
                {
                    "author": "JoanTheSparky",
                    "body": "That group simply doesn't recognize your right to life, liberty and property.\n\n*\"this group would be against my private property. I would shoot them.\"*  They have guns too.  You shoot one, two, ..  they shoot back and you're done.\n\nSo how do individual libertarians plan to SUCCESSFULLY enforce their (natural) rights against other groups that do not recognize those rights?  What do libertarians need to do to be able to COMPETE with groups that are opposing their way of life?\n\nAre those (natural) rights actually reliable without them being enforced violently against minorities / individuals?  **What is that construct called that enforces rights against minorities / individuals who do not subscribe to those rules?**",
                    "score": 0,
                    "replies": [
                        {
                            "author": "SpeakerOk1974",
                            "body": "Barring the absurdity that many armed men are going to team up to take your property unless it's a gang of tax theives to collect their rent on their land they just allow you to inhabit if you put up with them extorting you for money, think to yourself is this a likely circumstance?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "absurdity?  What happens over in Eastern Europe (Ukraine war to be specific) right now matches that 'absurdity' pretty well my friend.  I'm sure I could come up with more examples around the globe now and in the past if that wouldn't already tank your view of reality..",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SpeakerOk1974",
                                            "body": "Did you mention war? Doesn't happen without borders around the people you extort for money. Also I didn't discuss a private protection agency because I did in my other response to you.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "If you call a stretch of land 'my private property' and put a fence around it and then team up with like minded folk who did that to 'their stretches of land' and you all have been forming an organized militia that enforces libertarian rules within their area of influence - i.e. the stretches of land that the group CONTROLS and an outside organized group now comes and violates this 'construct' with arms / force.. what would you call that if not a war?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "clinkzs",
            "body": "Try watching Free State of Jones",
            "score": 3,
            "replies": [
                {
                    "author": "JoanTheSparky",
                    "body": "Does that movie answer how libertarians avoid a (natural) service rules enforcing provider (that obviously must be able to overcome minorities / individuals of a different mindset to be a successful provider) from starting to enforce rules that benefit a few at the cost of the rest?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "clinkzs",
                            "body": "Watch it.\n\n  \nThere is no difference between a group of bandits taking your land off of you and a government agency taking your land off of you, they just wear better looking clothes. What you must be able to do is the same in both cases, and thats why people fight so hard for the right to bear arms",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "How did it become anyone's land in the first place?  How did they acquire it 'rightfully'?\n\nBearing arms is useless if the other side is better equipped and trained - which a militia that specializes in rule enforcing for libertarians will be any day of the week.  How does a libertarian society counter such a development?  By becoming a bigger, better equipped, better trained organized militia itself?  Well, what do you think that construct will be up to after a while and how neo-libertarians will call it once it turns up and demands payments for providing libertarian rule enforcing services to the public?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "clinkzs",
                                            "body": "The way you phrase your arguments make you look like a Bernie Bro and I believe most people will just ignore you.\n\n  \nYou keep writing arguments based on false premises and you dont seem to understand N.A.P / Jusnaturalism. Do you really have that much free time in your hands that the best thing you can do is try to stirr dumb answers to dumb questions ?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "JoanTheSparky",
                                                    "body": "Why do you don't understand that there are people out there who don't give 2fs about NAP/justnaturalism?  And that \"nature\" will keep making those people.. and that those people can own and use guns like anyone else?  And that they can chose where and when they move to enforce their will against others?\n\nI'd rather you address the argument instead of delivering ad-hominems - sheds a bad light on you and your agenda really.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "clinkzs",
                                                            "body": "People who own and use guns to enforce their will against others, for example, the government ?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "JoanTheSparky",
                                                                    "body": "Yes and/or people who want to hold slaves or who are into minors.. those kind of people.  Nature makes them all the time.  Those kind of people do not follow NAP and they also do not fight fair and just.. they seek and take opportunities.  You as a cooperative work sharing specialist individual are not equipped to deal with such people 24/7, which means your (natural) rights are not reliable.\n\nHow do you gonna solve that riddle?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Intelligent-End7336",
            "body": ">A group comes and is able to use (lethal) force to take the land from the libertarian. What does he do?\n\nGood question. You could also phrase it as - What do you do when you can't pay your property tax and the government comes and takes your land and sells it off?",
            "score": 6,
            "replies": [
                {
                    "author": "JoanTheSparky",
                    "body": "Well, the government is providing you with the right of having exclusive usage of that parcel of land by enforcing that rule against anyone who doesn't agree with it, like trespassers or what have you by using overwhelming force against those minorities / individuals.. this is what you pay that service provider for in the form of .. property taxes.\n\nSo, as you didn't keep your end of the contract and obviously are not capable of enforcing this right of using that parcel of land exclusively in the first place anyway government will take it from you and give that right to someone who is more capable.\n\nThat's how it works. Individual libertarians are in no position to reliably enforce their (natural) rights against groups that are stronger than them - so they team up (organized militias have been suggested) which sooner or later (economies of scale, specialization, work sharing, markets) will become a service that needs payment..  well, how would you call that payment?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Intelligent-End7336",
                            "body": "Calling property tax payment for a 'service' ignores that the government doesn’t allow competition in enforcement. If protection agencies had to compete for customers instead of extracting payment through force, you wouldn’t see land taken over failure to pay an arbitrary tax. The argument that libertarians would simply recreate the state assumes coercion is necessary for security, but voluntary associations and market competition provide alternative enforcement mechanisms without forced taxation.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JoanTheSparky",
                                    "body": "1. So you think that competing rule enforcers (which enforce different rules or the same?) would not coalesce into a monopol sooner or later simply due to economies of scale?  And once that state has been reached this monopol will be capable of enforcing the rules against resistance by any other - now minority or individual..  **so it's not that government doesn't allow competition, it's simply that it ALREADY quashed any competition in that space and is the monopol.**\n2. *\"you wouldn’t see land taken over failure to pay an arbitrary tax\"* .. if someone doesn't pay that tax and isn't being protected - why should \"passerby's\" (for lack of better word for a market force that correct this freeloader behavior) not take the opportunity and do their thing in seizing control of that property against the will of the current 'occupant'?  I mean.. if I don't pay, does it matter who actually comes for my property?  I don't expect the protection force to do that publicly obviously (though, it surely would incentivize policy closures with clients if they see what happens when they don't pay their tax) - maybe a bad cop arm that is being subsidized by the paying clients.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Intelligent-End7336",
                                            "body": "You're assuming that economies of scale always lead to monopoly, but this ignores counterbalancing market forces. Protection agencies in a free market would have incentives to remain competitive because consumers can leave. Unlike the state, they wouldn’t have legal privileges granting them absolute authority or barring new entrants.\n\nGovernments don’t just “naturally” form through competition. They form through violence and coercion, outlawing competitors, jailing dissenters, and forcing participation. A market for protection would still have competition and checks against centralization because customers wouldn’t tolerate a monopoly that behaves like a state.\n\nAs for property rights, you’re making the argument that if someone stops paying for protection, their property is fair game for anyone to seize. This assumes protection services operate like a mob rather than contractual enforcement agencies. In a market, a provider wouldn’t necessarily “take” a client’s property but might stop enforcing their claims, just like how unpaid security guards don’t rob the business they once protected.\n\nIf no one upholds property rights, sure, people might seize land, but that’s just anarchy in the chaos sense, not in the libertarian sense. The whole point of private enforcement is to maintain a rights-respecting order without the perverse incentives of a state. The distinction between a government taking your land for nonpayment of taxes and a private agency refusing to protect you is that a private system allows alternative solutions, competition, and voluntary exchange. The state simply dictates and takes.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}