{
    "title": "President Javier Milei withdrew Argentina from the World Health Organization",
    "author": "None",
    "subreddit": "Libertarian",
    "rank": 476,
    "score": 1182,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 63,
    "url": "https://i.redd.it/rh92pclw8che1.png",
    "id": "1iicfjv",
    "selftext": "[OFFICIAL STATEMENT] English translation: The president's office informs that President Javier Milei has made the decision to withdraw the Argentine Republic from the World Health Organization. \nThe WHO was created in 1948 to coordinate responses to global health emergencies, but it failed in its greatest test: it promoted quarantines without scientific support when it had to combat the Covid-19 pandemic.\nThe quarantines caused one of the greatest catastrophes in world economic history, and according to the Rome Statute of 1998, it could be classified as a crime against humanity.\nIn our country, the WHO supported a government that left children out of schools, left hundreds of thousands of workers without income, led hundreds of thousands of businesses and small businesses to bankruptcy, and still cost us 130,000 lives.\nToday the evidence indicates that the WHO measures do not work because they are the result of political influence, not based on science. Furthermore, it has confirmed its inflexibility to change its approach, and far from admitting its mistakes, it chooses to continue assuming roles that do not correspond to it and limiting the sovereignty of countries.\nWe must rethink from the international community why there are supranational organizations, financed by all, that do not meet the objectives for which they were created, they are dedicated to international politics and seek to impose themselves above the member countries.",
    "comments": [
        {
            "author": "Brocks_UCL",
            "body": "![gif](giphy|Swx36wwSsU49HAnIhC|downsized)",
            "score": 164,
            "replies": []
        },
        {
            "author": "AspirantVeeVee",
            "body": "love this guy",
            "score": 84,
            "replies": []
        },
        {
            "author": "Noveno",
            "body": "Again fucking based.",
            "score": 168,
            "replies": []
        },
        {
            "author": "fantom_farter",
            "body": "Damn, everything I read about this guy makes me love him more.",
            "score": 27,
            "replies": []
        },
        {
            "author": "Maleficent-Low1631",
            "body": "Argentine here. I just saw a news article about the beginning of the privatization process of the routes, what do you think about it? I say that it is good, and that the other infrastructure sectors should be privatized so that we can have balanced competition again.",
            "score": 14,
            "replies": []
        },
        {
            "author": "mcnello",
            "body": "![gif](giphy|CAYVZA5NRb529kKQUc)\n\nChad Javier Milei vs. Soy Boy beta cucks WHO.",
            "score": 83,
            "replies": []
        },
        {
            "author": "Somhairle77",
            "body": "Good for him.",
            "score": 11,
            "replies": []
        },
        {
            "author": "FrancoisTruser",
            "body": "Good. Good.",
            "score": 28,
            "replies": []
        },
        {
            "author": "SubmarineCaptain_",
            "body": "Don’t judge me but I don’t really understand how that is Libertarian. In future instead of having several hundreds CDCs the WHO could standardise medical procedures to make conducting business easier. Also if Libertarians are pro free trade than the WHO is the only thing that somehow keeps everything a bit safe, in a purely isolationist libertarian world without WHO, you would have measles infested third world countries with horrible health standards that would damage everyone. \nIts like routine check ups and preventive medicine actually costing less than curing smth after doing nothing.\nPlease don’t downvote as Reddit does not care about free speech and has karma points to not let people ask critical questions, better prove me wrong.\n\nEDIT1: On the other hand, I can see your points. WHO becomes useless as an illness gets to a country, a more regional health department becomes a lot better at management here as it knows how the country “works” and regional specifics and thus can allocate resources more efficiently (thats why I’m also against world government, it would be tempting to have one set of regulations for everyone and basically have the whole earth as one market but at such heights governments just become inefficient with today’s technology (imagine having a more or less functioning centralised country the size of India during the middle Ages, one reason people had feudalism). \nBack to the point , WHO is efficient in helping countries COORDINATE their strategies on a worldwide scale (not control the countries but plan together). \nOn another note. Many leftists put neolibs/soclibs and libertarians in one basket, while its true that many things overlap, issues like WHO show the difference: Neolibs see the government as one of the pillars of liberty and think that WHO helps free trade to flow easier and creates some kind of “base level” that helps to save costs.",
            "score": 89,
            "replies": [
                {
                    "author": "qp0n",
                    "body": "The WHO literally believes it should have the authority to supersede national sovereignty in an 'emergency'.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "Brocks_UCL",
                            "body": "You forgot that they get to decide what constitutes an “emergency” and for how long. Something as big and absolute as the WHO should not exist or at least not have all the power it does",
                            "score": 35,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Strider_27",
                    "body": "You do realize you can pull out of a membership and still follow the rules of that membership right? Except it’s now voluntary. Seems a lot closer to libertarianism than answering to a global cabal that there’s no say in for minor members",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "DowntownVisit77",
                    "body": "This sub is basically full of anarchists instead of true reasonable libertarians",
                    "score": 93,
                    "replies": [
                        {
                            "author": "Hench999",
                            "body": "There's always been a kind of rift between the limited government libertarians and the anarchist types. I have been called a statist countless times simply for believing in a country with borders and a limited government.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "DowntownVisit77",
                                    "body": "We need some form of government to ensure order and at the same time respect the individual harmless freedoms of human beings . Completely removing governmental institutions is destructive . We rather need more checks and balances in national and international institutions",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "Accomplished-Hunt802",
                                            "body": "I would say the best approach is Minarchism ( a branch of libertarianism) which would focus on limiting state power to a minimum and only really needed instances. Primary focusing in protecting people’s rights not their privileges, enforcing law and diplomacy.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "DowntownVisit77",
                                                    "body": "I like how you put it as people’s rights not privileges. I do not know much about Minarchism . I will read about it",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "New_Leg6758",
                                                    "body": "I second this",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "igortsen",
                                    "body": "I think if we ever had a truly libertarian experience like Argentina is starting to enjoy, there would be more of a willingness to test the limits of limited government.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BreakfastSpecials",
                            "body": "So true. You can’t just dismantle everything, but more transparency is definitely needed.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "DracoDruida",
                            "body": "It's worse. It's neofeudal.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DowntownVisit77",
                                    "body": "That’s crazy",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cerberus_RE",
                            "body": "No it's not, lol.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hblok",
                    "body": "As with covid, the main problem with WHO had very little to do with viruses or medical details. It's all about politics, and politics only.\n\nThe problem with WHO is first their power grab, most recently the attempt at becoming a global authority on health issues for the entire human population. No entity should be given such power.\n\nHowever, even without any real authority, the problem during covid was that national politicians used their quotes (or even misquoted) WHO as an appeal to experts, to justify the most inane mandates. That's why they need to be discarded.\n\nNow, if Bill Gates wants to run around in the jungle and inject people with random stuff, that's his prerogative (lest somebody puts a pie in his face). But as soon as his pet project is given any credit which can be misused, it should be shut down.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "DinoFeliz",
                    "body": "As a libertarian, I would like to delegate the least to the government, I think we would all agree to that. In this case, the WHO is a supra-national organization, which I didn't vote that would impose what I can and can't do, for example, during the COVID era.   \n  \nMinimal government includes not depending on these supra-national organizations.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "HoldMyCrackPipe",
                    "body": "Why should we as Americans be beholden to an international regulatory body? Did you vote for the WHO leader? Were you consulted on how its mission should be achieved? Were you consulted if it should be created?\n\nThe government should be minimally involved in your life. WHO and other such institutions only serve to control you without any oversight. \n\nAfuera!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "RocksCanOnlyWait",
                    "body": "Because the WHO did such a great job handling, COVID, right?\n\n\nA single global entity sounds great when you assume it won't ever make mistakes or be corrupted. But we don't live in such a fantasy land.\n\n\nThe rejection of the WHO is also due to it's push for its policies to have legal binding in member countries. It's supposed to be an advisory board.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "geehawn",
                    "body": "Just looking at the statement by the Argentinean President. He states the WHO was created to coordinate responses with global health emergencies, and that they called for global quarantines without scientific data.\n\nBreaking it down a little\n\n1. \"Global health emergency\" - I believe that at the time, the scattered pieces of information the WHO and governments had about COVID (seemingly easy to spread , affects different people possibly leading to death, no testing, no data, no vaccine, unknown effective treatments, etc), was a global health emergency. If you don't know anything about a virus that is spreading uncontrollably, and the prognosis is uncertain (no symptoms, severe symptoms, death, loss of senses, etc) , then it should be quarantined to allow experts to GET more data.\n2. \"Coordinated\" - I think they did coordinate action. They called for governments to impose quarantines.\n3. He estimates his country experienced 130,000 deaths. Could it have been more had there been no quarantine? I'm not any sort of a medical expert, but I in post-mortem, I wouldn't believe it'd less than 130,000.\n\nNobody likes to submit to the government. I get it. But, we're only as intelligent, strong, effective, etc as the weakest link. And if weakest link think that COVID virus is indeed not a real thing, then *~~that's how the government should treat it at first takes~~* at first take the government should treat it as 'deadly' and react accordingly to the weakest links by imposing quarantines and trying to get a handle on it before things get worse.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "heimeyer72",
                            "body": "I was about to go in a similar direction - of course, as long as you know very little about a virus, then quarantine and erring on the side of safety is obviously the ways to go, but your last sentence irritates me:\n\n> And if weakest link think that COVID virus is indeed not a real thing, then that's how the government should treat it at first takes.\n\nDo you want to say that, when there is a minority in a certain community (in the widest sense, including countries like the USA, Canada and whatnot) that opts to ignore a virus like COVID, then the government (again in the widest sense) should ignore it, too? (Edit: Typo corrected.)\n\n^(I hope that's not what you mean.)",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "geehawn",
                                    "body": "Thank you for pointing that out.\n\nI should have said the following:\n\n>\"And if weakest link think that COVID virus is indeed not a real thing, then at first take the government should treat it as 'deadly' and react accordingly to the weakest links by imposing quarantines and trying to get a handle on it before things get worse. \"\n\nI'll fix my post above",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "heimeyer72",
                                            "body": "Thank you.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "StrangeHumors",
                                            "body": "Yeah, basically the response has to factor in the lowest common denominator, I.E. the people who deny objective scientific observation. In that case, there isn't really room for nuance in response.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "geehawn",
                                                    "body": "Well put! Much more concise than what I posted 🙂",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HoldMyCrackPipe",
                            "body": "Why not let individuals make their own decisions about their healthcare? Why should we trust the “experts” when they couldn’t even acknowledge that it came from a lab at first? Now that the evidence is everywhere they are trying to act like they always believed it came from a lab. \n\nRemember they tried to convince you it came from wet markets. They tried to convince you that the vaccines were necessary and effective. They tried to convince you that children were at risk. \n\nIt was all a lie. Let individuals make their own choices. \n\nThey cried wolf and now when we do have the big one nobody will believe the authorities.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "geehawn",
                                    "body": "I think it's unfair to suggest that at the beginning they didn't have the answers or data about a presumably deadly or contagious virus/illness, and then say \"now we know\" that none of the government's actions were necessary or effective.\n\nAt the beginning of the scare of the virus, what we now identified as COVID, I truly believe the government didn't have the answers of what it was, how truly deadly/not-deadly it was, how it spread, where it came from. But I believe they did recognize the contagious aspect, and reportedly people were dying or experiencing effects requiring ICU-level hospitalization.\n\nI could make the analogy about soldiers in a base area. If there's a sniper firing upon soldiers while they're walking about conducting normal-ish business, what would we expect the soldiers to do? Take cover, communicate, try to figure out where fire is coming from. What I wouldn't think they should do is continue about their business, walking about without cover.\n\nIn similar fashion, a virus was spreading through the country at a surprising rate. \"Where did it come from? How is it spreading? Why are only some people experiencing severe symptoms and others not? Not everyone exhibits symptoms but can still carry the virus!?\" To me that is good criteria to hold down the fort, quarantine, and figure out what the crap is going on.\n\nAgain, I'd prefer people have their freedom of handling their own business. But, as we  should acknowledge, not just with COVID, but in general. In a lot of civil/social behavior people just don't act accordingly to the threat. I still find people STILL don't wash their hands after using the toilet in public settings; mainly males, since I use the male washrooms 🤪. People still sneeze into their palms, pick their nose, cough without covering, and then go about using their shopping cart. It's nasty. I'm not a germophobe, but the most important thing I learned coming out of the whole 3-4 year ordeal was to avoid touching my face when out in public areas.\n\nYes, I can just go on with washing my own hands and minding my own business. But when people are out in public, I feel there should be a common or basic behavior to practice a good level of hygiene. By not doing so, it then becomes the business of the public, and the public business is the business of the government.\n\n\\*edited\\* for grammatical and spelling issues",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "HoldMyCrackPipe",
                                            "body": "I hear you. The main issue is in the fact that any ideas or opinions that were contrary to the “narrative” were labeled as conspiracy theories or anti-vax or whatever ad hominem attack. \n\nDiscourse and medical debate was silenced and that only happens when an institution as powerful as the government leans on private companies. \n\nFacebook has shown the emails where the Biden admin suppressed any speech about the virus coming from a lab. Why? Why not allow free speech and let people form their own opinions. \n\nWhen you suppress the discourse nobody will trust you even if you are right.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thencewasit",
                    "body": "Isn’t the WHO also involved in drug scheduling?  How can you in anyway support an organization that causes the bullshit drug war.\n\nhttps://www.unodc.org/documents/commissions/CND/Scheduling_Resource_Material/19-11955_Drug_Conventions_eBook.pdf\n\n\nFuck those guys.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SubmarineCaptain_",
                            "body": "1. Never said I support the WHO, just said that sth like this could be beneficial, I too think the WHO should be reformed.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Brocks_UCL",
                    "body": "The WHO has clauses that say essentially it can take autonomy from member countries in the event of a “global health emergency” and force them to mandate vaccination and quarantines, etc. Now you may think well that doesnt sound too bad. Until you realize that they decide what is considered a global health emergency. \n\nYou have a group of unelected “officials” who can dictate what constitutes a GHE and then take control of the member countries for the duration of the GHE. All with little oversight",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "christopherobin1",
                    "body": "Substitute \"WHO\" for \"government\" and you'll have your answer.\n\nWhy do you assume the WHO is the only thing standing between much of the world and health? Even if you assume good intentions (which there is good evidence is not applicable with the WHO), in actual practice the WHO sets poor standards and mishandles health issues like any government directed program.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "igortsen",
                    "body": "Good on you for arguing a position, taking in new information and rounding out your opinion further. \n\nI think that voluntary association and co-ordination are fine, but shouldn't be funded by taxes. That's the voluntary part. If there is value to what the WHO aims to do (they are garbage at it) then the free market or voluntary donation funded efforts like this in a centralized model giving ADVICE has a place and a possibly helpful result.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Good. Fuck the globalists",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheM0nkB0ughtLunch",
            "body": "Let’s hope the trend continues.",
            "score": 15,
            "replies": []
        },
        {
            "author": "edog21",
            "body": "¡Viva la libertad carajo!",
            "score": 5,
            "replies": []
        },
        {
            "author": "BR1M570N3",
            "body": "Long live Freedom, Goddamnit",
            "score": 11,
            "replies": []
        },
        {
            "author": "AlphaTangoFoxtrt",
            "body": "#A F U E R A !\n#F\n#U\n#E\n#R\n#A\n#!\n\nThe WHO *could* have been a useful organization. But we saw how compromised it was during COVID running straight interference for the CCP. Like many collectivist ideologies, it can sound good on paper in a friction-less vacuum, but the second it meets reality, it falls apart. That's why it's a bad idea.\n\nDoes having the world coordinate on disease research sound like a good idea? Yeah of course. Until you realize \"the world\" includes China who will blackmail the organization into supporting their narrative.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Veddy74",
            "body": "Sweet",
            "score": 2,
            "replies": []
        },
        {
            "author": "More-Instruction-183",
            "body": "Based as always",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheRiceConnoisseur",
            "body": "![gif](giphy|5GoVLqeAOo6PK)",
            "score": 6,
            "replies": []
        },
        {
            "author": "Catch76",
            "body": "He withdraw, until he needs them. Always the same.",
            "score": 2,
            "replies": [
                {
                    "author": "Brocks_UCL",
                    "body": "Its not like he cant follow their guidelines, he just isnt forced to. Healthcare doesnt just vanish if you arent a WHO member",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Carimusic",
            "body": "My president! National hero of the motherland, future president of the Earth (Meloni first lady).",
            "score": 2,
            "replies": []
        },
        {
            "author": "t0rnAsundr",
            "body": "I wish our leadership could speak like that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "persona-3-4-5",
            "body": "Well it's about time",
            "score": 1,
            "replies": []
        },
        {
            "author": "CuteRiceCracker",
            "body": "Probably my favorite head of state as of now\n\nHope he will not disappoint in the future",
            "score": 1,
            "replies": []
        },
        {
            "author": "Striking_Metal_38",
            "body": "Milei keeps slaying. I hope Trump takes many pages from his book. First Rothbardian president is proving these ideas work ftw!",
            "score": 1,
            "replies": []
        },
        {
            "author": "IsawitinCroc",
            "body": "Goddamn wildcard!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrostyArctic47",
            "body": "But then he's a radical social authoritarian",
            "score": 1,
            "replies": []
        },
        {
            "author": "tuscan21",
            "body": "This is isolationism not libertarianism btw.",
            "score": -6,
            "replies": []
        }
    ]
}