{
    "title": "Love seeing libertarian ideas spreading",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 461,
    "score": 1702,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 166,
    "url": "https://i.redd.it/3gzfbef9zehe1.png",
    "id": "1iiqks2",
    "selftext": "",
    "comments": [
        {
            "author": "Wolfstar33",
            "body": "My problem is that Congress didn’t create DOGE through legislation and through its constitutional powers nor is Elon a senate approved agency head.",
            "score": 524,
            "replies": [
                {
                    "author": "TwicePlus",
                    "body": "Not to mention Congress holds the purse strings, not an unelected appointee of the Executive branch.  If Congress allocated funds for things like USAID, then Congress needs to be the ones to shut it down.  \n\nAlso, I don’t like a billionaire entrepreneur with billions in government contracts being the one to make the calls on which gov’t funding gets cut short.   That’s a huge conflict of interest as he can gain insight into his competitors with government data and then directly negatively impact them through funding cuts.",
                    "score": 311,
                    "replies": [
                        {
                            "author": "CO_Surfer",
                            "body": "Read about the creation of USAID. It was created through EO after legislation was passed requiring implementation of a foreign aid program (significant paraphrasing as, so do look it up if you have interest).   USAID was the implementation, but there’s nothing that I see stopping the dismantling of USAID via EO so long as the foreign aid requirements are met through an alternative government office. Word on the street is that the responsibilities from this program will move to the state department. \n\nSo lesson learned: don’t rely on EO long term. ",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "zdk",
                                    "body": "I think a strict reading of the Foreign Assistance Act required the creation of a new department, but I'm sure there's some nuance that there.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "maineac",
                                    "body": "I don't know what it is supposed to be, but providing foreign aid does not seem like the main function. I have read that USAID was in the process of investigating Elon. I have also read they are funding different media outlets like Politico. I don't know where it says they hold investigatory powers over US  citizens or how funding media outlets is in any way associated with foreign aid. It appears to me that USAID is just a front.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "achandlerwhite",
                                            "body": "It was just that gov agencies had politico pro accounts. It’s like a gov data subscription, a tool used by many professionals. Seriously, nothing there.\n\nThe Elon investigations were on his companies receiving gov money, not him as a citizen. \n\nI don’t agree with them necessarily, but get your facts straight to make effective arguments.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "denzien",
                                            "body": "What business do they have investigating private citizens?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Point_Top",
                                                    "body": "Well if they suspect a crime was being committed…",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "denzien",
                                                            "body": "Why USAID and not a law enforcement agency?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Point_Top",
                                                                    "body": "Forgot to respond to this. USAID does have an enforcement branch. I think it’s similar to the IRS one. They have agents and everything. \nhttps://oig.usaid.gov/our-work/investigations",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "denzien",
                                                                            "body": "Thanks for the follow-up and the link!",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "McArsekicker",
                            "body": "Congress seems to be fundamentally broken. I wouldn’t rely on them to do anything but enrich themselves. Not sure what how we fix that problem.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "GratedCucumber",
                                    "body": "Nothing will change without proportional representation and ranked choice voting to destroy the stranglehold political parties have on our system.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "pizza_lover736",
                                            "body": "And who passes that law??",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "GratedCucumber",
                                                    "body": "Well, just look at which party seems to be passing ranked choice at the local levels and which party is trying to make it illegal.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DonkeyDonkey9",
                                    "body": "Vote.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "augsome",
                                            "body": "Voting isn’t enough with the two party system and massive funding needed to run for any position that we have right now.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "maineac",
                                                    "body": "Not when most people that purport to be Libertarian vote Republican.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "augsome",
                                                            "body": "I’ll start voting libertarian when tiered voting comes to my state, until then I’ll put my vote towards one of the two candidates that actually has a chance of winning.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "-nom-nom-",
                            "body": "You're asking for zero checks and balances. If congress is vastly overreaching, you want only them to be able to keep themselves in check",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "kfmfe04",
                            "body": "Congress won’t shut down anything - both sides are for more spending as it gives them more power.  The Pork Barrel is endless.\n\nUnpopular opinion: shock and awe via DOGE is the way to Drain the Swamp.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "theravenousR",
                                    "body": "DOGE IS the swamp. Musk built the majority of his wealth via government subsidies and government contracts. The same things this sub claims to loathe. Of course he's like a kid in the candy store with access to financial and personal data on all of his competitors. Are you guys really this dense? \n\n\nFor there to be even the appearance of propriety, he would need to step down from any of his companies that took subsidies or contracts (pretty much all of them) and divest all his shares.\n\n\nMark my words, he's going to end up with a shitload of juicy, generous government contracts before Trump's term is up. All while kneecapping his competitors, making him the sole option for a myriad of endeavors.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "JBCTech7",
                                    "body": "i don't think that's very unpopular. I mean...that's what the majority of voters voted for.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "not_today_thank",
                            "body": ">Not to mention Congress holds the purse strings\n\nThe legislature appropriates the money, the executive can't spend money that hasn't been appropriated, but it generally has fairly wide (not total) discretion how it's used.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "rushedone",
                            "body": "If Term limits and insider trading bans get passed I would consider Congress getting some of its powers back. \n\nCare to come to the bargaining table?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bteam3r",
                    "body": "Have you read how DOGE was actually created? Because it is fascinating. Trump just repurposed the US Digital Service, which Obama created, and was already funded/approved/etc. He just made Elon the head of it, which is within his power to do.",
                    "score": 66,
                    "replies": [
                        {
                            "author": "corybomb",
                            "body": "Seriously?",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "erdricksarmor",
                                    "body": "https://www.whitehouse.gov/presidential-actions/2025/01/establishing-and-implementing-the-presidents-department-of-government-efficiency/",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "garnorm",
                                            "body": "That is indeed interesting… learned something new today",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": "Same here.  Fascinating!",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "strawhatguy",
                                    "body": "Yeah you can read the EO yourself on White House website.\n\nBeauty part is the acronym didn’t change USDS, US Doge service. The EO grants authority for a temporary organization, also called DOGE, and that’s the thing Elon’s team is working under. \n\nThey definitely had lawyers to look at how they could do this legally. Very fascinating.",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "mrchu13",
                                            "body": "Very good thread on X about this if you’re interested. \nhttps://x.com/renztom/status/1887038847629877714?s=46",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "strawhatguy",
                                                    "body": "Yeah I saw that one, he explains it much better. I did read the EOs that first day (mostly to see which Biden EOs Trump reversed) and saw the DOGE repurposing the Digital Service and thought, oh very clever.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SnappyDogDays",
                    "body": "It was.  It was called the United States Digital Service and was established in 2014.   USDS heads don't need Senate approval.   At least the other heads before Elon didn't need it that I could find.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "natermer",
                    "body": "USAID wasn't created through legislation either.  If the president wants to go and create his own special club house and give it a special name how is that a problem?  Congress authorizes spending.  Apparently getting funding isn't a problem for 'DOGE'.\n\nMost of the Federal government is a violation of not only the constitution, but good sense. \n\nUnless specifically delegated to the Federal government by the constitution all powers of government is vested in the individual states. \n\n\nThe work-around to this is try to claim that administrative agencies are somehow independent from normal rule of law because they are \"independent\".   Go and look up how they tried to justify the creation of the modern administrate state. \n\nhttps://www.heritage.org/political-process/report/the-birth-the-administrative-state-where-it-came-and-what-it-means-limited\n\nNone of this is constitutional.  Before 1900s we maybe had 3 or 4 administrative agencies. Now we have well over 400.  \n\nIt is all bullshit. And crying about the constitution to try to defend any of this is the height of hypocrisy and ignorance.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cows-go-moo19",
                    "body": "I don’t care what executive bureaucracies congress did or did not create. If you need congress’ permission to reform, it will never happen.\n\nTear down the bureaucracy by any means necessary. And do it quickly.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "VVTD33",
                            "body": "See, that's the problem I have.  I don't believe the ends justify the means.  Ever.  Anything torn down by Executive Order can be made by Executive Order.  Once you give the federal government precedence, it can never be taken back.  What will you say when the next democrat POTUS emplaces Alexander Soros to head DOGE, and he hires millions of 19 year old bureaucrats to make government more efficient?",
                            "score": 50,
                            "replies": [
                                {
                                    "author": "Asangkt358",
                                    "body": "\"Libertarian\" : We want to shrink government.\n\nTrump : Ok!\n\n\"Libertarian\"  : Not like that!\n\nSmh.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Yourewrongtoo",
                                            "body": "He is right, I know you don’t want to listen but the precedent it sets allows for the next president to create a government agency by just repurposing another one and totally changing its mission.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Asangkt358",
                                                    "body": "That isn't new.  Presidents and Congress have been fighting about how administrative funding is spent going all the way back to when Jefferson first refused to spend some money that Congress had approved.  It's a practice called \"impoundment\" and many presidents have done it over the years and several of them have redirected funds from one agency to another when the appropriating statute language wasn't clear enough.  Congress even enacted a whole statutory scheme around the practice when it passed the Congressional Budget and Impoundment Act of 1974, though much of that was destroyed when Clinton lost his line-item veto case at the SCOTUS in the 90's.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Yourewrongtoo",
                                                            "body": "This isn’t fighting over funding it’s about who controls funding and how things are legally or illegally made. DOGE isn’t in the constitution. DOGE wasn’t created by congress. Allowing for a sitting president to create a new agency by using the name of another then repurposing the stated mission by congress is allowing the president to make their own law.\n\nSince you bring up that Supreme Court loss what was the reasoning? Was it because congress can’t abdicate some of its power to the executive even if it wants to, it has to be enumerated into the constitution. Do you think then congress can abdicate the power to create agencies to Trump?",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "VVTD33",
                                                                    "body": "![gif](giphy|LSKVmdIwZFeNEBKBxZ)",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Asangkt358",
                                                                    "body": "The president can consult with whomever he/she wishes to consult, including a group of guys calling themselves \"DOGE\".  And yes, past presidents have folded agencies together without Congressional approval though it all depends on how specific the underlying enabling statute.  You'd be surprised at how vague some of those enabling statutes are.  Title IX, for example, just says:  \n\n\"No person in the United States shall, on the basis of sex, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any education program or activity receiving Federal financial assistance.\"\n\nThat single-sentence statute has been used to expand the Dept of Education in many ways as well as to create sub-agencies within the Dept of Education all with their own budgets and regulations.  Since that statute doesn't actually require any of those things, however, Trump will be free to defund and dismantle all of those things if he so desires.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Yourewrongtoo",
                                                                            "body": "The president can consult and if that is what DOGE was doing he could consult with them. The issues start piling up right after consultation, they do not have security clearances at DOGE so they can’t handle any data that requires clearance. DOGE as an agency doesn’t exist in federal or constitutional law so it has no ability to enter any agency.\n\nhttps://apple.news/AC23RFmZfSwSMEl1kpJcrEw\n\nLook at this DOGE member being a prominent racist with deep racist beliefs who advocated for eugenics. People have to be vetted to enter in government they can’t just be scooped off the street because Nazi Musk says so.\n\nI’m sorry you don’t seem very libertarian to me if you are arguing for an expansive viewpoint of reading laws by the executive to wholly create a new department. If you legitimize this then don’t get mad when the next democratic president comes along and creates your worst socialist nightmares completely out of nothing.\n\nThe hard thing about being principled is that it can be limiting, you either work within a framework or you are destroying it entirely, do you wish to destroy the constitution?",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Asangkt358",
                                                                                    "body": "Again, Trump is doing nothing new here, other than actually carry through with his promises to shrink government.  Everything he is doing has been done by past presidents.  Your entire criticism is founded on a tenuous and incomplete understanding of history.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Yourewrongtoo",
                                                                                            "body": "No. He is doing a lot of new things, DOGE is an entirely new department created completely out of thin air. He is violating the law by having “appointed” the head of an agency without a senate confirmation, allowing them access to other agencies even though they lack legal framework to do so and clearances.\n\nYour justification is like trumps, made up entirely. Look at what you said, DOGE can exist because Title IX exists and the department of education used that to expand their mission. The department of education has nothing to do with doge, it can not be used to say doge can exist no matter what. Just admit you aren’t a libertarian, anyone reading this can see you are just a MAGA Republican LARPING as a Libertarian.",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Asangkt358",
                                                                                                    "body": "DOGE isn't an official department, despite it's name.  Nor does it have to be in order for Trump to consult with them and follow their recommendations.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Yourewrongtoo",
                                                                                                            "body": "It has to be an official department to have access to other departments… do you think presidents can simply ”consult” with someone and allow them to take data or have access to department systems. There are rules you know.",
                                                                                                            "score": 4,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "cyclorphan",
                                                                                                                    "body": "Given that they have basically an unchecked power to declassify almost anything, yes, I'd say they can. I hope that DOGE is cautious about PHI/PII (Musk presides over multiple companies that have to be), but I don't see how this is a greater power or mutually exclusive with what they already have.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Yourewrongtoo",
                                                                                                                            "body": "Even the president can’t share everyone’s social security numbers or declassify how to build a hydrogen bomb. There are limits to this and this argument is so bad Trump isn’t using it in his defense filing.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "Asangkt358",
                                                                                                                    "body": "No, it doesn't have to be an official department to have access to other departments and, yes, presidents consult with outsiders all the time.",
                                                                                                                    "score": -1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Yourewrongtoo",
                                                                                                                            "body": "This is false as there is an act, the Federal Advisory Committee Act, it states there that the records of an advisory committee must be kept, it limits the actions and access to other agencies, and it creates requirements for people employed there. Trump has not acknowledged DOGE as an advisory committee either.\n\nAgain you and Trump are making up the law and not following it one fucking bit. Part of being an advisory committee is that it must fall under the jurisdiction of a stated department, it can not operate without a head that can be held accountable. The people also need to be vetted in the normal fashion and certainly not openly racist, calling for eugenics, or inciting racial hatred.",
                                                                                                                            "score": 4,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "HeavyComforterer",
                                                    "body": "Also wether you guys like it or not - the funding from these agencies support real people in real communities. To pull the plug over night on much needed services is just psychotic.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "grendev",
                            "body": "So if you do it by consolidating all powers in the president, that's fine?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "MarduRusher",
                            "body": "That’s sort of my attitude. I get the idea of wanting to adhere to the constitution but when so much of what the government does is already unconstitutional and the normal checks and balances are failing to stop that, it might be time to play by those same rules.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "exiledinruin",
                                    "body": "the only unconstitutional thing happening is DOGE getting access to all this money. you don't care about constitution or laws, you just want what you want, damned be to the country.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "MarduRusher",
                                            "body": "Having seen what much of the USAID funding is going to, no lmao.\n\nBut to use another example look at gun control. Blatantly unconstitutional but on the books for almost 100 years now. We’ve tried to get rid of that unconstitutional legislation using constitutional means only to fail over and over.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "exiledinruin",
                                                    "body": "shows what you know. 2nd amendment was only in the last half century interpreted to mean individual ownership of all sorts of weapon. the only unconstitutional thing there is that people are allowed to own weapons that can kill so many innocent people. stop drinking the kool-aid",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "cngfan",
                                            "body": "What the fuck are you talking about? Getting money?!?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "exiledinruin",
                                                    "body": "where do you think all those cancelled checks are going to? straight to prop up his other businesses; Tesla, SpaceX, X, etc.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rare_Tea3155",
                    "body": "They didn’t pass student debt forgiveness either but that didn’t stop democrats from trying it over and over. Now the tables are turned. Guess it was a bad idea for them to set that president",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Wolfstar33",
                            "body": "Firstly, it is precedent. \n\nSecondly, this is not a tables have turned situation. It seems you are referring to EO’s which I believe are a massive constitutional loophole in how they are currently being used. Both parties for the last 2-3 decades have used EO’s to push things past Congress. Congress has to stop being lazy and do their job as a legislature and take back authority from the executive.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Asangkt358",
                    "body": "Thats such an empty complaint.   All Doge is doing is reviewing spending records and making recommendations to Trump.  Do you think that the President can't consult with anyone unless they were first approved by Congress?   \n\nAnyone should be able to review government spending and voice an opinion on said spending.  And the President absolutely can listen to such opinions, even if they come from someone that wasn't voted on by Congress.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "grendev",
                            "body": "They aren't auditing, they are going in and taking over. Those are vastly different things. Congress appropriates the money. I'm all for getting spending down but this is not the constitutional way to do it.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Asangkt358",
                                    "body": "Sitting in a building accessing financial records is not \"taking over\".",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "grendev",
                                            "body": "Just accessing financial records: [https://www.cnn.com/2025/02/06/politics/elon-musk-treasury-department-payment-system/index.html](https://www.cnn.com/2025/02/06/politics/elon-musk-treasury-department-payment-system/index.html)\n\nWe're going to have to wait for the facts to shake out (hopefully) but I'd like to know what they are doing with my financial records.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Asangkt358",
                                                    "body": "You think that Trump doesn't have the power to decide to shut off the flow of outgoing funds from USAID?  He does.  That's how the executive branch works.",
                                                    "score": -4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional_Golf393",
            "body": "If you support the democrats, you are not a libertarian. \n\nA left wing progressive libertarian is an oxymoron.\n\nReading these comments leave me thinking that not one of you have a libertarian bone in your body.",
            "score": 154,
            "replies": [
                {
                    "author": "mwthink",
                    "body": "You’re not alone. These people are wild and co-opting the brand.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "shodan13",
                            "body": "Seems like most here are also happy for them to do that.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DistributionOk528",
                    "body": "Yep.  MAGA infested.",
                    "score": 97,
                    "replies": [
                        {
                            "author": "strikerrage",
                            "body": "Said the Kamala voter.",
                            "score": -29,
                            "replies": [
                                {
                                    "author": "theoneandonlybroski",
                                    "body": "She sucked and the DNC should have held a primary, but Trump explicitly said what he wanted to do before he got elected. Dictator on day one. There is not a libertarian bone in Trump’s body; no matter who the other person is they were a better choice.",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "Professional_Golf393",
                                            "body": "They said, while at the same time furious that he’s downsizing the government. smh",
                                            "score": -19,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "augsome",
                    "body": "Gatekeeping having libertarian values is wild. Just like no one should have 100% pure conservative or liberal values, most “libertarians” have mixed views that tend to lean this direction.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "grendev",
                            "body": "It's the poison pill with every ideology, if you aren't 100% with us, you're our enemy.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "DnD4sworn",
                                    "body": "I think therefore I am… someone’s enemy",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "guhman123",
                    "body": "I don't believe we have an actual libertarian party in this country, so I must choose with respect to left/right instead of auth/lib.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Only_Biscotti_2748",
                    "body": "Your inability to understand left-wing libertarianism doesnt mean it doesn't exist. It just means you aren't smart enough to understand it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Professional_Golf393",
                            "body": "Ah yes, the typical leftist argument, “I’m smart, you’re dumb” with no other substance to your point.\n\nYou guys are so predictable.\n\nTell me one thing about current left wing progressivism that aligns with libertarianism?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Only_Biscotti_2748",
                                    "body": "I understand what values and principles lead to someone being a right-libertarian. I think those values are dogshit, but I understand how their existence leads to right-libertarianism.\n\n\nYour inability to do the same for left-libertarianism doesn't say anything about left-libertarianism. It just means you aren't capable of understanding simple political theory, regardless of whether you agree with it or not.\n\n\nI'm not saying right-libertarians are dumb. I'm saying YOU are.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Professional_Golf393",
                                            "body": "More name calling and babble without answering the question. Like I said, predictable. \n\nAt least automod has my back 😏",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Only_Biscotti_2748",
                                                    "body": "Covering your ears and refusing to accept your limitations won't make them go away.\n\n\nAct like the adult you are (presumably) and have the intellectual courage to understand what your political opponents believe.\n\n\nAnd yeah, the bot that mindlessly repeats pre-written statements does have your back... That's just not the flex you think it is.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Professional_Golf393",
                                                            "body": "🥱\n\nI understand the left and right quite well. I made a specific point that people who support the progressive left ideology are not libertarian, that’s pretty cut and dry.  \n\nProve your point with a counter argument instead of calling me dumb. It’s quite simple, tell me why I’m wrong…",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AutoModerator",
                                                                            "body": "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AutoModerator",
                                            "body": "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlphaTangoFoxtrt",
            "body": "I mean the IRS kind of is via the 16th amendment.\n\nI hate income tax, but it is, legally, constitutional.",
            "score": 90,
            "replies": []
        },
        {
            "author": "marginalboy",
            "body": "Eh, straw man. I’ve not seen one person object to the absurdity that is “DOGE” do so because it’s not explicitly commissioned in the Constitution 🥱",
            "score": 74,
            "replies": []
        },
        {
            "author": "masterwad",
            "body": "Would libertarians love it if George Soros was snooping around in the Treasury? No, so why do they kneel before Musk when he does it?\n\nAlso, Dinesh D’Souza is an idiot for siding with white nationalists. His “films” are braindead jokes. You would think that Dinesh (of Indian descent) would have noticed how Vivek (of Indian descent) got dropped from DOGE like the tool he is.\n\nBut Dinesh is a convicted felon who was pardoned by convicted felon Donald Trump.\n\nOh sure, we can all trust a convicted felon, along with the richest man on Earth who spent $290M to elect him (who says he was screwed if Trump lost) to “drain the swamp”…You trust a fraudster to crack down on fraud? You trust an idiot who wasted 2 billion gallons of water in California to crack down on waste? You trust a South African illegal immigrant, whose electric trucks can’t even go through car washes unscathed, to know anything about efficiency?",
            "score": 114,
            "replies": [
                {
                    "author": "Susbirder",
                    "body": "If Soros transparently campaigned with any candidate and told the world upfront that he would jump in the fray and fix the waste and abuses of Big Government, it would probably be about the same.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "New_Leg6758",
                    "body": "Anyone paying the most remote bit of attention knows that the \"convicted felon\" thing is such bullshit. Go after the guy for shamelessly backing Israel in the slaughter going on over there, or for any number of things he actually did. But the convicted felon thing just makes you sound like another Leftie.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "New_Leg6758",
                                    "body": "Bro it was New York. He was never gonna get a fair trial there. On top of that the damn judge told the jurors that they didn't have to agree on the details of the conviction. That's the biggest \"wink wink, nudge nudge\" I've ever seen.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "erdricksarmor",
                    "body": ">But Dinesh is a convicted felon\n\nYes, the terrible crime of donating too much money to a friend's failed political campaign.\n\n![gif](giphy|5yuC2vIsQJdoA)",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "cows-go-moo19",
                    "body": "If George Soros started destroying federal bureaucracies, it would be one of the only good things he’s ever done in his life. \n\nYou call it “snooping” to obscure what we are talking about. This is reform.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ehronatha",
                            "body": "This, this, 100 x this - I don't care who's doing the libertarian stuff!  \n\nI don't see D, R, or XYZ - I see pro-freedom or anti-freedom.  If this was being accomplished through a left-wing movement and Ds, I would also be thrilled.  (Unfortunately that can't happen because left-wing people need big government for resource reallocation.)\n\nThe libertarians who are losing their minds at this incredible time in history are showing their true colors.\n\nIs everything perfect? No. Are we getting lots of stuff that we say we wanted?  Yes!!!!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ziegen76",
                    "body": "You’re probably right,  but how do you reconcile Dinesh being pardoned by a suspected white nationalist?",
                    "score": -6,
                    "replies": [
                        {
                            "author": "exiledinruin",
                            "body": "to fool rubes on reddit obviously",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "staticattacks",
            "body": "![gif](giphy|6nGE3BmUlhs3e)",
            "score": 46,
            "replies": []
        },
        {
            "author": "gnenadov",
            "body": "“Draining the swamp” by giving massive power to an unelected billionaire!",
            "score": 39,
            "replies": [
                {
                    "author": "MMOOMM",
                    "body": "It's almost like he doesn't actually have the power and is doing exactly as trump commands. You know, the elected head of 1/3rd of the Federal government.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "theravenousR",
                            "body": "\"Exactly as Trump commands,\" my ass. Trump wouldn't know the first thing about accessing the Treasury's payment system.\n\n\nNow, is he doing it with Trump's approval? Sure, after giving Trump a quarter of a billion dollars, Trump is his puppet.\n\n\nTrump: \"H-1Bs are very bad for the American worker. With America First, we're gonna get rid of it.\"\n\n\nMusk:  \"I need cheap, desperate labor to function as indentured servants.\"\n\n\nTrump: \"H-1B is a great program, I love it, I've always said it was great.\"",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sirwinston_",
                    "body": "Well the swamp refers to the bureaucratic waste of Washington…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "vassago77379",
            "body": "If you are legitimately scared of a committee built to slash govt waste... you are part of the problem",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "This is one of the few political subs with intelligent, nuanced discussion. Thanks for giving me a sliver of hope, boys and girls.",
            "score": 3,
            "replies": []
        },
        {
            "author": "justgot86d",
            "body": "Neither is the Air Force\n\nBut seriously though kind of love seeing some folks now turn into strict constitutionalists.",
            "score": 26,
            "replies": []
        },
        {
            "author": "GrassyKnoll2020",
            "body": "It's low-ball libertarianism, but I suppose it's a start. Advocating the notion that \"we'll quit inventing new government agencies if and when you close the legacy agencies\" seems like 2 steps forwards and 1.9 steps back.",
            "score": 24,
            "replies": []
        },
        {
            "author": "LawlessCrayon",
            "body": "As much as it's a good libertarian idea, in practice the way this has gone down is illegal at best.  If we were being rational Elon would be deported or in jail instead of the one in charge of DOGE.  We should have seen that coming with the meme name though.",
            "score": 16,
            "replies": [
                {
                    "author": "MMOOMM",
                    "body": "From my understanding Trump made him a special governmental employee and also gave his whole team security clearance.\n\nWould love to see the laws broken. Is there something I'm missing?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "monet108",
                            "body": "It is jeopardizing a well run system of corruption and might expose the underbelly of how the CIA operates and wages war. What has been done to USAID is about the biggest wound to the CIA ever. \n\nThe various unelected government agencies all have issues with their budgets. The DoJ has never passed their own internal audits. The Federal Reserve has never been audited. Are these branches beholden to the American people or are we beholden to them. Should our tax dollars not be used as efficiently as possible or not. \n\nThese next four years are going to reveal a lot of sins.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "LawlessCrayon",
                            "body": "He's stealing our financial information and erasing scientific data, if you can't find enough in that for actionable crimes then it's crimes against humanity and treason for whatever he's done with that information.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "KilljoyTheTrucker",
                                    "body": ">stealing our financial information\n\nNo, he isn't. He's been directed to do a task, and has been given authorization and clearance for access. He's not the local bank teller accessing the company computer after hours to steal identity information for illegal personal use or illegal sale. \n\n>erasing scientific data\n\nWhat scientific data? This a new claim to me. Then the obvious follow up is, what was he directed to do with that information by his boss, and how does that chain violate any specific law that you can cite as relevant?\n\n>crimes against humanity\n\nWhich crimes?\n\n>treason\n\nPretty worthless word you've got there. Care to back it up?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "MMOOMM",
                                    "body": "His crime of treason is accessing and configuring data that the democratically elected President asked him to?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Yes, because the president cannot overrule congressionally set data laws. Even if those people have provisional clearances, it has been shown that the devices that they are using are not compliant with the security standards required for that data. Are you seriously under the impression that “President said ok, so it’s ok” and also on the libertarian board?",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "MMOOMM",
                                                    "body": "\nI’m pretty sure there’s a whole separation of powers thing. Congress can’t just pass a law on how the president is supposed to do their job. There are some explicit things that the senate gets a check on, but other than that you’d have to go through the amendment process.\n\nAnd nothing makes a council or congress more or less libertarian than a single executive. It depends on if they are hurting anyone. And right now it looks like there is no data leaked as the data is all still in the executive.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Euronomus",
                            "body": "The executive branch has no power under the constitution to shut down agencies or refuse to make payments passed into law by congress. When they shut down USAID and other agencies/departments  and froze payments required by law they were in direct violation of separation of powers.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "MMOOMM",
                                    "body": "“No Money shall be drawn from the Treasury, but in Consequence of Appropriations made by Law”\n\nLuckily the appropriations clause, article 1 section 9, clearly says that congress decides where the cap on money is. \n\nI see the ICA (1974) but I don’t know exactly how constitutionally binding simple majority laws are on the other branches of government, but I would assume none, considering overruling veto’s is 2/3rd and amendments bring in the states. Seems like Congress could just defund everything trump likes until he plays ball, like how they interacted up until Nixon.\n\nYou know, like the original separation of powers",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "Yes, the power of the purse is completely in the hands of congress - particularly the house. All spending starts and ends with them by passing bills into law. If you want USAID shut down and those grants canceled, congress has to pass it into law. Trump doing it unilaterally is unconstitutional - that's what the clause you so helpfully copied into your post means. No clue why you are bringing up the ICA - not relevant at all. However, yes, anything passed into law is binding on the other branches - with the exception of the Supreme Court ruling something to be unconstitutional. And I'm not at all sure what you mean by \"original separation of powers\", this is the original separation of powers - it's never been changed.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "KilljoyTheTrucker",
                                                    "body": "Cite the law that says the money *has* to be spent. Just because they're given a budget, doesn't mean that they have to actually use it.\n\nThe status quo has been use it or lose, but that's an entirely different fundamental issue (and likely the largest factor to spending waste). \n\nTrump isn't taking their budgets. He's telling administrative agencies to stop spending their budgets right now.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Euronomus",
                                                            "body": "Spending bills are laws, and as I said, the president is bound by the law. He can no more ignore that spending than you or I can ignore the speed limit. This is not my personal opinion, this is the prevailing jurisprudence - Trump's administration has already been ordered TWICE, by two different judges, to resume those payments on these exact grounds. So far they have refused to do so, they are in open violation of the Constitution.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Taxistheft98",
            "body": "Nor ICE",
            "score": 16,
            "replies": [
                {
                    "author": "Aura_Raineer",
                    "body": "Actually yes ICE https://constitution.congress.gov/browse/essay/artIV-S4-3/ALDE_00013637/",
                    "score": 8,
                    "replies": [
                        {
                            "author": "txeagle24",
                            "body": "Are you trying to be \"Illegal immigration is invasion\" guy?",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sagern",
            "body": "Ah yes, the famous \"you did the wrong thing so I get to as well defense.\" Not even really accurate, but even if it were it's still a nonsensical defense.",
            "score": 4,
            "replies": []
        },
        {
            "author": "dubzi_ART",
            "body": "ATF!",
            "score": 5,
            "replies": []
        },
        {
            "author": "sirweevr",
            "body": "These \"libertarian ideas\" will unspread the second they dont align with whatever MAGA policy becomes trendy next week.\n\nWatch the \"good parts\" of government, like ICE, grow exponentially over the coming years.",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "Not sure this is Libertarian. Musk is acting in excess of the EO, and the legalities of his actions are being challenged in court with the primary argument being that the EO was drafted narrowly in order to evade FACA and disclosure/ethics requirements for certain government employees. \n\nDraining the swamp by swapping alligators for crocodiles.",
            "score": 14,
            "replies": []
        },
        {
            "author": "mrasif",
            "body": "bUt nObOdy V0t3D f4R El0N!!!!",
            "score": 4,
            "replies": []
        },
        {
            "author": "AmateurOntologist",
            "body": "Take a moment to stop licking Elon's boots and realize that the IRS was created by the 16th amendment. It IS in the Constitution.",
            "score": 4,
            "replies": []
        },
        {
            "author": "davester88",
            "body": "Let’s create a government agency to slash other government agencies. Smartest idea yet! Lol",
            "score": 1,
            "replies": [
                {
                    "author": "erdricksarmor",
                    "body": "Technically, they repurposed and renamed an existing agency.\n\nhttps://www.whitehouse.gov/presidential-actions/2025/01/establishing-and-implementing-the-presidents-department-of-government-efficiency/",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "sirwinston_",
                    "body": "Yeah an agency with like 5-10 employees",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "txeagle24",
                    "body": "It's an idea that the left ignored until it started slashing, which is why there wasn't much of a stink made of it prior to the election.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Grundelwald",
                            "body": "Umm, \"Project 2025\" was not at all ignored by the left before the election. Maga and Trump himself shied away from associating with the name/ label, and not every left person understood the agenda behind the project when scaremongering about it, but it's basically exactly the playbook DOGE is following",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Flashy_Upstairs9004",
            "body": "Huzz never heard of the necessary and proper clause.",
            "score": 3,
            "replies": []
        },
        {
            "author": "EnigmaticHam",
            "body": "Don’t you libertarians like rules?  Why don’t you get up in arms at the fact that Elon has skirted or blatantly violated laws to take away your money?",
            "score": -1,
            "replies": [
                {
                    "author": "KilljoyTheTrucker",
                    "body": ">has skirted or blatantly violated laws\n\nCitation needed.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "galaxyofstardom",
                    "body": "most of the libertarians on reddit are not libertarians in the sense that they should be. its like MAGA with a cool name.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": ">”*Don’t you libertarians like rules?*”\n\nPrivate rules, not government rules\n\n>”*Why don’t you get up in arms at the fact that Elon has skirted or blatantly violated laws to take away your money?*”\n\nEnding wasteful government programs and firing useless government workers is not “bLaTaNtLy ViOLaTiNg LaWs.”\n\nThe DMV won’t shrink itself.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "Euronomus",
                            "body": "Gross violations of the constitution are ok?",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "guhman123",
            "body": "Sure, those respective departments are not explicitly stated in the Constitution. However, the Constitution puts the burden of enforcing Congressional legislation on the Executive branch, and so the executive has these departments to execute the laws passed by Congress in an organized manner and to collect taxes as Congress' budget requires. Additionally, Congress has budgeted federal money to these departments, as the Constitution provides Congress the ability to, and the executive has no right to mess with spending as it is the enumerated power of the Legislative, not the Executive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "This isn’t Libertarianism. It’s not creating a more efficient government. \nIt’s wiping out the competition. It’s a reaction to DEI and progressive policies that they don’t like. \nThey aren’t going to stop the military from spending $15,000 on hand soap dispensers. They aren’t going to stop urban planning from spending $3,000,000 on an intersection. \nThey aren’t going to lower the national debt.\nThey aren’t going to make the Pentagon pass an audit.\n\nAll that they will do is say “stop doing that”.",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "Not to mention that Elon Musk wasn’t elected, didn’t take an oath, and he stands to gain a lot based on what he cuts.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "A general in the military isn’t just given the rank, he has to work for it for a long time, proving he deserves the rank.\n\nA police chief isn’t just given the position, he has to go to police academy and work for years to get enough experience to get the position.\n\nDirector of the FBI isn’t a position handed out to any Tom, Dick, or Harry. You have to prove you can handle the position.\n\nThe vast majority of government may not be technically elected, but they have proved themselves to be capable. That’s a meritocracy, gaining a position based on merit. \n\nAnd yeah, they should go away. Welcome to r/libertarian.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "We have given an unvetted man access to power and influence, greater than he already had, and we don’t even know if he can run a government agency effectively. His only leadership experience is being CEO of Tesla (a company he hijacked) and SpaceX (a company that hasn’t accomplished anything yet, Mars by 2021).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Euronomus",
            "body": "Talk about a strawman - a nothing argument that completely misrepresents the situation. The constitution explicitly gives congress the right to levy taxes, and create government institutions. Meanwhile the conduct of Musk and his cronies is a gross violation of separation of powers as laid out in the constitution.",
            "score": -1,
            "replies": []
        },
        {
            "author": "MEMExplorer",
            "body": "Burn it all down \n\nhttps://youtube.com/shorts/Uj84sKQ8-VE?si=GNVuQoN9-coRG8f8",
            "score": -2,
            "replies": []
        },
        {
            "author": "darth_dad_bod",
            "body": "Sweet",
            "score": -4,
            "replies": []
        },
        {
            "author": "grayseeroly",
            "body": "Adding more government to solve the problem of too much government is an interesting choice.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Cannoli72",
            "body": "Eliminate everything outside of article one section 8 of the constitution. This is the fastest and easiest way to do it. Donald Trump has a duty to write an executive order on this today. This would also eliminate most of his agendas well!",
            "score": -8,
            "replies": []
        },
        {
            "author": "API4P",
            "body": "I liked that response.",
            "score": -6,
            "replies": []
        }
    ]
}