{
    "title": "Legalize Cocaine!",
    "author": "zenzonomy",
    "subreddit": "Libertarian",
    "rank": 460,
    "score": 94,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.politico.eu/article/colombia-president-gustavo-petro-legalize-cocaine-no-worse-than-whiskey-latin-america/",
    "id": "1ij881b",
    "selftext": "",
    "comments": [
        {
            "author": "zenzonomy",
            "body": "Colombia’s president: Legalize cocaine, it’s no worse than whiskey",
            "score": 16,
            "replies": [
                {
                    "author": "Asangkt358",
                    "body": "He's not wrong, though I dislike how this article completely glosses over his real point:  Keeping cocaine illegal is benefiting the criminals and not actually stopping anyone from actually getting their hands on cocaine.\n\nYou think we would have learned this lesson after Prohibition, but apparently not.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "galaxyofstardom",
            "body": "we should legalize all of it. we have bigger problems then the “war on drugs”.",
            "score": 13,
            "replies": []
        },
        {
            "author": "bigbeeeaan",
            "body": "This is why I get frustrated with politics and government, my brain doesn’t understand why this isn’t a no brainer. Spend trillions on fighting it vs spend probably millions regulating it (with taxes probably putting the balance sheet positive). Loss of life from “legal overdoses” would pale in comparison to the lives lost fighting it. Not to mention the enormous benefits a stable South America would bring to US and the world. \nI’d think Columbia, Latin America and Mexico should do it first though. Corner Europe and the US into figuring out how to legalize it.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Comfortable_Mix_7445",
            "body": "I dunno, I would argue it’s worse than whiskey. But if you wanna do it, that’s up to you, your decision, not the government’s.",
            "score": 40,
            "replies": [
                {
                    "author": "zenzonomy",
                    "body": "Yeah, it’s definitely worse than whiskey, but It’s not worth the drug war that prohibition has caused",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "FxckFxntxnyl",
                    "body": "It definitely is. I have basically zero septum anymore and immense sinus damage from 1 year of heavy use.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "TheAlchemist1",
                            "body": "Columbian cocaine and American 100x stepped on cocaine are two completely different drugs.  \n\nOne bump of the Columbian pure is like a 1 gram line in the states (usually between only 40-60% pure) and filled with shit you shouldn’t put in your nose plus other shit like caffeine that changes the high.\n\nI suppose heavy use still going to fuck you up, but if wanted the equivalent high you’d have done about 1/3 of what you were doing",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "FxckFxntxnyl",
                                    "body": "I do agree, I was invited to a crazy rich party back in my racing days and was welcomed to the coke table and it was the most insanely powerful coke Ive ever encountered. Insane levels of better.  No idea if it had meth in it or some other sort of enhancing cut/filler(levamisole is what ruined my body), but it was intense.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "conipto",
            "body": "I mean I don't know if it's just as harmful/less as whiskey, but if a cocaine bar opened up here, I'd be a customer.",
            "score": 6,
            "replies": []
        },
        {
            "author": "TheAlchemist1",
            "body": "Make Coca-Cola great again!",
            "score": 4,
            "replies": []
        },
        {
            "author": "mung_daals_catoring",
            "body": "Christ let's get grass figured out and legalized federally first, one thing at a time now boys lol",
            "score": 4,
            "replies": [
                {
                    "author": "frankiedonkeybrainz",
                    "body": "Incidentally, cocaine would probably have an easier path since it's a schedule 2 whereas Marijuana is a schedule 1. \n\nI'm speaking purely on the red tape of changing the designation not the stigma and arguments/support it would require to even get to the point of government dropping cocaine from schedule.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thencewasit",
            "body": "Maybe we just start by legalizing growing cocoa plants in the US.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PrincessSolo",
            "body": "If it's legal they can collect taxes on it",
            "score": 2,
            "replies": []
        },
        {
            "author": "SomeRandomGuy0321",
            "body": "I agree with legalization, but no worst than whiskey?  \nWhat is he on? (Pun intended)",
            "score": 2,
            "replies": []
        },
        {
            "author": "legal_opium",
            "body": "Id personally want medical transdermal patches for pain relief for my spinal damage. \n\nCould numb and give energy at the same time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DinoFeliz",
            "body": "In an ideal anarcho-capitalist or minarchist government, yes, de-regulation of drug consumption is a no-brainer. If you want to consume, is your problem only, you pay for your healthcare, and you don't cause problems to anyone else.\n\nNow let's take this to real life. Let's say Argentina, where I live as many proposed South American countries. In Argentina, unfortunately, we have an inefficient state healthcare system. If we legalize drugs, more people would consume them and also consume more of the health care system that is financed via taxes. So, until Health Care is 100% privately owned, and the state has 0% intervention there, drugs should be illegal as it's a cost to the health care system we all pay. Also a cost to the social systems we have in Argentina, etc, etc.\n\nYou could argue that programs combating drug cartels are more expensive, but, I doubt that. State Healthcare expenditure in Argentina represents around 10% of its GDP, meanwhile, military expenditure is less than 0.5% of GDP. Healthcare values would increase given free access to drugs.\n\nTLDR: in a minarchist government without state healthcare, for sure, yes to drugs. In the real world where the state still has healthcare, no, as people who don't consume drugs need to pay for those who do.\n\nEDIT: Adding a video from Milei that summarizes my position ( [https://youtu.be/giEcsRDosKM?t=783](https://youtu.be/giEcsRDosKM?t=783)) it's in Spanish but auto-translate is available. Please watch it and let me know what you guys think. Thanks!",
            "score": 2,
            "replies": [
                {
                    "author": "Intelligent-End7336",
                    "body": "> TLDR: in a minarchist government without state healthcare, for sure, yes to drugs. In the real world where the state still has healthcare, no, as people who don't consume drugs need to pay for those who do.\n\nDoes the state get to control what types of foods you eat?  Eating poorly causes health issues, so why can't government control your food intake?  \n\nCan the state dictate how much exercise you perform?  Lack of exercise is a key indicator for an unhealthy person.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "DinoFeliz",
                            "body": "I'm pro reducing the state and reducing costs. I do not want to control what people eat, even though you are 100% correct that eating poorly causes health issues. But that is already done, let's not add additional regulations on top of existing ones else we will be limited in what we can or can't eat. \n\n**I'm just saying, that in a welfare state, which is Argentina** (I don't know the US health system in depth to state my opinion, I know there's some public sector, but mostly private.. not sure), **let's not add additional cost to the taxpayers by legalizing a harmful activity.** \n\nWhen we switch to a minarchist government, and the state doesn't handle healthcare then yes, legalize drugs, I don't care if they want to kill themselves in their free time. **What I don't want is to charge the cost of their addiction to me.**  \n\n**And by the way, the state did try to influence what type of food we eat by adding an absurd law pre-Milei times.**  [https://www.ojambf.com/en/the-front-of-package-labelling-law-was-passed/](https://www.ojambf.com/en/the-front-of-package-labelling-law-was-passed/)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Intelligent-End7336",
                                    "body": "You’re effectively saying, \"People only get freedom of choice when I no longer feel inconvenienced by it.\" That’s not how rights work.\n\nYour approach means freedom of choice is permanently held hostage to the hope that government healthcare will one day disappear.\n\nYou're controlling citizens based on the impact to a state run institution.  \n\nYou should be taking freedom when you get the chance.  \n\nThe same argument applies to Milei.  People claim he's not an actual Ancap.  Should you then have elected someone else, or take the win?  It's not perfect to legalize drugs and have a potential cost impact.  But it's a step towards more freedom and should be pursued along with all other attempts at more freedom.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hkusp45css",
                    "body": "What other voluntary behaviors are you advocating to criminalize because of the medical costs/risks to the participant? \n\nSky diving? Driving a car? Drinking alcohol? Using tobacco? Sex? Competitive sports? Bike ramps? Skateboarding?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DinoFeliz",
                            "body": "Please do not build a strawman to refute my arguments. Of course, taking that to the extreme, if that's what you want, I could forbid citizens from taking a bath for fear that they slip and hit themselves. \n\nIt's a long stretch to compare the use of cocaine to any of the activities you mentioned.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "hkusp45css",
                                    "body": "The justification is the same. The activity doesn't really matter.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bigbeeeaan",
                    "body": "I get what you’re saying but I’d assume there would be taxes on cocaine (which I’d consider a reasonable tax as you’d want cocaine use disincentivized for the benefit of the public) which should go to funding healthcare/addiction treatment. I don’t know how much of problem drug related crimes are in Argentina (would welcome some context) but that would be another government cost I’d think would be reduced further adding to it being a “net positive policy” regardless of current government size.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DinoFeliz",
                            "body": "Sorry it's in Spanish, I guess you could translate the page. We have a city, Rosario, where in 2023 there were 258 murders, 70% of them related to drugs\n\n[https://www.infobae.com/sociedad/policiales/2024/03/13/el-mapa-de-la-muerte-en-rosario-uno-por-uno-los-barrios-que-controla-cada-capo-narco/](https://www.infobae.com/sociedad/policiales/2024/03/13/el-mapa-de-la-muerte-en-rosario-uno-por-uno-los-barrios-que-controla-cada-capo-narco/)\n\nI was in your position regarding drugs and taxation. As mentioned, in an ideal minarchist government, for sure, in the real world, there are problems. \n\nI suggest listening to this fragment [https://youtu.be/giEcsRDosKM?t=783](https://youtu.be/giEcsRDosKM?t=783) . It's in Spanish, but you can put auto-sub translate, Milei explains the problem of legalizing drugs without having a Minarchist state.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "bigbeeeaan",
                                    "body": "I’ll definitely check those out, appreciate the links!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bull_Bound_Co",
                    "body": "Cocaine has been legal in Colombia for personal use since the 90's they have fewer issues with users abusing it. I suspect it's because it's so cheap only a few dollars a gram.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TCh3rn0b0g",
            "body": "People who want to do drugs, will obtain them whether they are legal or not.\n\nI do NOT advocate the use of drugs. However, that said, I DO support legalizing all drugs. Individuals should be accountable for their own decisions.\n\nRegulations should still be in place for the case of minorities, driving under influence, or use within private institutions, obviously.",
            "score": 1,
            "replies": []
        }
    ]
}