{
    "title": "Intellectual property and its regulation",
    "author": "None",
    "subreddit": "Libertarian",
    "rank": 458,
    "score": 5,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 35,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ijr6xr/intellectual_property_and_its_regulation/",
    "id": "1ijr6xr",
    "selftext": "As someone trying to understand libertarianism one of the hardest things to grasp is a free-market approach to intellectual property rights like copyright, patents, trademarks, etc. How would these properties be regulated without an overarching government framework? In the case of physical objects and land, ownership is an easy concept. When it comes to ownership of ideas, patterns, domain names, etc, the situation is much more complicated. How would differences in opinion be resolved? on And how could theses protections work in a global market? \n\nWould you be in favour of extensive protection of intellectual rights or are there some limitations needed?",
    "comments": [
        {
            "author": "Key-Kaleidoscope-680",
            "body": "There would be no intellectual property because ideas are not scarce.",
            "score": 7,
            "replies": []
        },
        {
            "author": "onetruecharlesworth",
            "body": "Easy, you don’t. you can’t own an idea. The concept in and of itself is BS. You can’t own Math it just is, someone else could discover the same thing as you half a world away at nearly the exact same moment. So whoever pays a lawyer first and gets their paperwork in wins? Once an idea is out there it’s out there. Intellectual property rights are a means of protectionism via regulation. It’s a way to artificially increase the profits margins of the producer by preventing competition from closing the margin. You want people to copy your idea, it makes the society richer as a whole by lowering the marginal cost to the consumer via whatever innovation you created and you get to profit in the short term, definition of a win/win. God forbid you have to continue to innovate, invest in capex, and provide more value to society when you could just exploit the entire market by creating artificial scarcity.\n\nEspecially when you send your entire manufacturing process over seas, they are seeing the whole process beginning to end even if they don’t copy you exactly they’ll pull something from it just by being at work all day subconsciously. Also anyone can buy the product and take it apart to figure out how it works, you gonna bust down someone’s door for popping the screen of their iPhone and poking around?\n\nI say this working in intellectual property knowing it would put me out of a job. (I assist private law firms get patents through the office I’m not a public sector leech) but the longer I’ve worked in this industry the more BS and arbitrary it seems to become.",
            "score": 5,
            "replies": [
                {
                    "author": "None",
                    "body": "Thanks for the reply. I think how we handle intellectual property will get more and more important in the future and there's a real danger of overregulation.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "onetruecharlesworth",
                            "body": "I’m actually less worried about, it seems like the world is headed towards a more decentralized future with Bitcoin and “crypto”. People are starting to realize the pace of innovation is becoming faster than anyone can regulate. and parallel systems outside of the preview of these regulating entities are being created. I have a lot of hope for the future because of Bitcoin.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Echale3",
                    "body": "You may work in intellectual property, but you clearly don't understand the why of it or human nature too well.  I got the first of several patents about 30 years ago, and I didn't spend my hard-earned money doing so out of some sense of altruism, I expect to be compensated for investing my intellect, time, and efforts in making an idea become real.  It's been the same for all my other patented inventions.\n\nYou said that the inventor wants others to copy their work, capitalize on their effort and investment, drive profits down, and be a win-win for society.  That runs contrary to normal human nature.  If somebody invests time, effort, and capital into developing an idea into something useable, anybody that's not overcome with an unbelievable sense of altruism wants to be compensated for their efforts, which is why, in the interest if fairness, IP law gives them the level of protection it does for the time it does.    \n\nThere's an intrinsic value to things, and if you try to sell whatever it is that you invented for more than that thing is worth to somebody they simply won't buy it and will find some other way to make do, so your argument about patents artificially increasing profits falls flat.\n\nAs regarding sending your manufacturing process overseas and losing control of it that way, a person in the US can obtain patents in other countries or economic zones via the Patent Cooperation Treaty.  Of course, somebody doing the manufacturing for you will learn both the process and composition of matter aspects of your patent, that's to be expected if you outsource production.  If your patent claims (the true heart of the patent, it defines what is and isn't protected) are written properly and you did your research properly, it will protect you from somebody doing an easy tweak and getting around it that way. \n\nWhat a patent in the US won't do is protect your IP in a different country or economic zone, that's why the Patent Cooperation Treaty was created, it allows you to apply for patents in other countries/zones besides your own.  It's not an easy or inexpensive process (I can tell you this from personal experience), but it's useful.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "onetruecharlesworth",
                            "body": "Right you’d create an innovation and attack the margin until other people stepped in and attacked the margin too til it fell to zero. intellectual property laws are an attempt to slow that process to maintain the margin as long as possible to exploit the market. \n\nthe natural state of the economy is deflation via innovation. We’re much better at making TVs now than we were 50 years ago. That’s why flat screens are so cheap. A calculator used to cost you money now there’s a free app on your phone. Did I steal the idea from the guy that made the Calculator? do I owe him money for making a Calculator app? No, but did you not indirectly benefit through from my free calculator app via all the people that are now also able to contribute more to the economy cause now they can do calculations faster bringing the price of all the other goods you consume down in all the sectors people are using my calculator app.\n\nCure for cancer is a great example, how many Einstein’s have to die of cancer? how much GDP in human labor do we have to lose? or how much money do you have to make from withholding the cure from people with your intellectual property rights before you’re satisfied? How much capital destruction and misery do you have to inflict upon others before you’re OK with some Chinese or European, or American company, copying it? \n\nYou’re directly creating inflation by artificially creating scarcity through your intellectual property rights. You’ll be making money the whole way as people try to replicate you it’s not like they’ll be able to come to market and close the margin tomorrow. Just don’t be a little bitch about it and be happy that people are using your product or service and the money you’re making now and innovate to continue to create more value. That’s how real capitalism works not the pseudo socialist bullshit we live in now. You already have the network effect. You’re the first mover. While people are still figuring out how your first thing works. You could’ve already developed and released another product attacking a different margin somewhere else. With the trust and reliability brought by the branding of your initial cancer cure. There’s a difference between providing value through your innovation and getting payed for it in a mutually agreed upon exchange of value and coercing the consumer into using your artificial scare product via legal arbitrage because it’s your idea and you feel entitled to it.\n\nAlso side note nothing has “intrinsic” value all value is subjectively created at the margin. Your patent prevents them from seeking alternatives by legally boxing out all competition. Your argument conflicts with itself.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Emergency_Accident36",
            "body": "should mostly be forbbiden to claim.  Maybe a very brief period in some cases.  You put it out in the world it's the worlds now",
            "score": 2,
            "replies": []
        },
        {
            "author": "Echale3",
            "body": "Something tells me that the people responding to this, especially the ones touting Kinsella's disdain for IP, have never invented anything and gone through the process of developing a concept into a real, usable, item, design, or process that's fit for its intended purpose.  Since you've never done it, you can only imagine, but not truly know, what it really takes to go from concept to reality.   \n\nYou think other people's work should be free for you to make use of.  Here's something to consider...  Party #1 (could be an individual, group of people, or a corporate entity) has an idea for something that would be really useful to others, but it'll take time, effort, and money to develop it.  Party #1 spends time developing the idea (time has value), spends money buying raw materials, building prototypes, doing testing, etc., and eventually refines everything to the point they have an item, design, or process that's fit for the purpose intended.\n\nWhy does your libertarian philosophy allow Party #2, a person, group, or corporate entity that didn't come up with said idea, didn't do any of the work it took to go from concept to completion, didn't spend money or time or put any effort into the process to take all that from Party #1?  Is that in any way fair to Party #1?  No, it's not.  \n\nAsk yourself this, too -- if you had an idea for a new something-or-other that would useful to people, and you knew that if you were to invest in developing said idea some other party could just come along and reap the benefits of your time, effort, intellect, and money spent in development, would you be likely to do all that out of a sense of total altruism, or would you be a normal person and say \"Fuck it, I'll just get ripped off\", and not go any further with your idea?  Be honest, 99.99999% of you would not want to do the work only to see somebody else reap the benefits and you get two fists full of fuck-all out of it.",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "Just as a thought, wouldn't weakened IP protection mean companies would have to use their IP for real products and services instead of patent trolling and letting them rot in a vault? I think this is a very complicated matter and it's hard to imagine strong protection without strong intervention. I certainly understand the arguments for patent protection as well though.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "onetruecharlesworth",
                    "body": "They had to spend capex to reverse engineer and build out the manufacturing for the copy. There are still development costs for them. It’s just cheaper cause they have a jumping off point to work backwards from. They could easily run out of money before they created a functional copy. Figuring out how a new innovation works isn’t free and because of that you get to sell it a premium because you’re the only producer and can probably scale faster. You’d be profiting the entire time that they’re going through that process. Nice try though\n\nConsider the fact that many companies choose not to patent certain technologies or innovations, even if they could. This might be because they want to encourage collaboration and open-source development, or because they believe that patenting would stifle innovation rather than promote it.\n\nIn the case of search algorithms, for example, the technology is constantly evolving, and companies like Google are continually updating and improving their algorithms to stay ahead of the competition. This suggests that the value of innovation lies not in patenting a specific technology, but in the ongoing process of development and improvement.\n\nBy not relying on patents, companies can focus on creating value through their products and services, rather than trying to artificially create scarcity through legal means. This approach can ultimately benefit consumers and promote innovation in the long run",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Echale3",
                            "body": "You claimed to work in IP assisting law firms in the patenting process, but I really begin to wonder what level of assistance you bring to the table because there's so much you either don't realize or choose to gloss over with regard to the patenting process, especially what must be disclosed in a patent application.\n\nCompanies may choose not to obtain patents because the patent must contain a detailed road map telling anyone \"skilled in the art\" how to recreate the invention.  The overwhelming bulk of the reverse engineering time and effort you refer to is already done for the person or company looking to infringe.  All they have to do is set up the manufacturing.\n\nBy not obtaining a patent and controlling the information within the inventing company, the \"how to do it\" can be kept as a trade secret.  The capex for reverse engineering is pretty damn low if there's a patent or a patent application providing a roadmap to somebody that's either looking to infringe or betting that the patent doesn't issue.  It's often just a case of making a capex for duplicate equipment and raw materials, then using the disclosures in the patent as a proxy for the R&D process.\n\nUnless the company requests it and also meets certain criteria, a patent application will be published for public view 18 months after it's applied for.  Once it's published, anybody can go online to the USPTO (or overseas versions of it) website and read all about it.  Once the \"how to\" bit is revealed, it's common for other companies to begin to work on improvements or derivatives that would either obviate the patent protection or possibly prove patentable in and of themselves if the invention is worth pursuing from a market perspective.  Case in point there would be the chemical differences between sildenafil and vardenafil.  They aren't all that different, chemically speaking but are different enough that vardenafil was patentable despite the sildenafil patent.\n\nWith regard to algorithms, yes, it's definitely a case of improve or get left behind and the speed with which that happens drastically outpaces the speed at which a patent will issue, effectively negating patenting as useful.  In that case, each improvement, regardless of who made it, builds on what came before, and will shortly be built on itself.  That said, your example is limited in scope and overlooks the much broader range of patents that would fall under either design patents, utility patents, process patents, or composition of matter patents.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "onetruecharlesworth",
                                    "body": "You’re proving my point for me, you literally just acknowledged that it’s easier to protect your IP by not filing than by filing it. if this process didn’t exist you wouldn’t have to publicly disclose every aspect of your idea making reverse engineering more expensive. You’re literally doxxing your own invention with no real way to enforce your patent. Chinas gonna violate those laws all day. They don’t care. You’re just Trying to sit on top of the IP and wring out as much profit from law abiding actors in the economy as possible. It’s protectionism which ultimately hurts everybody involved in the long run including the owner of the IP.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Echale3",
                                            "body": "In actuality, it's more difficult to protect it by not filing a patent.  Despite having to provide a road map to those skilled in the art, it's the claim structure that determines what's protected versus what's not protected.  The independent claims are generally very broadly worded and the dependent claims are generally more closely worded to coincide with what's specifically disclosed as \"the ideal\" version in the patent.  The independent claims can cover a lot of ground in the relative vicinity of the ideal version of the process or thing patented by virtue of being discussed as pertinent and useful for various aspects of the invention (but don't have to be specific to the ideal version) in various other sections, which cuts off others from creating a close derivative.  \n\nIf you don't file a patent, once the secret's out, it's out and there's nothing you can do to stop it.\n\nYeah, China is going to violate any patent it deems useful, even if you manage to get a patent on your invention there.  That said, where you choose to file your patent does give you protection in those areas.  You just have to choose wisely.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "onetruecharlesworth",
                                                    "body": " that doesn’t change anything. You’re still disclosing more than you’d have to than if you completely hid it. A partial map is still a map. It’s a moot point. even if the patent claims are broadly worded and cover a lot of ground, the fact remains that the patent application still provides a “road map” to those skilled in the art. a partial map is still a map. it can still be used to navigate and understand the underlying technology.\n\nMoreover, the fact that China may violate patents doesn’t necessarily justify the patent system. It just highlights the challenges of enforcing patents in certain jurisdictions. They needlessly add friction and generate artificial scarcity through legal arbitrage with no long term upside and aren’t even really enforceable.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SANcapITY",
            "body": "Stephan Kinsella - Against IP. Google it. It is free and only about 70 pages. Should be required reading for every libertarian.\n\nTL:DR; IP laws are not compatible with libertarian philosophy, and not only that, they actually hinder progress rather than promote it.\n\nProperty rights only exist to settle disputes over scarce and rivalrous goods. Information is not scarce or rivalrous.",
            "score": 2,
            "replies": [
                {
                    "author": "Echale3",
                    "body": "Kinsella is full of shit and doesn't understand human nature at all.  People invent because they need something that isn't being provided, and if they put a lot of time, effort, and money into the process, they expect to get compensated for it if they take it to market.  Abolishing IP protection puts the inventor at a disadvantage when it comes to marketing their product because they have development costs that need to be recouped, whereas somebody freeloading off the work of the inventor doesn't, so the freeloader can put the same product on the shelf at a lower cost than the inventor can.\n\nIf IP isn't protected, there'll be no incentive for innovation because nobody will want to take on the development costs just to have their product stolen by somebody who wanted to freeload off the work of others.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SANcapITY",
                            "body": "Wow, clearly you’re never read him. Cool story.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Echale3",
                                    "body": "I actually have, and some of what he says would initially make sense on the face of it but on closer inspection and consideration I find he chooses to ignore or overlook things that would effectively discount his assertions.  At the end, he merely poses his opinion, but I find his opinion uncompelling in terms of revising or undoing intellectual property laws as they exist now.\n\nTake for instance, his argument about the two burger joints and trademark IP.  His argument is that the actual harmed party in the transaction is only the buyer of the LachmannBurger disguised under the trade name RothbardBurger, when the buyer truly wanted a RothbardBurger instead of the LachmannBurger.  Yes, I do agree that the buyer of the burger was hoodwinked, and thus has a fraud perpetrated on him or her.  However, I do not agree that the owner of the RothbardBurger trademark has no actionable case against LachmannBurger for selling LachmannBurgers under the RothbardBurger name.  In this particular instance, Kinsella completely overlooks that there is a definite level of financial and possible level or reputational harm occurring to RothbardBurger by LachmannBurger's usurpation of the RothbardBurger trade name.  \n\nIf Kinsella overlooks something as obvious as that in order to make the argument that the owner of the IP in question wasn't damaged, then I discount his argument as specious.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Thanks! That makes intuitive sense.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SANcapITY",
                            "body": "I suggest you read the book, or just dig around in his website or his podcasts. He lays out how rights come about and what they mean with such clarity - underrated as a legal theorist since he's mostly known for his work on IP.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "The_Atomic_Comb",
            "body": "I'm not an expert on IP issues although I have read some stuff from a university press published book called Openness to Creative Destruction – recommended by the libertarian economist Donald Boudreaux – and it talked about IP. (And it was a great book that discusses innovation, regulation, and some other things.) I don't think links are allowed in this subreddit, so if you want details on what the book said about IP, see my comment history. Search \"intellectual property section of the book I just cited\" in my comments history, and the comment you'll find will have a link to a lengthy series of quotations from the book.\n\nAlso as an aside: if you're interested in learning more about libertarianism I would recommend you focus on material from libertarian economists and philosophers and not from lay libertarians here in this subreddit or other places. That's not to say laymen are useless at helping you learn about their ideology; after all I'm a non-academic layman myself. But let's just say the quality of a lot of laymen's arguments – including lay libertarians' arguments – tends to not be that great. (Which shouldn't surprise anyone who's read books like Democracy for Realists, Myth of the Rational Voter, or other books that document how uninformed most voters are – because of the incentives they face, for example.)\n\nNow, what is the case for IP? (By the way I am a libertarian.)\n\nThe basic idea behind it is that without IP, things would be worse overall – specifically, there would be less innovations made. Inventions and innovations suffer from a ***free-riding*** issue.\n\nLet's say I consider toiling long and hard to come up with a new type of car engine that's extremely gas-efficient; it uses significantly less gas to propel the car the same distance. What customer wouldn't want such an engine in their car to save on gas? It would make a lot of money. But I know the intellectual work to devise such an engine can't be easy, because otherwise someone else probably would've done so already.\n\nTherefore I'd presumably be putting forth a non-trivial amount of effort and time to devise my engine. I would have to deal with the headaches involved in designing such a contraption, as well as deal with the scoffs and lack of funding from those who are not believers in my invention. (There are stories of people who have innovated whose ideas were rejected by others. E.g., J. K. Rowling's Harry Potter was rejected by a bunch of publishers before it was finally accepted.) Let's say I do all that successfully – after all, sometimes ideas don't work out and it ends in failure! – and I finish my engine. I remember that I am living in a country that recently abolished IP laws, so I can't patent my invention. I therefore understand that right after my hard work is finished, someone else can copy my engine and legally sell it – and with higher profits than me, since they're unencumbered by the earlier costs I have incurred while developing the engine.\n\nI thus sit wondering to myself why I should go through so much work and effort, when so much of the benefits of that go to other people rather than me. I observe to myself: why not hope someone else invents it instead? In that case I could then sell the invention like I could before, but this time ***without*** having to go through all the hassle of inventing it. That sounds like the better deal to me, so I sit hoping I can sell someone else's engine. Everyone else thinks similarly to me since they're also in my situation, and the result is the car engine is either never invented or not invented as soon as it would've been had an IP system been in place.\n\nI then realize to myself that even if I the inventor cared not one bit about getting more money (and how many people are like that? How many people want money for themselves, or for their loved ones?) and was totally devoted to car engines, my new country's new lack of IP still discourages inventions. Inventions require money to be made. Money ***enables*** inventions to be made. I notice my invention won't bring as much profits to me without IP, meaning I would have less money, to make more inventions, than I otherwise would've had...",
            "score": 1,
            "replies": [
                {
                    "author": "Echale3",
                    "body": "Finally, somebody else who actually gets the why and wherefore of IP laws and human nature.  I hold multiple patents both in the US and overseas.  I didn't do all the work and time it took or spent the money I did to go from a novel idea to market-ready product out of some altruistic motive.  I did it because I want to make some money off of the ideas I come up with.  If I hadn't had the benefit of protective IP laws, I probably wouldn't have bothered to develop my ideas like I did.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "onetruecharlesworth",
                            "body": "If your idea needs legal arbitrage to give it value it’s a trash idea. People will naturally flock to the innovations that provide them with the most value. You didn’t go through that whole process of developing a product unless it addressed other market participants needs! An idea being profitable and benefiting both parties isn’t mutually exclusive in fact it’s the basis for free trade! You could have all the patents in the world but your idea isn’t worth shit unless other people see value in it. Nothing has intrinsic value, all value is decided subjectively at the margin. If people knew what Amazon would be today they would have held their stock but when it first came out in the 90s nobody really saw that much value in a digital book store. It’s the same here, you don’t just get to assume your innovation is right and has value other people do. You’ll make money no matter what if it’s a good idea. You bitch and moan about how I don’t “understand the nature of humans” but really it’s you who doesn’t understand. You’re just a greedy human it’s in your nature.\n\nIt’s like pirating music, are there gonna be people that steal your IP? yeah, but there’s gonna be plenty of other people that just buy and use it cause it’s way easier to do that than just steal it.\n\nIs Taylor swift still not disgustingly wealthy cause a couple million people or tens of millions of people decide to pirate her music? Do you see her flipping out and suing people in international court over it? Has she gone on a boycott and refused to make new albums and songs because of it? No, she’s just happy people are enjoying her art just like you should be about people using your product or service.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Echale3",
                                    "body": "*\"It’s like pirating music, are there gonna be people that steal your IP? yeah, but there’s gonna be plenty of other people that just buy and use it cause it’s way easier to do that than just steal it.\"*\n\nIf that's the case, why was Napster so popular?  Why is it that there are billions and billions of online visits to the various music piracy websites still in operation?  It's as easy and a hell of a lot cheaper to just steal it than it is to buy it legally.  I don't know how old you are, but you're overlooking a lot of history.  Napster's theft of the work of others was making a big dent in the livelihoods of a variety of popular musicians who relied on their talents to make a living, that's why it got shut down.\n\n*\"Is Taylor swift still not disgustingly wealthy cause a couple million people or tens of millions of people decide to pirate her music? \"*\n\nI think we're at the point where anybody reading through all this can see where you're coming from with the idea that IP laws should be taken down.  You've tipped your hand with the \"disgustingly wealthy\" comment.  She's wealthy, sure, but is wealth a disgusting thing, really?  Your arguments, and Kinsella's as well, are all about people who didn't do the work wanting to freeload off those that did and were successful at it.  You couch it as benefitting everybody because it increases competition, but really, the process we have increases competition on its own because every improvement already drives further improvement while also providing a means for those making improvements to get some level of return on their investment if their improvement is marketable and provides value to the end user.\n\n*\"You bitch and moan about how I don’t “understand the nature of humans” but really it’s you who doesn’t understand. You’re just a greedy human it’s in your nature.\"*\n\nI'd say that growing up on a university campus and also my years as a corrections officer prior to getting a STEM degree and going into R&D gave me a crash course in the breadth and depth of human nature.  I understand it very well, both at an animalistic level and at a high level.  You call me a greedy human, but who's really the greedy one here?  Is it the person who does the work and seeks a return for that work or the person who doesn't do the work and merely steals the efforts of others in order to enrich themself?  The laws we have were put into place to protect those that do the work from those that steal their work.  Your arguments throughout all this show you to be one of the people who would blithely steal the work of others, all the while claiming that you doing so is good for everybody including the person you stole from.  If you were to divorce yourself from your obvious dislike of people who are successful and look at your arguments from a purely objective standpoint, I think you'd see the inherent unfairness in the system you argue should be in place.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "onetruecharlesworth",
                                            "body": "lol dude I’m clearly a free market capitalist it’s pretty clear from my argument I hate government regulations and have zero problems either with people making money. Glad we are resorting to ad hominem attacks now though. \n\nYour Napster point is moot, The fact that people are still getting rich from their creative works, despite the existence of piracy, suggests that many people are willing to pay for the value they receive from those works.\n\nIt’s often easier and more convenient to be a legal consumer than a pirate. With the rise of streaming services and digital marketplaces, it’s become increasingly easy for people to access and purchase the music, movies, and other creative works they want.\n\nPiracy often requires a certain level of technical expertise and can be time-consuming and cumbersome. In contrast, legal consumption is often just a click away.\n\nFurthermore, many people are willing to pay for the value they receive from creative works because they want to support the creators and the industries that produce them. They may also be motivated by a sense of fairness and a desire to do the right thing.\n\nThe fact that people are still getting rich from their creative works, despite the existence of piracy, suggests that the incentives for creativity and innovation are still strong. It also suggests that the vast majority of people are willing to pay for the value they receive from creative works, and that piracy is not as big of a problem as some people make it out to be.\n\n\nLook I get it you’re clearly emotionally invested in your argument. It’s clear that I’m not going to convince you so we’ll have to agree to disagree. Your refusal to acknowledge my very valid points makes this an exercise in futility.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Echale3",
                                                    "body": "I'm just pointing out where your own words place you in the spectrum of humanity.  Based on what you've said it seems clear that you're fine with freeloading off the backs of other people's efforts, and that's objectively a form of theft.  You develop a widget, I see said widget, take said widget, and market your widget as mine and you lose out on revenue that should rightfully have come to you.  Did I steal your widget or not?  Looking at it another way, you work and make money.  You see a nice laptop, it does everything you want it to, and you purchase it.  I see your laptop and take it from you to use, resell, or whatever.  It matters not whether the property is real or intellectual, it's still somebody's work product and they have a right to it and to allow whoever they want to use it or not use it as the case may be.  \n\nThe fact that people are still making money off legal consumption doesn't change the fact that they are still facing loss of revenue due to theft.  Yes, the incentive for creativity is still there because they are still getting some revenue stream off their work, but they aren't getting all that's due because there are people stealing their work product from them.  I guess you're OK with that as long as the level of theft isn't too severe?\n\nYes, some people are basically honest and will do the right thing under the system we have set up now, but there are a hell of a lot of people that aren't so honest and will resort to theft when it suits them.\n\nBe a free capitalist if you want, I'm very much a capitalist as well, but I also see the inherent problems that exist for inventors such as myself if we're not afforded some level of legal protection from others who would steal from and capitalize on the level of investment we put into bringing an idea from concept to market-ready.  What you propose is more or less a free-for-all that I see as eventually stifling creativity to a significant degree by precluding a clear route to capitalize on their work for a specific period of time.  We could certainly have a discussion over the current 20-year limit, but that's for another day.  \n\nIf something is market-worthy and provides utility and value, it won't be long after it comes out that people will be looking at ways to derivatize it and tap into the market for themselves.  Without allowing somebody time to recoup their investment in time, effort, and money, people that lack internal motivation to create will basically just throw up their hands and say \"Fuck it\" because they don't see a financial upside to making the investment in their idea.\n\nI do agree that we'll never convince each other, and that's fine.  If we all had the same idea, we'd never get anywhere and I'd be bored as hell because I wouldn't have anybody to debate.  It takes people on both sides of the intellectual fence to create a system that generates the most value for the most people.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "onetruecharlesworth",
                                                            "body": "I understand that you’re trying to argue that the patent system is necessary to incentivize innovation, but I think this point has already been addressed. You’re posing a hypothetical scenario where people wouldn’t be incentivized to innovate without the regulatory protection of patents, but I’ve already argued that the market will naturally incentivize innovation and creativity.\n\nPeople will flock to innovations that provide them with the most value, and creators will be motivated to innovate in order to meet the demands of the market. This is a more effective and efficient way to promote innovation, rather than relying on a system of patents that can stifle creativity and progress.\n\nRemember, IP is designed to protect innovation at the margin. Your example of creating a widget is an intellectually dishonest exercise because creating a widget during the Victorian era was a lot more capital intensive than creating a widget now. I could do it in my garage. Victorian laborer couldn’t produce widget in mass. In your example the innovation isn’t the widget its the mass production of them if there wasn’t a demand for the widgets, there’d be no reason to scale them so aggressively. So clearly the widget must have already existed for a while and be in wide use for mass production to be in your words “worth it” So the original creator made a shit load of money getting the market saturated to such a point before “stealing” it would be “worth it”. Really the orginal creator failed to continue to innovate his process and was left behind but he made a pretty penny in the mean time. Go ahead try and create a GLP-1 drug in mass out of your garage, that’s basically the equivalency you’re making.\n\nI’d like to reiterate that my position is advocating for a ‘free-for-all’ but no to steal others’ work. Will it happen? Of course, but it happens now even with all these protections. As someone so well versed in human nature I’m shocked you don’t understand the concept that people will break the law regardless of the rules. You’re intentionally misrepresenting my argument to attack me personally and its intellectually dishonest. Rather, it’s about creating a system that promotes innovation, creativity, and progress, what do you think humanity has been doing for the last 2000 years? How did people create capital before IP rights? If it was true that you were only be motivated to innovate when there are intellectual property protections then we’d Still be stuck in the middle ages. \n\nIf someone decides that an idea isn’t worth pursuing because they can’t recoup their investment, that’s their decision to make. But to say that nobody would innovate without intellectual property protection is absurd, that literally what the role of the entrepreneur is. If it’s “ Worth it” Or not, is up to the individual. Pursuing a specific idea in America might not be as profitable as someone doing the same thing in Pakistan. You’re acting like only one person could possibly ever come up with one idea multiple people can come up with the same idea.\n\nEntrepreneurs have been innovating and taking risks for centuries, long before the existence of intellectual property protection. It’s not the promise of a patent or copyright that drives them to innovate, but rather the potential to create value and solve problems in the market. That’s why capitalism works its a mutually beneficial and willfully exchange of value (real) for value (monetary).\n\nLet’s focus on finding a solution that promotes innovation and creativity, rather than relying on a system that can hold us back.  You keep moving the goal posts as your argument falls apart just yield.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Echale3",
                                                                    "body": "In looking at worldwide innovation metrics, it seems that countries with similar IP protections to those found in the US lead the world in innovation.  I think that pretty well indicates that the system we currently have isn't stifling innovation at all.\n\nIf you come at it from the idea that ideas and inventions aren't real property and that the very idea of you claiming an idea and invention as yours tramples somebody else's right to use it on their property and with their raw materials, then of course you'll think that the current system is a problem.  Here we see the base difference -- I see my ideas and inventions as mine, your ideas and inventions as yours, etc., and that we both have to right to allow others to use that property or to not use it.  That, however, as far as our system is set up, only prevents others from using it in predefined geographic locations.\n\nIf I invent something and somebody in Pakistan invents the same thing, and I file for a patent in the US, my invention is protected only in the US, and the guy in Pakistan is free to do whatever he wants with his invention in Pakistan and anywhere else he can market it, just not in the US.  The same can be said for my invention -- it's protected only in the US, but nowhere else, so anybody outside the US can make use of it, market it, etc.    \n\nI'm not moving the goal posts, they are where they are.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "onetruecharlesworth",
                                                                            "body": "I understand that you’re trying to argue that the current IP system is necessary for innovation, but I think your argument is based on flawed assumptions. Correlation does not imply causation, and there are many other factors that could be contributing to the innovation metrics you mentioned. You know like literacy rates as a basic starting point. Domestic security, am I able to walk to school to the mall to my place of business to conduct business? Ect. Furthermore, the current IP system is not the only possible system that can promote innovation, and there are many alternative systems that could be more effective.\n\nI also disagree with your assumption that ideas and inventions are a form of property that can be owned and protected. Ideas and inventions are not scarce resources that can be owned, and the concept of intellectual property is a social construct that can be changed or abolished. I think your willingness to suddenly allow this hypothetically person in Pakistan to use and profit from your Idea show that idea clearly aren’t property. You would never abide someone moving into your house and renting out one of your bedrooms when their name isn’t on the title of the mortgage. That’s the difference between property and ideas. You gonna shoot someone or arrest them for trespassing on your idea by allowing the thought to pass through their mind?\n\nFinally, I think you’re ignoring the fact that the current IP system can still stifle innovation by creating barriers to entry, limiting access to knowledge and technology, and favoring large corporations over small inventors and entrepreneurs.\n\nI’m also glad you refused to acknowledge my point about disclosure of the invention and the obvious hole in the logic of protecting something by putting it on full display for anyone to see. You also ignored my point about the nature of entrepreneurship and innovation in general and historical examples clearly showing innovation happens without intellectual property protections.\n\nI also find a hilarious that you’re somehow OK with someone stealing your idea in Pakistan because they live in Pakistan but in the US you want ownership over it? If you’re your idea here it’s your idea there. It’s not like it materially different just cause it’s in a different geographical location. It’s your idea, it’s your patent! You should own everything in Pakistan too shouldn’t you? You should sue right now! He’s using your property!\n\nWhat are you talking about? you concede that hiding all aspects of the patent would be better than disclosing it. you conceded that the arbitrary 20 year time limit could be changed and now you’re somehow OK with someone in Pakistan stealing your invention cause he filed in Pakistan? So you’d be ok With China one for one ripping off an iPhone if they just submitted their own patent in their own domestic territory? somehow your argument changes with every post. We’re clearly reaching the level of absurdity where you can see the IP laws do nothing but create friction. Look I get it you feel threatened that my point of view even exists cause it threatens your ability to rent seek off your IP but you can’t live off past glories forever or I guess in your case 2 decades but I need you to accept the fundamental flaws in your argument as your try to go back and paper over points with more nuanced arguments when they’re just wrong from first principles. You can’t just keep coming back with new arguments cause your old points were losers and act like you’re in the right. The cognitive dissonance is unreal. Do you even know what your own argument is anymore? I’d like you to clearly reiterate your stance.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "The_Atomic_Comb",
                    "body": "By the way that last point about money enabling inventions is not hypothetical; here's a excerpt from the book that I find relevant here:\n\n>UCLA economic historian Ken Sokoloff, in papers with economic historians Zorina Khan and Naomi Lamoreaux, presented evidence that in the United States, patents provided funding that helped enable more invention, especially by ordinary citizens.74 In an elaboration of some of this work, Khan has shown that the early patent system provided an important source of income for many inventors75 (which plausibly could have served either as an incentive to invent, or as an enabler by providing funding for further inventions). She argues that US citizens had easier access to patents than did British citizens, and that this helps explain why US economic growth in the period was greater than Britain’s.76\n\nHopefully I helped show some of the issues that would arise if IP were abolished. Some lay libertarians seem to think IP is horrible or illogical when it's not. One comment you got here says: \"It’s a way to artificially increase the profits margins of the producer by preventing competition from closing the margin.\" I've come across this \"artificial barrier to entry\" argument before. I'll quote a reply I made from a past comment to someone using this argument:\n\n>Is a law against theft a barrier to entry or an \"artificial protection\" (which I'm assuming you mean a barrier to entry or something like that) for that company? The fact I can't steal your car means I can't as easily enter the food delivery industry, since I'd have to buy a car or buy your permission \\[to use your car\\] instead... just like how the fact I can't copy a movie and sell it makes it more difficult for me to enter the movie industry, since I'd have to buy the stuff and services to make a movie or buy the movie owner's permission instead.\n\n>Yes, patents do reduce the ability of other people to compete with the patent owner... but as we can see from the theft example, in a sense all property is like that. That's because property rights are basically the ability to \\[legally\\] ***exclude*** people from using things – property owners can use governmental force to punish people for using property ***without their permission***.\n\nOthers seem to think there's something inherently contradictory or wrong about IP. I hope my car engine story and my excerpted reply above show you why that's not true. As much as people might insist otherwise, there's no divine law or metaphysical fact or something that says that property rights can't \"really\" apply to IP. ***All that property rights ultimately are*** is basically the legally recognized ability to exclude people from using ***the thing considered as property*** – whether it be a patented invention, or your house – without your permission, and that governmental or some other force can be used to stop people from using it and/or punish them for using it without permission. That doesn't change even if people try to define property rights in such a way that they can't apply to IP  – e.g., one comment you got here says \"Property rights only exist to settle disputes over scarce and rivalrous goods. Information is not scarce or rivalrous.\" (\"Information\" is not scarce? Is he suggesting we have as many ***inventions*** – which is what IP is about – as we want? Scarcity in economics means that what we want adds up to more than what exists to satisfy those wants. If inventions aren't scarce then that means we have as many inventions as we want; every possible invention has been invented and every want that an invention could satisfy has been satisfied. I hope I don't have to explain why this is not true.) Governmental force can be used to stop people from using your house without your permission, ***as well as*** your patented invention without your permission. Saying property rights don't apply to IP doesn't change that fact. The issue is whether property rights in IP should be enforced or not.\n\nHow do libertarians deal with IP? There's one school (which is wrong) followed by Stephan Kinsella and others that would see it abolished, and another that would allow at least some IP. Sadly I don't know much about IP so I can't answer your questions about how IP would evolve and work in detail. Also I'm not an ancap so I'm not sure how IP would work in an anarcho-capitalist world (which you may or may not have been asking about).",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "IP is really a very broad concept and covers many different phenomena. It is also a much more controversial concept than conventional property. I was mainly interested in how it can fit into a libertarian model with low government regulation and intervention.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NorcalA70",
                    "body": "This. I’ve been accused of not being a good libertarian because of supporting IP lol. In your example the question I posed was that if you had the blueprints and specs for your engine stored on a removable hard drive in your lab and someone broke in and stole the hard drive, what did they steal? Would their theft be limited to the drive or do the contents of the drive have value as well?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "The_Atomic_Comb",
                            "body": ">if you had the blueprints and specs for your engine stored on a removable hard drive in your lab and someone broke in and stole the hard drive, what did they steal? Would their theft be limited to the drove or do the contents of the drive have value as well?\n\nThe thief tried to steal ***the car engine blueprints*** and while I'm not an expert on legal issues, this fact surely means the theft isn't limited to just the hard drive. Let me give an analogy: if the car engine designs were on paper, is the theft limited to the value of the paper (which would mean the \"value\" of what the thief stole is trivial)? Do we really want a legal system in which people can try to steal something worth possibly millions of dollars and the only charge they face if the heist fails is petty theft? In such a legal system why not try to steal constantly from inventors?\n\nHow would the value of the blueprints be determined in court? I'm not really sure... but the jail time and/or fines for the thief have to be higher than the penalties for stealing only hard drives or only paper.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "natermer",
            "body": "\"Intellectual Property\" is a misnomer.  It is a lawyer's trick to make  seem like there is some sort of cohesive theory or idea or concept behind disparate and unrelated laws. \n\nTrademarks, patents, and copyrights have nothing to do with each other. These are all examples of government granted monopolies that have different purposes, different goals, and different conditions. \n\nPatents and copyrights are actually violations of private property.  And is incompatible with Liberty for the most part.\n\nThe important and valuable parts of these things can be replicated with contract law.  Stuff like \"by agreeing to stream this video you are contractually obligated to not share with such and such penalty if you do\".   Or \"If you join this company you can't tell anybody about how we make things or we will sue you\".  \n\nThe key difference here is that contracts are voluntary.  You can choose to agree to them or not.  Patents and copyrights restrictions are inflicted on you no matter what.\n\nPatents are the worst of the whole bunch because of the arbitrariness of all of it. \n\nA illustration of how this is NOT \"property\" is simple to demonstrate.\n\nIf somebody files and is awarded a patent they are given a monopoly on it.  Say it is a new type of medicine.  If they never actually go out and make that medicine they still have the monopoly. \n\nWhich means that if you discover the same medicine independently and never heard of them, never seen their medicine, never seen their patent, and you (completely independently) produce and sell the same drug... you have violated the law. \n\nIn fact the patent law expects this the patents to be violated by accident.  If you actually violate patent on purpose then that is treble damages. \n\nThe reality is that there is no property at all when it comes to patents, intellectual or otherwise.  It doesn't look like private property, it doesn't work like private property, and it not only actually completely and unrelated to any sort of private property law that exists it is a violation of it. \n\nAlso patents don't actually work.\n\nThe idea of patents is that by awarding these monopolies you are encouraging people to not only innovate but to publish their innovations publicly.  That is to get a patent you have to tell everybody how it works and publish it with the government. \n\nThe goal here is to foster innovation and promote economic development.\n\nBut it doesn't work. Patents actually hurt innovation and hurt economic development.  They have never been demonstrated to work and studies show net losses because of it.  It is just a bad theory. \n\nI am picking on patents because patents are the worst and most obviously bad example. \n\nCopyright is still bad.  But it is harder to demonstrate.\n\n----------------------\n\nA special body of law for trademarks is unnecessary because it is covered by Tort law. \n\nIf I sell a manufacture a good with another person's trademark on it and I don't disclose this to the customer I am committing fraud.  It is the customer that is damaged, not the person who created the trademark. So they are the ones that should sue. \n\n-------------------------------\n\n\nIncidentally things like clothing and fonts are not copyright-able. \n\nMeaning I can't create a new type of jacket and then sue somebody else copying it and selling their own versions. \n\nYet fashion is still a thing. \n\nThey will incorporate logos into clothing as a way to leverage trademark law... but that is mostly for the poors to show off that they can spend money on higher end stuff.    The real high end clothing doesn't have logos on it.",
            "score": 1,
            "replies": []
        }
    ]
}