{
    "title": "Airports and the NAP",
    "author": "ScrotumNipples",
    "subreddit": "Libertarian",
    "rank": 448,
    "score": 5,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ikb0mc/airports_and_the_nap/",
    "id": "1ikb0mc",
    "selftext": "I travel a lot for work, which means I spend a fair amount of time in airports. I'd like to get the community's opinion on people watching reels and having video calls in public without headphones.\n\nIn my opinion it's just outright rude to subject me and everyone else to whatever it is you're entertained by. Part of me wants to make this blatent disregard for everyone within earshot a capitol offense. However, I like to look at things in a logical manner. This is a public space and they are entitled to enjoy it as much as I am.\n\nThoughts?",
    "comments": [
        {
            "author": "Montananarchist",
            "body": "You should engage in exaggerated interpretive dance in front of them to whatever they're forcing on you. ",
            "score": 14,
            "replies": [
                {
                    "author": "ScrotumNipples",
                    "body": "Hahaha I wish my social inhibitions would let me do that. Maybe I'll try butting into the next public facetime call I see though.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Psycosteve10mm",
            "body": "I just wear headphones and let the idiots be idiots. This tends to be a much better experience then not using them.",
            "score": 9,
            "replies": []
        },
        {
            "author": "harbingerpg",
            "body": "I often fantasize about smacking the absolute shit outta those people.  They might not deserve to die.     Stepping in another traveler’s “therapy dog” shit would be justice.",
            "score": 7,
            "replies": []
        },
        {
            "author": "vvfella",
            "body": "There’s a difference between something being legal and something being culturally acceptable. I’m against laws limiting these types of things in public spaces (especially because no doubt they’d be selectively enforced) but I’m in favor of societally shaming people for doing it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Kilted-Brewer",
            "body": "I could be wrong, but aren’t most formulations of the NAP intended for private property?  If so, do we need to determine where your private ’property’ begins within a public space?  So, would that line be drawn where his sound waves hit your body/ears?  Would that line change based upon the distance between you… or should it be static, I.e. within 5 feet you’ll overhear his phone even at a reasonable volume, but past that it won’t?\n\nI always liked David Friedman’s treatment of the NAP as relative… if I’m talking on my phone in a normal voice nearby, the amount of sound reaching you probably wouldn’t be considered a violation of the NAP by most of us.  But if I’m blasting reels, music, videos, etc.  it probably is (as well as just flat out rude).\n\nI think public shaming is probably the way to go.  Or if you aren’t worried about physical escalation, maybe sit down next to them and start blasting the Tibetan throat music alternated with your favorite sitar instrumentals.  Maybe some bagpipes as well.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RobertEHotep",
            "body": "A pair of earbuds costs under $10. If you can afford a phone, you can afford a pair of headphones. It's completely anti-social to force what you're listening to onto the people surrounding you. When I see people doing this -- or, God forbid, walking around with a Bluetooth speaker -- I get enraged.",
            "score": 3,
            "replies": [
                {
                    "author": "RobertEHotep",
                    "body": "But the bigger problem with airports is the goddamn TSA and its security theater.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ihiwszkpseb",
            "body": "You can make an argument similar to the one for limiting immigration. Just because it’s a public space doesn’t mean everyone in the world has equal access to it or can do whatever they want there. For example, a homeless guy doesn’t have the right to do homeless guy stuff in a public school bathroom or go to a public park with kids around and do heroin or jerk off. Just because it’s a public space doesn’t mean there can’t be rules. Unfortunately the space is owned by the government so there’s no a priori way to determine what the proper rules should be, similar to how, given that public schools exist, there’s no “objective” way to determine what the public school curriculum should be.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Swimming-Formal-5541",
            "body": "just wear headphones man this doesnt have to be an NAP thing",
            "score": 1,
            "replies": [
                {
                    "author": "Psycosteve10mm",
                    "body": "There is a big difference between no and non. No aggression for any reason vs we are going to try and, not be aggressive with each other. In a libertarian society at what point is being inconvenienced grounds for smacking the shit out of somebody? Is asking someone not to be so annoying considered aggression?   Or is human decency in public, part of the consent you give in being in a civil society?  Where does your right to be left alone clash with a person's right to be obnoxious?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Designer_Piglets",
            "body": "I think the NAP should stay in ancap circles. It seems like a fantasy idea for a fantasy society that will never come close to existing. Capitalism requires some sort of state, there's never been a counter example. I've read like a hundred hours on the principle, I understand it pretty well, and I get the philosophy behind it. It makes sense in a book. But I don't see much use for it from a pragmatic standpoint. Not to mention how many hypothetical scenarios there are where the principle completely disintegrates. For example, someone buys up all the property 360 degrees around your house, and if you follow the NAP, you starve to death if your neighbor is an asshole.\n\nIn situations where it actually can be applied in real life, you can get the exact same solution just by following the most basic moral compass.",
            "score": -2,
            "replies": [
                {
                    "author": "HODL_monk",
                    "body": "'Do the right thing' is not going to work with the vanillas as a framework for law enforcement, when there are about 25 % of the population that either won't do the right thing, or their idea of the right thing is insane, like looking at them 'funny' will be a full NAP violation, and can only be remedied by a savage beating, and before you say that is ridiculous, kids do stuff like this all the time. We need legal rules, for the intellectually deficient among us, otherwise the rest of us will have to tolerate a vast amount of BS, of all different types.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}