{
    "title": "It’s (D)ifferent",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 413,
    "score": 2109,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 169,
    "url": "https://i.redd.it/t5a7lx8cqyhe1.png",
    "id": "1ikv6so",
    "selftext": "",
    "comments": [
        {
            "author": "No_Stinking_Badges85",
            "body": "At least 92% of federal employees received at ieast 1 dose of the vaccine. An additional 4.5% sought exemptions for various reasons, physiological reasons being cited the most. The remaining 3.5% that refused remains to be an indeterminant amount. The end point for these individuals is hard to determine, many may have been terminated or faced disciplinary actions. Additionally, many federal courts actually sided with federal employees who were terminated for vaccine refusal which they did citing religious grounds when their cases were brought to court.",
            "score": 92,
            "replies": [
                {
                    "author": "lost_in_the_system",
                    "body": "If you worked for the DoD (Civs included) you got to be part of the first rounds of public testing. It was a wild time. Navy got Moderna and I believe  Army got Pfizer.\n\nLined us all up and had the Corp men walk the line and poke everyone.\n\nThose that refused (civilians) had to go do daily health check ins. All are still working other than those that left voluntarily.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "LigerSanta",
                            "body": "To add on to what you said: Contractors working for the DoD were fired due to Biden’s mandate. It depended on the company and when contracts were expiring, but people were fired for not being vaccinated. Civilian employees were also under real threat of being fired and the reason you didn’t see more about it was because the judicial branch put a stop to the vaccine mandate. Checks and balances work, but they do take time. Hopefully, they still work. ",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "aknockingmormon",
                            "body": "I remember getting on a command conference call with our CO, and she made it clear that \"we are expecting that no religious exemptions will be granted, and any sailor without a religious exemption or proof of vaccination by the deadline will be eligible for court marshall and, at a minimum, and other than honorable discharge. So you might as well just get vaccinated.\"\n\nThe Navy made a strong effort to deny any and all religious exemptions. They also kept their members on covid restrictions longer than any other organization, locking them down to their ships and denying anyone any quality of life. People were denied the ability to go home to their families. Dual mil parents were ordered to stay on the ship for extended periods, leaving them no options in regards to childcare. Base facilities were restricted or outright shut down, to include medical and dental facilities. The medical facility I was required to use shut down all non-emergency dental services for nearly 2 years. Medical was by appointment only, and appointments were extremely limited due to reduced manning. \n\nThen they wonder why recruitment rates took a nosedive.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "inyuez",
                                    "body": "If your religious beliefs prevented you from getting vaccines how would you have even gotten into the military? They give you a bunch of different vaccines on your first day in boot camp.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "aknockingmormon",
                                            "body": "Oh, I forgot, you gotta stick with the religion you're born with. Your beliefs aren't allowed to evolve or change over time. You also aren't allowed to be upset that you're being forced to take a wildly under-tested vaccine that uses a brand-spanking new MRNA technology, despite the fact that you're way outside the risk zone for complications from infections, and despite the fact that the vaccine does not stop, or even hinder, transmission or infection. \n\nComparing the covid vaccine to the vaccines that have been used for generations is a wild ass way to minimize the people's desire for bodily autonomy.\n\nThreatening someone with actual criminal charges for not wanting to get an experimental vaccine is pure evil. Threatening to destroy someone's future despite how honorable their service was because they don't want to comply with a medical mandate is evil. It doesn't matter if they are in the military. It's gross that you think so.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "lost_in_the_system",
                                                    "body": "That the thing the military wast the test! It was cleared for old folk then the NIH and USDA realized they had access to a super convenient cohort of individuals ages 18 to 60 in reasonably good health. It was baked in from the beginning lol",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "aknockingmormon",
                                                            "body": "\"Hey guys, we have this vaccine that uses a technology never used before. Information regarding its formulation, clinical data, or potential side effects is proprietary despite being developed with taxpayer dollars. You're required to take it as soon as it receives FDA authorization, which is happening on an expedited timeline prior to any long term research being conducted. This is to protect the people around you, even though the vaccine doesn't keep you from getting sick or spreading the virus (but we aren't gonna release that information until 6 months after the deadline).\"\n\nI hate this \"you joined the military so you don't get rights\" argument the left spews to justify the use of military personnel as a testing group for the vaccine.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LostInMyADD",
                                    "body": "Same with the AF. They literally said, \"there will be no religious exemptions, or any exemptions for that matter.\" Plain and simple. They also then said you would be discharged if you didn't get it",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "aknockingmormon",
                                            "body": "Yea, our CO straight up threatened court Marshal.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "LostInMyADD",
                                                    "body": "Damn, thats nuts.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "No_Stinking_Badges85",
                            "body": "I forgot how many shots i got during check in at parris island. Long before covid. Then more for deployment. Then regular flu shots. Yep they shot me up good in 5 years. If i sign up for a job thats going to send me to filthy conditions overseas, give me the shots. If you can't follow fuckin orders in the military, you should face consequences. \n\nCivilians excluded from this sentiment though, of course.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "LostInMyADD",
                            "body": "100% this. Its bullshit... kinda crazy how now I get chest pains now...actually have a stress test, and echocardiogram tomorrow...then wear a heart monitor for 3 days. I have documented this started within the first month of the first shot they forced me to get....and the second shot didn't help....but when they say I will lose my job (dos civilian side) AND be dishonorable discharged (military side) unless I do it... what choice did I have?...",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RenegadEvoX",
            "body": "I swear there’s so many MAGAs cosplaying as Libertarians here",
            "score": 186,
            "replies": [
                {
                    "author": "Toothbrush042",
                    "body": "They aren’t even trying to hide it anymore",
                    "score": 57,
                    "replies": []
                },
                {
                    "author": "ThrowitB8",
                    "body": "Ngl watching this sub downgrade over the last many years has been interesting.",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Immediate_Net_8304",
                    "body": "They still call themselves Libertarians because they know being MAGA is morally terrible",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "guhman123",
                    "body": "ive noticed that the comments are actual libertarian takes while the post is MAGA and still gets upvoted like crazy. This is the only explanation.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Opening-Wasabi-9018",
                            "body": "The post isn't Maga at all. Libertarians rejected the vaccine and the lockdowns lmao",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ehronatha",
                    "body": "It's possible to be both MAGA and Libertarian.  \n\nHowever, it's not possible to be both Libertarian and a pro-institutional liberal, so I would say that it's you all who are cosplaying.",
                    "score": -25,
                    "replies": [
                        {
                            "author": "Ephelus",
                            "body": "No, it’s not. Libertarianism doesn’t accept crony capitalism. MAGA is literally that. There’s some overlap in ideals (ostensible reduction of government, etc) at least on the surface. But when you take a look at MAGA ideals (Project 2025), it’s horrendous government overreach.\nIf you’re MAGA and a Libertarian, you’re lying to yourself.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "trezzanator",
                                    "body": "What's funny is that as this administration continues to show its true face on gov't overreach time and time again, the MAGA brain rots still pose as backing \"small government\".\n\nThis sub has become a fucking joke",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RenegadEvoX",
                            "body": "Well you just exposed yourself with that one.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "Toothbrush042",
                            "body": "Definitions don’t care about your feelings little bro",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jeydon",
            "body": "Congress passes laws that say how much money should be spent and on what. Getting mad because federal employees are obeying the law and doing their jobs is foolish. If you think it's wasteful spending, advocate for Congress to change the budget.",
            "score": 271,
            "replies": [
                {
                    "author": "Push_Dose",
                    "body": "I’m not mad at them for doing their job. It’s just that their job shouldn’t exist in the first place.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "One_Form7910",
                            "body": "Idk I personally want someone’s job to allocate disability grants to states",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "2stupid",
                                    "body": "I personally want someone’s job to allocate disability grants to states that are part of the United States instead of foreign states.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "masterwad",
                            "body": "Republicans control both chambers of Congress in 2025 (just like in 2017), they can pass any laws they want to shrink the government, but they aren’t doing it lawfully, they’re blindly following the lawless convicted felon they nominated 3x in a row, because Trump was so popular with stupid rednecks that they decided idiot Trump was “too big to fail.”\n\nIf George Soros was getting tens of billions in government contracts, and was hacking into the US Treasury, your hair would be on fire because of the conflicts of interest of a foreign billionaire.\n\nNobody here can coherently rationalize away Elon Musk’s conflicts of interest. What he’s doing is illegal.\n\n[Trump ‘does not have the authority to abolish’ USAID: Congressional Research Service](https://thehill.com/homenews/administration/5125050-trump-does-not-have-the-authority-to-abolish-usaid-congressional-research-service/amp/)",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Push_Dose",
                                    "body": "I don’t know what you’re arguing with me about. This is a libertarian sub. I’m not conservative because I want smaller government I’m a libertarian voter because I want smaller government. I don’t like what the republicans are doing just as much as I don’t like what was done the last four years.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Short-Exercise-8374",
                                            "body": "Was it great 5 years ago?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Push_Dose",
                                                    "body": "The government has been in a sharp decline since post WW2.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lickem_Clean",
                            "body": "I’m kinda mad at them for doing their job.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Joaaayknows",
                            "body": "Great copy paste of the 14 year old libertarian meme account on instagram where you saw that line. \n\nI’m sure your job is not nearly as wasteful as *checks notes* humanitarian aid",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "Push_Dose",
                                    "body": "I’m a flight paramedic. Most people would consider that important especially after my career as a firefighter paramedic and later a critical care paramedic before moving to flight. And that wasn’t a stolen line I believe the federal government should be so small we don’t notice its activities in our day to day life.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Joaaayknows",
                                            "body": "Fair point on the current position then, guess I picked on the wrong person. \n\nPoint still stands. Unless you are a flight paramedic in another country there is no chance you notice foreign aid in your “day to day life.” Only on the news for stories feeding you how humanitarian aid is actually a bad thing as .01% of our budget.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "Push_Dose",
                                                    "body": "Yes foreign aid is a small part of the budget but balloons larger if you include Ukraine and Israel aid packages. I understand what you’re saying people wouldn’t notice 130 bucks a year in taxes to pay for that aid but it’s all the things on top of that that end up with us spending thousands of dollars a year in federal taxes for programs a lot of libertarians don’t think should exist.\n\nEdit: and just in case if you think I’m someone who wants to cut that federal spending but not other huge items like military spending I also think that should be cut significantly as well.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Asangkt358",
                    "body": "Show me the law that Congress passed that says we have to give \"aide\" to the NY Times, Politico, the BBC, Bill Kristol, or any of the other bullshit that DOGE has been bringing to light.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "wormgenius",
                            "body": "Hey illiterate moron, I have a bridge to sell you \n\nhttps://www.military.com/daily-news/2025/02/07/trump-promotes-conspiracy-theory-about-federal-governments-media-subscriptions.html",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "2stupid",
                                    "body": "Well, the byline on that one ... The AP is on the payroll themselves. \nI would understand if Politico wanted to give the government a special subscription for $10,000 a year, but 10k per person that accesses it per year, that's not a subscription - that's a kickback. \n\nAssociated Press | By David Bauder\nPublished February 07, 2025 at 9:47am ET\n\n\n------------------------\nHow about the byline on this one -\nAssociated Press \nBY  MELISSA GOLDIN\nUpdated 1:39 PM PST, February 7, 2025\n\n\"The Associated Press was among the media outlets said to receive USAID funding. Although the news wire has been paid $37.5 million by other government agencies since 2008, none of that came from USAID, according to a federal government website that tracks its spending.\" \n\n-----------------------------------\n\nWould you like to look at my bridge ? I'll offer it at a very special price ....",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Asangkt358",
                                    "body": "Oh look, the propaganda source claims it isn't propaganda!  How convincing!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "2stupid",
                            "body": "I just searched google for that, but the results are not clear - \"It looks like there aren't many great matches for your search\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lvl69blackmage",
                    "body": "Not the point of the meme at all. It’s saying people weren’t upset when people got fired for not taking the vaccine, but now that they are fired/losing jobs because of spending cuts people are up in arms.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "quelquechose",
                            "body": "Yeah, one scenario is logical and justified. One is not. It's rational to complain about idiotic injustice.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Verum14",
                                    "body": "The best part is both sides of this conversation will agree with you, lol",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "djdadi",
                            "body": "it literally is different though.  one is individual choices and actions in response to a pandemic, the other one is just getting rid of everyone no matter what they did or didn't do.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "karmabrolice",
                                    "body": "The better one is non discriminatory",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "No such thing as being discriminated against for making a foolish choice.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "HauntingAcadia2731",
                                                    "body": "A “foolish” choice is subjective. \n\nBalancing money in a ledger is objective.\n\nNice try though.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Euronomus",
                                                            "body": "Subjective or not - it's not discrimination to hold someone accountable for their actions.",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cyrusthemarginal",
                    "body": "Or you can vote for the candidate who is saying they will reform things and audit agencies, and appoint someone to do it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Euronomus",
                            "body": "This reply shows why we need stronger civics education in America.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jankdangus",
                    "body": "Yeah, but that isn’t what they are actually mad about. They are mad about the idea that we are cutting spending at all.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Euronomus",
                            "body": "No, we're mad because what they're doing is blatantly unconstitutional and unlawful.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "When in the last 50 years has an administration blatantly ignored multiple court orders made on constitutional grounds? - pretty sure it's been since segregation - the vast majority of Americans, on whatever side, aren't ok with that. For christ sakes the man is trying to end birthright citizenship with an executive order.... Trying to equate that with some congressmen trying to get waiting periods to buy a gun or the occasional misuse of the commerce clause, is tiresome and clownish. It's funny how easily some people abandon things they call principles when it gets them what they want.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Euronomus",
                                                            "body": "Not sure where you got that? I give next to zero fucks about immigration one way or the other, but pretending it's not next level unconstitutional to try and end birthright citizenship through an executive order is absurd.  And that is the crux of my point - no doubt there have been abuses on both sides, not arguing that at all. However pretending that Trump's current actions aren't on a whole different level than any president before him, even Jackson, is either disengenuous or ignorant.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Euronomus",
                                                                            "body": "Can't logic someone out of something they didn't logic themselves into I guess. Pretending that we aren't in the biggest constitutional crisis in the countries history is clownshoes level ridiculous.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[deleted]",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Euronomus",
                                                                                            "body": "Far from the most incorrect thing you've said here - but you are technically wrong. A \"constitutional crisis\" is when someone is leveraging the rules of the constitution against itself. The civil war was just a group of people deciding they didn't want to play by the rules and trying to secede. It certainly stressed the constitutional system, but it doesn't meet the textbook definition of \"constitutional crisis\"",
                                                                                            "score": 6,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "cyrusthemarginal",
                                    "body": "What law and section of the constitution says federal agencies can't be audited?",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "Shutting down statutory agencies created(or made statutory) by congress, and/or discontinuing payments mandated by congress, is a gross violation of the separation of powers as you'll find in the very first paragraph of the very first article of the constitution - only congress has the power to make or change law, it's the duty of the president to enforce the laws congress passes. Furthermore the power of the purse is placed solely by congress - as you'll find in Article I, Section 9, Clause 7. Congress has sole control over the money of the government - the president has no say that congress doesn't explicitly give him. Even the money for office supplies at the white house has to be allocated to him by congess.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "cyrusthemarginal",
                                                    "body": "So nothing in there about auditting, thank you.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HiDannik",
            "body": "Why is this subreddit called libertarian if y'all are just gonna cheer on Musk acting like a King?",
            "score": 150,
            "replies": [
                {
                    "author": "mrbig99",
                    "body": "This subreddit is one user posting memes all day.",
                    "score": 72,
                    "replies": []
                },
                {
                    "author": "Push_Dose",
                    "body": "Isn’t dissolving the federal government one of the primary principles of Libertarianism?",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Euronomus",
                            "body": "The constitution is supposed to matter to libertarians.",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "Push_Dose",
                                    "body": "The constitution was created to limit the federal government. It wasn’t until the supremacy clause was later added did the federal government start hoarding power and at this point it’s completely out of hand.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "Wtf are you talking about? The supremacy clause is part of the original constitution as written by the founders....",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "Push_Dose",
                                                    "body": "It is not it was added nearly 2 decades later and was supported by Madison and others who worked on the Federalist papers. But it is not true that it was apart of the original constitution. \n\nThe very spirit of the original constitution was made for the federal government to be small and only cover things like interstate commerce and national defense. Everything else was supposed to be left to the states. The federal government wasn’t even collecting taxes at this time.",
                                                    "score": -10,
                                                    "replies": [
                                                        {
                                                            "author": "Euronomus",
                                                            "body": "Are you really trying to say that article VI wasn't part of the original ratified constitution?",
                                                            "score": 30,
                                                            "replies": [
                                                                {
                                                                    "author": "Push_Dose",
                                                                    "body": "Yes, clearly. Are you trying to suggest that the tenth amendment of the original constitution was a mistake?",
                                                                    "score": -8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Euronomus",
                                                                            "body": "Would love a source saying the supremacy clause wasn't part of the constitution as signed/ ratified in 1787/88. And why would I think the tenth is a mistake? It goes hand in hand with the supremacy clause.",
                                                                            "score": 22,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Push_Dose",
                                                                                    "body": "I stand corrected after looking further after my previous comment. I was always under the impression that it was added after the fact. Nonetheless, I will not stray from my original assertion that small government was a key component of the founding father’s design. Honestly I’ll die on the hill that what the federal government has become was not the intent nor within the vision of the founding father’s scope.",
                                                                                    "score": -1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "rightoftexas",
                                    "body": "They're still skirting the line but he can't do more than 30 days without being confirmed. \n\nWho knows what happens then.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "Not sure what you're even talking about here?  I'm talking about trying to abolish statutory agencies and cut funding passed by congress - both clear violations of the constitution.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "rightoftexas",
                                                    "body": "I meant Elon's role has 30 days under an emergency executive order.\n\nThe executive branch operates those agencies and if an audit is necessary of those agencies then it's well within their constitutional rights to do that. That could mean pausing funds or releasing contractors.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Euronomus",
                                                            "body": "Nope, pausing funds ordered by congress without their consent is unconstitutional.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "rightoftexas",
                                                                    "body": "So if Congress ordered illegal or unconstitutional payments the executive has no check on their function?\n\nSay Congress approves the CIA to buy cocaine and distributing it?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Euronomus",
                                                                            "body": "Nope, that would be the judicial branches responsibility - though the executive may have grounds to bring it to the judicial branch. The president and his cronies can't be judge jury and executioner though.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "rightoftexas",
                                                                                    "body": "You're right, should be brought to the judicial branch. \n\nBut the executive has the authority to pause but not stop payments. \n\nWhich as far as I can tell, that is where most of this currently is.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Euronomus",
                                                                                            "body": "No, they would have to get permission from congress - it may only take a committee vote, but he can't freeze it unilaterally. The courts have already ordered them to resume those payments twice now on those exact grounds.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "rightoftexas",
                                                                                                    "body": "Congress hasn't passed line by line budgets for these organizations so they can't freeze everything unilaterally but the executive, which is supposed to operate these organizations by the Constitution, can absolutely cut spending for specific projects not established by Congress.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Euronomus",
                                                                                                            "body": "When congress passes spending bills they are full of two words and a phrase - \"shall\", \"may\", and \"at the discretion of\", anything that is a \"shall\" is not negotiable, it has to be paid. The two court orders I mentioned both made it clear that the executive retained control of the \"may\" and \"at the discretion of\" parts of the budget - they can absolutely freeze that, just not the \"shall's\".",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "rightoftexas",
                                                                                                                    "body": "And this is a great chance for Congress to work on their job being more than a few phrases and I welcome the challenges to the executives level of control.\n\nBut to say Congress vague expressions have absolute control of the Constitution is absurd.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Euronomus",
                                                                                                                            "body": "It's legalese, the same reason contracts can be difficult to nail down. Sucks for sure, I hate reading it. But the unfortunate reality is that language isn't a \"hard science\" like math or chemistry, it's a living thing, so having a branch that has definitive meanings has its place.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "rightoftexas",
                                                                                                                                    "body": "It is a huge mess that the courts will provide guidance for. \n\nWhile I agree with your point about congressional controls I think they've relinquished far too much to executive control. And they have done that by passing laws that have bureaucratic control in the executive branch.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SupImHak",
                                    "body": "First of all no, much of the Constitution has nothing to do with actual rights and at times is in direct opposition to libertarian values (read the 16th for a good example). Secondly, the parts that actually matter (read the Bill of Rights for good examples) we like in a more objective sense and not by leftist fair-weather interpretations",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Push_Dose",
                                            "body": "You’re pretty crazy if you think the original constitution is in opposition to libertarian values. First amendment freedom of speech and assembly are clearly important for limiting government power. Second amendment was created to fight tyranny. The 3rd amendment sounds weird nowadays but also limits federal government power. Fourth amendment prohibits random searches and seizures clearly limiting government power. Fifth amendment is personal protection against government and judiciary power. Sixth is the same. 8th amendment is also quite clearly limiting the governments ability to unjustifiably punish individuals. 9th amendment expands upon individual rights. And the tenth amendment is literally the entire argument going on here and all the time.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "SupImHak",
                                                    "body": "I didn't say the \"original constitution\" did I. And the amendments you are pointing out are whats known as the \"Bill of Rights\", what I said to look up as good examples for the part of the constitution we believe in. But you already knew that and are just being subversive.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Push_Dose",
                                                            "body": "Kinda weird because like I just pointed out those 10 are certainly apart of the constitution with the clear intent of mitigating the federal government’s power.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "SupImHak",
                                                                    "body": "Limits the governments authority over it's citizens, not the capacity of the executive branch to manage itself",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Push_Dose",
                                                                            "body": "Like I said on another comment the federal government should be small enough to not notice its activity on a daily basis. That includes the executive branch. I looked through your comment history and you clearly have a not so libertarian political stance why are you even here starting arguments?",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SupImHak",
                                                                                    "body": "Your subversions are wasted on me leftist.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Push_Dose",
                                                                                            "body": "I support having 0% federal income tax and very minimal amount of the welfare state but I’m a leftist? Interesting.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "masterwad",
                            "body": "What’s stopping you from moving to libertarian paradise Somalia? Why are you living in the United States if you don’t like income taxes? What’s stopping you from living in international waters?\n\nIf you think overthrowing a constitutional democratic government is about liberty, it’s not, it’s about anarchy. And if it’s anarchy you want, there plenty of places on Earth you can move to to get that.\n\nGo live on Mars with Elon Musk and starve there if you want. The absolute gall of that sociopath, relying on US government contracts for his private businesses, while acting as Judge Dredd for any other government contracts.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Push_Dose",
                                    "body": "Isn’t the go move somewhere else the same argument republicans use against democrats? I still live in the United States because I love the protections granted to me by the constitution that is not available anywhere else in the world.\n\nI highly disagree with your second point. It’s not about anarchy it’s our birth right and duty as Americans to fight tyranny. Thomas Jefferson himself has two famous quotes about the topic.\n\n“Whenever any form of government becomes destructive of these ends (life, liberty, pursuit of happiness) it is the right of the people to alter or abolish it”\n\n“I hold it that a little rebellion is a good thing now and then and is as necessary in the political world as storms in the physical” \n\nI’m not interested moving to Mars just like your first point. The United States is the best country in the world due to the founding father’s design and it has clearly been straying from its path of what it was originally created to be.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aebulbul",
                    "body": "These people are out for revenge. They don’t really care about libertarian principles.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Because the last few years has shown, the libertarian party was infiltrated by Trumpanzees. Libertarians now cheer on \nauthoritarianism, weird timeline eh?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Rip_and_Tear93",
                            "body": "I'm just enjoying watching federal agencies get gutted. We already know that Trump and Elon have a litany of unconstitutional bullshit lined up, so we have to take what we can get out of this administration. \n\nBut, please, do tell me how we need to wait for Congress to reign in said federal agencies legally, which will totally happen.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "My non-snark answer is term limits. That’s the only way to begin fixing any of this.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "rightoftexas",
                                            "body": "Then the bureaucrats gain even more control because they don't have term limits",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Euronomus",
                            "body": "He's not dissolving the government, he's consolidating the power of the federal government into his own tiny circle.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RCDP_Kennedy",
            "body": "Federal employees can only spend what congress allocates. Let’s not spread misinformation.",
            "score": 92,
            "replies": [
                {
                    "author": "Amazing-Film-2825",
                    "body": "Wasting money and the money being congress allocated are not mutually exclusive.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Statists are in no position to be saying what is and is not misinformation.\n\n**“2 wEeKs To flaTtEn ThE cUrVe”**\n\n“[BiDeN iS aS sHaRp As A tAcK](https://www.reddit.com/r/Libertarian/comments/1emng5a/weird_is_the_new_biden_is_as_sharp_as_a_tack/)”\n\n**”HuNtEr BiDeN LaPtoP StOrY iS MiSiNfOrMatIoN!**”",
                    "score": -38,
                    "replies": [
                        {
                            "author": "masterwad",
                            "body": "Trump, as a felon, cannot even possess the gun that crackhead Hunter was charged with lying to obtain, yet Republicans just voted to give Trump nuclear weapons instead, as if Trump isn’t addicted to the stimulant Adderall, and he will raise prices for everyone with braindead tariffs (which US consumers will ultimately pay).\n\nUSAID, which Musk wanted to delete, even as it fights Ebola outbreaks worldwide, was investigating Starlink contracts in Ukraine. Do you think that’s just a crazy coincidence?\n\nFunny how everything comes back to Ukraine:\n\n[Ex-FBI source charged with Biden lies is tied to Russian intelligence, prosecutors say](https://www.npr.org/2024/02/20/1232789953/alexander-smirnov-fbi-informant-biden-hunter-ukraine)\n\nWikipedia says — https://en.m.wikipedia.org/wiki/Alexander_Smirnov_(FBI_informant)\n\n>Alexander Smirnov (born 1980) is an Israeli-American former informant who was charged with, and eventually pled guilty to, lying to the US Federal Bureau of Investigation (FBI) and creating false records regarding the Biden–Ukraine conspiracy theory.\n\nHow will the US benefit if an Ebola outbreak in Africa reaches America? It won’t. How will it benefit the US if anti-vaxx heroin addict crank RFK Jr does jack shit at the CDC during a smallpox outbreak? It’s obvious that the only needles Mr. Brain Worm likes are are heroin needles, but I thought the Republican Party says illegal drugs are corrupting our country? RFK Jr., the heroin addict kook non-doctor tapped by Trump to lead the CDC, thinks vaccines are bad because he thinks vaccines cause autism (which is false, old men’s sperm is linked to autism). But we’re all supposed to ignore Musk’s Nazi salute because he has autism?\n\n“This is the largest data breach and the largest IT security breach in our country’s history.”\n\nIf George Soros was getting tens of billions in government contracts, and was hacking into the US Treasury, your hair would be on fire because of the conflicts of interest of a foreign billionaire.\n\nNobody here can coherently rationalize away Elon Musk’s conflicts of interest. What he’s doing is illegal.\n\n[Trump ‘does not have the authority to abolish’ USAID: Congressional Research Service](https://thehill.com/homenews/administration/5125050-trump-does-not-have-the-authority-to-abolish-usaid-congressional-research-service/amp/)\n\nRepublicans control both chambers of Congress in 2025 (just like in 2017), they can pass any laws they want to shrink the government, but they aren’t doing it lawfully, they’re blindly following the lawless convicted felon they nominated 3x in a row, because Trump was so popular with stupid rednecks that they decided idiot Trump was “too big to fail.”\n\nWhere was Donald Trump or Elon Musk in Trump’s first term when HUD Secretary Ben Carson, Interior Secretary Ryan Zinke, and EPA Secretary Scott Pruitt were all wasting taxpayer money and using it like their own personal piggybank? That’s how you know that neither of them actually care about government waste.\n\nIt’s just a pretext for the world’s richest man, who is constitutionally banned from being POTUS, to siphon everyone’s private data. This plot is about Big Data, they don’t care about government spending because the money printers keep running.\n\nThe absolute gall of that sociopath Musk, relying on US government contracts for his private businesses, while acting as Judge Dredd for any other government contracts.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "theoneandonlybroski",
                            "body": "Do you not see the massive security risk, not to mention the complete disregard for the rule of law in Elon’s actions? Firing these federal employees without going through the proper channels, giving cause? I’m all for government efficiency, and if employees have been misallocating funds I do think they should be confronted, but firing all but 28 employees in the USAID? Unilaterally declaring the DoE no longer exists? This is authoritarianism to the max.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "wickedbiskit",
                                    "body": "It’s an executive branch agency. The chief executive shouldn’t have say over an executive agency?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "Not the parts that are mandated by congress. And spending is not his to decide unless congress has explicitly given the executive discretion over those funds.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "theoneandonlybroski",
                                            "body": "Congress has power of the purse. Not the president. Congress says how much money goes where and the executive branch executes it. The president cannot say he doesn’t like an agency congress approved thus he cuts all funding. That is tyranny.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DE3187",
                                    "body": "Now you're worried about \"proper channels\"? Lmao",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "theoneandonlybroski",
                                            "body": "What are you talking about?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "luckoftheblirish",
                                    "body": ">dismantling federal agencies is authoritarianism \n\nYou need to change your flair, bud",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "Dismantling federal agencies you have no legal or constitutional authority to dismantle simply because you are in control of the means of enforcement is, in fact, remarkably authoritarian - practically textbook.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "luckoftheblirish",
                                                    "body": "Terrible argument.\n\nDefinition of authoritarian: *favoring or enforcing strict obedience to authority, especially that of the government, at the expense of personal freedom*\n\n1. If a federal agency is enforcing strict obedience to authority at the expense of personal freedom, then dismantling it is clearly not authoritarian. In fact, it's the opposite.\n\n2. The constitutionality of federal agencies in their current capacity is very debatable.\n\n3. Libertarianism =/ constitutionalism. The fact that something is not constitutional does not necessarily mean that it goes against libertarian principles (or, more broadly, that it is wrong/immoral).",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "Euronomus",
                                                            "body": "Yes, Trump is using his authority over the government to demand strict adherence to what he himself wants - not what the democratically elected representatives of the people have passed into law. Like I said, practically textbook.",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "luckoftheblirish",
                                                                    "body": "Yeah, I'm not defending Trump, I'm attacking your poorly-reasoned argument. Nobody within federal agencies is democratically elected. They are literally unelected bureaucrats.\n\nFeel free to respond to any of my previous points.",
                                                                    "score": -7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Euronomus",
                                                                            "body": "Those agencies, and those bureaucratic positions, are mandated by the will of the people through laws passed by their elected representatives. The position of the president does not have the constitutional authority to overrule that. Doing so strips the people of their right to representation in government  Replacing democratic institutions with the whims of an individual who managed to get their hands on the levers of power is the definition of authoritarianism.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "luckoftheblirish",
                                                                                    "body": ">Those agencies, and those bureaucratic positions, are mandated by the will of the people through laws passed by their elected representatives.\n\nDelusional and factually incorrect. The inner workings of the federal government are far beyond the capacity of intelligent citizens to comprehend, let alone the average Joe. The will of the average person has no bearing on the actions of federal agencies. What percentage of the US population even knew what USAID was doing before the recent controversy? I would wager <1%. How can you impose your will on an agency without any knowledge about how the agency operates or what it does?\n\n>The position of the president does not have the constitutional authority to overrule that.\n\nFederal agencies technically operate within the executive branch of government. The president does legally have a a lot of authority over their operations, although they are ultimately intended to enforce the laws created by congress.\n\n>Replacing democratic institutions with the whims of an individual who managed to get their hands on the levers of power is the definition of authoritarianism\n\nAgain, federal agencies are not democratic institutions. Nobody votes for anyone within them, and nobody votes for the regulations that they create or actions that they take.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Euronomus",
                                                                                            "body": "Yes, no one can know everything about how everything in the world works.  One of the central reasons man has conquered earth is that we specialize... And the least worst system of government we have ever developed is representational democracy. We(ideally) select people who specialize in government based on our values and trust that they will find the best way to do what we desire - that doesn't mean that we all get what we want, but again, it's the least of all the shitty options we have.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "luckoftheblirish",
                                                                                                    "body": ">And the least worst system of government we have ever developed is representational democracy.\n\nI'm sure peasants felt the same way about monarchy in the middle ages. The fact that a system of government \"works\" does not mean it doesn't have egregious problems, shouldn't be criticized, or can't be replaced with something better. Defending the status quo simply because it's the status quo is absurd.\n\n>We select people who specialize in government based on our values and trust that they will find the best way to do what we desire\n\nThat's certain how it's supposed to operate, but it's delusional to think that's how it actually operates in practice. Human beings ultimately act in their own self-interest - you are assuming that politicians and bureaucrats act perfectly altruistically (i.e. act in the interest of the public rather than in their own interest), but this is clearly absurd. The incentive structure within our system of government caters to greed (both by political and private actors) and breeds corruption.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Euronomus",
                                                                                                            "body": "I'm not assuming people act altruistically - that's exactly why I stressed that it's the least shitty system we have ( you missed my edit - I own it, but I changed it to \"we (ideally) select people\" before your response, specifically for the reason you called me out on) .  If you have a suggestion better than representative democracy I'm all ears.",
                                                                                                            "score": 6,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ArcRust",
            "body": "Im not defending vaccine mandates. \n\nBut this post is dumb. You'll never convince people if you can't even recognize what their frustration is about.\n\nIn both cases, libs were looking at the situation from the viewpoint of \"harm to others\". Whether you agree with that or not, that's how they see it. They see refusal to get vaccines as risking the health and safety of others. They see the current firings as fascist action that will lead to the harm of others.\n\nIm not saying that I agree or disagree. But, claiming hypocrisy shows that you aren't even listening. This kind of shit is divisive and doesn't help.",
            "score": 12,
            "replies": [
                {
                    "author": "Opening-Wasabi-9018",
                    "body": "You wrote all that to fail to see the side of Libertarians lmao",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sureyouknowurself",
            "body": "They can learn to code",
            "score": 4,
            "replies": []
        },
        {
            "author": "caleecool",
            "body": "You know, it would help DOGE's image **a lot** if they had a simple website that had an itemized list of fraud/wasteful spending they've found.\n\nIt would immensely cut down on the conspiracy theories/complaining, while providing everyone with transparency.\n\nI mean, that's what we're after right? A free market with perfect information, to make the most informed choices.\n\nAt the moment, DOGE feels like a \"shadow\" government/coup to the Left because it's acting like one.",
            "score": 21,
            "replies": [
                {
                    "author": "Euronomus",
                    "body": "Because there is practically no real fraud or excessive waste being found. Everything they have publicized to try and rile up the right was either ordered by congress, or taken drastically out of context. You hear about Politico getting USAID funds? It was to license pictures for a government website - they literally bought specific pictures from them.... But they publicize it as \"Omg, USAID gave money to Politico\" - completely ignoring the context. The whole \"audit board\" nonsense is a smokescreen for an authoritarian takeover of the US government.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "salparadise5000",
                            "body": "Ordered by Congress doesn't mean it's not waste",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Euronomus",
                                    "body": "Yes, yes it does - you might not like what it's being spent on, but as long as it's being spent exactly how the law is written then USAID and other agencies aren't wasting it - they're doing the job they are tasked with. If you want that spending cut then the only legal way to cut it is for congress to pass a law - Trump has no legal authority to cut it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Timo-the-hippo",
                            "body": "So the government can bribe news organizations as long as they get pictures in return? At least I can ignore every other dumb thing you say now.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Euronomus",
                                    "body": "Buying something is a bribe? Makes perfect sense.... Meanwhile Donnie just let two people who actually sought/took real bribes off scott-free.....",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "hold_that_thought",
            "body": "Who and how is \"wasting\" defined?",
            "score": 11,
            "replies": [
                {
                    "author": "John2H",
                    "body": "By the people who won the popular vote.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "trufus_for_youfus",
                            "body": "Based and fuck democracy pilled.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sirwinston_",
                    "body": "Their roles existing in the first place is wasting $$.",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "LagsOlot",
            "body": "If you have to lie to make a point it's a bad point.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Most_Structure9568",
            "body": "Defund the secret service.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MateTheNate",
            "body": "They’re getting fired because they are not Trump loyalists",
            "score": 8,
            "replies": []
        },
        {
            "author": "xXxBoaTxXx",
            "body": "Seems weird to me to compare an epidemic to \"legal spending\" or \"corruption\" I don't care what view anyone has on the bottom half. \nAnd wow can't businesses just like make terms for their employment within the law? Don't like the vaccine what's stopping them from going to another job which doesn't require any of the \"bullshit\". \nChoose to be victimized or don't as far as I am concerned. ",
            "score": 11,
            "replies": [
                {
                    "author": "Push_Dose",
                    "body": "Not very libertarian of you to suggest that the government should be involved in decision making about your body. The vax mandate was wack but the existence of this size of federal government is also wack.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "Royal_IDunno",
            "body": "Accurate.\n\nEdit: far left brigaders downvoting everyone again 😂😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cosmic_Spud",
            "body": "They're all in cults.  And they will all gladly send people to die in work camps if they disagree.  It's psi-ops. The FBI owns all the media and gets people worked up at each other so they don't all focus their anger at  DC",
            "score": 1,
            "replies": []
        },
        {
            "author": "FatBlueLines",
            "body": "This is awesome",
            "score": -7,
            "replies": []
        },
        {
            "author": "Roctopuss",
            "body": "This sub is so completely overrun with Dems we may as well shut it down. At least change the name.",
            "score": -6,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Many libertarians (including myself) are former lefties and former socialists.\n\nFacts, history, and economics trumps weak emotional arguments any day.\n\nDon’t give up hope.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GHhost25",
                            "body": "Lol, let me guess you were a leftist until you got your first paycheck.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Moist-eggplant1994",
            "body": "Exactly! Insane!!",
            "score": -2,
            "replies": []
        },
        {
            "author": "dgillz",
            "body": "Has anyone actually been fired yet?",
            "score": 1,
            "replies": [
                {
                    "author": "Euronomus",
                    "body": "Numerous people, hell I believe it was 16 inspectors general that Trump (illegally) fired. If you're unaware, an inspector general is the person who is tasked with making sure their agencies follow the law....",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "cherishedleaf",
            "body": "Amen",
            "score": -8,
            "replies": []
        },
        {
            "author": "Neither-Big3749",
            "body": "Shhh, we can’t talk about covid. Apparently it has been eradicated thanks to our big pharmaceutical overlords. Please remember to get your booster shot like a good little plebe. 😑",
            "score": -1,
            "replies": []
        }
    ]
}