{
    "title": "\"When you sacrifice liberty for security, you lose both.\" -Ron Paul",
    "author": "AbolishtheDraft",
    "subreddit": "Libertarian",
    "rank": 379,
    "score": 762,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 47,
    "url": "https://v.redd.it/4lwzng5c0cie1",
    "id": "1im8z4k",
    "selftext": "",
    "comments": [
        {
            "author": "HogunHiro",
            "body": "Ron Paul wasn’t 20 years too early. The collective American people are 20 years too late. Glad they are finally starting to understand.",
            "score": 82,
            "replies": [
                {
                    "author": "libertarianinus",
                    "body": "He and Ross Perot would of been a great team.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "GrizzlyBeardBabyUnit",
                    "body": "What makes you think the American people are starting to understand? Trump and his henchman aren’t getting rid of agencies because of their inefficiencies, they’re getting rid of the ones that allow his benefactors to operate without oversight under the Executive Branch. \n\nTrump is congealing an unprecedented amount of power under himself. Republicans/ Conservatives Lipublicans would be losing their shit if a democratic president did the same. But because, “liberty for me, none for thee” people are just eating this shit up saying, “hAhA cRy HaRdEr lIbErAls 😂.”\n\nHopefully the courts take their oaths seriously and stand up for the Constitution. I’m all for getting rid of silly inefficient government. But the budget/ agencies are handled by Congress, they need to be the ones defunding agencies. Keep powers separate!",
                    "score": 16,
                    "replies": [
                        {
                            "author": "ImGon-",
                            "body": "I think regardless of what Trump’s intentions are, the national discussion of cutting spending and just more libertarian-leaning ideas in general is good. The American people as a whole are being forced to grapple with those ideas that were simply in the background for so long. I mean I’ve seen republicans talk about cutting defense spending, auditing the Pentagon, stopping military aid to other nations… that’s a total 180 compared to where republicans were at just 15-20 years ago. \n\nNow to just get them to stop the war on drugs and immigration… that’ll take another 15-20 years, if at all.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Scared_Sample_3134",
                            "body": "The budget and agencies are handled by congress but what have they really done about those things the last 20 years? Pretty much nothing. They talk about making cuts and then they have more meetings, emails, committees, talking, and then nothing to show for it. I don’t necessarily like the way Trump is doing everything right now, but it is nice to see some action.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "goober8008",
            "body": "This was Super Kaiju savior Ron Paul, outclassed everyone on that stage.  This was my guy.  I think this is one of the greatest answers in Debate History.  Redirects the question to make his point, then comes back to answer the question clearly and concisely relates to the audience with answer.  Smug interviewer getting served is just icing on the cake.",
            "score": 26,
            "replies": []
        },
        {
            "author": "chewychee",
            "body": "The GOAT!",
            "score": 23,
            "replies": []
        },
        {
            "author": "jedi_trey",
            "body": "Pretty sure he was mis-quoting Ben Franklin\n\n \"Those who would give up essential Liberty, to purchase a little temporary Safety, deserve neither Liberty nor Safety\". ",
            "score": 32,
            "replies": [
                {
                    "author": "Warack",
                    "body": "Paraphrasing the idea.",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "Intelligent-End7336",
                    "body": "> Pretty sure he was mis-quoting Ben Franklin\n\nThat's because Franklin was arguing for the power to tax to fund security, not the other way around.  \n\nIn Ron Paul's context, we've lost security because the government has grown it's power of taxation in the name of providing security but has failed it's own task. \n\nFranklin's quote and ideals are literally the forerunner for the surveillance/security state that we find ourselves in today.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Shhh. It's fun seeing conservatives unironically post a pro-tax quote.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "metalbracelet",
                            "body": "Can you elaborate please? The quote seems to be rejecting the idea of purchasing temporary safety so I don’t understand how he was arguing for tax. Genuine question, I’m not sure of the context of the quote.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Intelligent-End7336",
                                    "body": "It was part of a tax dispute between the Penn Family and the local government.  There were Indian raids during the French and Indian War.  The Assembly wanted to tax the Penn Family to fund the defense and the Penn Family just wanted to voluntarily contribute. \n\nFranklin's quote is directed to the assembly telling them to exercise their powers to tax and that the Penn Family was benefiting from the defense without paying taxes on it.  \n\nFranklin was arguing that the Assembly/Government was the one being asked to give up its liberty, specifically, its right to self-governance and taxation because the Penns were trying to override their authority by resisting taxation.\n\nTo further clarify, the Penn Family were proprietors who acted as landlords and rulers of the colony, not the king directly.  Pennsylvania had an elected Assembly, roughly a legislature.  The assembly wanted to tax everyone for defense funds.  The Family didn't want to allow the Assembly the power to tax them since there were landlords per the power of the Crown.  \n\nFranklin is technically arguing for the right to self governance and taxation with representation, but he's still arguing for taxation in the end.  From a minimum government Libertarian perspective, this is probably in line with standard expectations for government and everyone contributing.  From a no government libertarian perspective, this solidifies the idea of government taxation to provide defense which leads to the Military Industrial Complex that we have today.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Snoo_17731",
            "body": "MAN I WISHED HE WON!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Which-Supermarket-69",
            "body": "![gif](giphy|cMso9wDwqSy3e|downsized)",
            "score": 3,
            "replies": [
                {
                    "author": "Snoo_17731",
                    "body": "Ron is the GOAT",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OneChampionship7736",
            "body": "I wish he would have won 😔",
            "score": 3,
            "replies": []
        },
        {
            "author": "I_heart_heart_the_Dr",
            "body": "I worked on his campaign, and got to meet him. 😢",
            "score": 3,
            "replies": [
                {
                    "author": "rushedone",
                    "body": "Username checks out!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "perryurban",
            "body": "I would have loved to have lived in a universe where Ron Paul became president of the USA. I want to see that world.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_Orange_4435",
            "body": "It took a dumb fuck like Trump to communicate to dumb fucks. They figured out that scaring the *fuck* out of people and aligning an agenda with peoples’ bullshit beliefs is how you get them to see things your way. Ron Paul was simply too intelligent for the masses.",
            "score": 9,
            "replies": [
                {
                    "author": "Bubbly-Ad-1427",
                    "body": "presidential elections are 90% a charisma battle between two people to see who can garner more support for their terrible ideas",
                    "score": 8,
                    "replies": [
                        {
                            "author": "No_Orange_4435",
                            "body": "Facts.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Samniss_Arandeen",
                            "body": "And the result isn't even a tyranny of the majority, it's a tyranny of the ideological base of one party that somehow managed to convince a plurality.\n\n*God* I wish the Framers would have just made a Parliamentary system for Presidential election and been done with it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Prestigious_Bite_314",
                    "body": "You need a jockster, not someone whonis dumb necessarily. They view politics like sports. It's either fanaticism or entertainment.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Samniss_Arandeen",
                            "body": "Well, Mike Ditka *did* consider running against Obama in 2004...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Scared_Sample_3134",
                    "body": "Don’t underestimate how powerful the media was for a long time (both sides) in promoting the mainstream ideas of “safety” and “security” and the “importance of these agencies.” It took me a long time to open my eyes.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "No_Orange_4435",
                            "body": "I see the media nowadays as an extended presidential campaign. It’s fucking disgusting.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Scared_Sample_3134",
                                    "body": "Truth. You can even see in this clip here Chris Wallace asking these leading questions like \"how could we possibly function without the intelligence of the FBI?!\" More people are awake now, but a lot are still asleep. It's lonely out here.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Behemoth92",
                    "body": "Trump is not a dumb fuck. Everyone who failed to communicate this was a dumb fuck. You can’t run on intellectual ideals when you need to get hick votes. You have to fear monger. It’s what it is.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "No_Orange_4435",
                            "body": "I won’t disagree with the latter part of your message.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Embarrassed_Safe500",
            "body": "May God bless Ron Paul",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Scale_9248",
            "body": "Politicians say it's their job to protect us from our enemies. Actually, it's their job to make sure we have enemies.",
            "score": 2,
            "replies": []
        },
        {
            "author": "timbernforge",
            "body": "More like 70 years too late.  Needed to have more people pushing back in the 20s & 30s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "embarrassed_error365",
            "body": "Ron Paul's mistake was not claiming he has no idea about wanting to end those things before getting elected and immediately flip flopping.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational-Area-149",
            "body": "Don't agree. As a libertarian I think security is the only thing for which it's worth sacrificing liberty.\n\nCountries without widespread gun ownership tend to be safer",
            "score": -6,
            "replies": [
                {
                    "author": "umpteenththrowawayy",
                    "body": "I genuinely can’t tell if this is a shitpost.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Bubbly-Ad-1427",
                            "body": "it’s worse, a fedpost",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IronSkyRanger",
                    "body": "Because the government will protect us, right?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Educational-Area-149",
                            "body": "It will do it inefficiently and at high costs but security is the only compromise worth making",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "IronSkyRanger",
                                    "body": "You defeated your argument with this statement.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Bubbly-Ad-1427",
                                    "body": "“we should trade liberty for security, but the government will do it bad”",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bubbly-Ad-1427",
                    "body": "least obvious fed",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}