{
    "title": "“eLoN iS a Nazi”",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 352,
    "score": 376,
    "upvote_ratio": 0.58,
    "num_comments (reported by reddit)": 151,
    "url": "https://i.redd.it/1n2bx4m3umie1.png",
    "id": "1inkh4v",
    "selftext": "",
    "comments": [
        {
            "author": "sirweevr",
            "body": "If Elon is a libertarian, he could start by not serving an extreme statist President.\n\nAnd he could avoid supporting hyper-statist parties across Europe.\n\nBut he doesn't have a trace of libertarianism inside him, so he won't.",
            "score": 327,
            "replies": [
                {
                    "author": "Zomia-Mimisbrunnr",
                    "body": "So he says but in reality he's a big government corporate poser",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "luckac69",
                    "body": "Extreme statist president? The one abolishing government departments?\n\nI wouldn’t call trump a libertarian, but extreme statist?",
                    "score": -16,
                    "replies": []
                },
                {
                    "author": "Narrow-Ad6201",
                    "body": "dont drink the coolaid bro.",
                    "score": -7,
                    "replies": []
                },
                {
                    "author": "OpinionStunning6236",
                    "body": "He should pass up a position where he can actually do something just so he can wait for a “non statist” president? We’re never getting one of those if Libertarians are sitting on the sidelines.\n\nAnd just to be clear I don’t think Elon is a legitimate Libertarian but he has some Libertarian leanings.",
                    "score": -77,
                    "replies": [
                        {
                            "author": "Gimmenakedcats",
                            "body": "They’re not saying for him not to do work, just not flamboyantly profess love to a statist every few minutes and do whatever he says. Elon isn’t a libertarian, he’s a technocrat. Libertarians would do well to realize that his oligarch ass in no way cares about you individually unless you contribute to his vision of the future. That’s not to say that we can’t share *some* views together, but this man’s aim as a billionaire who’s obsessed with Thiel, Trump, and AI is not the same as an average American.",
                            "score": 38,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "upvote-button",
            "body": "Bro you're looking for a maga echo chamber. Why are you in here?",
            "score": 466,
            "replies": [
                {
                    "author": "ScholarDazzling3895",
                    "body": "Decreasing and limiting government departments is arguably a very libertarian position. This chat is a liberal echo chamber trying to convince themselves they are nuanced.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "upvote-button",
                            "body": "Oh yeah the maga post were currently talking under with 400 upvotes is 100% proof that this is a liberal echo chamber. You're a genius my guy",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ScholarDazzling3895",
                                    "body": "Libertarians have been \"leaning right\" for a while (The left just insisted on bigger gov is all and moved further left). Most of the comments on this thread are very much liberal talking points.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ehronatha",
                    "body": "Correct - this is a progressive echo chamber.",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "mrkrinkle84",
                    "body": "It looks like they are just pointing out situations of the past and pointing out people's reaction to them. Maybe, you should take note? We all make mistakes, but if you can't recognize you made them, you can never learn from them. \n\nI know I know, I'm also looking for a logical.... I mean MAGA echo chamber and last place to find logic.. I mean MAGA is Reddit.",
                    "score": -178,
                    "replies": [
                        {
                            "author": "upvote-button",
                            "body": "I'm guessing you didn't look at his responses in the comments. Maybe you should learn how to check what you're defending before you defend it",
                            "score": 89,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aidsinmyhand",
            "body": "You mean the same standing O that Canada was dragged for months about?? And apologized for. Musk fans are some special type of sensitive lol.",
            "score": 511,
            "replies": [
                {
                    "author": "Angus_Fraser",
                    "body": "First I'm hearing about it",
                    "score": -74,
                    "replies": [
                        {
                            "author": "thebackupquarterback",
                            "body": "Admitting you don't keep up with the news isn't a point OP's favor.",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "Angus_Fraser",
                                    "body": ">Canada\n\n>ever relevant enough to watch their news\n\nGood one",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "thebackupquarterback",
                                            "body": "You not keeping up with a country 40 million people isn't a flex, just means you don't really pay attention to the world.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Angus_Fraser",
                                                    "body": ">Canada\n\n>ever relevant on the world stage\n\nSerbia is more relevant on the world stage. Canada is just a vassal for the UK at best, and or dorky brother to the North that isn't worth paying attention to.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Ah yes, the **liberal media** totally “*dragged Canada for months*.”\n\nHow could I forget that.  /s",
                    "score": -434,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Libertarian doesn’t equate to MAGA, OP. There are other subs out there that likely align more with the agenda you’re trying to push. Good luck in your journey.",
                            "score": 148,
                            "replies": [
                                {
                                    "author": "Loves_octopus",
                                    "body": "The way things are now, you literally cannot be maga and libertarian",
                                    "score": 84,
                                    "replies": [
                                        {
                                            "author": "Pancakesex",
                                            "body": "say it again!",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "BackdoorSpecial",
                                                    "body": "Louder! For the OPs in back!",
                                                    "score": 14,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Sure_Hedgehog4823",
                                            "body": "Actually you can be anything you want to be.. any loser on Reddit telling you otherwise is just that",
                                            "score": -9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Aidsinmyhand",
                            "body": "Yea this was dragged for months lol not my fault you don't get out of your bubble.",
                            "score": 223,
                            "replies": [
                                {
                                    "author": "col3man17",
                                    "body": "Was it? When? This is the first I've heard about it",
                                    "score": -44,
                                    "replies": [
                                        {
                                            "author": "Gimmenakedcats",
                                            "body": "Oh guys- one guy didn’t pay attention to something, this means it didn’t happen!",
                                            "score": 44,
                                            "replies": [
                                                {
                                                    "author": "aged_monkey",
                                                    "body": "Lol there's a literal long ass Wikipedia article about it outlining in length the reactions, and the lengths Canada went to apologize, and even extradite him. It was the result of poor due diligence, not an intentional teenage troll job by a billionaire trying to legitimize Nazi salutes in the less savory corridors of our society. One he didn't apologize for, but leaned into further lol. \n\nhttps://en.wikipedia.org/wiki/Yaroslav_Hunka_scandal",
                                                    "score": 20,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "Resorting to childish ad hominem attacks is when you have **nothing of substance** to bring to the debate.\n\nTry again.",
                                    "score": -309,
                                    "replies": [
                                        {
                                            "author": "Coballs",
                                            "body": "https://preview.redd.it/v453awgssoie1.jpeg?width=960&format=pjpg&auto=webp&s=f594de3ca61d439c477837947fb2a3a8aba50d9e",
                                            "score": 170,
                                            "replies": [
                                                {
                                                    "author": "guhman123",
                                                    "body": "gonna save that one rq",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Aidsinmyhand",
                                            "body": "There is a debate here?? About what??",
                                            "score": 143,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": "Your original rebuttal was that Trudeau and Canada’s politicians suffered repercussions in the media for giving a standing ovation to a literal SS officer.\n\nWhen was the last time CNN, MSNBC, The New York Times, Jimmy Kimmel, John Oliver, Stephen Colbert, SNL, or The Young Turks made any mention of Trudeau and Canada’s standing Ovation?\n\nHow quickly did the liberal media machine make that one disappear after it first happened?\n\nMusk’s awkward hand gesture has been dragged on for weeks.\n\nHave any of the aforementioned  liberal media outlets or shows made any reference to these same awkward hand gestures?\n\nhttps://preview.redd.it/sdx6htfhynie1.jpeg?width=1290&format=pjpg&auto=webp&s=b5f3b629727b8fc2c06acd91afb467f3d595d84e",
                                                    "score": -130,
                                                    "replies": [
                                                        {
                                                            "author": "Aidsinmyhand",
                                                            "body": "Your pictures that are taken out of context?? These pictures were [all](https://nationalpost.com/news/canada/vladimir-putin-canada-parliament-nazi-tucker-carlson) [mocked](https://www.bbc.com/news/world-us-canada-66943005.amp) [to](https://news.sky.com/story/amp/canadian-parliaments-standing-ovation-for-former-nazi-soldier-was-deeply-embarrassing-trudeau-says-12970074) [death](https://www.cbc.ca/kidsnews/post/why-Canada-is-apologizing-after-MPs-gave-this-man-a-standing-ovation) [when](https://www.politico.com/news/2023/09/24/nazi-linked-veteran-ovation-zelenkyy-canada-visit-00117857) people asked for the videos to them weeks ago lol. \n\nThe last time the standing O was mentioned was months after it happened, stuff doesn't permanently stay in the news cycle lol. Canada was dragged for months by news sources all across the world because of it, that's simply a fact like it or lump it. The good thing about it though is that it was a legitimate mistake they apologized for immediately unlike musk. \n\nThere is no \"debate\" here my friend simply just you being really confused lol.",
                                                            "score": 189,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "huss360",
                                                            "body": "When you watch the videos of all those pictures, the only one that was close to a nazi salute was the republican in the bottom pic",
                                                            "score": 38,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "guhman123",
                                                            "body": "hey can you send the videos of each of those, and compare them side by side to neo-nazis doing the salute? Think this would clear a lot of things up.",
                                                            "score": 15,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "elqueco14",
                            "body": "Dude go touch grass",
                            "score": 55,
                            "replies": []
                        },
                        {
                            "author": "GopnikOli",
                            "body": "Almost all of your posts are about owning libs and how vocal the left is, multiple people here seem to be of the belief you’re just a MAGA shill at this point.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "twilightaurorae",
            "body": "Who is exactly 'sleeping'? \n\nThe Ukranian man's background was not known at that time, but when it was revealed there was anger. It was a mistake that Trudeau admitted to.",
            "score": 380,
            "replies": [
                {
                    "author": "Helpful-Formal9214",
                    "body": "Found the socialist. Go back to BlueSky with this bullshit excuse \n\n\nWe know you would never grant the same grace to libertarians and Republicans if they accidentally invited a Nazi to congress. Get out of here. \n\n\nFuck the left. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "smithsp86",
                    "body": "> The Ukranian man's background was not known at that time\n\nThat's bullshit.  Anyone with even a passing understanding of WWII should know which side Ukrainians fought for.  Hint, it wasn't the side that genocided them through the holodomor.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JohnTheSavage_",
                    "body": ">The Ukranian man's background was not known\n\nBullshit. As soon as they said the line, \"Mr. Hunka fought the Russians in world war 2,\" I was like, \"Uh oh.\"\n\nBecause I took history in high school. Pack of fucking idiots.",
                    "score": -78,
                    "replies": [
                        {
                            "author": "YerBoi",
                            "body": "Maybe consult some history books yourself, especially the parts about the Molotov-Ribbentrop pact and the events leading to Operation Barbarossa.",
                            "score": 69,
                            "replies": [
                                {
                                    "author": "LeavesOfOneTree",
                                    "body": "Lolol imagine thinking the Russians were good guys just because fought on the same side of WW2.",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "___miki",
                                            "body": "Hardly any \"good guys\" when discussing states that participate in all-out warfare.",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "ZombieTesticle",
                                                    "body": "Well at least the US bothered to stay around until the end back then so they get bonus points for that, I feel.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "twilightaurorae",
                            "body": "And if you took your history, which I also did, you might be familar with the non-aggression pact that Russia and Nazi Germany did. Russia (USSR) invaded Eastern Poland (which Ukraine was part of), while Germany did the Western part. \n\nFighting the Russians was simply an extension of fighting against communist/Soviet influence (who was their invader). Regrettably, he joined the SS to do so, and may have committed atrocities. \n\nAnd secondly, there was condemnation of the issue, with an apology sent out, and the speaker resigning. As it should b.",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "THANATOS4488",
                                    "body": "\"Joined the SS\"\n\n\"May have committed atrocities\"\n\nDude, the SS were the worst of the worst. There is no may have. There could be Nazi soldiers who never had the opportunity to do anything evil. There were no SS soldiers who hadn't done evil.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "aged_monkey",
                                            "body": "Lol yes, and then Elon just legitimized the very people that exist today ... who still think the SS were the good guys.\n\nOne apologized, and did everything to make up for it. Elon Musk on the other hand is showing off their most patented sign like its a good thing. \n\nAnd now there are bunch of relatively influential people who are doing it out in the open too (E.g., Steve Bannon).",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LeavesOfOneTree",
                                    "body": "🎯",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LeavesOfOneTree",
                            "body": "He didn’t just fight the Russians in WW2. He was fucking Waffen SS one of the most brutal and evil units in the entire WW2.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "JohnTheSavage_",
                                    "body": "Yeah. That's the point. The Russians were an allied nation in WW2. If you were fighting them, you weren't an ally.\n\nEverybody's acting like the odds were equally good he was just unaffiliated Ukrainian resistance. Which, even if that were true, is still fucking stupid, because anyone who knows even basic history would know to fucking check if your pet Ukrainian guy was one of the many Ukrainian guys who joined the fucking Nazis.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "luckac69",
                                            "body": "Obviously being in the SS is different, but the Soviet Union in general wasn’t better than Nazi Germany in general.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "LeavesOfOneTree",
                                            "body": "Yep. And not a single US news agency covered this, as they were calling Trump ‘actual hitler’",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "TurdFergusonlol",
                                                    "body": "Why tf would US news even care about some Canadian parliament blunder, especially during our own presidential cycle?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Gimmenakedcats",
                            "body": "No you didn’t- lmao. Nobody learned about these men in high school and it was far more nuanced than that.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeavesOfOneTree",
                    "body": "It was also widely reported that Trudeau met privately with Hunka and his family prior to parliament. You don’t uncover he was a nazi in that meeting you’re a dumbass.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "twilightaurorae",
                            "body": "What were you expecting of the meeting?\n\nThey (the government) wanted to meet someone who resisted the Russians and were given Hunka. I highly doubt the private meeting was discussing about his Nazi involvement and Hunka probably wont spout Nazi stuff.\n\nAnd get back to the point, dumbass or not, there was condemnation for this incident.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "vvfella",
            "body": "Elon sucks as a human and so far sucks at doing anything other than tooting his own horn about all the spending he’s cutting. So confused why so many in a libertarian group, especially a mod, seem to worship him so much. \n\nAlso concerning that people who disagree with Elon-praising seem to be getting banned…",
            "score": 207,
            "replies": [
                {
                    "author": "Narrow-Ad6201",
                    "body": "listen elon is a grifter and is most likely not as talented as he lets on. and hes definitely socially inept. but if you look at the responses to this thread about him theyre awefully similar in rhetorric as most liberal positions..... \n\nno wait im not supposed to notice stuff. please downvote me.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Temporary-Sun-862",
                    "body": "Elon has done more for humanity than anyone else of our generation. Tesla, spaceX and Starlink. All three are awesome and pushing the technology frontier. \nWhen you say he sucks as a human, you and I must be slugs on this planet just sucking away at filth because no one on Reddit, including you and I has done anything nearly as important as Musk has. \n\nI’m not a musk fan boy, I’m able to recognize when media is feeding me bs.\n\nEdit post: down vote 149, hell yes, let your self hate out, you cucks.",
                    "score": -139,
                    "replies": [
                        {
                            "author": "aqua_navy_cerulean",
                            "body": "\"I'm able to recognize when media is feeding me bs\" but is unable to critically analyze the actions of Elon Musk outside of \"he make good tech\"\n\nHe also didn't start Tesla, just sayong",
                            "score": 107,
                            "replies": [
                                {
                                    "author": "globulator",
                                    "body": "Lol the dude saves Tesla from bankruptcy and turns it into one of the most valuable companies in the world and people like you still love to point out that he didn't file the original articles of organization. If he's just some dumby, what does that make everyone else that isn't worth hundreds of billions or dollars? He had a little bit of money from his parents, sure, but how many people who were given a few million bucks turn it into hundreds of billions? It's just jealousy, and it's embarrassing.",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "author": "aqua_navy_cerulean",
                                            "body": "I didn't say he was dumb. I agree he's done good things for parts of the tech industry, but he also has done several things I don't think are ok and we shouldn't let slide. Also, a few million is absolutely not a \"little bit of money\"",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Keitt58",
                            "body": "It's funny, but last I checked, Musk relied on massive government funding to accomplish some of those achievements.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "vvfella",
                            "body": "That you, Adrian Dittmann? \n\nThat’s the only way I can imagine saying “Elon has done more for humanity than anyone else of our generation” followed up by claiming not to be a Musk fanboy.",
                            "score": 49,
                            "replies": [
                                {
                                    "author": "guhman123",
                                    "body": "nah its common knowledge that musk is his own biggest fanboy",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "vNerdNeck",
                            "body": "It amazes me that people can seriously bash Elon accomplishments with a straight face.   If it wasn't for him EV cars wouldn't be anywhere near a \"thing\" as they are right now, and private space travel would still be limited to Sir Richard's  minute zero g flights for fellow millionaires.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "10PieceMcNuggetMeal",
                                    "body": "And Nazi scientists invented the scanning electron microscope. Just because you invented something cool doesn't mean you don't get called out for being a dickhead.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CigaretteTrees",
            "body": "Elon might not be a Nazi but he is certainly a conman and whatever movement accepts him will ultimately become less legitimate by association, he is not a Libertarian, I surely don’t know any principled libertarians that would accept billions in handouts from the government, funded by coercing the taxpayers.\n\nhttps://preview.redd.it/wnaag5r60qie1.jpeg?width=924&format=pjpg&auto=webp&s=576439c86d6c0c62afcd34080df8bf307100226a",
            "score": 85,
            "replies": [
                {
                    "author": "Spiteblight",
                    "body": "Exactly. But also, that guy is a Nazi.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "CigaretteTrees",
                            "body": "Could be, it wouldn’t surprise me, but at the same time it’s very hard to imagine anyone outside of an edgelord basement dwelling teenager could actually hold Nazi beliefs, they are just so incredibly outlandish.\n\nAs to Elon’s Nazi salute, my moneys on he did it to “own the libs”, but again it wouldn’t surprise me if he was actually a full on Nazi.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "LK102614",
                                    "body": "Edgelord you say…\n\nhttps://preview.redd.it/wzo9pvbelqie1.jpeg?width=817&format=pjpg&auto=webp&s=16b874af8fde98f90510cf0bb6d0e44d74948472",
                                    "score": 33,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vNerdNeck",
                    "body": "\"hand outs from the gov't\"\n\nIs that in reference to gov't payments for launching shit into space,  or for winning grants bringing internet to rural areas. \n\n  \nhelp me understand how he is a conman?   Usually conman don't actually deliver anything,  they don't create markets like EV, private space and sat internet (just to name a few).",
                    "score": -4,
                    "replies": [
                        {
                            "author": "CigaretteTrees",
                            "body": "The worst of the handouts are the EV credits, why is the taxpayer subsidizing a rich person buying a luxury car? \n\nI would also consider the Starlink rural internet grants to be handouts, why is my income being stolen to fund internet in rural areas? People made the choice to live in a rural area and if they don’t like the lack of service or can’t afford service they should chose to live elsewhere, simple as that, they don’t get to steal my money to fund their internet.\n\n“Usually conmen don’t actually deliver anything”\n\nYes, such as Tesla Semi, Hyperlink, Solar roofs, “Full Self Driving”, all of Tesla’s human-like robots that are faked in promotions, etc.\n\nHis companies have delivered genuine projects but he has also constantly and knowingly lied to consumers promising “x new thing is right around the corner” in order to inflate his stock price, he went to court not long ago over the complete lie that was his Solar Roof reveal, where he installed fake solar panel tiles on roofs and lied to the audience that they were fully functional. \n\nPart of that same Solar Roof debacle Musk had used government money from Space X to purchase bonds in Solar City, a residential installation company founded by his cousins, when it was clear Solar City was going to go bankrupt and SpaceX would’ve lost all the money invested he then lied to Tesla shareholders and used Tesla to purchase Solar City (a company on the verge of bankruptcy) for $2.6 billion and absorbed over $3 billion in Solar City debt.\n\nHe lied to consumers that “Full Self Driving” was complete and faked videos showing it functioning, all the while selling the feature to consumers knowing he could not deliver.\n\nI could go on all day but it really comes down to blatant lies for his own personal benefit and breaking his fiduciary duty in order to enrich himself at the expense of his shareholders.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "somethingcreative987",
                            "body": "Why does he need to take my money to do these things?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "vNerdNeck",
                                    "body": "So, he should launch shit into space for free?  what kind of business model is that?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "somethingcreative987",
                                            "body": "Who said he should do anything for free? How do you have taxation is theft under your name but argue “it’s ok if my taxes go to elon musk”?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 44,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 133,
            "replies": [
                {
                    "author": "AustralianPonies",
                    "body": "Ah yes the German government, notorious for rooting out Nazis.",
                    "score": -43,
                    "replies": [
                        {
                            "author": "___miki",
                            "body": "Are you suggesting afd rejects Nazism and distances itself from it?",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -9,
                                    "replies": []
                                },
                                {
                                    "author": "AustralianPonies",
                                    "body": "I’m saying I don’t trust the German government. That’s where the Nazis came from, last time I checked.",
                                    "score": -25,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "10PieceMcNuggetMeal",
            "body": "Both are bad. Fuck Musk",
            "score": 96,
            "replies": []
        },
        {
            "author": "IAmTheWalrus45",
            "body": "Why are you comparing his hand wave to another nazi event? It’s almost like you agree it was a Nazi salute… Are you mad at the unequal reaction or that there was a reaction at all?",
            "score": 29,
            "replies": []
        },
        {
            "author": "clark3000mkp",
            "body": "Yeah both are bad it's not that hard",
            "score": 91,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Elon Musk’s Space X catches reusable rockets from space with chopsticks.\n\nJustin Trudeau had to resign **before** Orange Man even took office.\n\nOne is becoming more libertarian every year.  The other is just another statist politician. \n\nThey are not the same.",
                    "score": -98,
                    "replies": [
                        {
                            "author": "10PieceMcNuggetMeal",
                            "body": "What does that have to do with these 2 incidents? This is the weirdest false equivalency I have ever seen.\n\nOne man does Nazi salute. One parliament praised a Nazi accidentally. \n\n\nYeah, but the one guy is space man!\n\nLike what?",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "ENVYisEVIL",
                                            "body": "Finally…a sign of intelligent life 👆",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "aqua_navy_cerulean",
            "body": "How much money has Elon donated to AFD?",
            "score": 46,
            "replies": []
        },
        {
            "author": "SirLoremIpsum",
            "body": "> Give nazi salute\n\n> go to speak at AfD rally\n\n\"hahha I'm not a Nazi\"\n\n\nDid you see the reaction to Trudeau and Canadian parliament?\n\nWhat's Elon's reaction to being called a Nazi? To apologise and state he does't believe that? or ot go to an AfD rally and double down\n\nAbsolutely cooked.\n\nA duck is quacking and waddling and you're going \"wait what if it's a zebra?\"",
            "score": 16,
            "replies": []
        },
        {
            "author": "revuhlutionn",
            "body": "All Nazis are bad. Also, you are not a libertarian take off the costume.",
            "score": 18,
            "replies": []
        },
        {
            "author": "xhydrox",
            "body": "To be fair, Trudeau apologized for being a complete idiot and the moron who invited the guy resigned.",
            "score": 9,
            "replies": []
        },
        {
            "author": "StickAForkInMee",
            "body": "Elon is a fucking Nazi and a racist. It’s not even up for discussion. He’s not a libertarian. He’s not for efficiency. He is the deep state Trump talked about but falsely projected onto the Democrats.  He is literally the George soros figure the right has bitched about for years ",
            "score": 17,
            "replies": [
                {
                    "author": "Narrow-Ad6201",
                    "body": "lol bro youre not a libertarian youre a yeehaw socialist. \n\nanyone who can just throw the title \"nazi\" around like it doesnt mean a fucking thing is absolutely not a libertarian. real libertarians know what national socialism is and what qualifies as authoritarian fascism. elons an autistic dork with social retardation. hes not a fucking nazi.\n\ndownvote me all you want.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Noah215a",
            "body": "The fuck is a MAGAT doing on a libertarian subreddit lol",
            "score": 16,
            "replies": []
        },
        {
            "author": "Smokyminer87",
            "body": "I don’t know…how about both are bad? 🤷‍♂️",
            "score": 7,
            "replies": [
                {
                    "author": "ScholarDazzling3895",
                    "body": "Neither are Nazis. Musk did what looked very similar to a Nazi salute, but the dude literally was with Ben Shapiro last year at Auswitch . Trudeau's government accidentally invited a Ukrainian WW2 soldier to honor him in Canada, only to find out the soldier was a Nazi sympathizer in WW2, in other words he fought for the Nazis (lmao). These people are looking for someone to call a Nazi.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PajamaTrucker",
            "body": "If you can't tell the difference, then you're part of the problem 🤣",
            "score": 9,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PajamaTrucker",
                            "body": "One is a failure in the vetting to even have a governing body allowing Nazi to speak. All of whom were critical and apologetic afterwards.\n\nThe other is a dog whistle, from someone who wouldn't know what Accountability meant if it Brian Thompson'd him through his skull.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VictoriaSlim",
            "body": "The Speaker who invited the Ukrainian resigned, when can I expect Musk's resignation? Oh wait the false equivalence didn't work out for you once facts were applied did it?",
            "score": 7,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Except The Speaker saluted an actual Nazi and Elon Musk did an autistic hand gesture.\n\nNice try.\n\nElon Musk is a producer. Politicians are leeches that do not produce anything.\n\nhttps://preview.redd.it/6ao5ekua5tie1.jpeg?width=1080&format=pjpg&auto=webp&s=702865733285e2d72a79a52767148d2093446c15\n\nActual Libertarians are happy with Musk uncovering government waste and  stupidity.",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "guhman123",
            "body": "Glad to see the comments here, looks like i finally found a sub that isn't a left or MAGA echo chamber.",
            "score": 8,
            "replies": []
        },
        {
            "author": "perfec7paradox",
            "body": "Elon may not be a \"nazi\" but he's trying really hard to be accepted by them.",
            "score": 5,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "That contradiction might almost make him not a nazi…",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "UuuBetcha",
            "body": "“Elon waves his hand” lol OP is so unserious ",
            "score": 5,
            "replies": [
                {
                    "author": "ScholarDazzling3895",
                    "body": "If you think Elon Musk did a Nazi salute, then you really want to believe it. It was a very awkard situation but Elon Musk has literally zero affiliation or any history of supporting Nazis.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Any_Comedian2468",
                            "body": "Lol he literally just gave a talk at their meeting in Germany and funded a neo-Nazi group. Germans are furious that he’s interfering in their elections.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FranknessProductions",
            "body": "I'd be willing to give him the benefit of the doubt if he wasn't publicly funneling money into AfD, surely you recognize how sus that makes this whole thing look",
            "score": 4,
            "replies": []
        },
        {
            "author": "slbzyou",
            "body": "Elon literraly is a NAZI",
            "score": 8,
            "replies": []
        },
        {
            "author": "sahovaman",
            "body": "Typical Redditor dude... They're extremely liberal, and think whatever the paid actors on their favorite news channel tell them to think.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ninthreer",
            "body": "Its almost like the entire world is falling to fascism",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thenameisjoel",
            "body": "Reddit is so strange with its ratios. How is the OP in a positive ratio, while every reply that agrees with OP or carries the same sentiment is met with karma?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Narrow-Ad6201",
            "body": "elon is a grifter and is most likely not as talented as he lets on. and hes definitely socially inept. but if you look at the responses to this thread about him theyre awefully similar in rhetoric as most liberal positions on reddit.....\n\nno wait im not supposed to notice stuff. please downvote me. echochamber and circlejerking good. levelheaded discourse bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReadABookFFS113",
            "body": "I mean, Musk has purposely shared Nazi propaganda and anti-Semitic conspiracy theories with his followers. He's definitely a Nazi.",
            "score": 1,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "**Leftists saying “______” is a Nazi means absolutely nothing.**\n\n**Trump Derangement Syndrome** outweighs reason. \n\nHating government is not the same as having Jews. \n\nAnyone with **the ability to think critically** would understand that a multi-billionaire that runs and owns multiple public companies has too much to lose with advocating for *RaYcISt* views.\n\nRemember Kanye?  **That** is an actual Nazi.\n\nWhat happened to Kanye’s reputation, endorsements, net worth, and income after he made anti-Semitic comments?  They were all eviscerated.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "globulator",
            "body": "The indiscriminate hate of this man is truly astounding. He could cure cancer and give it out for free and you guys would still hate him. Is it jealousy or what? I don't get the complaints.",
            "score": -1,
            "replies": [
                {
                    "author": "c_sharp_php_guy",
                    "body": "I get that he's a flawed person, made mistakes, and I am not too comfortable with all the influence he is currently having on the current administration, albeit I think there is good there, but I also have to question the level of passionate hate for him.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LazyClerk408",
            "body": "Thank you for this. I never knew about that.  #sicksadworld",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ok_Sea_6214",
            "body": "Random subs are now explicitly saying you can't downplay Nazis, but no one wants to discuss Azov regiment.",
            "score": -5,
            "replies": []
        },
        {
            "author": "anxietyattacks77",
            "body": "Elon appeared at the German neo Nazi rally to endorse their \"master plan\" for mass deportations for not ethnic Germans.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Parabellum12",
            "body": "This sub gets astroturfed hard on certain topics and it’s so easy to see lol. Leftists are pathetic.",
            "score": -30,
            "replies": [
                {
                    "author": "seatega",
                    "body": "This is getting “astroturfed” because it has nothing to do with Libertarianism.  \n\nThe thing Trump, Elon, and Trudeau have in common is that none of them are libertarians, and a lot of us come here to get away from the sports-teamesque fan war BS like this meme",
                    "score": 11,
                    "replies": [
                        {
                            "author": "ENVYisEVIL",
                            "body": "[Actual libertarians see the link](https://www.reddit.com/r/Libertarian/s/rcP2LUIsdx).\n\nIt’s not that complicated. Elon is exposing the deep state and crooked Democrat/Republican politicians.\n\nLeftists are trying to defame him in order to stop Elon from exposing government corruption. \n\nCalling that out is **very libertarian**.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "speeperr",
                    "body": "This sub is still a lot better than others, and the mods here seem good. But yeah, this is still reddit.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WoodySorrelSon",
            "body": "You know you can just make one post with a bunch of photos instead of spamming the sub? ",
            "score": -1,
            "replies": []
        },
        {
            "author": "Seared_Gibets",
            "body": "Lol, and to top it off, they completely disregard the fact that the ADL, absolutely *the* most Nazi hating group, said themselves that Musk ***didn't*** make a Nazi salute.\n\nBut, of course, then when you point that out, they try to smother you with buckets of antisemitic gibber.\n\nBunch of fuckin loons.\n\nYep, called you *actual Nazis* out. Come on cowards. At least have the spine to identify yourself when you downvote this, so we know which you lurkers can be flatly ignored.\n\nAnd F.y.i. for the dipshits that will try spewing \"bUt MuH aNtIfA!¡!” \n\nThe brown-shirts that were all for Shitler *also* claimed to be anti-fascist while conducting all the same shit these black-clad Nazis carry out today.\n\nAntifa are a bunch of Nazis.\n\n:Edit:\n\n😂😂😂  Fuckin cowards.",
            "score": -66,
            "replies": [
                {
                    "author": "FranknessProductions",
                    "body": ">The brown shirts who worked for Hitler claimed to be anti-fascist\n\nI legitimately think this may be the most braindead statement I have ever heard on this website, that is actually an extremely impressive feat to accomplish",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Seared_Gibets",
                            "body": "Wow, couldn't even make the quote right. Figures.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ferg-berg",
            "body": "https://i.redd.it/7f4bp10dfpie1.gif",
            "score": -31,
            "replies": []
        }
    ]
}