{
    "title": "Republicans have proposed an almost $4 trillion debt limit increase",
    "author": "Anen-o-me",
    "subreddit": "Libertarian",
    "rank": 334,
    "score": 1193,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 177,
    "url": "https://i.redd.it/488b14j4urie1.jpeg",
    "id": "1io1ftt",
    "selftext": "",
    "comments": [
        {
            "author": "guesswhatihate",
            "body": "If I accidentally overdraft, I would get hit with fees\n\n\nWhen they purposely overdraft, they call it legislation ",
            "score": 396,
            "replies": [
                {
                    "author": "None",
                    "body": "It's the benefit of being the consumer and the credit card company at the same time.",
                    "score": 87,
                    "replies": [
                        {
                            "author": "M-y-P",
                            "body": "But they aren't right? It isn't like they are going to just print an additional 4 trillion dollars since, from what I understand, that wouldn't be debt.\n\nThey are probably selling bonds and shit like taking grants from other nations, and in that case those nations and individuals are the credit card company.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "onetruecharlesworth",
                                    "body": "You need to look into how open market operations(OMO) works as well as the attempts now to currently lower the supplement leverage ratio for US treasuries internationally.\n\nOpen market operations allow specially designated banks to sell treasuries to the fed (who has no money and spends it into creation) now if we lower the Supplemental leverage ratio banks don’t have to hold as many treasuries to back their loans bonus points if you can combine that with a little legislative magic forcing banks to buy more treasuries and poof money money money rains from the heavens both private bank money and base money. No printing necessary.\n\n\nBasically it’s a shell game, where the fed doesn’t “print money” it buys treasuries with money it doesn’t have and gives it to the banks and banks issue loans against that money in a ratio of 1:9 creating even more money.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "M-y-P",
                                            "body": "So the debt would be to US banks? I will look into it since it's something that I'm not familiar with and sounds as it should be common knowledge.\n\nI always try to understand the whole circle in this type of things, like the grants against stock that billionaires take to postpone taxes. Since things usually aren't as people present them.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "onetruecharlesworth",
                                                    "body": "In part, you’re close. It Nnot just the banks but the fed itself as well. remember the fed is buying some of those treasuries from the banks at a profit to the banks. You lower the reserve ratio to incentivize banks to buy US debt they otherwise wouldn’t and then they just turn right back around and sell it to the fed monetizing some of that debt via OMO However we all know what happens when banks suddenly find themselves holding a bunch of bad debt right? We bail them out. They’ll monetize the entire debt all at once if they need to. Maybe they’ll let a couple of smaller banks fail for show to show they’re “serious” about monetary policy. It’s all a confidence game.\n\nI think it just helps to remember “the fed and treasury has a lot of levers” they will spin up however many word salad programs that aren’t technically QE or money printing but effectually do the same thing that they need to maintain functioning treasury markets.\n\nIt should be common knowledge but the system is intentionally convoluted to keep you trapped inside it. If they were straight up about how half this shit worked I guarantee you a third of Americans would be selling all their dollars for gold or bitcoin.\n\nit gets even more sinister when you realize the same banks that are allowed to sell treasuries to the fed for a profit in OMO are also most likely shareholders in the fed which by law has to give out a 6% dividend yearly to it’s shareholders. We don’t know who actually owns the fed they don’t disclose that but if I was a betting man it’s all the banks like JP Morgan and BOA. So banks buy treasuries from themselves at a profit then pay themselves 6% for doing it.\n\nIn essence, the Fed is converting the government’s debt (in the form of Treasury bonds) into money, which can then be used to finance government spending and private credit creation. This process is also known as “debt monetization” or “monetary financing”.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Puppygorl6969",
                                                    "body": "Are you familiar with the 2008 stock market crash and housing market crash? ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "International_Lie485",
                                    "body": "LOL\n\nNobody has to $40,000,000,000,000 to lend to the US government.\n\nYes, they print it, they change digits on a computer.\n\nIt's propaganda, the are tricking you by calling it debt.\n\nThe Government \"borrows\" money from the Government, it's a fucking scheme.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IsaJuice",
                    "body": "Fuck the Fed",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "JustAnotherReditr",
                    "body": "Use a credit card",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TangoLimaGolf",
            "body": "I swear to Christ, the word “No” doesn’t exist in Congress.",
            "score": 347,
            "replies": [
                {
                    "author": "Ihate_reddit_app",
                    "body": "Would the word \"no\" exist in your vocab if you could just print money from your house?",
                    "score": 96,
                    "replies": [
                        {
                            "author": "RedditThrowaway-1984",
                            "body": "Hey - have you been talking with my wife?",
                            "score": 65,
                            "replies": [
                                {
                                    "author": "nickrac",
                                    "body": "Seriously - how many more decorative gold chickens from home goods does this kitchen need?!",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "DontThinkSoNiceTry",
                                            "body": "Bahahahah!  Take my upvote!",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TangoLimaGolf",
                            "body": "It would if every time I printed it my neighbors money became worthless. Eventually the neighbors would figure it out and string me up in a tree.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Likestoreadcomments",
                    "body": "No does exist, but it’s drowned out and silenced when push comes to shove. It’s there, just hard to hear. \n\nMassie/Paul 2028.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "MichigaCur",
                    "body": "It exists when it's directed to you...",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "UMF_Pyro",
                    "body": "\"No\" does exist. It's just being used for evil instead of good. For example: \"Should we stop stealing the citizen's money and giving it to our buddies? No\"",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "fukinuhhh",
                    "body": "No only exists when they want to do good things",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "AlphaTangoFoxtrt",
                    "body": ">Should we stop infringing upon the rights of peaceful individuals?\n>>No.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "StationSquare",
                    "body": "Says the guy who don't smoke weed.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrazyBigHog",
            "body": "Well considering we fall another 1 trillion in debt about every 100 days, that checks out.",
            "score": 197,
            "replies": []
        },
        {
            "author": "evil_timmy",
            "body": "I thought they were cutting all the waste and corruption so this wouldn't be necessary? Why yes, I was in fact born yesterday, but I don't see how that's relevant to this conversation.",
            "score": 228,
            "replies": [
                {
                    "author": "fasteddieg",
                    "body": "Make no mistake, republicans are looking for cuts simply to \"offset\" a tax cut.   We should be focusing on reducing spend to balance our budget and ultimately to create a surplus like in 1999 to pay down the debt.   We shouldn't look to cut income right away without solid, proven momentum in reducing our spend. If a consumer is trying to reduce their debt, they do not immediately look to cut their income.  It's such a short sighted action.",
                    "score": 72,
                    "replies": [
                        {
                            "author": "nkfallout",
                            "body": "Tax cuts will cause inflation to go up as well. I would keep doing the budget and deficit cuts for at least another year before even considering a tax cut.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "free_is_free76",
                    "body": "With how much they're saving in cuts, they'll only have to increase spending by 313% instead of 654%.",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "tucketnucket",
                    "body": "What's in it for them if they can't replace all that garbage with their own version?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "evil_timmy",
                            "body": "Like that health care plan they're going to present with their whole repeal and replace strategy? That'll be ready in ~~2012~~ ~~2016~~ ~~2020~~ ~~2024~~ any day now.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CouchTurnip",
            "body": "And what are the chances this doesn’t benefit the megawealthy while taking money away from programs that benefit the average American taxpayer?\n\nI hate always being right :(",
            "score": 90,
            "replies": []
        },
        {
            "author": "Dokeyshoes1",
            "body": "What is the point of DOGE again?",
            "score": 89,
            "replies": [
                {
                    "author": "c0horst",
                    "body": "To let Elon Musk kill government organizations he doesn't like. I'm not saying they SHOULDN'T be trimmed, but holy shit this is not the way to do it.",
                    "score": 137,
                    "replies": [
                        {
                            "author": "EngagedInConvexation",
                            "body": "I *wish* it were about getting rid of orgs he doesn't like.  It's about unchecked access to information.  I get about 20 bucks a week scanning my receipts for some company that wants to aggregate my data and train an algorithm or AI.\n\nHow much you think this works out for Leon at the end of the month?",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "OpenSourcePenguin",
                                    "body": "https://www.aol.com/news/musk-slammed-state-department-reveals-053821535.html\n\nMonth? You'll find examples in hours.\n\nImagine wasting taxpayer money on the ugly piece of just which cannot handle a car wash or getting wet in general \n\nSuddenly Republicans are totally fine with electric cars? Not just any electric car, the ones that cost in the luxury range of their type.\n\nMusk's purchase of the presidency is an excellent investment for him. Comes at a convenient time when Tesla sales world wide are crashing.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "StoicFable",
                            "body": "To funnel money into Tesla and space x while he gets richer.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Spe3dGoat",
                            "body": "Its the only way to do it.\n\nThe republicans just proved it. There will never be any consensus for politicians, department heads and massive programs to audit themselves. Why would they ?\n\nThis is as close to a cleanup as you will see in your lifetime.\n\nDon't worry. The (D)s will reinstate it all in 4 years anyway.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FourIV",
                    "body": "To pretend to cut waste by pretending to find shit that everyone already knew and target the .0001% of the budget.\n\nHit the DOD first imo",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "OpenSourcePenguin",
                    "body": "Kill everything else so Tesla and SpaceX can have bigger contracts",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "leavingishard1",
                    "body": "To free up public funding for SpaceX, Tesla, and tax cuts for coporations /s",
                    "score": 1,
                    "replies": [
                        {
                            "author": "leavingishard1",
                            "body": "Down vote all you want but you know he is going to keep getting that tax money",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "To get the support of Libertarians by doing a Melei.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Except he was pretty successful considering how fucked their economy was/still kinda is",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "StoppableHulk",
                            "body": "Melei is at least somewhat beholden to the people because he's actually President. \n\nElon is just a random guy with the verbal consent of the President. Nothing he does is even legal. He'll get his bag and peace out whenever he feels like it no matter what unmitigated fucking disaster he leaves behind.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Regardless. It is what Libertarians want. Abuse from oligarchs and private business (because that is better than a functioning democracy or someshit)",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ccbadd",
                    "body": "Yeah, those dumb bastards could fix the problem is three weeks.  Worthless......",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "fasteddieg",
            "body": "And this is one of the primary reasons I despise the republican party.  Fiscally conservative my ass, only when they are not in power do they care about the budget, debit limit, deficit, debt, etc.",
            "score": 71,
            "replies": []
        },
        {
            "author": "Cannoli72",
            "body": "But don’t worry! They are going to fix inflation!!!",
            "score": 86,
            "replies": [
                {
                    "author": "viper999999999",
                    "body": "Yeah the fix is in all right",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "TravisKOP",
            "body": "Not shocked. Both parties have a vested interest in increased federal authority and spending power",
            "score": 55,
            "replies": []
        },
        {
            "author": "StoppableHulk",
            "body": "The Republican party is literally nothing more than a very thin veil for massive corporate interests. \n\nThe only thing congress did during Trump's entire first tenure, was pass a $4 trillion tax break for corporations. That's their entire function and they did that function. \n\nNow they'll do that function again.\n\nThey won't protect anyone's rights, they won't actually limit the federal government's scope or powers, they won't even protect your guns. \n\nThey give tax breaks to corporations and billionaires. And occasionally start wars. That's all.",
            "score": 55,
            "replies": [
                {
                    "author": "NuderWorldOrder",
                    "body": "Where as the Democratic party is a slightly thicker veil.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "StoppableHulk",
                            "body": "They've certainly been working overtime to prove it lately too. Their one chance when history offers them the easiest layup in the world prove they are as moral and high-minded as they've always marketed themselves as and they're leaping away as though the opportunity were a grenade.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Practical_End4935",
            "body": "The Republicans hate winning two elections in a row!",
            "score": 89,
            "replies": [
                {
                    "author": "Cannoli72",
                    "body": "Isn’t that the truth!",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "returnofthewait",
                    "body": "They won't lose bc of this. Elons got everybody convinced it's all fixed now that he's there.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Practical_End4935",
                            "body": "I think you underestimate how much they don’t want to be victorious!",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "corkybelle1890",
                    "body": "Apparently the Dems do too. Both are becoming equally atrocious that we keep voting them out. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jonatkinsps",
            "body": "That's only four thousand billion dollars, whatever. Elon just saved like fifty million",
            "score": 54,
            "replies": []
        },
        {
            "author": "cdogrob",
            "body": "Explain this to me like I’m 5 - \n\nThe debt ceiling has to be increased until a surplus is created, right? Is there a reasonable short term plan without increasing it? \n\nWhat is/was the point of Doge? How long did it take Argentina to make their budget changes?",
            "score": 6,
            "replies": [
                {
                    "author": "Aggro_Gurl",
                    "body": "The point of DOGE was to trick people into allowing a bunch of billionaires to  suck up any money that isnt already owned by them. Elon's comments on everyone on medicare or SS being \"parasites,\" are telling. He already sees it as HIS treasury.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "dak4f2",
                            "body": "Exactly. Plus his companies get $8M per day from the government. HE is the parasite. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Truth_7",
                            "body": "This is baseless, straight ridiculous commentary. Spewing bullshit like this shows you know and understand absolutely nothing.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "swettm",
                                    "body": "Can't blame 'em when the media is shoving this narrative down your throat 24/7",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Truth_7",
                                            "body": "The real information is available, if they are open to reading it. Doesn't seem to be the case tho, they'd rather stay in the Reddit feedback loop that offers blind allegiance to anything democratic themed post or comment.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Aggro_Gurl",
                                                    "body": "Give me the real information then. No, i wont take elons word for it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "where are they gonna get the funds for this lol... they comin for social sec and medicaid. they comin for it.",
            "score": 25,
            "replies": [
                {
                    "author": "Illustrious-Fox4063",
                    "body": "The .fed has been spending Social Security and Medicare since sometime in the late 50's  or early 60's with buying Special Obligation Bonds from the Treasury with the SS and FICA Tax proceeds.  The General Find gets the money to spend on whatever waste they want and the SS Amin gets a IOU Bond.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Apprehensive-Tear420",
                            "body": "You haven't written a single fact",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Illustrious-Fox4063",
                                    "body": "So Social Security Receipts are not transferred to the General Fund via Special Obligation Bonds?\n\nhttps://www.ssa.gov/history/BudgetTreatment.html#:\\~:text=Since%201960%2C%20the%20policy%20has,the%20form%20of%20Treasury%20securities.\n\nhttps://www.ssa.gov/oact/NOTES/note142.html#:\\~:text=The%20assets%20of%20the%20trust%20funds%20must%20be%20invested%20in,prevailing%20market%20price%20is%20paid.\n\nhttps://www.investopedia.com/ask/answers/110614/how-social-security-trust-fund-invested.asp#:\\~:text=The%20Social%20Security%20trust%20funds%20are%20limited%20by%20law%20to,to%20the%20Social%20Security%20Act.\n\nI think my facts might be a bit more factual than yours.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "LordSplooshe",
                                    "body": "Both social security and Medicare are already major US debt holders. Also the the Federal Employee Retirement Trust 😂.\n\nIf you think your 401k is better off, you’re mistaken. They are institutional scapegoats. They will load your 401ks up with garbage before any major crash.\n\nhttps://www.pgpf.org/article/the-federal-government-has-borrowed-trillions-but-who-owns-all-that-debt/",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thecodebenders",
            "body": "People who think DOGE is \"saving the government money\" are in for a rude awakening.  The only thing that office is doing is setting up the largest slush fund that's ever existed.  Probably to be repurposed as a sovereign wealth fund, cover the cost of deportations, buy some land we have no business owning or whatever Trump's new shiny object is.  The money is allocated and \"fully funded\". With the consolidation of agencies, the ability for \"saved\" money to become fungible grows significantly. The chance that this spending doesn't somehow get used feels like the wrong side of the bet.  Rubber will only meet the road if Congress manages to pass a budget that reduces funding/spending, and if you think you're going to get Congress to agree to cut all the pork they've built over the years, you are far more an optimist than I am.",
            "score": 32,
            "replies": [
                {
                    "author": "Truth_7",
                    "body": "Umm, what? \n\nWe don't have this money. We are in debt. They are limiting the expansion of the debt. That does not, to be abundantly clear, create a slush fund.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "thecodebenders",
                            "body": "We do \"have the money\" because Congress allocated it. I know it's all borrowed debt but that doesn't change that the government it's treats it as \"funded.\" I'm not making some argument about the morals or even really facts of things. As far the Treasury is concerned they're obligated to cut the check if it's asked for. The way we decrease spending is by getting Congress to reduce its spending bill. That's their power, and their responsibility. The rest of this is showmanship. ",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "peren005",
                            "body": "well, from the looks of it sounds like DOGE should focus on preventing Congress from trying to expand the debt, no? Congress wants to add 4T to it and DOGE, at best from their \\*own\\* guidance, states they'll cut 2T. \n\nAlready a losing battle.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Truth_7",
                                    "body": "Yes, but it isn't quite that simple. We still have to make payments on existing debt or the financial system will absolutely collapse to a degree never before experienced and that's big part of why the $4T debt was added. Look at what we're paying in interest.  I think the common misconception is that it was $4T in new spending.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "peren005",
                                            "body": "The simple thing is put their foots where their mouths are and pass a balanced budget. They don’t have an excuse this time around since they control all three levels of government. \n\nYou want tax cuts, hell yeah but that better be 1:1 with spending cuts. If the debt crisis is as large as they hounded on best way to pay off debt is in the present. They’re just too scared to go after the big spending items of defense and SSN/Medicare/Medicaid, and all the cuts they’re doing to other programs are just show boating, literally jumping over dollars to save pennies.\n\nThe argument to expand debt for debt payments is a thermal runaway condition, eventually it’s going to break.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "B2389764",
            "body": "There is no way to balance the budget. Discretionary spending is only 27% of the total expenditure. Interest on the debt alone is nearly one trillion per year. At this point all we can hope to due is lessen the annual deficit.",
            "score": 11,
            "replies": []
        },
        {
            "author": "igortsen",
            "body": "Conservatives will say it's necessary because the Libs put us so deep in the hole, but that's just an easy out to keep digging.",
            "score": 8,
            "replies": []
        },
        {
            "author": "DazzlingMood3547",
            "body": "I thought they were all about cutting the debt!🤣🤣🤣",
            "score": 4,
            "replies": []
        },
        {
            "author": "coinwavey",
            "body": "So can all the trumpers finally leave this sub?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Brocks_UCL",
            "body": "Frick on a stick",
            "score": 8,
            "replies": []
        },
        {
            "author": "FourIV",
            "body": "Woods' Law #3: No matter whom you vote for, you always wind up getting John McCain.",
            "score": 6,
            "replies": []
        },
        {
            "author": "daviddavidson29",
            "body": "Does anyone understand how budgeting and spending works?",
            "score": 3,
            "replies": []
        },
        {
            "author": "psychicesp",
            "body": "Welp, it was a good fantasy while it lasted.",
            "score": 3,
            "replies": []
        },
        {
            "author": "hippienhood",
            "body": "This is what I was concerned of. It’s not JUST our individual accounts that were compromised which is bad enough. It’s the ones of all the counties, cities, and states of America.",
            "score": 3,
            "replies": []
        },
        {
            "author": "The-Dinkus-Aminkus",
            "body": "In the same month Republicans \"proposed\" eliminating the IRS? Whoopdy doo",
            "score": 3,
            "replies": []
        },
        {
            "author": "contains_almonds",
            "body": "Stupid Republicans",
            "score": 4,
            "replies": []
        },
        {
            "author": "General-Zer0",
            "body": "What was the limit before?",
            "score": 2,
            "replies": []
        },
        {
            "author": "ilya_neuesdorf",
            "body": "Isn't it the only security left for dollar to remain internationally accepted trade currency?\nAs soon as it goes away, dollar is going away, no?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Diligent_Divide_3364",
            "body": "Seriously, is this surprising to anyone",
            "score": 2,
            "replies": []
        },
        {
            "author": "garnorm",
            "body": "Ahh yes… right on cue, in the midst of all the other distractions and BS nonsense that is currently on a nonstop rollout",
            "score": 3,
            "replies": []
        },
        {
            "author": "Shrek2onVHS69420",
            "body": "A republican tripling national debt? Where have I seen this before?",
            "score": 3,
            "replies": []
        },
        {
            "author": "KobeGoBoom",
            "body": "I would upvote if not for the fact that Brian Tyler Cohen is an insufferable liar who would implement full blown socialism if he had the chance",
            "score": 11,
            "replies": [
                {
                    "author": "JamesMattDillon",
                    "body": "Right.  He could tell me what color shirt I have on and it's still think he's lying.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Powwow7538",
            "body": "But stopped 50 million in condoms to hiv patients. Winning 🥇",
            "score": 8,
            "replies": [
                {
                    "author": "jussyjus",
                    "body": "Not sure if you heard but he lied about that. It’s where his recent “some of the things I say will be incorrect” quote references.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Powwow7538",
                            "body": "I didn't say hamas or Gaza. Hiv patients is the real story.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jussyjus",
                                    "body": "Either way the dude sucks and we’re all going to receive way less for the money we will continue to pay.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LostActionFigure",
                    "body": "Can’t wait for more drug resistant strains from all that winning!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "jankdangus",
            "body": "Why? I voted to slow down the national debt crisis, not to exacerbate it. The national debt isn’t an issue as long as we cut waste, fraud, and abuse and at the same time grow our economy.",
            "score": 8,
            "replies": [
                {
                    "author": "charlsey2309",
                    "body": "You thought the guy with multiple bankruptcies was going to fix the US budget deficit? If so I have a Nigerian Prince I should introduce you to, dumbass.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "M4J4M1",
                            "body": "Not to mention, he at least acts like trade deficit == fiscal deficit.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "jankdangus",
                            "body": "Yo chill out! Plus it was more so I’m putting my faith in Elon.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "charlsey2309",
                                    "body": "Mmm I see doubling down on being stupid",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "😭",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Aggro_Gurl",
                                    "body": "sycophant",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thunder_blue",
                    "body": "you voted for the wrong person",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Illustrious-Fox4063",
                            "body": "The Executive is not the Legislative.  The Legislative holds the purse strings.  The President could refuse to sign it and send it back for an actual budget with his requests for funding for each department.  Congress could then overrule or adopt.  \n\nIf I was President with all that is going on right now I would refuse to sign, send my budget to Congress (the same as the last year budget, say that is what is needed and refuse anything that came back over that number.  If Congress lets the .gov shut down then that is on them.  Then the next year do it all over again and not sign any CR's.  Only real budgets get passed.  Force Congress to do their job. It isn't like the Opposition and press can call you anything worse than the Fascist Nazi they have been using for the last several years.  Oh wait maybe they will use Double Secret Nazi this time!",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "peren005",
                                    "body": "The chances of Trump not signing it are nill. I mean after all he did want Congress to expand it largely so he wouldn't have deal with budget talks every year.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Illustrious-Fox4063",
                                            "body": "That I agree with but he could veto or pocket veto it.  Also there is what I would do if I was President, as likely as pigs flying out of my butt.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "jankdangus",
                            "body": "To be fair, I didn’t see Kamala harping about cutting waste, fraud, and abuse. Maybe Biden was doing it behind the scene, but didn’t see it from him either.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "c0horst",
                                    "body": "Neither one was going to cut the budget. One was going to funnel money to DEI and foreign aid, the other was going to funnel money directly into Elon Musk's gaping asshole. Pick your poison.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Lmao you are not wrong. But I actually support more funding for SpaceX rather than building more bombs and jet fighters though especially since they are doing a good job.",
                                            "score": -7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BucNassty",
                            "body": "lol as opposed to kamala.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "thunder_blue",
                                    "body": "wrong. you can vote for whoever you want",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "D3adOs",
            "body": "Can I have a source for that pls. Tried to find it myself. Couldn’t.",
            "score": 4,
            "replies": [
                {
                    "author": "embarrassed_error365",
                    "body": "How are you not able to find it?\n\nhttps://preview.redd.it/wxh8wjn97sie1.jpeg?width=1124&format=pjpg&auto=webp&s=0352d6445748d72435f4e160c16d413c75fd3fd8\n\n[https://finance.yahoo.com/news/house-gop-takes-first-step-151725015.html](https://finance.yahoo.com/news/house-gop-takes-first-step-151725015.html)",
                    "score": 8,
                    "replies": [
                        {
                            "author": "D3adOs",
                            "body": "So extending debt ceiling and 4.5 trillion in tax cuts?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "LordSplooshe",
                                    "body": "Not for you, you get tariffs to increase the prices of your everyday expenses.\n\nIf you can’t see the tax, is it really a tax?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EverlongMarigold",
                    "body": "Get out of her with your common sense. A source is only required when you're trying to disprove a Liberal,   it's not required when accusing Conservatives!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "riplan1911",
            "body": "Both sides are going to spend the US into oblivion (it's already there) and when we go completely bankrupt and the dollar is worthless D and R will point fingers and say it's your fault.  While everyone stands around with there thumbs up their asses wondering how did this happen.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FBI-INTERROGATION",
            "body": "What does the party effect this? lmao\n\nThis is a yearly thing at this point and will be voted for by both parties",
            "score": 2,
            "replies": [
                {
                    "author": "EngagedInConvexation",
                    "body": "True, verily.\n\nHowever one party is *firmly* in power currently (NOT libertarian, in case anyone needs a reminder) and it happens to be the same one that used the marketing strategy of \"shrinking\" things and returning to greatness.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "upvote-button",
            "body": "Incompetent people run our world. Time to clean house. That means every single person with influence or power. Both sides of the aisle, all industry leaders, all branches of government. Everybody. They had the power to shape the world and this is the result. They failed. Time to be replaced",
            "score": 2,
            "replies": []
        },
        {
            "author": "Butane9000",
            "body": "So like just a few months of an increase?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting_stuff2",
            "body": "All of the Republicans?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Diligent_Agent_9620",
            "body": "This was explained why the other day. Because if we don't we default on the existing loans and we don't have time to clean up the mess that's been made.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HaikuHaiku",
            "body": "What are they supposed to do? Go bankrupt? They are already trying to cut as much waste as they can, with Doge and other initiatives, but it takes time. In the meantime, the only option is to keep increasing the debt. There is NO realistic alternative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beginning-Shoe-9133",
            "body": "Ugh...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jarte3",
            "body": "I hate Bryan Tyler Cohen so much lol he’s a giant tool",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClapDemCheeks1",
            "body": "Is this dure to the tax cuts they wanna make? Hear there was a bill pretty much eliminating the income tax. Which, if you weren't cutting spending along with it would technically increase the debt. \n\nSimple:\n\n4 Trillion in tax with 6 Trillion in spend\n\nReduced down to 0 in tax with still 6 Trillion in debt that's a 4 Trillion increase in debt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SunnySpot69",
            "body": "I'm confused. I thought they were cutting everything to save money?",
            "score": 1,
            "replies": [
                {
                    "author": "Anen-o-me",
                    "body": "Ya got scammed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Workspinriderepeat",
            "body": "DOGE and the \"cost cutting\" is all smoke and mirrors",
            "score": 1,
            "replies": []
        },
        {
            "author": "disenchantedsiren",
            "body": "Makes sense with all the money DOGE is saving us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ccbadd",
            "body": "They kind of have to in order to provide for the spending that is already approved.  As long as we allow the HOR to use CR to hold spending high there is really no choice.  This is the kind  of thing that happens when you let the last guy legally ignore the spending limit only to have it reinstated right after the new guy is elected and you are already at the limit.  What else could be done right now?  After we cut a LOT of spending, we can lower it back if we ever balance the budget.  Dems are on the TV yelling \"F Trump\" because DOGE is actually exposing all there money laundering efforts and cutting that spending.",
            "score": 0,
            "replies": [
                {
                    "author": "LostActionFigure",
                    "body": "Cut the crap, Doge is a bullshit operation to cherry pick “fraud”. There has been no transparency on what exactly has been cut while it’s clear that spending for Elon’s companies has gone up. $400 million in the state dept budget for armored cyber trucks? Come onnnnn.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Grumblepugs2000",
            "body": "It's funny how the left suddenly cares about the debt... They are the main reason we are in this mess to begin with ",
            "score": 1,
            "replies": [
                {
                    "author": "LordSplooshe",
                    "body": "Are you going to pretend Republicans have never been presidents before? \n\nThe debt has increased under Republicans at higher rates than Dems.\n\nWasn’t the last president to have a surplus Clinton?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "john35093509",
                            "body": "With a Republican Congress, yes.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "LordSplooshe",
                                    "body": "Trump had full control of Congress and the senate in his first term.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "john35093509",
                                            "body": "What does that have to do with my statement?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LordSplooshe",
                                                    "body": "When Republicans have absolute control of the government the only thing they can manage to do is pass a tax cut that adds $7 trillion to the deficit.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EnGexer",
            "body": "Of course they have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zimzum133",
            "body": "I would not trust this paid DNC shill as far as I can throw him",
            "score": -1,
            "replies": []
        },
        {
            "author": "ginga__",
            "body": "Don't increase debt limit.\nDeclare fiscal emergency.\nLet DOGE run wild.",
            "score": 0,
            "replies": []
        },
        {
            "author": "raremud_",
            "body": "1 step forward, 2 steps back, down a flight of stairs. either way, kamala or this dude, same shit woulda happened. minus the step forward",
            "score": 0,
            "replies": []
        },
        {
            "author": "Truth_7",
            "body": "To all the idiot liberals making their idiot comments.\n\nThis was necessary to not default on payments for debt already incurred.",
            "score": -12,
            "replies": [
                {
                    "author": "villainoust",
                    "body": "I think that's why people rolled their eyes during the Biden administration when there was posturing related to an increase to the debt ceiling and whether they would increase or not.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Truth_7",
                            "body": "Sure. But there is only one party looking to fix the budget, and one party wanting to expand it massively and indefinitely through entitlement programs. Let's not conflate the two.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "hezaplaya",
                                    "body": "I mean, every time a democratic president has come into office for the last 40 years, the previous administration has left us with a recession. Hell even George Bush Sr had to go back on his promise of no new taxes because of the state Regan left us in. \n\nSavings and loan under Bush Sr. Great financial crisis under Bush, Covid under Trump. Meanwhile the economies inherited by George W and Trump have been good to great.\n\nPeople have incredibly short memories and a distinct lack of patience to do things any other way than spending our way out of a recession. We often forget that the first stimulus for 2008 and the first stimulus for COVID were passed by the right, in addition to tax breaks for rich people with no plan to pay for any of it. \n\nVoters need to really step up their game.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "villainoust",
                                    "body": "I don't really trust either party at the moment to make the best decisions to reduce the debt. We'll see how things develop.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Aggro_Gurl",
                                    "body": "Lol youre saying the republican party cares about the budget, under an article where they prove they clearly do not. \n\n\nThey love you as a voter.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Truth_7",
                                            "body": "Clearly you don't understand the context of the article, or never got past the headline. Not that I'm surprised, this is Reddit after all, the most ignorant and biased of all social media.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Aggro_Gurl",
                                                    "body": "Whats frustrating is you folks accuse of bias and ignorance, but if democrats raised the debt limit by 4 tril, youd be tearing your hair out. Yall cheering for tyranny cuz an elephant is doing it.  you know this is your money they taxed right? Not very libertarian. \n\n\nIts always on reddit where you make these comments too, like you dont have an account here.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Blaze4G",
                                    "body": "Fix the budget how? By doing tax cuts?",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AsianVoodoo",
            "body": "It’s currently at 36.1 trillion from the last approval. This would represent a massive cut.",
            "score": 0,
            "replies": [
                {
                    "author": "Anen-o-me",
                    "body": "No this adds another $4 trillion to the $36.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "AsianVoodoo",
                            "body": "It’s still a decrease in growth rate compared to the 36.1 previously. Here’s hoping the debt ceiling is decreased next time around instead.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "machinehead3413",
                                    "body": "I promise, if elected, I will still steal from you but I will do it slower than my opponent.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Anen-o-me",
                                    "body": "A decrease in growth is the lie they've sold for generations now. $34 trillion is only the explicit debt. Unfunded liabilities exceeds $100 - $200+ trillion! (Social Security, Medicare, and pensions)",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rude_Hamster123",
            "body": "Seems balanced to me, idk",
            "score": -4,
            "replies": [
                {
                    "author": "dallywolf",
                    "body": "It will be after they pass a $4 trillion dollar tax cut for the rich mid-year.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "GGM8EZ",
            "body": "You kinda need it when turning the country around. we spend so much money so fast even with all the fed cuts we need a certain ammout to function while it's turned around and stopped. Things have to get worse before it gets better",
            "score": -8,
            "replies": []
        }
    ]
}