{
    "title": "$80 Million to house illegal immigrants in hotels paid for by homeless U.S. citizens living on the streets of those hotels.",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 333,
    "score": 229,
    "upvote_ratio": 0.72,
    "num_comments (reported by reddit)": 82,
    "url": "https://i.redd.it/142zg97syuie1.jpeg",
    "id": "1iodtc7",
    "selftext": "",
    "comments": [
        {
            "author": "dubie2003",
            "body": "Is this a libertarian supported position?  Just because someone doesn’t like an approved spend, does that give that individual the unilateral authority to just snatch that funding back without any steps inbetween?",
            "score": 155,
            "replies": [
                {
                    "author": "Thencewasit",
                    "body": "I mean yes and no.\n\nA private citizen.  That’s bad.\n\nWhen you accept funding from government, usually they have an agreement that provides money can be unilaterally taken back.  If you don’t like those rules don’t play the game.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "dubie2003",
                            "body": "Those clauses are based on using the funding for its intended purposes so if that funding was to be used for student lunch vouchers yet was used to ‘build the wall’ that would make sense but given the limited info in the post, it seems like the money was being used as intended but Elon/Trump/etc we’re not happy with that and pulled it back",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Thencewasit",
                                    "body": "Well then I hope they sue to get the money back.  Should be easy if your claims are correct ",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Ihatemylife153",
                                            "body": "Shouldn't the presidents claims and actions be correct before making and taking them? That seems way easier than suing the United States government over a pretty clear contract dispute don't you think?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Thencewasit",
                                                    "body": "The government is an actor just like any other entity.  If you don’t want unilateral decisions available then it needs to be in the contract.  If you don’t like the rules, then don’t play the game.\n\nBorrowers make agreements with lenders all the time that give them access to their bank accounts and other collateral.  Are you suggesting these agencies are not sophisticated enough to understand the risks inherent in their dealings?\n\nIf there were no money to take, then the US would be the one needing to sue to get its money back.  This situation just puts the shoe on the other foot.",
                                                    "score": -8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TangoLimaGolf",
                    "body": "It’s YOUR money. Always remember that every penny the U.S. Government spends comes from you, your family, and everyone you associate with. When it’s printed it devalues the dollars in your pocket which is essentially taxation. When it’s taxed it’s robbery. Either way it’s your money.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "dubie2003",
                            "body": "But how does that address my question?\n\nCongress approved the budget (passed a law), budget is spent, new guy in the block comes in and doesn’t like certain spends and unilaterally stops it and goes a step further and pulls it back.  Zero working with Congress, just goes rogue and essentially (or literally?) breaks the law in the process resulting in further upheaval involving the courts and etc… which just burns more of our tax dollars.\n\nIs that a libertarian value?",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "WaltKerman",
                                    "body": "Spending fema money on hotels for migrants was not specifically approved by Congress. The money was allocated for housing of some sort. Not having FEMA pay for hotels at 2X rate for non citizens is a level of waste that I don't think the super majority of libertarians would support...",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "dubie2003",
                                            "body": "You’re answering a different question.\n\nI understand that you are not happy with the spend but since it is allowed, your frustration should be with Congress for allowing so much flexibility in where it is spent and then the local leaders choosing to spend it on housing migrants.\n\nCurious, where did you get the 2x figure.  I didn’t see it in the original post but I may have missed it.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Mekkah",
                                    "body": "Was this funded by Congress or just the Biden admin shifting funds from FEMA knowing that Congress will be forced to fund FEMA?\n\nI don't know offhand I just assume that's what they were doing.  \n\nI ask this because I lived in a city where they'd take all the profit from the aquarium to slush funds, then ask the citizens to approve empathy loans to fund the aquarium.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "dubie2003",
                                            "body": "Honestly, I am not sure.  I have never truly been exposed to that level of detail.\n\nIn the end, it would seem that whatever the agreement is in place, there would still be some kind of check n balance to ensure one person doesn’t have unilateral power to make large swings in funding on a whim.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "mtf250",
                                                    "body": "I think Trump can get it back and force Congress to reapprove the spending. If they care to.",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "dubie2003",
                                                            "body": "So, easier to ask for forgiveness than permission?  Is that the defense you are suggesting?",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "WaltKerman",
                                                                    "body": "I mean that's what fema did spending millions on hotel rooms at a premium rate of 2X.\n\nHow on earth can this be defended as a libertarian position, especially when it's permanent housing for non-citizens with full room service. ",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "dubie2003",
                                                                            "body": "Are you saying fema used funds not in alignment to the allowed purpose or are you just not happy that they had the freedom to do what they wanted?\n\nI know you are not happy but you are bringing a lot to the table without sources so it’s difficult for others to verify/absorb and then address.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "zdk",
                                            "body": "It was funded by congress\n\n[https://www.fema.gov/grants/shelter-services-program](https://www.fema.gov/grants/shelter-services-program)\n\n[https://www.dhs.gov/archive/news/2024/08/28/department-homeland-security-announces-380-million-additional-funding-communities](https://www.dhs.gov/archive/news/2024/08/28/department-homeland-security-announces-380-million-additional-funding-communities)",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Mekkah",
                                                    "body": "Yeah this is what I was looking for.  \n\nSo it was funded by Congress but it's not allocated by Congress as a key point.  So the Administraton can probably pull but can't spend outside the scope of SSP boundaries legally I assume, but also not a lawyer.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TangoLimaGolf",
                                    "body": "Yes. Taxation is theft so the money was acquired illegally regardless.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "The-Dinkus-Aminkus",
                                    "body": "Highly doubt any laws were broken, and yes, liberty or DEATH my guy.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "waltur_d",
                            "body": "You’re high if you think we’re getting any of this money back.  It’s going into the pockets of the 1%",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "truththathurts88",
                                    "body": "Oh gosh, get real. The 1% don’t want your crumbs",
                                    "score": -24,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "meezethadabber",
                    "body": "When my tax dollars are paying for it? Yes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dubie2003",
                            "body": "So you like a dictator/king/single-sole-person without any oversight to be in charge of federal funding?\n\nSeems like an odd position to have and not in alignment with libertarian views but everyone is entitled to their opinion.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "truththathurts88",
                    "body": "Yes",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "mp0295",
            "body": "I don't see how it's a libertarian positions to force local governments to pay to clean up a mess caused by Federal government policy",
            "score": 27,
            "replies": []
        },
        {
            "author": "Blue-Eyes-WhiteGuy",
            "body": "This homie claims to be an Anarcho Capitalist yet celebrating government over reaching confuses the fuck outta me.",
            "score": 23,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Anarcho-Capitalism is my north star. That is the end goal. \n\nIf I’m forced to live among statists, libertarianism is the best short-term solution.\n\nGovernment undoing government’s **moronic $80 million** and wasteful spending is not antithetical to AnCap if the $80 million is returned to taxpayers.\n\nFocus on the moronic $80 million of **wasteful spending** than on obsessing over my pronouns.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "Blue-Eyes-WhiteGuy",
                            "body": "That’s the thing though it’s likely NOT to be returned to the tax payers, it’s going to go fund some war on foreign soil or line  the pockets of republican politicians. Same rabbit different hat.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "True.  As an AnCap, I agree 100%.\n\nAs a libertarian, I’m celebrating the small wins without being naive enough to think that D.O.G.E. or Trump will make a meaningful difference to the national debt, unfortunately.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vvfella",
            "body": "I could never cheer for the federal government being able to pull money from bank accounts that aren’t theirs.",
            "score": 86,
            "replies": [
                {
                    "author": "truththathurts88",
                    "body": "Then you aren’t thinking clearly. It is OUR money,  not the government’s.  And we elected the government to do exactly this…didn’t you pay attention to the elections?",
                    "score": -39,
                    "replies": [
                        {
                            "author": "vvfella",
                            "body": "If it is our money, how does the federal government grabbing money that was already approved by elected officials (since that matters to you) even give it back to us? It’s just going to be used to fund their other trash projects, all while setting a precedent that the feds should be able to interfere with bank accounts outside of their own.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "truththathurts88",
                                    "body": "You are making an assumption, and you know that they say about that…",
                                    "score": -32,
                                    "replies": [
                                        {
                                            "author": "vvfella",
                                            "body": "Yes, I’m assuming it’s not coming back to us because it never has and they’re not even pretending it will be. \n\nBut, Unless you have information the rest of us don’t, you’re also making assumptions that taxpayers will see any of these funds returned to them. So guess we’re all asses here 🤷‍♀️",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "truththathurts88",
                                                    "body": "How about give it more 3 weeks to judge",
                                                    "score": -6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "seatega",
                            "body": "That would maybe make sense if they were giving it back to us, but they’re not, they’re just going to use it for some other government program",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "truththathurts88",
                                    "body": "You are making an assumption, most likely it’s trimming spend to support tax cuts.  So it would come back to us.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "seatega",
                                            "body": ">most likely it’s trimming spend to support tax cuts\n\nIsn’t that also an assumption?",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "truththathurts88",
                                                    "body": "No, see news reports on House tax plan.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DrZoid1984",
                                            "body": "Complains about assumptions then makes assumptions. Ha.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "truththathurts88",
                                                    "body": "Umm, there is reporting on $4 trillion tax cut plan. Not assuming, I’m just well-informed",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "guhman123",
                                                            "body": "It’s a 2 trillion tax cut plan. The 4 trillion number is how much they want to raise the debt ceiling because they have no interest in spending less",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mycatsellsblow",
                            "body": "If it's \"our money\", why don't I see a deposit in my bank account that the government has on file?\n\nI keep hearing DOGE is finding all of this fraud and waste, yet I haven't seen a single plan to return it to tax payers.  Kinda seems like this is all a performative feel good act to score political points, while the government will then just reallocate it to wherever the new administration wants it to go.  Doesn't really seem like \"our money\" at all.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "walksonfourfeet",
                            "body": "Who’s ‘we’?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "truththathurts88",
                                    "body": "Taxpayers",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BIGSTANKDICKDADDY",
            "body": "The real tragedy is wasting $60m to house migrants because they're required to go through government checkpoints and multiple layers of unnecessary bureaucracy.\n\nLet these people work.",
            "score": 23,
            "replies": []
        },
        {
            "author": "walksonfourfeet",
            "body": "https://www.theguardian.com/technology/2025/feb/13/us-department-of-state-plans-to-spend-400m-on-tesla-armoured-vehicles-elon-musk",
            "score": 10,
            "replies": []
        },
        {
            "author": "AffinityForLepers",
            "body": "This actually seems bad.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Wheredoesthisonego",
            "body": "Not illegal immigrants. Non documented migrants. There's a difference.The hotels have been turned into migrant housing. And it's 59 million AFAIK. Not sure where your 80 million comes from. This was supported by 18 Republicans when it got passed.",
            "score": 22,
            "replies": [
                {
                    "author": "truththathurts88",
                    "body": "Same thing lol",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Wheredoesthisonego",
                            "body": "No it's not. Illegal immigrants are here wrongfully. Non documented migrants are here waiting foe status and using appropriate government channels for doing so. They are following the rules and the government passed this bill for these people. It is not fraudulent funds. It was voted on and approved by elected officials. Nothing illegal about it. \nWhether or not it's a good case use for the money is a different conversation.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "truththathurts88",
                                    "body": "They are gaming the system that Biden broke.  We all know that.",
                                    "score": -14,
                                    "replies": [
                                        {
                                            "author": "BIGSTANKDICKDADDY",
                                            "body": "I think you might have stumbled into the wrong sub man. Libertarians are generally pro-immigration.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Thulcandra-native",
                                                    "body": "Look at his username, 88 is a nazi dog whistle",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "BIGSTANKDICKDADDY",
                                                            "body": "I hadn't even noticed their name, but that sure explains it.",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "LogicalConstant",
                                                            "body": "Is it really? Hadn't heard that before, what does it mean? Also, I have some friends born in the wrong year...",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Thulcandra-native",
                                                                    "body": "Ya, 1488 is another one. Basically H is the 8th letter of the alphabet, HH, heil hitler is what it means. These losers love their stupid little symbols. They have sooo many things like that\n\nHere’s a wiki link for the 14 or 1488 bit\nhttps://en.m.wikipedia.org/wiki/Fourteen_Words\n\nHere’s another wiki link for the 88 as a standalone. It’s the page for the literal number, but if you scroll down it has a section about neo naziism \nhttps://en.m.wikipedia.org/wiki/88_%28number%29\n\nThey think they’re clever by using coded language, but once you see it you see it.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SCB024",
                                                    "body": "No. Not in a welfare state. This is borderline socialism. \n\nIf they aren't demanding welfare and are integrating and following the laws that is arguable. \n\nIllegals getting tons of benefits tax payers never get is asinine and destructive.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "BIGSTANKDICKDADDY",
                                                            "body": "Agreed, but in this case it is the government who is forcing them to jump through hoops in order to begin working and integrating. If they haven’t committed a crime in their home state then why are we wasting $60m to house them as they slowly work through a convoluted bureaucratic system? Get off their back and let them work.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "SCB024",
                                                                    "body": "Jump through hoops? What hoops? They come in illegally and get tons of benefits. \n\nWhat are you talking about??\n\nIf you want to argue for making legal immigration more feasible, make that point. Don't pretend like they have made it hard for any illegals in the past 4 years. \n\nI think it should be very hard to immigrate and also very hard to gain the right to vote as \"natural/native\" citizens. \n\nThe idea that everyone gets to vote is beyond asinine. There is zero evidence it is a good idea and a mountain of evidence to the contrary. \n\nSounding and feeling good are far from actually good most often.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Hurricane_Ivan",
                            "body": "Non documented? \n\nI think they meant undocumented. But who knows, maybe that'll be the next term they start using. \n\nAfter all, we've gone from:\n\nIllegal Alien > Illegal Immigrant > Illegal Migrant > Migrants",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SwimmingSympathy5815",
            "body": "What made the immigrants “illegal”?  What law are we talking about?\n\nWhy was spend authorized by congress and deployed by a federal institution illegal?\n\nWhy is this only targeting NYC and not the red border states that received federal funding for the same purpose from the same program?\n\nWhy is anyone taking Musk at his word anymore after… pretty much everything?  Dude gets off on lying.  Ask him how he programmed PayPal without using SQL?  Or how he has time and skill to be the top ranked character on multiple video games while running multiple companies and a federal department?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ihatemylife153",
            "body": "Nope that's not how any of that works. But it's clear that any explanation further won't matter to you. Have fun.",
            "score": 7,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Very intelligent rebuttal. 👌👏\n\n/s",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Ihatemylife153",
                            "body": "Go read the constitution and go read some more of these comments. Is that better? Like the answers are literally in this thread. I'm good.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": ">*I’m good.*\n\nThere’s nothing good about being narcissistic.\n\n>”*Go read the constitution*”\n\nWhat part of the constitution are you referring to specifically?\n\nWhat part of the condition allows **$80 million to be spent on housing non-U.S. citizens?**\n\n>”*go read some more of these comments.*”\n\nBecause average Reddit socialists can explain your own rebuttal better than you?  \n\nYou could just put in some effort and actually come up with an intelligent rebuttal instead of getting offended by the post and deflecting.\n\n>”*Is that better? Like the answers are literally in this thread.*”\n\nNo, it’s average.  \n\nWhich answers specifically are you referring to?\n\nA socialist’s answer doesn’t make it correct.  It makes it a socialist’s answer.\n\nDo you think that exposing and clawing back the $80 million in moronic spending was a bad thing?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Ihatemylife153",
                                            "body": "I think that the constitution very clearly states that Congress appropriates funds. Plain and simple.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": "Because **anything congress does is constitutional** and righteous /s.\n\nhttps://preview.redd.it/x7w2puvb24je1.jpeg?width=1290&format=pjpg&auto=webp&s=5938b4d83dd5ef5d6e5fa0e7e6eabdf32c3a3338\n\nOnly congress can declare wars.  When was the last time that happened despite The War on Terror being purported by **both Republicans** and **Democrats**?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "timmr99",
            "body": "🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "comb_over",
            "body": "Where is the evidence that they are illegal and the hotels where paid for by homeless citizens?",
            "score": 2,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "https://preview.redd.it/j6czx92smzie1.jpeg?width=1290&format=pjpg&auto=webp&s=89d4b354b5bbf74340774f638cf290ad66c10cf1\n\n[Article Link](https://www.yahoo.com/news/feds-seized-80m-given-nyc-023352652.html)\n\nU.S. Citizens are the only ones that pay federal income tax.\n\nGovernment has accumulated $36 trillion in national debt.  The deficiency is paid for by borrowing money from the Federal Reserve.\n\nU.S. citizens pay the price through inflation.\n\n[Inflation makes the poor and middle class poorer over time](https://i.redd.it/djk4r1l8ju281.jpg).\n\nPoverty can lead to homelessness.\n\nHence, **American citizens pay the price for big, fat, stupid government overspending**.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "comb_over",
                            "body": "You have provided any evidence to support your claim. Just made a new claim.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "theanxiousknitter",
            "body": "And who awarded them that money to begin with?",
            "score": 2,
            "replies": []
        },
        {
            "author": "guhman123",
            "body": "Not sure what point you are trying to make, because withholding budgeted money without congressional approval is very unconstitutional",
            "score": -1,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Spending $80 million to house migrants is also unconstitutional.\n\nYou completely missed the giant elephant in the room.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "heatY_12",
                            "body": "Hmmmmmmmmmmmmmmmmmm, does unconstitutional act to stop “unconstitutional” act…..",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "guhman123",
                            "body": "Spending $80 million to house migrants, assuming that is true, is *not* unconstitutional unless that use of funding is contrary to what Congress laid out in the budget. If Congress dedicated $80 million to that program then it is completely constitutional, as the Constitution provides Congress with the sole authority to manage the federal budget.\n\nWhat isn't in question is the fact Congress is the only one who can direct federal funds, and the executive branch has absolutely 0 say in it, according to the Constitution.\n\nWhat is unconstitutional, then, is anyone other than Congress freezing funding that Congress lawfully dedicated towards a certain program or agency. Which this is.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "guhman123",
            "body": "“Illegal immigrants”\n\nThere are no illegal immigrants in libertarianism. Wrong sub",
            "score": -2,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "There are **no illegal immigrants** in AnCap.\n\nThere **are or are not** illegal immigrants in libertarianism.\n\nSome libertarians want open-borders + state welfare and others do not.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "guhman123",
                            "body": ">Some libertarians want open-borders + state welfare\n\nWhy bunch open-borders with state welfare? open-borders are an inherently libertarian stance, as that is less government involvement, while state welfare is not. And they do not naturally come as a bundle either. It just so happens that the party that supports (more) open borders right now, the democrats, also happens to support state welfare.\n\nBut if you think the government should be standing in the way of private individuals seeking a better life in this country than you are not libertarian.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}