{
    "title": "Going through a strange political transformation where I find myself oddly enough very sympathetic to libertarianism?",
    "author": "PGF3",
    "subreddit": "Libertarian",
    "rank": 331,
    "score": 10,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ip25i2/going_through_a_strange_political_transformation/",
    "id": "1ip25i2",
    "selftext": "So, I've been slowly politically transforming over time, I am not persay a \"Libertarian.\" or an \"Anarchist.\" but as the days go on and on, and I study both history and the modern times, I cannot but find my self at least somewhat sympathetic to the Libertarian vision, as the more I study both the modern world and the world of the past, I can only come to the conclusion, that the State is at the best of times, an ambivalent institution, which at times does benefit people, but also hurts people with its numerous institutions and far, far, far, far, far more often is an utterly inhuman monster, a molochian gluttonous satanic destructive demonic beast from Hell itself, looking to plunder, destroy and engulf all things which are good in this world, It sows tyranny, reaps sorrow, wages war, rips families apart, terrorizes others, destroys communities, props up those who look down upon others, and enriches the worst aspects of humanity. It is a monster, that kills, that cares not for neither culture of the collective or the individual, nor does it care for mercy, respect, tolerance or love; it is a horrid horrific monstrous creature that ruins mankind.\n\nThat is the arc I've been on as of late lol.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Libertarianism is a BROAD spectrum. I started with recorded lectures of Milton Friedman on youtube. Whole lectures, Q&A sessions, debates. His book \"Free to Choose\" and the accompanying video series. It's amazing how we're still discussing issues from the 70s. The same bad solutions then as we have now. Your YouTube algorithm will probably suggest John Stossel next, and Thomas Sowell. \n\nAnd thats a good jumping off point.",
            "score": 8,
            "replies": []
        },
        {
            "author": "mcnello",
            "body": "I'll just say... Growth rates in the U.S. were MUCH higher when government was tiny. \n\nThis same trend holds true across time, and throughout the world.",
            "score": 6,
            "replies": []
        },
        {
            "author": "laxintx",
            "body": "> an utterly inhuman monster, a molochian gluttonous satanic destructive demonic beast from Hell itself, looking to plunder, destroy and engulf all things which are good in this world, It sows tyranny, reaps sorrow, wages war, rips families apart, terrorizes others, destroys communities, props up those who look down upon others, and enriches the worst aspects of humanity.\n\nPoetry.",
            "score": 7,
            "replies": []
        },
        {
            "author": "guhman123",
            "body": ">an utterly inhuman monster, a molochian gluttonous satanic destructive demonic beast from Hell itself, looking to plunder, destroy and engulf all things which are good in this world, It sows tyranny, reaps sorrow, wages war, rips families apart, terrorizes others, destroys communities, props up those who look down upon others, and enriches the worst aspects of humanity. It is a monster, that kills, that cares not for neither culture of the collective or the individual, nor does it care for mercy, respect, tolerance or love; it is a horrid horrific monstrous creature that ruins mankind.\n\n>  \nI am not persay a \"Libertarian.\"\n\nLmao. you're a libertarian",
            "score": 3,
            "replies": [
                {
                    "author": "PGF3",
                    "body": "you see, I disagree because I support things, a lot of libertarians specifically \"right.\" libertarians would absolutely abhor, the other thing is, while I do not trust the human state, I hold a similar distrust for the human economy, and the various economic systems it has produced, and my view is truth be told, that no system devised by Man can fix this.\n\nOnly God can fix this, and he will fix this.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "PGF3",
                                    "body": "So, my take in the economy, and I don't think I have all the answers, nor would I ever want to mandate this on anyone, for that is neither my place, nor right, but I would believe, that society would be much better off, as small clusters of societies organized through worker Co-ops and smaller businesses, where growth is limited, to me this feels most natural, where both private property is respected and cherished but also the ownership of ones work is also highly prioritized\n\nI also believe coming along side this would be a lot of support systems, for less fortunate, either through charity, or some type of welfare program or another. That is in essence my economic take, that society would be best, if we lived more simply and were able to use our talents to produce and own things with our own hands, I would never want to legislate this, nor would I desire it being forced upon others.\n\nEven than I find flaws within it, back to what you were saying, I look at history, I see the pain that all economic systems have brought with them, free market systems and the poverty that comes with them, state managed systems and the over burden of bureacracy and management of other peoples lives, the wanton violence of Anarcho-Communist systems and its brutality to those that do not think like them, I look at economic systems and all I see are wanton death and cruelty, this doesn't even mention pre-industrial economic modes.\n\nFor me, I cannot trust the human economy, for it along with the Human State, has been the second worse oppressor of mankind in our entire history right behind Satan himself.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "Anarcho communism is an oxymoron. A system as imbecilic as communism can only remain in place with the force of the state.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "AutoModerator",
                                    "body": "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Own_Palpitation_8477",
                            "body": "Just think through the implications of any libertarian policies, and you will quickly come to the conclusion that libertarians are at best completely unserious political thinkers and at worst total barbarians. It takes like 10 minutes of critical thinking to show libertarians how wrong they are about everything. Don't fall for it!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Like what? That's a pretty wide brush to paint with...",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Own_Palpitation_8477",
                                            "body": "Do you want to abolish federal healthcare?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "What do you mean by federal healthcare? Are you advocating for state organized doctors? Or single payer insurance? \"Healthcare\" is also such a broad term its basically meaningless. My gym membership is healthcare. Organic groceries are healthcare. Do you mean the practice of medicine? Surgery? Or just paying the bill?\n\nShould hospitals work like the public school system where you go to the tax funded hospital closest to your house? An awful lot of people in America would be absolutely screwed if thats how things were set up.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Own_Palpitation_8477",
                                                            "body": "I mean Medicare and Medicaid, the federal healthcare programs. If you are a libertarian, I imagine you want to abolish these, correct?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "Yes. Why should they exist in the first place? So old people aren't dying in the streets? So poor people can have access to quality healthcare? That's a very nice warm fuzzy feeling but....  \nHave you ever seen a Medicaid nursing home? The old people are basically prisoners left to slowly die alone. Uncared for by overwhelmed and underpaid \"nurses\". Some of them are abused and stolen from. It's incredibly sad. Maybe Americans shouldn't just dump their elderly parents into an institution to be rid of them. Maybe there is room for a private charity, or even a for profit organization, to step in and pay for these services. They could have much better quality control and standards of care - and they would be much more efficient. Maybe instead we should offer people vouchers, like the school choice advocates suggest. People could choose the facility that treats them the best, and the best facilities will get the money. The bad facilities will close. \n\nHave you ever been on Medicare? Most places that actually accept medicare are not conveniently located, and are incredibly busy and understaffed. Overwhelmed and underpaid nurses and doctors don't care about you and treat you like they don't care. Doctors will offer you treatments and prescriptions you don't need because they get paid to sell you those drugs and do those procedures. There were almost 100,000 opioid overdoses in 2024. Who gets hooked on the drugs in the first place? It's poor people in Appalachia and other economically devastated areas. Who pays for the prescription opioids that get them hooked? You, and I, and every other tax payer funding Medicare.\n\nThe Libertarian argument isn't \"abolish healthcare\" - it's \"let the best healthcare providers be rewarded so they can provide more and better healthcare\". The healthcare system in America isn't messed up because of the free market, it's messed up because the government has gotten involved in that market.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Own_Palpitation_8477",
                                                                            "body": "So what will happen to the \\~100 million elderly and poor people who will lose their health insurance if your policies are initiated? What will you offer instead?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "Starting today, you let the elderly people on the program continue until they die. We can't pull the rug out from under these people. Also, we let anyone not currently using Medicaid opt out of the whole thing, or continue until they die. If they choose to opt out, and they have paid in with any taxes at all, they can receive a check for that amount that they've paid in. They can now contribute that money to a High Yield Health Savings Account, or purchase another form of private insurance. You could even make it a voucher, so it can't be spent on drugs or gambling or whatever. \n\nThe people on medicare will lose their medicare, but they can pay for a private insurer if they're not forced to pay it out of their paycheck, since they'll have more money. The most expensive part of healthcare is routine healthcare, not catastrophic accidents - and old people require WAY more routine healthcare. Doctors visits and prescription drugs add up. Fixing a broken leg is a big sum, but not compared to a lifetime of doctors visits, lab tests, prescriptions, etc. \n\nPrivate companies and charities will fill the void. If you contribute to that HSA along with a retirement account, that money will actually be there for you when you get old. \n\nThe House Budget Committe estimates that Medicare Part A will be insolvent in 2036 - So whether we dissolve it today, or wait 10 more years, it will dissappear. What then? I got my first job when I was 18. I'll pay taxes into Medicare and Medicaid for 50 years. When it is my turn to collect, that money will be gone. Same for you. Not only are you and I poorer today because of the taxes we've paid in, we're screwed in the future too. \n\nSource: https://budget.house.gov/press-release/social-security-and-medicare-continue-on-path-to-insolvency-trustees-confirm#:\\~:text=The%20Medicare%20Board%20of%20Trustees,projected%20in%20last%20year's%20report.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Own_Palpitation_8477",
                                                                                            "body": "This doesn't make sense. Medicare provides health insurance for elderly people. How are retired people supposed to pay for health insurance? With what money? If I retire at 65 and live to 85, how am I supposed to pay for 20 years of health insurance?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "Do you have some form of retirement account now? An IRA or 401K?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                            "body": "I have a pension.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "Which you have been contributing to for the last number of years, right? Why couldn't you do the same for some form of supplemental Healthcare plan?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                            "body": "So your solution is for people to save $ for their entire working lives to be able to afford healthcare in retirement?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "None",
                                                                                                                                    "body": "You already do that for other parts of your life. You could offer a tax incentive for contributing to those savings. \n\nThe alternative is to steal the future from your children....",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                            "body": "And what percentage of people do you anticipate will not be able to save up this amount of money? 5%? 10%? 25%?",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "None",
                                                                                                                                                    "body": "Who can say? But yes, there will be some percentage of indigent people.  There are still poor people now. There are people today who have to work until they die. And their options for medical treatments are limited to whats covered by their low quality government insurance.\n\nCharities still exist.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                            "body": "I would think you would have some idea, since you are advocating for this policy. Do you think 5% is a reasonable estimate?",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "None",
                                                                                                                                                                    "body": "72 milliion people are currently enrolled in medicaid. 65 million people are currently enrolled in medicare.\nThat means when these programs go insolvent in 2036 20% of the US population will have no coverage at all. 5% uncovered would be a miraculous improvement. \n\nEither way - I don't need to be an expert to see something is broken. And it's not a problem that the government can spend its way out of.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                            "body": "You think 137 million is 20% of the US population? Time to do some Googling, my friend. \n\nAnd why are you ignoring my question? What is a reasonable estimate for how many people won't be able to save enough $ for healthcare when they retire? Give me a conservative estimate.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                    "body": "https://preview.redd.it/hlxsqgn7obje1.jpeg?width=1080&format=pjpg&auto=webp&s=3ab772cc48e1dbb448cdfbc37c6b25777cb9561d\n\n334.9 million people. 72 million on Medicaid - 21%. 65 million on medicare - 19%. People who receive both services are counted twice so you can't just add 21% and 19%  together.\n\nThe ideal number would be 0% uncovered. Just because some people are uncovered doesnt mean we dont care about them. And a lack of health insurance doesnt mean people are dying in the streets. There have always been free clinics today - provided by private hospitals and funded by charity. Thats good!\n\nThe issue you have with this proposal is that you think without government control the MAJOR cost will be passed on to the patient. But the high costs of treatment are because of a lack of transparency in medical billing - which is encouraged by government involvement and big insurance businesses using government leverage to keep prices high. More competitive practices and transparency will drive costs down.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                            "body": "Yeah, even if you count people who qualify for both, you are nowhere near 20%\n\nBut besides this, you are still evading the question. What is your estimate? You have already agreed that some people won't be able to save up for health insurance for their retirement. What is your best conservative estimate?\n\nPlease try to actually answer the question instead of evading this time.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                    "body": "10 people. But I could be wrong. It could be more. It might be 15 people. But that's just an estimate. Happy? \n\nDude this is reddit. I'm not an expert. Are you? That would take access to information I don't have. And you're arguing in bad faith. If I said 10% of people fall through the cracks, you say \"Heartless jerk. You want people to die! That's why we need government to provide this service!\" Even though the government service is poor quality. And what the government is really doing is stealing from the young, and giving to the old. \n\nI know for a fact that next Friday a line on my paycheck will be a tax for medicare, medicaid, and social security. Probably close to $300. The government takes that money from me, and gives it to you - a retiree. In 30 years, when it's my turn to benefit from this system, it won't be there. It will have been gone for 20 years. What happens to the 140 million people who are stuck on this service when it dissolves? If the estimate for my proposal is 10% of people fall through the cracks, thats better than the 40% left behind when medicare disappears.",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                            "body": "I'm not retired, so I'm not sure what you're talking about, but what I am showing you is that you haven't thought at all about the effects of your policies. This is why I said earlier that libertarians are, at best, unserious, and, at worst, barbaric. You want to take healthcare away from like 30-40% of the population,  around 100 million people, and as you have admitted, many of these people will not be able to afford health insurance while they are working or when they retire.\n\nSo your policies will, no doubt, lead to death, sickness, and misery for, more than likely, millions of people. Then when I ask you for an estimate about how many people this will affect, you wave your hands and say, How could I possibly know?\n\nAgain, this is why libertarians are not serious political thinkers and all it takes is like 10 minutes of pushing back on your ideas to reveal this. Anything else you want to discuss?",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                    "body": "Called it. \"HEARTLESS BARBARIAN!! You want death in the streets!\"\n\nHealthcare is not going away - doctors have existed, and always will exist, for thousands of years. But the government funded health insurance is already definitely going to be taken away from 30%-40% of the population. 2036 is 11 years. Theres my question that you have avoided 3 times now. WHAT HAPPENS THEN? \n\nIf the services were cheaper (through a privatized, less regulated system) more people could afford it. And have you ever seen a doctor using medicare? It's a miserable experience. You shouldn't want to wish it on anyone. I certainly dont. \n\nLife already has a 100% death rate. Sickness and misery are a part of the human condition. Medicare and Medicaid have not stopped this. If utopia is your standard, how are you supporting that system?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                            "body": "No, this was the original statement I made, and we can see how it is accurate in real time. You want to take healthcare away from tens of millions of people and you have nothing to replace it, except people will have to figure it out. People who are serious about politics have thought through their policy positions and have answers for inquiring parties. It is childish to think that you can take healthcare away from millions of people and not have any answers as to how these people will be affected. Again, this is why I say libertarianism is silly if you spend 10 minutes thinking about it.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                },
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                    "body": "Nice edit. I have answered every one of your objections. And you have no rebuttal. Thats why you have to call me  heartless. But I'm actually arguing for freedom and choice. That is scary to some. Uncertainty is scary.\n\nSo you're not retired. That's wild that you're arguing for a system that is stealing your money, giving it to people who are retired. And WILL BE GONE by the time it's your turn to benefit. The system is broken. The government broke it. And there is no way they can tax and legislate their way to fixing it.",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                            "body": "My rebuttal is that your ideology is unserious and barbaric, as I've been saying from the beginning. This is evidenced by how many people would be hurt by your policies, and your inability to answer even the most basic questions about them like how many people will permanently lose their health insurance? what will they do? how will states find the $ in their budgets to create state health insurance? etc. So this is my rebuttal. Do you want to counter it with something substantive?",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                                    "body": "What will happen in 2036 when medicare and medicaid go bankrupt. \n\nWill the programs disappear? Will people have to \"figure it out\" then? \n\nLess regulation and greater transparency will make medical costs cheaper. That will make personal private insurance cheaper. Waiting until those programs disappear will hurt people more.",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                            "body": "It won't. Conservatives have been saying this for decades to dupe people like you into thinking that it isn't a solvent system. Unless Trump abolishes it, we will still have Medicare in 2036.",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                                                    "body": "https://budget.house.gov/press-release/social-security-and-medicare-continue-on-path-to-insolvency-trustees-confirm#:~:text=The%20Medicare%20Board%20of%20Trustees,projected%20in%20last%20year's%20report\n\nJust pretend the problem doesn't exist? Who is the unserious political thinker now? \n\nDo you believe government has infinite money?",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                            "body": "No, I agree with the article you posted. Did you even read it? It is not inevitable that Medicare will be insolvent according to your own article. The article is intended to urge congresspeople to make budget changes to keep it solvent. Maybe read the whole thing next time. Got a rebuttal?\n\n\"The House Budget Committee’s [**Fiscal Year (FY) 2025 Budget**](https://budget.house.gov/fy-2025-budget-resolution), while not making any changes to Social Security or Medicare benefits, provides a mechanism to force Congress and the President to address the insolvency of these critical programs. The Budget Committee has also reported the [***Fiscal Commission Act***](https://www.congress.gov/bill/118th-congress/house-bill/5779?q=%7B%22search%22%3A%22.R.+5779%22%7D&s=1&r=1), which will also give Congress the tools it needs to save and strengthen these vital programs.\" ",
                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                                                                    "body": "Yes, if congress does nothing, they will collapse. What happens then? Where do all the people go who have \"significant cuts to their benefits\"? It sure would be barbaric to teach people to rely on this and then pull the rug out from under them. \n\nYour message is \"we better HOPE they do something!\" Good thing the FCA gives them the tools to fix it!\nTools such as..... spending cuts? Tax increases? Its $142 TRILLION in unfunded liabilities - thats an aweful lot of penny pinching, or an ungodly amount of taxes. \n\nEither way, you cant be serious to think the government has infinite money, has your best interest at heart, or is competent enough to make the necessary changes to avoid this collapse.",
                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                                            "body": "No, I simply agree with the press release that you posted. Congress should act to keep it solvent. The alternative (your position) will hurt and probably kill millions of people, bc your policies are barbaric, and you have nothing to offer these millions of people, bc you haven't given much thought to your ideology. I appreciate you helping me prove this in real time.",
                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                                                                                    "body": "Now its a genocide. LOL. \n\nDo you agree that private medicine is superior to public medicine? Seeing a private dentist, with private insurance gives you access to more and better procedures than the medicare dentist - this is not an opinion. Why would you not want that for everyone?",
                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                                                            "body": "\"Now its a genocide. LOL.\"\n\n\\-Never said this. We have already established that you want to take away healthcare for probably about 100 million people. It is completely reasonable to think millions of these people will be hurt or die bc of this. I'm sorry your policies will cause genocide levels of death. Maybe this is a sign you should think about it some more?\n\nDo you agree that private medicine is superior to public medicine? \n\n\\-No.\n\nWhy would you not want that for everyone?\n\n\\-Bc I think it is much worse for society to have private insurance. I would rather we join every first-world nation on earth and provide healthcare for all of our citizens.",
                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                                                                                                    "body": "Then that's just proof of a priviliged upbringing and detachment from reality. Medicare doctors offices are miserable places. You've clearly never been. Wishing all people to have that as their only option is not humane, or kind - it's evil. \n\nCanada has expanded MAID to cover more than just terminal illness. Including mental illness. This is civilized? \"Feeling sad? Have you tried dying?\" No thank you. \n\nYou're just a state loving boot licker. \nWhen the order to kill the verboten inferiors goes out, you will follow without question. Try freedom. You'll live longer.",
                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                                                                            "body": "Medicare doctor's offices? Wtf are you talking about? Like 90% of primary physicians take Medicare. But thanks for the advice! And helping me show that libertarians have no idea what they're talking about. I appreciate it!",
                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                                                                                        },
                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                                                                            "body": "Do you really think that Medicare doctor's offices exist and that you've been to one before? Remember when I said libertarians aren't serious and don't know what they're talking about? Yeesh.",
                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                                                                                                                    "body": "Not all doctors accept medicare. Thats just not true.\nWhen a patient has medicare coverage, their providers are limited. Their CHOICE of doctor is limited. Their CHOICE of procedures and drugs are limited to what is approved by medicare. That's criminal. The quality of service is less. \n\nHave you ever been on medicare? Have you ever been FORCED to use the service you're advocating?",
                                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                                                                                            "body": "Yeah, I know. About 93% of doctors do. Seriously though, do you think Medicare doctor's offices exist and that you've been to one? You said they were horrible. When have you been to a magical Medicare doctor's office? Where was it? Please post the address. I would love to see what a Medicare doctor's office looks like.",
                                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                                                    "author": "None",
                                                                                                                                                                                                                                                                                                                                    "body": "No. I had to drive to a dentists office an hour from my house to get my wisdom teeth out. After waiting 5 hours in the waiting room, I had a major surgery to remove my teeth. A private insurer would have covered a more delicate procedure. \n\nWhile I was waiting for that procedure, a woman next to me was told to go home, she was crying the whole time. She was there before me. And after waiting for hours, with an appointment, the receptionist told her to leave. That's the type of system you're advocating. \n\nOn a separate trip, to a different doctor. At an urgent care, my girlfriend had a UTI and the provider offered her antibiotics. After finding out we were covered by medicare, they offered to prescribe her VICODIN - for a UTI!\n\nHave you ever been on the receiving end of these services? You do a lot of accusing, but you don't answer any questions. Because you're the shallow thinker. Uncaring for others. Virtue signal away.",
                                                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                                                                                                            "body": "Thanks for the stories. Again, I think I have proven my point. You have no idea what you are talking about, like most libertarians, and are not a serious political thinker.",
                                                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                                                                                                                        },
                                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                                            "author": "Own_Palpitation_8477",
                                                                                                                                                                                                                                                                                                                                            "body": "Are you really an adult who thought that Medicare doctor's offices were a real thing until yesterday? And you wonder why I said libertarians have no idea what they're talking about lol",
                                                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "TheWestWolf78",
                                                                            "body": "There's so much nonsense here. Learn nore about Libertarianism, the current US healthcare system and how it's being ruined by multiple bad actors, where at least the government pretends to give a shit while still making a mess. I'm all for being a Libertarian, but there's a reason literally *every other industrialized nation* has some form of socialized healthcare. Once you're out of school this may all be a but more real to you.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "What did I say that was wrong? The US healthcare system is messed up, but when a foreign government leader needs a surgery, where do they go? When a government panel decides that a child in the UK can't take a life saving drug approved in the US, where do they come? How is adding a panel of bureaucrats to the Doctor-Patient relationship helpful to anyone?\n\nPlease explain the libertarian value that advocates for the removal of choice and strict regulation of a free market.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "TheWestWolf78",
                                                                                            "body": "Plenty of people engage in medical tourism *away from the US*. Nobody said you shouldn't be allowed to choose a private doctor here, but health insurance ghouls like yourself remove more choice than any bureaucrat.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "What is medical tourism? \n\nCheck out these articles about UK Judges siding with \"medical professionals\" against parents.Parents can't decide best treatment for their children when there are options that may work. Please explain how these parents had \"choice\" from the free NHS. \n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC5712473/#:~:text=Introduction,the%20doctors%20believed%20was%20futile.\n\nhttps://apnews.com/article/indi-gregory-uk-italy-ruling-0caecf4c18336004d4e3b99cfff9c327\n\nhttps://www.google.com/amp/s/www.bbc.com/news/uk-england-merseyside-43754949.amp",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ENVYisEVIL",
            "body": "Welcome brother!  Be sure to check out the recommended libertarian podcasts, websites, books, and audiobooks in this sub’s info page.\n\n[Mises.org has an amazing online library](https://mises.org/) of libertarian audiobooks and ebooks available to download for free.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JonnyDoeDoe",
            "body": "There's a huge gap between libertarianism and anarchy, there shouldn't be... One would think that limited government would be a necessary transition to anything close to no government... But just not the way they see it...  I usually tell folks to start by looking at classical liberals, starting with Locke...",
            "score": 1,
            "replies": []
        },
        {
            "author": "WaltKerman",
            "body": "Libertarianism isn't anarchism. Libertarian is far broader.\n\nDemocracies are libertarian and autocracies are authoritarian.",
            "score": 1,
            "replies": []
        },
        {
            "author": "soggyGreyDuck",
            "body": "Exactly, I think a LOT of people are waking up to this idea. The best way to ensure your freedom isn't infringed upon is to also ensure others don't get infringed upon. Individual and state rights are important",
            "score": 1,
            "replies": []
        }
    ]
}