{
    "title": "Whether or not your team is in power does not make this okay or righteous.",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 313,
    "score": 471,
    "upvote_ratio": 0.68,
    "num_comments (reported by reddit)": 125,
    "url": "https://i.redd.it/3fszy4lz02je1.jpeg",
    "id": "1ip51q3",
    "selftext": "",
    "comments": [
        {
            "author": "None",
            "body": "The framing of this topic is suspect for several reasons: \n\nFirst, USAID is one of [several donors to OCCRP](https://www.occrp.org/en/about-us/who-supports-our-work), including the State Department and several 501c3 orgs. The focus on USAID seems to capitalize on the recent maligning of the agency to add credence to the claim.\n\nSecond, Shellenberg's characterization that the CIA \"[involved in the impeachment of President](https://www.newsmax.com/amp/newsfront/michael-shellenberger-usaid-fund/2025/02/06/id/1198050/)\" is a bit hyperbolic. The initial whistleblower complaint was made by a CIA analyst, but there is nothing indicating that the CIA as an organization was involved in either the OCCRP report or otherwise acting in a coordinated manner with other entities in either the complaint or impeachment inquiry. \n\nThird, as for the [whistleblower complaint](https://www.washingtonpost.com/context/read-the-whistleblower-complaint-regarding-president-trump-s-communications-with-ukrainian-president-volodymyr-zelensky/4b9e0ca5-3824-467f-b1a3-77f2d4ee16aa/?itid=lk_interstitial_manual_4). Yes, the July 22, 2019 report from OCCRP was mentioned four (4) times . . . in footnotes. In each instance the reference to the July 22 report was to support other information obtained by the whistleblower. For instance, in the complaint the whistleblower states, \"\\[s\\]eparately, multiple U.S. officials told me that Mr. Giuliani had reportedly privately reached out to a variety of other Zelenskyy advisers, including Chief of Staff Andriy Bohdan and Acting Chairman of the Security Service of Ukraine Ivan Bakanov.\" There is a citation to a footnote that reads, in whole, \"\\[i\\[n a report published by the Organized Crime and Corruption Reporting Project (OCCRP) on 22 July, two associates of Mr. Giuliani reportedly traveled to Kyiv in May 201Q and met with Mr. Bakanov and another close Zelenskyy adviser, Mr. Serhiy Shefir.\" \n\nLikewise, the whistleblower further states, \"\\[a\\]round the same time, I also learned from a U.S. official that \"associates\" of Mr. Giuliani were trying to make contact with the incoming Zelenskyy team.\" As for the OCCRP July 22 report reference, the footnote states, in whole, \"I do not know whether these associates of Mr. Giuliani were the same individuals named in the 22 July report by OCCRP, referenced above.\"\n\nIn other words, the OCCRP July 22 report has a muted impact on the whistleblower's statement, and Shellenberger's statement that \"\\[t\\]he CIA whistleblower complaint cited a long report by OCCRP four times\" attempting to frame this as a high reliance on the July 22 report is specious.",
            "score": 118,
            "replies": [
                {
                    "author": "teh-haps",
                    "body": "Appreciate the summary!",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "guhman123",
            "body": "okay... where is the evidence?",
            "score": 317,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 83,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "https://preview.redd.it/21pglgy572je1.jpeg?width=1290&format=pjpg&auto=webp&s=af6b6001677f4584fc1c36e1bf04c858ab81110a\n\n[Thomas Massie—Michael Shellenberger Congressional Testimony on USAID Paid for Trump Impeachment Effort](https://x.com/RepThomasMassie/status/1890186529676447864?mx=2)\n\n[Article Link — Shellenberger: USAID Paid for Trump Impeachment Effort](https://www.newsmax.com/amp/newsfront/michael-shellenberger-usaid-fund/2025/02/06/id/1198050/)",
                    "score": -213,
                    "replies": [
                        {
                            "author": "guhman123",
                            "body": "that image says nothing, as it is literally just a repost of the image in the post.\n\nFirst link is dead, and even if it was live Twitter isn't exactly the bastion of free press these days.\n\nAnd for the second link, the article cites a journalist's statement from Twitter, which further cites a \"Drop Site News\", which has no link to the supposed report and I am unable to find it online. So essentially, it leaves me with 2 choices: take its word at face value (stupid) or disregard its conclusions as there is no evidence in that article that anything said there is true. Please dig a bit deeper and find a primary source to back your own claim.",
                            "score": 252,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "It’s a bot, I don’t know why the other mods don’t do something about it.",
                                    "score": 47,
                                    "replies": [
                                        {
                                            "author": "ToastNeo1",
                                            "body": "OP is also a MOD.",
                                            "score": 43,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Right! You’d think the others would do something about him.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "ToastNeo1",
                                                            "body": "When they posted about unbanning people I could have sworn they weren't a MOD anymore. I was either wrong or they made them a MOD again later.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "vvfella",
                                                                    "body": "Mod again later - I had checked because I had a feeling this was the mod the whole thing was about back then and they were definitely off the list only to show back up shortly after 😬",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "guhman123",
                                            "body": "im starting to get the idea that the mods might be a bit more republican than libertarian",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Consistent-Dream-873",
                                    "body": "Wait wait why isn't Twitter a bastion of the free press??",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "Chill out and try the link again.  \n\nIt takes less time to actually do your own homework than rant on for 3 paragraphs.\n\n**Don’t pretend that Google doesn’t exist** and that you are owed anything, your highness.  \n\nClosing your eyes doesn’t mean that the USAID didn’t potentially commit treason.",
                                    "score": -190,
                                    "replies": [
                                        {
                                            "author": "guhman123",
                                            "body": "Ah, it works now. That statement is again from Shellenberger, the same source from the Newsmax article, with the exact same issue, citing a \"Drop Site News\" report that cannot be found.\n\n>**Don’t pretend that Google doesn’t exist**\n\nI'm sorry your Highness, but since you are the one who made the claim then you are the one with the burden of proof. I will not do your homework for you. All I asked for is the basis of your claims, why can't you produce it?\n\nAnyways, unless you can find the \"Drop Site News\" report that Shellenberger cites as a basis for his claims, I can't find any merit in those claims in good faith.",
                                            "score": 170,
                                            "replies": [
                                                {
                                                    "author": "Ihatemylife153",
                                                    "body": "I juts wanna say kudos. I do this too. I'm so tired of not finding real evidence to literally every single claim these people have. People drop every ounce of integrity when it comes to politics. They accept answers and words as proof they would never accept from their boss, their wives, their friends etc. Wtf is it about politics that make us act this way?",
                                                    "score": 67,
                                                    "replies": [
                                                        {
                                                            "author": "guhman123",
                                                            "body": "blind trust leads to authoritarians getting power. a lack of critical thought and doubting everything you hear is extremely dangerous",
                                                            "score": 12,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "MechEngAg",
                                                            "body": "Its human nature. We want to believe these things. We sometimes understand certain things to be true without the need for evidence, so we begin to believe whatever supports that narrative without evidence as well.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "nigaraze",
                                                    "body": "And with the no response but a meme to redirect, its clear OP got caught with a bullshit source from his own post",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "guhman123",
                                                            "body": "knowing this OP, that's a rare occurrence. they tend to argue their side 'till kingdom come, ignoring any legitimate counterpoints",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "nigaraze",
                                                                    "body": "This isn’t even a counter point sadly, this is just straight up fake news with bullshit sources lmfao",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "guhman123",
                                                                            "body": "my eyes are so thoroughly oversaturated with this shit that i forgot they have no merit to begin with, thanks for reminding me.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MDunn14",
                                                    "body": "And it’s so stupid half these people are freaking out about “treason” when the literal sitting president has already committed it as well as espionage. But shhhhhh let’s forget about that and pretend half the country didn’t knowingly vote in a criminal administration.",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "guhman123",
                                                            "body": "b-b-but look what doge says!!1!1!",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "BlueLaceSensor128",
                                                    "body": "[This article from the Washington Post is linked on that one.](https://www.washingtonpost.com/context/read-the-whistleblower-complaint-regarding-president-trump-s-communications-with-ukrainian-president-volodymyr-zelensky/4b9e0ca5-3824-467f-b1a3-77f2d4ee16aa/?itid=lk_interstitial_manual_4) (“Click here to download the PDF”)",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "MDunn14",
                                                            "body": "Whistleblower complaints are not evidence. They are the beginning of an investigation.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Professional_Golf393",
                                            "body": "r/libertarian is cooked. Just look at these upvote downvote ratios. Shameful.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": "Facts > Feelz\n\nhttps://preview.redd.it/yozztbhtx3je1.jpeg?width=1200&format=pjpg&auto=webp&s=890cd2d93b4a47b7d73d50eac960186aa0da315c",
                                                    "score": -23,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "cathode-raygun",
                                                    "body": "It really is fucked up to see so many willfully shut their eyes since info is coming from someone they dislike.\n\nY'all are acting like Democrats.",
                                                    "score": -29,
                                                    "replies": [
                                                        {
                                                            "author": "Professional_Golf393",
                                                            "body": "That’s the issue here, r/libertarian is inundated with authoritarian leftists, or bots, I’m not quite sure which.",
                                                            "score": -18,
                                                            "replies": [
                                                                {
                                                                    "author": "cathode-raygun",
                                                                    "body": "We're living in weird times. I don't understand how people who should be cheering over corruption and waste being exposed are up in arms because it comes from someone they hate (for nebulous reasons).",
                                                                    "score": -8,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Toaster_Toastman",
                                                    "body": "100% brigading.",
                                                    "score": -8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Get_Wrecked01",
                            "body": "I watched the video, read the article, and read the complaint statement from 2019. There are no receipts showing a link from the whistleblower to a USAID or subsidiary organization, or a CIA directive to her involved in the impeachment efforts. There are allegations, but that's it. \n\nAn I missing something?",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "MDunn14",
                                    "body": "Yea you’re missing the lobotomy some people seemed to have gotten recently",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jerkedpickle",
                            "body": "Are you actually okay with a sitting president pressuring a foreign government to help win a political campaign? Because Trump didn’t deny he did pressure Ukraine to help him, he just said it was okay that he did.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Ihatemylife153",
                            "body": "I’m pretty sure ENVYisEVIL is a bot trying to find out how to navigate debates because there’s no way this dude has this many unpopular takes in a pretty diverse community? I’d say I’m as far left as a person can be genuinely interested in the logic. I have plenty of upvotes and down. I’ve never seen this guy have an upvote. Idk if this is against TOS to say this and I’ll delete if so but damn!",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Likestoreadcomments",
                            "body": "The amount of lolberts and lefties brigading you, jfc. If I wasn’t convinced it was a cult I sure believe it now.",
                            "score": -12,
                            "replies": []
                        },
                        {
                            "author": "BlueLaceSensor128",
                            "body": "Dude, you got brigaded hard. Must be right over the target with this stuff and they’re getting so desperate they forgot how to read. You should be very proud of every single one of those downvotes.",
                            "score": -38,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "My posts in this sub alone have had 5 million views since  early last year. The right people (average Reddit tankies) are seeing the posts.\n\nThe mission—spreading libertarian ideas—is more important than the comment upvotes.\n\nTankies gonna brigade.",
                                    "score": -17,
                                    "replies": [
                                        {
                                            "author": "caprix",
                                            "body": "Thank you for doing what you do. I have to admit I don’t agree with all your posts/comments. But the brigading is getting insane in this sub over the last 6 months or so. Half of the comments are the furthest thing from libertarian and it gets maddening. This comment of yours is a good reminder.",
                                            "score": -8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThatOtherGuyTPM",
            "body": "Just looking for literally anything to substantiate this beyond a confident “we did it.”",
            "score": 47,
            "replies": []
        },
        {
            "author": "someguyontheintrnet",
            "body": "Any reference to ‘the deep state’ is an automatic no from me, dawg.\n\nEdit: I got banned from the sub for my comments in this thread. Count r/Libertarian as another conservative echo chamber. Good luck fam.",
            "score": 103,
            "replies": [
                {
                    "author": "DramaticBat2363",
                    "body": "The people in charge ARE the deep state",
                    "score": 34,
                    "replies": [
                        {
                            "author": "someguyontheintrnet",
                            "body": "Yep. But the right wing conspiracy theorists think  only the left is corrupt for some reason.",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "caprix",
                                    "body": "So because of so-called conspiracy theorists,you’ll no longer stomach even the mention of a deep state? Abandon all skepticism? And automatically assume the comment is coming from someone right-wing? You’re actively contributing to the polarization of our political climate, are you proud of that?\n\n\nThe right is corrupt as well, and has its share of politicians dedicated to deep state power.",
                                    "score": -8,
                                    "replies": []
                                },
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "[Biden is as sharp as a tack! Sharp, sharp, sharp, sharp, sharp](https://www.reddit.com/r/Libertarian/comments/1e8w8d9/biden_is_as_sharp_as_a_tack_sharp_sharp_sharp/)",
                                    "score": -48,
                                    "replies": [
                                        {
                                            "author": "someguyontheintrnet",
                                            "body": "How this comment even relevant? Go home, ENVYisEVIl, you’re drunk.",
                                            "score": 41,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": "Imagine watching 6 minutes of the liberal politicians and mainstream media **gaslighting that the sitting president did NOT have severe cognitive decline**….only to come to the conclusion of being in denial 😂.\n\nThis is a libertarian sub, my statist friend.  You are obviously lost and that’s perfectly fine.\n\nCheck out the sub’s FAQ section to view the **recommended libertarian** podcasts, websites, and audiobooks.\n\nYou too might convert to libertarian someday.\n\nhttps://preview.redd.it/r9byr07z24je1.jpeg?width=1200&format=pjpg&auto=webp&s=a91531b13eb42d95d9645d4f30abacbfd0f65cc9",
                                                    "score": -20,
                                                    "replies": [
                                                        {
                                                            "author": "wildtyranitar",
                                                            "body": "You’re just a republican pretending to be a libertarian but go off",
                                                            "score": 46,
                                                            "replies": [
                                                                {
                                                                    "author": "ENVYisEVIL",
                                                                    "body": "Only a simpleton would consider anything they disagree with to be a Republican without providing a shred of evidence.",
                                                                    "score": -5,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "caprix",
                                                                    "body": "Are libertarians not allowed to criticize a party without being labelled as the other party? You’re actively contributing to the polarization of our political climate, are you proud of that?",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "wildtyranitar",
                                                                            "body": "Did I ever say not to criticize a party? Putting words into my mouth all I said was OP is a right winger pretending to be libertarian. I believe this because if you do a quick glance at their post history it’s pretty clear they only criticize the left, which isn’t wrong but there isn’t any critiquing the right for the same issues they critiqued the left on. It seems bias in my opinion and I think OP should be called out for it. I’ve seen a lot of conservatives acting like they’re “just in the middle” or claiming to be libertarian and it’s just false and quite frankly annoying.",
                                                                            "score": 16,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "caprix",
                                                                                    "body": "You’ve somehow used the words republican, right-wing and conservative completely interchangeably in your comment.\n\n\nMaybe, rather than the fault being libertarians you think are pretending, there is a confusion or misunderstanding that lies in you? A bias, as you mentioned, that leads you to paint large groups of people with a single stroke? In other words, active contribution to the polarization of our political climate.",
                                                                                    "score": -6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "someguyontheintrnet",
                                                                                            "body": "So you defend the astroturfer clearly pushing a rinf-wing agenda while attacking those that are calling him out. Sounds like you’re contributing to the polarization of politics as well my friend.",
                                                                                            "score": 8,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "caprix",
                                                                                                    "body": "Nope, I’m actually doing the opposite by introducing some nuance and challenging others to think critically rather than speaking in broad and/or absolute strokes. For example, you say “clearly pushing a (right)-wing agenda”. What makes this so clear to you? Does this mean there is an absolute absence of nuance to that persons posts, in your mind? More importantly, why do you purport that I am defending the poster, rather than the concept of political nuance in an era of polarization (which is what I was doing)?",
                                                                                                    "score": -2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "wildtyranitar",
                                                                                            "body": "Because the words are synonymous…",
                                                                                            "score": 4,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "caprix",
                                                                                                    "body": "Read a book, my friend.",
                                                                                                    "score": -1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BlakJak_Johnson",
                            "body": "Fucking this.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "engoac",
                    "body": "Yea I've been lurking for a while and recently this sub has gone downhill",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shoddy_Drawing_7519",
            "body": "Evidence?",
            "score": 10,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Already posted in other comments",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Shoddy_Drawing_7519",
                            "body": "So you have no evidence then? Because that is not evidence of anything just a conspiracy",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "There are 109 other comments in this post have already asked and answered this question.\n\nDo your homework.",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "moreton91",
            "body": "Nobody fabricated shit. Trump gave us all the evidence we needed that he was trying to steal the 2020 election.",
            "score": 115,
            "replies": [
                {
                    "author": "BornIn80",
                    "body": "You sound like the audience these social programming funds were looking for.",
                    "score": -33,
                    "replies": []
                },
                {
                    "author": "Consistent-Dream-873",
                    "body": "There's no proof of that lol",
                    "score": -48,
                    "replies": [
                        {
                            "author": "liberty_is_all",
                            "body": "[The Report](https://www.justice.gov/storage/Report-of-Special-Counsel-Smith-Volume-1-January-2025.pdf)\n\nThere is abounding evidence that Trump tried to steal the election.  Plenty of evidence before Jan 6th even happened.  They actually chose not to indict on insurrection charges because of the lack of evidence on that specifically.\n\nMost people will not take the time to read this.  I read the first 50 pages in its entirety. It is incredibly damning. This man is now our president and directs the DOJ.",
                            "score": 39,
                            "replies": []
                        },
                        {
                            "author": "moreton91",
                            "body": "Apart from all the attempts to overturn the el3ction results and lies about it being rigged.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "DramaticBat2363",
                            "body": "January 6th, 2021",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "Sure_Hedgehog4823",
                                    "body": "You meant he day that “guards” openly allowed people into the capital to stage something they could’ve easily shut down with lethal force",
                                    "score": -51,
                                    "replies": [
                                        {
                                            "author": "DramaticBat2363",
                                            "body": "\"Within 36 hours, five people died: one was shot by the Capitol Police, another died of a drug overdose, and three died of natural causes, including a police officer who died of natural causes a day after being assaulted by rioters.[d][34][45] Many people were injured, including 174 police officers. Four officers who responded to the attack killed themselves within seven months.\"\n\nJan 6th Wikipedia",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "hkusp45css",
                                                    "body": "Worst insurrection ever. Relying on natural causes and suicide to overthrow a government. Not a single shot fired by the revolutionaries.\n\nYeah, American government was nearly eradicated when some dude stole a podium.",
                                                    "score": -13,
                                                    "replies": [
                                                        {
                                                            "author": "DramaticBat2363",
                                                            "body": "You are confusing the outcome with intent, like a bank robber who gets no cash.  It is still illegal on the face of it.  Don't be mad that the group you like was so bad at being criminals, lol",
                                                            "score": 32,
                                                            "replies": [
                                                                {
                                                                    "author": "hkusp45css",
                                                                    "body": "No, I am discussing the fact that I find it ludicrous, absolutely insane to refer to a protest where the WORST action on behalf of the protesters was trespassing, vandalism and resisting arrest as an \"insurrection\"\n\nThis is America, if they wanted to overthrow the federal government or stop the transfer of power, shouldn't they have been able to scrounge up a single incident of deadly force out of the whole thing?\n\nYou're so invested in the buzzword you've attached that you're ignoring its meaning.\n\nYou're either dishonest or so confidently incorrect that any sane argument is going to fall on deaf ears.\n\nWhich is a sad way to go through life.",
                                                                    "score": -13,
                                                                    "replies": [
                                                                        {
                                                                            "author": "gadela08",
                                                                            "body": "Not an \"insurrection\"?  If it walks likea duck and quacks like a duck... What is it then? \n\nAre you aware of why it happened on January 6 specifically? To interrupt the Congressional certification of the election. \n\nCompare this to similar events across global history and it falls clearly into the category of attempted coup.",
                                                                            "score": 13,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "JJDirty",
                                                                                    "body": "The mental gymnastics to defend a bunch of domestic terrorists.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "hkusp45css",
                                                                                    "body": "It didn't walk like a duck. We have other insurrections by which to compare it.\n\nIt was a reasonably calm protest and all of the hanky twisting is ONLY being done by people who don't understand what insurrection looks like, or who are lying for political reasons.\n\nInsurrections require violence. They are not accomplished by sitting in desks owned by the government and taking selfies.",
                                                                                    "score": -9,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "gadela08",
                                                                                            "body": "Not violent?\nhttps://youtu.be/rWRn-RcEodg?si=ySnxAjMnFAwIXXxS",
                                                                                            "score": 7,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "hkusp45css",
                                                                                                    "body": "Correct, not violent. Unruly? Sure. Resisting arrest? Sure.\n\nThe protesters themselves didn't commit ANY acts of violence that would lead a sane person to conclude they were trying to stop the transfer of power.\n\nMildly destructive? Absolutely. Violent? Where are the fucking victims? Everyone injured (aside from the protester killed by Capitol Police) was scrapes and cuts and bruises that would have been present dispersing any large-scale unorganized protest.\n\nI keep hearing about the \"gun problem\" we have in the US. Who tries to overthrow the government without ever firing a shot? It's not like DC has metal detectors you have to walk through before you can go protest.",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "DramaticBat2363",
                                                                                                            "body": "\"Within 36 hours, five people died: one was shot by the Capitol Police, another died of a drug overdose, and three died of natural causes, including a police officer who died of natural causes a day after being assaulted by rioters.[d][34][45] Many people were injured, including 174 police officers. Four officers who responded to the attack killed themselves within seven months.\"\n\nJan 6th Wikipedia",
                                                                                                            "score": 8,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "gadela08",
                                                                                                            "body": "If this event would have happened anywhere else in the world we would be calling it an attempted self-coup.  It happens in developing countries enough that academia has words for these things.\n\nAcademics.and historians are already calling the event an insurrection, and plots to overturn the election were prosecuted and convicted of seditious conspiracy.\n\nCoups can happen without lethal force, but in this case, Trump couldn't convince any of the other institutions of government (military, law enforcement, etc) to go along with his coup attempt so the only force he had was the militias.(Proud boys, qAnon, Brownshirts, etc).",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "DramaticBat2363",
                                                                                            "body": "If this is true, then why did Mike Pence not run again with Trump?  Oh, that's right, Pence has stated that he believes Trump was using corrupt Secret Service agents and January 6th insurectionists to kill him:\n\nhttps://www.pbs.org/newshour/politics/pence-details-jan-6-falling-out-with-trump-in-new-memoir",
                                                                                            "score": 11,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "hkusp45css",
                                                                                                    "body": "You're deflecting the argument to some other circumstance or evidence that has nothing to do with the topic at hand.\n\nEven if Pence truly believed it was an insurrection AND even if that's why he didn't run again, that doesn't make him any less wrong than you are.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "DramaticBat2363",
                                                                                                            "body": "Huh?  Are you okay, bro?  Do we need to call your caretaker for you?  You seem lost.",
                                                                                                            "score": 6,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "hkusp45css",
                                                                                                                    "body": "I assure you, between the person calling Jan 6 an \"insurrection\" and intimating it was an attempt to stop the transfer of power and me, I'm not the \"lost\" party, here.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "DramaticBat2363",
                                                                                                                            "body": "You are confusing the outcome with intent, like a bank robber who gets no cash.  It is still illegal on the face of it.  Don't be mad that the group you like was so bad at being criminals, lol.",
                                                                                                                            "score": 6,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "hkusp45css",
                                                                                                                                    "body": "That's the second time you've used that inane argument, and I'll explain, again, that the way we can KNOW that the intent wasn't to stop the transfer of power is that NOBODY involved did anything to actually TRY to stop the transfer of power.\n\nYou8 see, in an insurrection, when you have a couple of hundred motivated insurrectionists, SOMEBODY on the \\*state's\\* side should have been injured.\n\nBecause that's what an insurrection is. It's the violent activity designed to topple the government currently in power to supplant that authority with something else.\n\nWho got violent, again? Oh, right, the ONLY shot fired was the state executing a protester for the capital offense of breaking a window and trying to crawl through it ... unarmed.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "DramaticBat2363",
                                                                                                                                            "body": "\"Within 36 hours, five people died: one was shot by the Capitol Police, another died of a drug overdose, and three died of natural causes, including a police officer who died of natural causes a day after being assaulted by rioters.[d][34][45] Many people were injured, including 174 police officers. Four officers who responded to the attack killed themselves within seven months.\"\n\nJan 6th Wikipedia",
                                                                                                                                            "score": 6,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "hkusp45css",
                                                                                                                                                    "body": "Yes. Thank you for proving my point. So, we agree, then?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "DramaticBat2363",
                                                                                                                                                            "body": "174 police officers being injured is non-violent?  Crazy",
                                                                                                                                                            "score": 6,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DramaticBat2363",
                            "body": "https://www.pbs.org/wgbh/frontline/documentary/american-insurrection/",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BlueLaceSensor128",
            "body": "[Here is the Washington Post link from the Drop Site News article everyone in the comments is pretending doesn’t exist.](https://www.washingtonpost.com/context/read-the-whistleblower-complaint-regarding-president-trump-s-communications-with-ukrainian-president-volodymyr-zelensky/4b9e0ca5-3824-467f-b1a3-77f2d4ee16aa/?itid=lk_interstitial_manual_4) On DSN if you scroll down it’s “whistleblower letter that led to President Donald Trump’s impeachment” at the end of a paragraph. And on the WP article you can see the actual letter by clicking the PDF.",
            "score": 25,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "“The truth is out there.”\n\n—The X Files",
                    "score": -12,
                    "replies": []
                }
            ]
        },
        {
            "author": "VoxAeternus",
            "body": "Even if they did it would be Sedition not Treason, but idiots are too stupid to know the difference. \n\nTreason is waging a violent war from within, or aiding and abetting an enemy state.\n\nSedition is to overthrow, take down, hinder, or delay the government or its laws with Speech, which would include funding according to the US Supreme Court.\n\nThat being said, these crimes require multiple witnesses of the acts to prove, and without evidence its just an idiot spewing nonsense.",
            "score": 4,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": ">”*Treason is waging a violent war from within, or aiding and abetting an enemy state.*”\n\n“*The Hunter Biden Laptop story is Russian MiSiNfOrMatiOn.*”\n\n**—The Enemy State**",
                    "score": 0,
                    "replies": [
                        {
                            "author": "VoxAeternus",
                            "body": "Scapegoating or falsely flagging an enemy of the state is not the same as directly aiding and abetting them, and \"waging a violent war from within\" implies a violent conflict like a military coup d'etat. \n\nSo do make it clearer;\n\nTreason would be selling Russia or China the blueprints of the F-22\n\nSedition would be a conspiracy of US Officials/Citizens to take down/hinder the government, by falsely claiming that Russia/China are controlling the government, via **Speech**",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BlakJak_Johnson",
            "body": "Do you base all of your feelings on tweets from shitter? You may wanna get that looked at.",
            "score": 33,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Speaking of “feelings”….have you actually considered producing a thought-provoking rebuttal instead of resorting to childish ad hominems?\n\nTwitter is a communication platform.  I trust it more than the morons that said that “[BiDeN iS aS sHaRp As A TaCk](https://www.reddit.com/r/Libertarian/comments/1e8w8d9/biden_is_as_sharp_as_a_tack_sharp_sharp_sharp/)” for 4 years.\n\nCritical thinking is more important than being an offended partisan.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "BlakJak_Johnson",
                            "body": "Trusting Shitter is a big no from me. Show me a pic of Shitter and a pic of the leaders of our government and I will tell both of those pics are the same.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "Surprise, surprise\n\nhttps://preview.redd.it/fo74yeexf5je1.jpeg?width=1200&format=pjpg&auto=webp&s=b92cb7f4ef8491cbcdb3a233993d4992538a929f",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SlasherHockey08",
            "body": "It doesn’t make it alright however it also might not be true. Even in the absence of actual transparency, the number of claims DOGE has made that turn out to be exaggerated, not fraud, or just plain false is high.\n\nThat’s additionally dubious when they don’t show their actual work or context AND never print retractions when they’re wrong.",
            "score": 4,
            "replies": []
        },
        {
            "author": "hey_dougz0r",
            "body": "After reading the various sources associated with this here's my take. The likely truth - assuming DSN's sourcing and reporting is valid - of USG funding links to OCCRP is highly questionable and needs to be known.\n\nUnfortunately, this will simply be used as more ammunition to support what is likely to be an even more corrupt administration than the last. The details and the players will change but the end result will still be a disdain for transparency and fairness (far more so in fact if things continue as they are).  \n  \nI don't know about anyone else here but I am more careful openly criticizing the current Trump administration than those previous, including Trump's first term. It's good to keep in mind that anything that goes online, especially on Reddit, essentially becomes a permanent record.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LagsOlot",
            "body": "To make a credible accusation like this you must disclose which organization and produce the subject material. And remember it's only slander if it is blatantly false.",
            "score": 9,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Read the other 57 comments before defaulting to slander.  \n\nThat’s called doing your homework.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "LagsOlot",
                            "body": "Do your homework before posting",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_lvlsd",
            "body": "[pot. kettle. black.](https://www.nytimes.com/2019/10/03/us/politics/trump-ukraine.html)",
            "score": 1,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Good.  The Big Guy didn’t get his nickname by coincidence.\n\nHunter Biden getting a multi-million dollar salary for Burisma also wasn’t a coincidence.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "yadaredyadadit",
            "body": "We orchestrate regime changes across the globe—get outta here? \nAnd here I was, under the impression that we were the 'leaders of the free world,' the 'champions of democracy,' and everything that supposedly comes with it. How naive of me. /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "duckpn3",
            "body": "Wether you like trump or not, us aid money went to political news company’s to cast a bad light on him in an effort to cause him to loose support. It’s just vague enough to say they weren’t a part of it but it is obvious what was going on. Trump was elected by the people , us aid trying to manipulate  voters to get the people they want elected doesn’t seem right to me especially because it’s our tax dollars.",
            "score": -2,
            "replies": []
        },
        {
            "author": "rabell3",
            "body": "A lot of brigaders in this sub. No meaningful conversation can be had here.",
            "score": -1,
            "replies": []
        },
        {
            "author": "AcceptableEditor4199",
            "body": "But were they funded directly to commit said treason. Messed up if true.",
            "score": -19,
            "replies": []
        }
    ]
}