{
    "title": "…and libertarianism is the cure.",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 305,
    "score": 608,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 125,
    "url": "https://i.redd.it/8b0ac0o534je1.jpeg",
    "id": "1ipbavf",
    "selftext": "",
    "comments": [
        {
            "author": "Carlose175",
            "body": "Love doge. Hate its implementation. The executive branch is at risk at becoming too powerful. \n\nDo we really think libertarianism will come through authoritarianism?",
            "score": 201,
            "replies": [
                {
                    "author": "amp0880",
                    "body": "This is becoming more of a fear especially after reports of the state dept ordering 400m of Teslas came out that was a bit of a wtf moment.  \n\nSeeing these bs payments being brought to light is great, but skepticism is rising.",
                    "score": 65,
                    "replies": [
                        {
                            "author": "ListerineInMyPeehole",
                            "body": "The $400m order was under Biden. And apparently it’s been changed to a general line about Armored Vehicles rather than Tesla.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Bigtrav1776",
                            "body": "I don’t know all the details, but from what I understand that was ordered in December of 2024 no?",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Parabellum12",
                            "body": "That was an order the Biden admin made, and that order was cancelled by the Trump admin as soon as it was discovered. Try harder.",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "libertinian",
                                    "body": "Day 2 since the scandal and they are now on their 3rd edit that I've caught. Weirdly the newest version of the document is missing 10 columns compared with the previous versions, including all the information on the contracting officer. Would love to know what is going on",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Calamz",
                                            "body": "https://preview.redd.it/pjbgbob7c8je1.jpeg?width=320&format=pjpg&auto=webp&s=8e1fec5c96bcf082b547f0f07e9d542cbfe87cdf\n\nso what you're saying is, it was indeed removed?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "1127_and_Im_tired",
                                    "body": "Interesting. All of the msm was screaming about it but you're mostly correct. They took off the Tesla name and suspended the order, for now. It'll be interesting to see what happens going forward.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "ListerineInMyPeehole",
                                            "body": "2026 Armored Optimus x 50,000 units lmao",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "twobugsfucking",
                    "body": "As a self branded minarchist what are your thoughts on Elon’s ideas of the courts being dispensable? Personally I really expected to see a lot of people on the side of small government recognize how utterly stupid depowering the courts first and not last is, and specifically imagine any well read and self styled minarchists are having heart palpaltations but haven’t spoken to one about it yet.\n\nFor the record personally I float around quite a bit but minarchy has always been of special interest to me.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "1127_and_Im_tired",
                            "body": "This is the thing that scares me about him. I saw a post he made on Twitter yesterday questioning whether the courts should have any say in everything the president does. I'm screaming yes! There needs to be some kind of check on the president's powers. But all these idiots think the president should do as he pleases . Of course, that will only be ok with them as long as he's doing what they want. The second someone they don't like is in office, they will regret that decision.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "A380-",
                                    "body": "But theoretically, couldn’t one judge somewhere block everything the president does? (Like Elon’s tweet said) Then how would the country change with so many obstacles…",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "1127_and_Im_tired",
                                            "body": "That's why we have so many layers in the judicial system. You don't go before the Supreme Court immediately. There are local, district, state, state Supreme, federal, Supreme Courts. So it's not possible for just one judge to unilaterally do anything. That's why we have appeals. Many judges can look at the situation and give their opinion on whether what the president is doing is constitutional or not.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "twobugsfucking",
                                                    "body": "Adding to this - the president is not supposed to do nearly as much as it does either. This lie that the executive has lost power and not grown immensely is ridiculous. Just look at things like “special operations” instead of wars from my childhood all the way to executive immunity for “official actions.” The framers never meant for the executive to act like a king or ceo, and it used to have *more* restriction. The “deep state” that is in place mostly functions that curtail all that new authority.",
                                                    "score": 22,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "A380-",
                                                    "body": "Okay got it, thanks kind redditor",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "1127_and_Im_tired",
                                                            "body": "Thanks for a civil discussion : )",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "My understanding is that judges block in response to lawsuits being brought before them. They don't just read the news like, \"hmm that executive order sounds illegal\" and go issue a block. So one judge wouldn't be blocking everything unless attorneys are filing lawsuits for everything and it gets assigned to that judge over and over. The higher up the ladder your lawsuit goes, the less options there are for judges, until eventually you reach the supreme court. \n\nMaybe I am wrong? Either way, the president can always appeal the ruling or motion to have a new judge review these things. If the entire judicial branch is just all in on capriciously blocking the president, all the way up to the supreme court, then it would fall on Congress to draft and pass a law that unambiguously authorizes the president's actions OR passing a constitutional amendment via one of the afforded avenues, depending on the reasoning being used to block the president (and assuming everyone agrees that the judicial branch is being bad).",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "A380-",
                                                    "body": "This makes total sense, thank you\n\nTbf, this entire process seems lengthy but still very much necessary nonetheless. \n\nI guess the president’s term could be over before he implemented one of his policies (like birthright citizen restrictions)",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OpinionStunning6236",
                    "body": "You just now think the executive branch is at risk of becoming too powerful? The executive branch has been seriously overreaching its constitutional role and consolidating more power for the president under every administration since the Great Depression",
                    "score": 11,
                    "replies": [
                        {
                            "author": "txeagle24",
                            "body": "You could even take it back further to the Civil War with Lincoln expanding executive power, suspending habeas corpus, & arresting dissenters.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Omen_of_Death",
                    "body": "That's my opinion on it, love the concept of it but hate the execution of it",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Shiroiken",
                    "body": "Nothing permanent can happen without Congress. Whatever Trump and DOGE limit can (and will) be undone by the next Democrat president. The GAO has spent decades trying to get Congress to act, so I doubt DOGE will have any impact either.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Sea_Journalist_3615",
                    "body": "Dude, this is the nature of government. As long as people keep supporting it, it will get more powerful and grow.\n\n  \nI blame minarchists as much as normal statists.  You will never get government to be what you want. It is simply crime.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Carlose175",
                            "body": "Anarchism is a pipe dream imo, just like communism. \n\nNot judging you personally. I just think a lack of monopoly on violence creates violence.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Opening-Wasabi-9018",
                                    "body": "I think monopoly on violence creates violence. I do know in a libertarian society you're not welcome. You're a leach",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Sea_Journalist_3615",
                                    "body": "\"Anarchism is a pipe dream imo, just like communism.\"\n\nMinarchy has been tried and it has failed every time. \n\n  \nTaxation is theft, enforced by murder and kidnapping.\n\n  \n\"Not judging you personally. I just think a lack of monopoly on violence creates violence.\"\n\nYour system is based on crime. You got nothing man. Literally nothing.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "mcnello",
                                            "body": "Whoever has the guns will always be your government, even if just by a different name. There is no way around that.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Sea_Journalist_3615",
                                                    "body": "\"Whoever has the guns will always be your government, even if just by a different name. There is no way around that.\"\n\nThat's circular. We must have government to stop people with guns taking over. Not an argument to support crime.\n\n  \nAll we have to do is switch to a consensual payment model instead of crime. That's it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ENVYisEVIL",
                            "body": "👆👌",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "luckac69",
                    "body": "Actually yes. Authoritarianism is opposed to Totalitarianism",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Carlose175",
                            "body": "How does this help an Anarcho Capitalist?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "hmmm, it's like saying - I love Bacon.  Hate seeing the pig executed that way though - too authoritarian and too powerful.   Grow up folks - you can't have it both ways.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Carlose175",
                            "body": "You can have it both ways. \n\nDOGE's implementation is bad for so many reasons. \n\nIf these things are not passed through legislature, they are at risk at becoming undone by the next presidency. And for what? Destroying the judiciary in the process?\n\nWe are not having our cake NOR eating it right now if things go the way they are going.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Maybe you don't know that the \"executive\" branch was elected by the people, and has term limits, where as the bureaucracies being cut were not elected...  Your statement of the executive branch being too powerful is rendered moot.  DOGE is doing exactly what people have voted for which is Democracy in action, not authoritarianism.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "Carlose175",
                            "body": "It seems you don't know what you voted for or what type of government the USA has.\n\nPeople voted for someone in the executive branch. You still have to vote for the legislative to get laws passed. And the judiciary is there to make sure all the branches remain within their scope.\n\nWe are not a democracy. We are a Constitutional Democratic Republic. The people don't directly vote on matters, we elect people to make choices for us and they're bound to the constitution.\n\n  \nSo when you say \"we voted for this\". No you did not. You just think you did. You just voted for a person to execute what the legislative passes. You have to vote for the house and the senate to get stuff passed. This is how its SUPPOSED to work here.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "You lost me when you said \"I don't know what I voted for\" comment.  You're an idiot.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Carlose175",
                                            "body": "You misunderstand my argument. Im sure YOU know that you voted for Trump and that you believe it's a sound vote.\n\nIm not attacking your judgement in that.\n\nIm attacking your judgement in the position that you voted Trump INTO. You do not understand what voting for the executive means.\n\nEDIT: Id avoid ad hominems. You look like you came from X with your lack of civics and conservative ideology. Try to keep It professional.\n\nI dont want to call you an idiot, but generally those who insult people in debates\\\\arguments generally tend to be idiots themselves. Just a personal observation of mine.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "sigh - trying to educate and reason with others on Reddit I find is often waste of time.    I'll give you one more try...  There's only one legitimate branch of government (of the big 3) that is not \"elected\" but is appointed - that's the Judicial Branch.  The Executive and Legislative branches are elected within a Constitutional Republic through a democratic process (with the caveat that the legislative does not have term limits where the executive does).  This is the crux of my statement that if an elected EXECUTIVE administration seems too \"authoritarian\" or too \"powerful\" like the TRUMP Administration - then vote someone else in.   Pretty simple.  If you don't like how the current executive administration is handling their policy enforcement, well, perhaps you can help vote for an alternative direction for the next round of campaigns.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Carlose175",
                                                            "body": "Your responses make zero sense and its like you're rambling.\n\nYour original comment is stating that the executive branch is not actually overstepping because they were voted in. Which makes zero fucking sense.\n\nThen you \"educate\" me about how the government works and how the judicial branch is appointed. How does this help your point?\n\nThen you tell me if I dont like it to vote for someone else.. I mean DUH?!\n\nIt is not of OPINION that I think the executive is overreaching. It is of LEGAL FACT. That's why the judges are doing what they're doing.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vvfella",
            "body": "Yay, more content about how if you aren’t a DOGE/Elon fan you must be a liberal and couldn’t possibly be a libertarian who doesn’t trust a grifter with conflicts of interest! What a nice variety of content we’re getting here…",
            "score": 250,
            "replies": [
                {
                    "author": "chrisnavillus",
                    "body": "Seriously, imagine if Biden had handed the keys to Bill Gates.",
                    "score": 85,
                    "replies": [
                        {
                            "author": "Epyphyte",
                            "body": "And he started canceling funding the funding of executive departments? Uh, yes please",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 41,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 26,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "seatega",
                    "body": "Same Russian bot posting all of them",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "AlienDelarge",
                    "body": "But this too shall pass.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "natermer",
                    "body": "You don't need to be a fan to realize what has happened to USAID and was is happening to other departments is a good thing. \n\nWhen you are shrinking government do you think you need praise from the people's jobs you are eliminating? \n\nThere is a shitload of people making bank off of taxes. Far more the most people imagine. \n\nScrew them.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "AngelsRangers",
                            "body": "Do you really think all of this cost cutting is going to turn into middle class tax cuts? I guarantee you when they revisit renewing the tax cuts from the first Trump administration, it will look the same. No meaningful relief for middle class guys like me and a ton of tax breaks for corporations and the rich",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "bravehotelfoxtrot",
                                    "body": "Regardless of whether this directly leads to tax cuts for you and I personally, slashing federal spending is a major prerequisite for nearly *any* positive progress. I agree with you that this likely won’t make a meaningful impact on our 1040s anytime soon, but that doesn’t mean there’s nothing to like here.\n\nTax breaks for businesses and rich people is still a net positive, if that is all that comes to pass and government doesn’t tax others even more to make up for it. I’d much rather *everyone* have their taxes mostly removed, but at least some people getting ripped off less is good (all else equal).",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": ">”*What a nice variety of content we’re getting here…*”\n\nYou’ve literally never come up with a single post on Reddit.\n\nInstead of being an armchair critic, post a discussion, article, question, or meme to discuss or debate your libertarian critiques of D.O.G.E. Or Elon\n\nD.O.G.E. is a libertarian idea.  Elon may or may not be a libertarian, but he is becoming more libertarian over time.  \n\nHe still has a long way to go.",
                    "score": -82,
                    "replies": [
                        {
                            "author": "vvfella",
                            "body": "Perhaps I am a hypocrite for not contributing the content I want to see, but that still doesn’t mean I can’t criticize you for posting the same type of thing over and over again that continues to misrepresent legitimate criticisms of the department 🤷‍♀️",
                            "score": 62,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": ">”*Perhaps I am a hypocrite for not contributing the content I want to see*”\n\nYes, you are **part of the problem** that you have with this sub.\n\n>”*but that still doesn’t mean I can’t criticize you*”\n\nStrawman fallacy.  My previous comment did not insinuate that you can’t criticize me.\n\n>”*for posting the same type of thing over and over again that continues to misrepresent legitimate criticisms of the department 🤷‍♀️*”\n\nD.O.G.E. has zero legitimate competitors.\n\nD.O.G.E. needs more competitors to audit the government.\n\nSo far, most libertarians in this sub like what they see…\n\nhttps://preview.redd.it/mnli8pdwb4je1.jpeg?width=753&format=pjpg&auto=webp&s=bf282e4659f772b3cfa82e3c29947f7e677f841e",
                                    "score": -38,
                                    "replies": [
                                        {
                                            "author": "SCB024",
                                            "body": "Libertarians: We need to reduce government size and spending.\n\nDOGE: Okay. On it. \n\nLibertarians: NO, NOT LIKE THAT!!!",
                                            "score": -17,
                                            "replies": [
                                                {
                                                    "author": "vvfella",
                                                    "body": "I’m not going to praise an untrained surgeon removing small tumors with a rusty kitchen knife while the patient is simultaneously bragging about planning to increase their radiation exposure. Methods matter and I’m shocked how many libertarians don’t see that or don’t care",
                                                    "score": 37,
                                                    "replies": [
                                                        {
                                                            "author": "twobugsfucking",
                                                            "body": "There are a lot of people who just prioritize low taxes above liberty and representation, checks and balances, and probably don't see one person making these calls about giving money back to us without representation as particularly more autocratic than many taking it from them. I think there is a big oversight here - everything else stopping the executive from just becoming autocratic being dissolved at the same time. But many people, and often the same people, have been around forever and are just desperate for a “win” and forgot republicans were not on their “team” - the risk you take when you give in and treat politics like a team sport. Hopefully they will be right and the cuts are used to fix the debt and not enrich the oligarchs but I think that's optimistic at best. I’m seeing a deficit ceiling that was just raised by a fucking trillion. And when you hear libertarians celebrating them talking about removing income tax remind them that they are also talking about hiking taxes on all goods and services by 30%. \n\nAlso many from the alt right who find small government subs and think they're just republican-extra-crispy.",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "SCB024",
                                                                    "body": "Sure thing, smart guy...",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "twobugsfucking",
                                                                            "body": "WTF is this comment? You see yourself in what I said? Registering a complaint? You got something smart to say yourself?\n\nEdit: Lmao it this is all it takes to get banned it was worth it. The cause of liberty is dying brothers. Good luck.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "atreeindisguise",
                            "body": "How can Elon be libertarian if he accepts so much money from the government? How blind do you have to be to think this man is doing this for libertarian ideals? It's oligarchy, plain and simple. That is NOT libertarian.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "The post is about D.O.G.E. and hysterical leftists overreacting to D.O.G.E.‘s discovery of moronic, wasteful government spending.\n\n**Don’t strawman and pretend that Elon Musk has to be a libertarian** to expose the stupidity of decades of Democrat and Republican policies.\n\nIf Bernie Sanders or Elizabeth Warren were smart enough to come up with D.O.G.E. then libertarians would have been cheering them on as well.\n\nBut they aren’t.  They are mindless, socialist, NPCs like most Redditors:\n\nhttps://preview.redd.it/1h7d5nmgr4je1.jpeg?width=1290&format=pjpg&auto=webp&s=6764e399aea669b279d6d901f5a1977f6d44120a",
                                    "score": -11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "factisfiction",
                            "body": "You're a mark. You will see that one day.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "**Try thinking** and come up with an intelligent rebuttal instead of resorting to a childish ad hominem.",
                                    "score": -16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Top posting boomer shit. You’re a mod, act like it.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -25,
                            "replies": [
                                {
                                    "author": "byzantinian",
                                    "body": ">There’s a situation with his son Xavier who turned transgender that Elon thought the doctors were helping him, but really they weren’t in Elon eyes is in my opinion why he’s helping Trump exposing all this corruption.\n\nWhat in the name of Alex Jones is this babbling non sequitur culture war bullshit? What the fuck is going on here?",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "Good points.",
                                    "score": -6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Azraelontheroof",
            "body": "I think a lot of the concern is the approach to let’s just stop all the spending immediately and fire a lot of very qualified people before the investigation is even done. Oh and who is doing the investigation and the security risks it poses. Why no audit on the billionaires with billions in unpaid taxes? There’s more money there cumulatively one would suspect. No doubt there’s been misappropriated money by the way, but there are ways to do things without just tearing down years of work without much thought.",
            "score": 38,
            "replies": [
                {
                    "author": "kkdawg22",
                    "body": "As someone who is making a living helping wealthy people pay less in taxes, legally... auditing billionaires won't do shit. Congress has designed the tax code to legally help the rich pay less as a rate in taxes than we do. This would just be a big waste of time and money, the solution is simplifying and rewriting the tax code.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Deradius",
                    "body": ">I think a lot of the concern is the approach to let’s just stop all the spending immediately and fire a lot of very qualified people before the investigation is even done. \n\nSounds fantastic.  The feds are doing all sorts of garbage they have no business doing.\n\nIf I could push a button and unemploy every single TSA employee right now, I’d karate chop that thing in an instant.  I don’t need to review anything.  The whole agency can go overnight.\n\n> Why no audit on the billionaires with billions in unpaid taxes?\n\nRegulatory capture.  The billionaires rigged the system a long time ago.  The audits will come back clean.  Law is a tool the powerful use to perpetuate their power.\n\n>there are ways to do things without just tearing down years of work without much thought.\n\nIf I spend 50 years building a 300 foot tall mountain of dog shit, that does not mean it has value, no matter how much work I put in.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Azraelontheroof",
                            "body": "Except it’s not a mountain of dogshit, it’s a system which has a lot of flaws but ultimately supports the day-to-day safety of millions. It needs changes, why just tear it down blindly before even arriving at fact-based conclusions? Because you don’t care until one day these things affect you personally. A completely selfish and apathetic party.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Deradius",
                                    "body": ">it’s a system which has a lot of flaws but ultimately supports the day-to-day safety of millions.\n\nMore detail please.  I need to know what you mean in order to constrain my response and keep it from being so long as to waste your time.\n\n>It needs changes, why just tear it down blindly before even arriving at fact-based conclusions?\n\nWe’re speaking in very broad generalities here and it’s depriving the discussion of meaning.\n\nFirst, the whole thing isn’t being torn down.  Most of the federal government will stay right where it is.\n\nSecond, of the things being gotten rid of, what concerns you?  The department of Ed?  What business is it of the federal government how a given state runs its schools?  Why is the government in the loan business?  Schools can and do (and should) absolutely exist without the federal government sticking its nose in.\n\nA bunch of old billionaire owned white dudes in DC do not know how your kids need to be educated, unless you happen to be a billionaire owned white dude living in DC as well.  In which case congrats.\n\nBy the way, Trump is a heinous tyrant.  He just doesn’t happen to be completely wrong about this particular thing.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Parabellum12",
                    "body": "You’re suggesting private citizens get audited before the government. That’s not how this works. We’re not in a deficit because there some unpaid taxes, theres a deficit because the government pisses money away. \n\n\nAnd even if they are qualified people, it becomes irrelevant if they’re job are not necessary.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Azraelontheroof",
                            "body": "I’m suggesting that if we can have satellites fly across the solar system we can feasibly audit both at the same time. Billionaire apologists are living in a delusion fed to them by people who see them as less than human.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Parabellum12",
                                    "body": "I’m not an apologist. Resources are better spent fixing what’s broken in our government before going after people in the private sector. All that found tax money isn’t going to do anybody any good if the government is going to send it to Pakistan for gender studies bullshit.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Azraelontheroof",
                                            "body": "I’m so sorry but hundreds of billions being sat on is absolutely part of what’s broken and is on par if not greater to government inefficiency and misappropriation.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Parabellum12",
                                                    "body": "Hundreds of billions? The hyperbole is wild.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Azraelontheroof",
                                                            "body": "CNBC has it as $150bn, the Peter G. Peterson Foundation has the tax gap itself at $688bn per year. Interestingly the Peter G. Peterson Foundation has the backing of billionaires.\n\nEven if we called it short at $100bn or even $50bn, you’re talking about a huge number at least in reference to specific things like USAID which is hot right now. \n\nYou could also talk about wealth inequality generally but that is basically the result of having a market like we do and it’s sort of out of the remit of the discussion.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Parabellum12",
                                                                    "body": "Lmao I know you aren’t a libertarian if “wealth inequality” is an issue for you. Why the sudden interest in this sub?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "atreeindisguise",
            "body": "Seems like the feed is trying to brainwash us into accepting corporate welfare for the richest man in America. We aren't getting any of the money back. It will all be converted to space x dollars.",
            "score": 41,
            "replies": [
                {
                    "author": "bongobutt",
                    "body": "SpaceX will receive $1tril a year? I mean, anything's possible. But dang do I think that ain't happening.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "kkdawg22",
                    "body": " Did you know Space X hasn't received a single subsidy from the federal governemnt?",
                    "score": -7,
                    "replies": []
                }
            ]
        },
        {
            "author": "flagstack",
            "body": "Or I have been waiting 4 years for a large tax return along with a handful of clients in the same boat and the irs is so under staffed some days you call and a message says we have too many calls waiting call another day and disconnects. I have spent hours sitting on hold.",
            "score": 11,
            "replies": []
        },
        {
            "author": "LagsOlot",
            "body": "IRS agents investigate crime through the lense of taxes. Sure taxation is legalized theft, but that is still not a justification for a private citizen to defraud another. Unless you're a Communist and don't believe in property rights.",
            "score": 29,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "https://i.redd.it/2rnrs790b4je1.gif",
                    "score": -3,
                    "replies": [
                        {
                            "author": "LagsOlot",
                            "body": "Not protecting personal property rights is communism. By definition.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "bongobutt",
                                    "body": "If you don't advocate stealing, you advocate stealing!  \n...wait.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "doesnotexist2",
                    "body": "\"IRS agents investigate crime through the lense of taxes\". Disagree. My father was audited for 2 years for his construction business that does 300k/yr in work. He maybe wrote off an extra 10k in expenses as business expenses. In the 2 years of auditing process, meeting with an agent 30 times, the irs probably spent 100x the extra tax he would've paid, just in the money they paid the agent as well as the behind the scenes auditors. IRS auditors are total BS scum.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "kkdawg22",
                            "body": "Agreed, working in the accounting field, I've quickly realized that the bar for entry as an IRS agent is extremely low.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "chainy",
                            "body": "If a burglar steals $500 of stuff from you I’m sure the cost of prosecuting them is higher than that. Should we just not prosecute burglaries unless it exceeds a certain threshold?\n\nThe enforcement is a deterrent, not a means to recover what is owed. If no one who committed tax fraud under $10000 ever got investigated a lot more people would commit tax fraud up to $10000.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "bongobutt",
                                    "body": "\"Defrauding\" someone in a civil case means you accepted money from someone else under false pretenses, amounting to a form of indirect theft.  \n  \n\"Fraud\" in an IRS sense means lying or hiding information from the government, so they don't steal as much from you as they said they wanted to.  \n  \nThe tax payers don't have a legitimate claim to the funds of anyone, even *the dirty, rich billionaires.* So if the claim isn't legitimate, then the \"fraud\" isn't legitimate. The IRS is brute force. Nothing more. I don't support tax fraud, because it isn't an effective form of resistance. It allows people like you to make silly arguments, and ultimately just distracts from the issues. But that doesn't mean that the IRS is justified. They are thieves, but I don't recommend trying to shoot them or resist them.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LagsOlot",
                            "body": "Good for you you switch to the correct terminology but the end of the post. Might want to edit the rest of your post.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Temperature-Other",
            "body": "I was all for it. They should have been implemented to go after the super wealthy dodging their taxes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Slowknots",
            "body": "Remember anything that a president can quickly undo the next one can quickly restore.",
            "score": 3,
            "replies": [
                {
                    "author": "bongobutt",
                    "body": "Lately, I've been thinking that the plan is to rip off the bandaid. If we tried to repeal each of these issues one at a time, each individual interest would spend every ounce of political capital to drag their feet and prevent any progress. But what if they rip all the dead limbs all at once? Then, after the public sees with their own eyes that the sky isn't falling, and that the \"disaster\" or \"crisis\" that D.C. is screaming about doesn't come to pass, they'll have a shot to repeal all of those departments using Congress in one fell swoop 2 or 3 years from now. Maybe I'm wrong, but this all reeks of being very well thought out and specifically executed. I don't know what their plan is, but they clearly have one. We'll just have to see if the plan is any good (for us, that is).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Slowknots",
                            "body": "It’s a shock and awe campaign.   Nothing more.  \n\nIt’s a fucking shit show of a plan and execution.   I actually traveled the US and world to improve efficiency in multiple companies - large and small.   \n\nThis isn’t this way to improve efficiency in any organization.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Which is the problem with democracy in the first place.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "NDA0000",
                            "body": "Genuine question, what do you think is a viable alternative to democracy?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "andrew_ryans_beard",
                            "body": "No, that's the problem with Congress ceding more and more of its authority to the executive.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Opening-Wasabi-9018",
                                    "body": "No democracy is a brain rot idea",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Carlose175",
                            "body": "We dont have a democracy, we have a constitutional democratic republic. \n\nThe people dont make decisions, we elect people to make decisions for us.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BerryHumble4585",
            "body": "Why is everyone just willing to hand over the keys to Elon without asking any questions though? That’s my concern about Doge. How do we know he’s not just serving his own best interest and feeding the public what they want to hear to get them riled up. As a libertarian I like the concept but hate the execution as this could quickly shift into authoritarianism instead of libertarianism",
            "score": 3,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Valid concerns 👌",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "perfec7paradox",
            "body": "No one is freaking out over the exposure. It's the morons running the program that everyone doesn't like",
            "score": 4,
            "replies": [
                {
                    "author": "bongobutt",
                    "body": "Some people in D.C. are absolutely freaking out about the exposure. They might be small in number, but they are *not* small in influence (at least until maybe now). They have worked for decades to make sure that each of these subjects were a third rail, and that people were called crackpots for claiming any malicious intent was involved or that any deeper investigation was needed.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "EntrepreneurNo3107",
            "body": "I LOVE the idea of slashing the budgets and spending.\n\nBut Elon isn't a very easy guy to trust with such a thing. Seems more authoritarian than libertarian in its implementation.",
            "score": 2,
            "replies": [
                {
                    "author": "gatornatortater",
                    "body": "You shouldn't trust any of them.. but..  when something good happens, don't complain about it.\n\nWith that said...  it does look like he will be the one who will be instigating the digital cashless track you everywhere currency this year or the next.  Yeh Amero!  ;/",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BlakJak_Johnson",
            "body": "Why does OP think they were hired for him?",
            "score": 2,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Notsmartnotdumb2025",
            "body": "this",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hench999",
            "body": "Back when Ron Paul ran for the second time, there was genuine excitement about his chances in Iowa. Of he could win Iowa, he could gain momentum and possibly have a shot, was the discussion. When that was being discussed, there was plenty of libertarians almost with a \"he has no shot, so why bother\" attitude. \"They will never let him win. How naive you all are for having hope and trying\" etc. Then, many would go on to say that Paul was just controlled opposition anyways. Yeah, I heard that one way too many times.\n\nI'm tired of the everything sucks and can and will never change my attitude. \"All sidesbare garbage, look how edgy and cynical I am\" so on and so forth.\n\nThe fact that many libertarians can't even be somewhat happy that SOME decent changes might happen. For the first time, these departments are being looked at. I don't think some golden age utopia is going to come of a Trump, but that doesn't mean I can't acknowledge that a few good things can come of this. I don't have any smore patience for the uber cynical all sides suck shtick  some libertarians feel like they have to keep up regardless of anything that happens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GopnikOli",
            "body": "No they’re not. This is another borderline MAGA own the libs take from yourself. I genuinely think that this OP is a bad faith poster lately.\n\n**Banned for this comment oof. How cool**.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Awkward_Ambition1143",
            "body": "This 👌🏾👏🏾👏🏾👏🏾",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperTrooper112",
            "body": "\\*sigh\\* this gross generalization has definitely been making the rounds and is getting pretty tired. \n\nPeople are freaking out over the shady and untrustworthy means and methods employed by doge up to this point. People are freaking out because it is uncertain who on their team is vetted or even qualified to handle classified information and those fears are unfortunately coming to light with an apparent posting of classified data. Our adversaries are most certainly loving the incompetence. \n\n[https://newrepublic.com/maz/post/191580/elon-musk-doge-classified-us-intel-data-website](https://newrepublic.com/maz/post/191580/elon-musk-doge-classified-us-intel-data-website)",
            "score": 1,
            "replies": []
        },
        {
            "author": "JohnKorducki",
            "body": "I don’t really think there are a lot of people freaking out. I think most of it is left wing politicians and aligned media trying to tell you people are freaking out, trying to paint a narrative of chaos.",
            "score": -10,
            "replies": [
                {
                    "author": "theonly764hero",
                    "body": "Because the media, as we have just found out, receives tens of billions of dollars in subsidies from government. And we wonder why they’re freaking out. Couldn’t be because their slush fund accounts are drying up.",
                    "score": -3,
                    "replies": []
                }
            ]
        }
    ]
}