{
    "title": "Expertise Requested: RE the politics and finances of US Dental care",
    "author": "dexknows33",
    "subreddit": "Libertarian",
    "rank": 332,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 1,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ipd403/expertise_requested_re_the_politics_and_finances/",
    "id": "1ipd403",
    "selftext": "Alright - I’m hoping someone on this page can help me out with a little thought experiment I have been considering working on. \n\nI think the financially-inclined sect of members on this page have likely all had conversations with non-libertarians about how government regulations, corporate influence on policy, etc within certain industries has inflated the price of the product for Americans. I had a real-world example come up in conversation (again) and wanted to put pen to paper with some more formal research into the history. \n\nI was playing cards at a Super Bowl party and one of the families mentioned that they had went to Mexico for dental work recently. A couple of crowns, some other routine work and I think one dental implant. They mentioned that even with insurance, they were able to fly their family to Cancun for 10 days, have their dental work completed, pay for all meals and expenses at a resort, and still came out about $15k ahead of what just the dental work would have cost in the US. I have heard several similar stories but it led to a comment by a left-leaning individual along the lines of “capitalism bad”. \n\nWhat I would like to do is have someone point me in the right direction for where I should start my research. My hypothesis is that there was a date at some point in the past where dental work in the US was reasonably-priced and that over time regulations, policies and other laws led to the price of these services rising much faster than the rate of inflation. \n\nAnyone have any background on where to start? What laws directly impacted dentist’s ability to price their services competitively? Was there a formation of a governing body that accelerated the rise of costs? Any background would be great for me to get started. I’d like to put together a timeline and tie that back to basic Mises principles to show people a real-world example of how government intervention hurts our purchasing power within specific industries. \n\nTL;DR: Looking for expertise or knowledge on the history of why American dental costs have inflated so much in relation to both other countries and our own economy. \n\n",
    "comments": [
        {
            "author": "dexknows33",
            "body": "Alrighty. Libertarians are maybe a little light on the topic of dentistry regulations lol.",
            "score": 1,
            "replies": []
        }
    ]
}