{
    "title": "Elected Libertarian threatened with tasers?!?",
    "author": "Drewcrew73",
    "subreddit": "Libertarian",
    "rank": 289,
    "score": 104,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 14,
    "url": "https://v.redd.it/3vh9qlztndje1",
    "id": "1iqd04l",
    "selftext": "This is the same councilman that was trespassed from a public office for telling a city employee “I’m a little disappointed in you”  thus, allegedly creating a toxic work environment. But it’s ok for multiple people to joke about tasing him in an open meeting 🤷🏼‍♀️ ",
    "comments": [
        {
            "author": "Odins_Infantry",
            "body": "Not that i normally give a damn but I think they also threw in a little \"body shaming \" as well. Just for good measure",
            "score": 27,
            "replies": [
                {
                    "author": "Jerclaw",
                    "body": "I interpreted it as they may need a couple for other people.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Drewcrew73",
                            "body": "Always a possibility",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Drewcrew73",
                    "body": "I never thought about that. I took it as that way several of them would have the pleasure of tasing me.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Odins_Infantry",
                            "body": "Might be but I'd wager it meant they would needed multiple to take him down.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Drewcrew73",
                                    "body": "You may be right. That’s what many others who have seen this thought as well",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "I think all of these people should be jobless, BUT this was clearly just light banter, not a threat.",
            "score": 5,
            "replies": [
                {
                    "author": "Drewcrew73",
                    "body": "Agreed, only thing I take issue with is these same people celebrated when I was trespassed from a public office to telling a city employee “I’m disappointed in you”",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "They should be tarred and feathered",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Blobwad",
            "body": "I interpreted it as she thought the speaker was going to do something sketchy. The slow buildup lets people start filling in the blanks of worst case scenario.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beginning-Shoe-9133",
            "body": "Where is this?",
            "score": 2,
            "replies": [
                {
                    "author": "Drewcrew73",
                    "body": "Good ol Ohio",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "wgm4444",
            "body": "NAP or no NAP, some people just need a punch in the face.",
            "score": 1,
            "replies": [
                {
                    "author": "Drewcrew73",
                    "body": "Everyone has a plan until they get punched in the face. Lol The question becomes, is it a NAP violation. One could argue that it is in response to aggression not the initiation.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}