{
    "title": "Trump added over $7 trillion to the national debt during his first term.",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 273,
    "score": 709,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 183,
    "url": "https://i.redd.it/o8dhfm2izhje1.jpeg",
    "id": "1iqrlbd",
    "selftext": "",
    "comments": [
        {
            "author": "metalbracelet",
            "body": "It’s really easy to get things done when you don’t care how you’re doing them.",
            "score": 313,
            "replies": [
                {
                    "author": "Ehronatha",
                    "body": "That's right - and in the case of the federal government, that's a good thing!",
                    "score": -43,
                    "replies": [
                        {
                            "author": "rhm54",
                            "body": "Yeah, who cares about laws anyways.",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "RedneckWeaboo",
                                    "body": "Not the federal government",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "fernospazzin",
                                            "body": "We’re all on a bus together. We can agree that our bus driver is bad. Does that mean I think there should be no driver at all? Hell no. \n\nYou’re an anarchist, not a libertarian. Do some self reflection",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Ardvarrk",
                                                    "body": "Because he said some bureaucratic dick suck laws don't matter? Hmmm, I'm not sure about that one.",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "author": "fernospazzin",
                                                            "body": "I am bud. Laws are an inter-subjective reality - same as social classes, the worth of the US Dollar, and virtually all religions - there is no higher powder dictating  the existence of these things, we define them as humans. Laws are ‘made up’ by nature - just like religion. \n\nThat doesn’t mean they don’t provide immense benefits to our lives. And im all for overhauling rules and laws that don’t make sense, but to say that all rules are bad, is simply shortsighted.\n\nEdit : it should be of GRAVE concern to every single one of us on this subreddit, libertarians, that our current sitting president established an ‘office of faith’ - not only does that offend our constitutions separation of church and state, that surely is not an EFFICIENT move for a SMALL government.",
                                                            "score": 14,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rhm54",
                                            "body": "Yep, but honestly I’m not sure you know what being a Libertarian actually means. Because “Fuck the governments made up laws” is an anarchist view, not a Libertarian.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Ardvarrk",
                                                    "body": "Hmm, so saying fuck the governments made up tax loop holes laws that benefit the rich is anarchist. I guess I don't want to be libertarian...guess I don't fit in anywhere",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "metalbracelet",
                            "body": "I want thoughtful, competent deconstruction of the regulatory state that is in the best interest of the freedom and rights of all individual citizens - not some unelected randos throwing their feces at everything because they have a hard-on for hating women and brown people.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Ehronatha",
                                    "body": "You ain't never gonna get want you want.\n\nWake up to reality, my friend.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rocco888",
            "body": "Its all bait and switch. Hes already asking for more debt for the tax cuts.\n\nHe blaming Biden for his debt and debts the GOP agreed to. \n\n[https://www.crfb.org/papers/trump-and-biden-national-debt](https://www.crfb.org/papers/trump-and-biden-national-debt)",
            "score": 44,
            "replies": [
                {
                    "author": "downtimeredditor",
                    "body": "Trump wanted Congress to remove debt ceiling entirely when they were negotiating a temporary budget prior to his inauguration. He wanted to be done under Biden but dems wouldn't budge\n \nhttps://www.nbcnews.com/politics/donald-trump/trump-calls-abolishing-debt-ceiling-rcna184820\n\nDude is likely going to increase the national debt a ton",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Republicans (including Trump) and Democrats (including Biden) are all part of the problem.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Ardvarrk",
                            "body": "Yep, there is no solution with either party in power. It's incredible how many folks, after 100s of years, keep thinking red or blue is their savior and they must align on either side.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "rocco888",
                            "body": "Absolutely",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "International_Lie485",
                    "body": ">Hes already asking for more debt for the tax cuts.\n\nFuck the \"debt\", abolish income tax.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "stockchaser317",
            "body": "I'll be more impressed when I see government agencies being shut down and taxes being either vastly reduced or eliminated altogether. Inflation is killing the lower and middle class, tax relief would be a huge help.",
            "score": 147,
            "replies": [
                {
                    "author": "Ehronatha",
                    "body": "We can't reduce taxes until the budget is balanced and the debt is being paid down.  Those should be the first two priorities.\n\nPaying down the debt will take credit out of the system, which will deflate the money supply.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "ChitteringCathode",
                    "body": ">vastly reduced or eliminated altogether.\n\nGood luck with that one.  Trump just said \"tariffs alone are what created this vast wealth for this country.\"  He may as well say \"The right kind of taxation is what made America great.\"  What an absolute joke.  I look forward to paying 3% less in income taxes and 100% more for everything because we slap tariffs haphazardly on anything and everything.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "Imaginary-Win9217",
                            "body": "He likes to compare his ideal government to when America was super rich and super tariff-y. The very same period when the large majority of wealth was split across 4 people",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Thedjdj",
                                    "body": "We’re in the Second Gilded Age. Unfortunately, the decades long propaganda campaign against unionisation has encouraged large swaths of the service economy that unionism is beneath them. ",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "obtk",
                    "body": "Don't worry, the tax relief Trump's interested in will trickle down any day now.",
                    "score": 123,
                    "replies": [
                        {
                            "author": "DrooshBagggg",
                            "body": "Objectively - nobody in office will do anything that will benefit us for the greater good. Republicans and democrats have been spending us into oblivion for a while now. Promise after promise gets thrown out the window. It’s power they all want and nothing else.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "petertompolicy",
                    "body": "The tax cuts are already in effect.\n\nThey only help the rich, and actually make things more expensive for everyone else.\n\nYou'll be shocked but the richest man in the world and a democrat billionaire from new York who rebranded as a Republican, because he thinks they are even easier to control, don't give a fuck about you.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "InTheSharkTank",
                    "body": "What really matters is cutting the spending. Whether or not they cut taxes, if they don't cut spending, they will inflate away the value of your wage.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "WhitePantherXP",
                            "body": "Let's not forget how a massive decrease in spending (GDP) by the populace will impact this equation.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lippspa",
                    "body": "They want to replace the income tax with Tariffs as far as I understand it won't relieve the common American.\n\nIt's gonna raise prices and when it comes to income tax.... The rich get the best deal when they pull that and everyday stuff is more costly",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Thebeardedragon",
                    "body": "Wouldn’t tax relief make inflation worse?",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Roctopuss",
                            "body": "Why would you think that?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "snowyflynfish",
                                    "body": "inflation is caused by an excess of money supply. tax cuts means more money competing to buy the same set of goods.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "International_Lie485",
                                            "body": "Oh the government doesn't buy goods? The government doesn't buy cars, the government doesn't buy paper, or printers, or printer ink?\n\nThe government doesn't pay salaries?\n\nTaxes have nothing to do with inflation.\n\nInflation is when the government prints more money (expands money supply).",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "snowyflynfish",
                                                    "body": "inflation is caused by money supply outsize goods produced. tax cuts put more money out into supply, effectively printing money. cuts to government spending are a very good way to curb inflation, but paring it with tax cuts just means that the money removed and the money added balance, resulting in only minimal effects on inflation.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "International_Lie485",
                                                            "body": ">inflation is caused by money supply outsize goods produced.\n\nI see you have a libertarian tag.\n\nThis awesome book was published in 1933, please read it and stop spreading government \"economics\".\n\nhttps://cdn.mises.org/Fiat%20Money%20Inflation%20in%20France_2.pdf",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "snowyflynfish",
                                                                    "body": "fiat money inflation in france is a great book, but hardly relevant to what we’re talking about here. it was also definitely not published in 1933 lol. both classical and keynesian theories agree that deficit spending is correlated to inflation. tax cuts increase deficit spending on their own. the only times inflation decreases with them is when spending is cut by a greater sum.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "International_Lie485",
                                                                            "body": "> both classical and keynesian theories agree that deficit spending is correlated to inflation.\n\nWhere does the money for \"deficit spending\" come from?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "snowyflynfish",
                                                                                    "body": "how do you mean? the government normally takes it on loan (mostly from domestic lenders). if this is about printing, it should be understood that the government doesn’t do that much these days (less than ten billion being planned for printing this year). issuing of new currency only really happens to keep up with economic growth, with most inflationary effects coming from the lending (or fed policy).",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "International_Lie485",
                                                                                            "body": "My brother in christ, nobody has $36,000,000,000,000 to lend to the US government.\n\nThe federal reserve prints the money (changed digits on a computer) and then the US government pinky promises to pay itself back.\n\nhttps://www.usdebtclock.org/",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "snowyflynfish",
                                                                                                    "body": "there is not much i can say other than that this is simply not true. all of the government’s debt is debt because it was once loaned and is waiting to be paid back.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "International_Lie485",
                                                                                                            "body": "$36,000,000,000,000 does not exist to lend to the US government.\n\nThe federal reserve just changes digits on a computer and the government \"promises\" to pay it back.\n\nAt any time they can cancel the debt and just not pay itself back.",
                                                                                                            "score": 0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Roctopuss",
                                            "body": "Great, so we agreed that higher minimum wage causes inflation!",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "snowyflynfish",
                                                    "body": "increases to minimum wage do not increase the money supply. typically, the money for increased wages comes from other employees being laid off or other corporate spending cuts. the decreased production can induce shortages of goods, but in modern times these effects have been mitigated by automation.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Roctopuss",
                                                            "body": "You can use the same exact reasoning for tax cuts. It doesn't increase the money supply at all. Only the Fed can do that.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "snowyflynfish",
                                                                    "body": "this is a common misunderstanding about the fed. the fed does not print money, nor is it the sole control over the money supply. they use targeted efforts (interest and reserve rates(though less now)) to affect lending and increase or decrease the availability of capital. this is wholly divorced from government taxation and spending, although they do base their policies on it.\n\ntax cuts put money into the market that otherwise would not have existed. they can be balanced with spending cuts, but doing so would see only minimal effects on inflation.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tldrthestoryofmylife",
                    "body": "It's happening already. Thousands of federal employees are being fired, and that's just the news of the past couple days. DOGE has saved taxpayers $100B so far, and while that's not enough in the grand scheme of things, you can't say we're not getting somewhere.\n\nI don't wanna sound like a bootlicker; I agree that the likes of McConnell and Nikki Haley have destroyed any reason for you to trust the Republicans, and that a lot would have to change for most people to consider finding something to agree on with them. However, Trump's not the same as the GOP warmongers, and we see more and more evidence of that in the coming days and weeks.",
                    "score": -44,
                    "replies": [
                        {
                            "author": "stockchaser317",
                            "body": "What's going to happen to all these \"savings\" tho? Doesn't Congress hold the keys to the purse? The saved money will just get funneled to the next sand war or straight to studying penguins on LSD :-/",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Honestly... I would like to see what happens to penguins on LSD.....",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "Lippspa",
                                            "body": "Cats on LAD videos wee funny in highschool sad now",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "https://youtu.be/Ta1F26KYc1A?si=Fh_YKQUGVE7nnP8X\n\nThis jaguar consented to the ayahuasca trip...",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Futureinspiration-23",
                                    "body": "More for IS RA EL",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "organic_nanner",
                                    "body": "Welp, ask that question after we pay back the $35trillion we have borrowed.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "PsychologicalGain298",
                                            "body": "No one is going to pay that debt down. Trump expecting it to increase 4T THIS YEAR!!!",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "organic_nanner",
                                                    "body": "The only way for the deficit to go down this year would be to cut military spending by about 75% (which I am all for), but it will take years to start any new government projects.  The US Gov  is broke.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Fenrir324",
                                                    "body": "Pretty sure most of that is to finance interest, at least a good chunk of it is.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rosebomb01",
                                            "body": "With all these savings at least we Republicans won't add to the debt. O wait didn't i just see something about  adding a lot more to the debt?",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "Interesting_stuff2",
                                            "body": "This 👆",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "tldrthestoryofmylife",
                                    "body": "Agreed, the only lasting solution is to mobilize Congress to strike down some of these insane programs that are already in place and keep more from getting passed.\n\nTrump's moving in the right direction, but his four years alone won't be enough to undo what the deep state has had the last 40+ years to do. What we need is a cultural revolution based on libertarianism where more people demand transparency and accountability from the state.\n\nI'm as \"hardcore\" as the libertarians come in that I believe the state only exists to protect your property rights against violence, and that the private sector (e.g., people like Erik Prince) can do even that if you try hard enough. However, the first step to draining the swamp is shining a light on the behavior of the authoritarians, which Trump is definitely doing more of.",
                                    "score": -6,
                                    "replies": []
                                },
                                {
                                    "author": "casinocooler",
                                    "body": "Correct me if I am wrong but the next time a budget comes around, the amounts allocated to non-existent programs and projects should be significantly reduced. I am more concerned about spending going forward than the difficult task of trying to claw back money already allocated. The amount of attention this is getting will surely reduce the number of stupid pet projects in future funding.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Thencewasit",
                                    "body": "That’s the best part of what DOGE is doing, by gutting the agencies you reduce the numbers of programs and projects that can be serviced.  The legislature doesn’t want to take the lead on the specific projects, so they funding will go to the agency and with no one to administer it will just sit.\n\nThere may be a few zealots who will try and get more money and grants out the door of the agency, but they will likely not be able to follow all the rules and laws and so they will quickly learn to keep their heads down.",
                                    "score": -10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PsychologicalGain298",
                            "body": "Juat to pay for more tax cuts for billionaires? What do you expect the endgame to be?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "tldrthestoryofmylife",
                                    "body": "\"Tax cuts for billionaires\" is just a party line designed to give you something to get outraged about. Trump never cut taxes for billionaires; at best, it was Reagan and Bush that did that, and Trump's not them.\n\nI don't care if billionaires are richer than me as long as they can't use their money to buy politicians and rig the system in their favor; without that, the free market will redistribute their wealth soon enough just like with everyone. Trump's making it harder to buy politicians by creating transparency and accountability, whereas both the Dems and the likes of McConnell on the GOP want to make it easier to do so.\n\nYou've been gaslit so bad that you think you're a libertarian but you trust the guys who overtly call for big government over the one who's firing people and shuttering agencies. Make it make sense!",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "PsychologicalGain298",
                                            "body": "That take is so ridiculous i would be shocked if you weren't laughing while you typed it. You missed every target.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Yabbos77",
                                            "body": "Do you think Elon didn’t essentially “buy” a politician?",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AlphaTangoFoxtrt",
                            "body": "1 step forward, 5 steps back. The GOP passed a bigger deficit and raised the debt ceiling $4T",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Inaise",
                            "body": "The tax money will not go back to the taxpayers. They will use it to fund Isreal, SpaceX and Tesla. We will pay the same or more taxes and have no idea where that money goes.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "tldrthestoryofmylife",
                                    "body": "You're a libertarian, so I assume you want a smaller government. Trump's firing people and shuttering agencies. Your problem is that you mistrust rich people altogether, so you think Trump and Elon are basically the same as the likes of Soros.\n\nYou need to face the facts. Your taxpayer dollars are already going to condoms for Gaza and sex change surgeries for Guatemala or whatever. If you're not mad about that being the case, but you're mad about the guy who exposed the corruption, then you're the problem.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "Yabbos77",
                                            "body": "The irony of you saying that person needs to face facts and then dumping the lie about taxpayer money funding “sex change surgeries” is hilarious. \n\nDid you even attempt to dig through the claims the White House made about USAID money compared to what it’s actually funding, or whether they combined USAID donations with state sanctioned donations?",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "treeloppah_",
                                                    "body": "Well all funds are fungible, so technically you can say whatever money you gave them is funding whatever.  So the question becomes, why is American tax payers giving money to any entity?  There must be a justification, and if the justification cannot be proven, IE: gave money to a country for a rural road but there is no road being built, the funds should end.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Living-Fill-8819",
                                            "body": "Tell us ol' wise one, when will the economy / stock market bounce back?",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "wazoomann",
                            "body": "Wow the downvotes - the guy is shrinking govt and you get downvotes",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 28,
            "replies": [
                {
                    "author": "CLE_BROWNS_32",
                    "body": "Also governments across the globe overspent as a reaction to Covid. The difference is the Dems kept spending after Trump.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "fredsherbert",
                            "body": "difference is fauci probably helped make covid and trump didn't fire him but instead let him run the show while he acted like his hands were tied",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Darmin",
            "body": "Doge has yet to save me any money, it has yet to lower any taxes. \n\n\nI'm happy to see federal employees fired, and their agencies stripped. \n\n\nBut if my taxes remain the same then it really feels like it was all for nothing. \n\n\nWhile I don't care for a great many things the USAID does, there's so many better places they could be looking into. DoD for example. I served for awhile and every year \"guys it's almost October we need ideas on what to spend the money on!\" \"No one gave satisfactory answers (aka the commander wanted something else) so we bought a smart board that will never get used, and 472947292 office chairs...again, no we didn't get a new microwave or coffee pot or new tools or a work gym\"\n\n\nWhile cutting government programs is a step in the right direction, we haven't yet taken a turn towards a smaller government. This is shown to be even more true with the recent budget proposal being even higher than what it has been, despite doge supposedly saving is millions per day. ",
            "score": 61,
            "replies": [
                {
                    "author": "Yabbos77",
                    "body": "Thank you- this is my biggest gripe. \n\nDoD- the Pentagon that hasn’t passed an audit in YEARS. Let’s START there. Where the BIG money is.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Likestoreadcomments",
                            "body": "Trump has recently proposed a treaty between russia/china and the US to denuclearize and halve the military budgets of all three nations. I know it’s not a doge audit yet but be patient. \n\nPlus theres also talks of having Ron Paul audit the fed. How are you not excited?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ChitteringCathode",
                                    "body": ">Plus theres also talks of having Ron Paul audit the fed. How are you not excited?\n\nThere is zero percent chance you believe this, right?  Do you really think Musk and similar will let Ron Paul anywhere close to a general audit?  Paul is one of the most honest politicians alive, and would 100% raise the alarm regarding corruption at the hands of oligarchs like Musk, who have benefited from corporate welfare and lobbying more than about anybody in the nation.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "ChitteringCathode",
                                                    "body": "I reserve optimism for people and events in my personal life, not for corrupt politicians and their crew, and what they intend for my country.\n\nThe fact that you've turned the admin and his oligarch buddies into your identity speaks volumes about what you hold dear on this planet.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Yabbos77",
                                    "body": "Because I’m going fucking broke trying to feed my family. Because this audit has been peanuts so far. Why should I let them off the hook for not immediately addressing the ACTUAL spending issues? What is the line they have to cross before YOU start demanding answers too? \n\nI’m done being patient. All these “day one” bullshit promises. For not being a career politician, he’s sure good at faking being one.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "sadson215",
                                            "body": "Go work on yourself and audit yourself.  The government isn't there to save you. Trump reducing government spending isn't going to save you.  Government or no that's all on you.  \n\nYou have a family with little ones I assume. That's great you won life.  Quit bitching and get to work.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sadson215",
                            "body": "The secretary of defense said at a minimum at the end of 4 years he wants the Us military to pass an audit",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Chosenwaffle",
                            "body": "Didnt they start on USAID because it was the department with the highest number of exception forms? Basically they'd appeal whenever they were asked to lower spending.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "adriamarievigg",
                    "body": "Yes! Exactly!\n\nNormal Americans need to see the benefits and then we can truly come together. If all this cutting doesn't benefit us, then who cares. \n\nThe protests are starting to ramp up. We need to come together on this. DOGE should not be a partisan issue. Show us that this benefits all of us, or at the very least tell us what you plan to do with all these \"savings\"\n\nSorry Im dumb, but saying \"We're saving the Country from being bankrupt\" doesn't mean anything to me. Especially when I can't afford eggs!",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Darmin",
                            "body": "Yeah a detailed breakdown of the money that has been saved, and the programs cut would help. \n\n\nUnfortunately the USAID has helped a few people, so even if it's pointed out that 2 million was given to isis to fund if terrorists liked raping men or boys more, it would be ignored, because \"usaid gave condoms to africans! You hate africans!\"",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chester-Bravo",
                    "body": "You got new office chairs?!  All the chairs I had in the Marine Corps were ancient. \n\nI got assigned to supervise the warehouse downsizing for our squadron once. The amount of equipment in there that went to drmo or the dumpster was wild. Personally took $40k worth of printer ink and toner to recycling because it couldn't be used in anything on the base. Was so tempted to take it home to sell on eBay.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Mert83Ender85",
                    "body": "Eventhough it doesn't come to you as less taxes it will definitely reduce inflation",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "StopWhiningPlz",
                    "body": "Doesn't anyone remember it's only been a month since Trump took office? How fucking fast do things need to happen? Fucks sake, people...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Darmin",
                            "body": "I'm saying I won't be \"ohmygodilovedoge\" because they haven't produced any tangible benefits. \n\n\nOnce I see it is actually lowering my taxes, I will give credit. Until then I am happy to see what it is doing, but I am skeptical that there will be any outcome that american citizens will benefit from. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "skeletus",
                    "body": "The debt still has to be paid.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sadson215",
                    "body": "Well we have to see what happens with the deficit/debt.  If they manage to cut the debt then your money should be worth more.  That'd be a nice win.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nave8",
            "body": "Both sides print money due to overspending",
            "score": 32,
            "replies": [
                {
                    "author": "lordhoser",
                    "body": "Congress has the power of the purse.   What ever expenditures a president has are up to congress to approve.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Nave8",
                            "body": "It appears congress is made up of just the two sides......",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "daviddavidson29",
            "body": "Making PPP loans forgivable was the single biggest economic blunder of our lifetime",
            "score": 5,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "He blames COVID, there is some validity to that, but really, he just didn't know what he was doing.",
            "score": 43,
            "replies": [
                {
                    "author": "jmark71",
                    "body": "He still doesn’t - he just sits there signing whatever EO is thrown in front of him.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "PomeloPepper",
                            "body": "He doesn't care to know. All he's interested in is the fastest path between \"I want\" and \"I got.\"\n\nWhich to be fair, most of us want that. But we've evolved past the toddler mindset that no one and nothing else matters but \"I want.\"",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "He kept Fauci in power and bragged about Operation Warp Speed.\n\nLibertarians and AnCaps knew what was going on and Trump chose to ignore them.\n\nRand Paul, Ron Paul, and Thomas Massie were not silent in their criticism of government during COVID.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "RequirementUsual1976",
                    "body": "I fucking hate the dude but mass hysteria is to blame. No one knew what they were doing and we collectively fucked it all up.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "International_Lie485",
                            "body": "Speak for yourself dumbo.\n\nThe rest of us knew what was going on and got censored.\n\nThere is a reason they shut down Stefan Molyneux.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "legal_opium",
                            "body": "Plenty of us knew what we were doing. Heck I was wearing a mask back in February of 2020. Even my doctor thought I was being silly. Then they did the use any mask you can find including mask ones. \n\nLike a cloth mask is gonna do any sort of protection compared to an n95. \n\n\nI also advocated for a short temporary shutdown while youth who volunteered could intentionally get the virus. Then go home and isolate and then once they got natural immunity be the ones who help take care of the elderly so the elderly aren't around people who have it. \n\nOnce I had natural immunity there was zero reason for me to wear a mask anymore. \n\n\nIt all should have been about protecting the elderly who were at risk. Not trying to stop us young people from getting the disease. \n\nThe whole months on end lockdown nonsense along with stimulus checks and massive government spending   was incredibly pointless",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Consistent-Dream-873",
                                    "body": "So you essentially were pro government interference but it didn't happen how you liked so you are against it.  How about recognizing that the places that had the most brutal complete shutdowns only added (optimistically) 2 weeks to the average persons life.  How about zero shutdowns cause they didn't work.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "legal_opium",
                                            "body": "Yeah if there is a 9 percent death rate virus we should shut down (reports from Iran were that high) and we were seeing 3 percent death rate from Italy. \n\nAt least for a short time to slow the spread a bit and allow us time to create hospital beds and allow the warmer weather to come so we can have hospital beds outside. \n\nA short week or two week shutdown would have been way better compared to what we had. \n\nLibertarian doesn't mean anti government. Minarchy is a form of government. And a lab created virus released by the ccp that potentially targets the elderly so they aren't a drain on resources seems like it falls under the purview of the government to try and fight back.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Consistent-Dream-873",
                                                    "body": "Oh ok we're just making up numbers now 😂😂😂",
                                                    "score": -9,
                                                    "replies": [
                                                        {
                                                            "author": "legal_opium",
                                                            "body": "https://www.nbcnews.com/news/amp/ncna1142646 from Feb 2020. \n\nIts almost like i know what I'm talking about.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Consistent-Dream-873",
                                                                    "body": "Nice cherry pick now heres the top google result, one of many that actually show the truth and didn't take googling the most biased bullshit ever to lie 😂😂\n\nhttps://www.worldometers.info/coronavirus/country/iran/\n\nAlso look up what under percent is... You don't know what you are talking about and are wildly embarrassing yourself with propoganda meant to scare people like you.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "legal_opium",
                                                                            "body": "That's not a cherry picked response. Its literally what the death rate was reported as early on. \n\nThe death rate did plummet later on as testing went up and we realized many more people had the disease but was not showing symptoms. \n\nThere were no covid tests available en masse in feb of 2020.\n\nTrump didn't even care about it until the stock market crashed and then he was like oh shit im gonna lose the election if we don't solve this. \n\nThen came the warp speed bullshit which him and the media and medical community claimed would give immunity and which I knew was bullshit because cold strains which covid is mutate way too fast. \n\nTurns out I was correct on that also.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Consistent-Dream-873",
                                                                                    "body": "Oh ok so essentially you were wildly wrong and posted wrong numbers ok thanks for clearing it up lmfao",
                                                                                    "score": -4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "legal_opium",
                                                                                            "body": "No, i was talking about the point of view from watching  what was going on with China and the doctor who first reported on it being disappeared and the lockdowns there. Hence why said initial reports. \n\n\nIf anything I'm wildly correct on what happened and why. \n\n\nIt was obvious it came from a lab. The question was , was it an accidental leak or on purpose. And if it was leaked was it a bio weapon that got leaked ? \n\nIf it was a bio weapon that targeted the elderly (which to me it dows look like that) and communism is all about supposed greater good. I could totally see a communist country killing off thier elderly with disease and double points for it spreading to the usa and tanking their stock market.",
                                                                                            "score": 7,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Consistent-Dream-873",
                                                                                                    "body": "Well yes I agree with it coming out of a lab fauci denying it so adamantly without asking for any investigation, being involved in gain of function research IN Wuhan, and now being preemptively pardoned is all the proof I'll ever need.  That being said Iran's death rate was NOT 9% I don't care if it was at one point thats not the point u made originally.",
                                                                                                    "score": -4,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "legal_opium",
                                                                                                            "body": "Yes that is the point i made originally. I was clear in pointing out when the decision to do lockdowns was made this was the information that we had at the time. \n\nWe were told 2 weeks to slow the spread and lower the curve. Not to totally end transmission like it got warped into. \n\nLearn to read dude.",
                                                                                                            "score": 7,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Consistent-Dream-873",
                                                                                                                    "body": "Your point was that you were wrong and the data was incorrect lmao?",
                                                                                                                    "score": -4,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "jmark71",
                                                                                            "body": "Or just maybe that’s EXACTLY what data suggested at the time.  Hindsight is always 20/20 but at the time I fully believe we were doing the right things and doing what we could with the knowledge we had of the virus.  As that changed, so did responses.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Consistent-Dream-873",
                                                                                                    "body": "The data didn't suggest that necessarily though Iran is not a reliable country to collect data from and you are narrowing in on two examples that fit your narrative, which were proven to be false anyways.  Idk why you are insisting that you were right at the time when the long term data showed you were wrong anyways so it's a dead point it doesn't matter the long term data shows lockdowns didn't work.",
                                                                                                    "score": -2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shabamsauce",
                    "body": "To add, all the people that are throwing fits about it now, had a lot more power then.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "patiofurnature",
                    "body": ">but really, he just didn't know what he was doing\n\nThat's the obvious downside to short presidential terms.  I'm 100% for short terms and term limits for presidents, but because of them, we'll never have an experienced president, which means it will be rare for presidents to be good at their job.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "legal_opium",
                            "body": "Rome had 1 year consuls and that worked out fine for centuries",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "patiofurnature",
                                    "body": "Yeah, that's the whole point.  We want everything to be 'fine.'  The short terms are intended to eliminate 'awful,' but they equally block 'incredible.'",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Practical_Advice2376",
                            "body": "FDR ruined the presidency when he occupied it until he died. Although, if someone like Ron Paul had it for that long, he would probably bring it back to Pre-Wilson levels.   \nSo, a big government president will be disastrous for a long term, small government president beneficial. It all depends on the person.  \nArbitrary fixed terms are kind of dumb. If the president fails for 2 years he gets 2 more because that's the way we've always done it?",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Popular_Temporary_33",
            "body": "Why didn't he do it the first term?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Siglet84",
            "body": "https://preview.redd.it/te052ckgijje1.jpeg?width=992&format=pjpg&auto=webp&s=a69721a3ea8db96f27e019138f838c32b68b3258\n\nIt’s almost like the president doesn’t make the budget.",
            "score": 5,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "I think the COVID spending was justified, but he should have been cutting spending during his first 3 years in office. I can’t believe he was bragging about increasing defense spending as if the American people don’t already overwhelmingly hate the MIC.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Razrwyre",
            "body": "I think Trump's report card will come at the end of his term... ya, fingers can point every which way in the meantime, but how much, if any, he'll actually reduce/ cut from spending and the debt will remain to be seen. If all he does is cut spending in one place and spend that cash somewhere else, these conversations we're having now are pointless... \nI personally think the time of US financial superiority is over. I feel all he's trying to do, and all he'll accomplish, is delay the sinking of the ship, cuz the US debt is what will cause the ultimate downfall of the US... I think he knows that (maybe)...",
            "score": 8,
            "replies": [
                {
                    "author": "jussyjus",
                    "body": "Delay the sinking while they loot what’s left.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheDeltaAgent",
            "body": "Tbf, 4 trillion of it was the year Covid occurred. The overall point is valid because even without it, he would’ve added around the same amount as Obama, but it was inflated due to that.",
            "score": 6,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Correct. Would Trump have done that knowing what he knows now with Elon’s influence? Maybe or maybe not.\n\nTo blame Biden entirely for the inflation problem is disingenuous on the Republicans’ part. \n\nBiden did contribute to inflation, but it was also Trump and every single president before him that helped devalue the dollar.\n\nTrump got lucky that the inflation problem occurred when he left office the first term.  That doesn’t make him innocent of helping ignite the inflation fire.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silky_Mango",
            "body": "Imagine voting for Trump because you care about the deficit and debt lol",
            "score": 6,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "**Juvenile strawman logical fallacy.**\n\nImagine **not voting for Trump** because you care about the deficit and debt.  \n\nTry again and this time bring an intelligent rebuttal.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Silky_Mango",
                            "body": "Rebuttal: Trump isn’t good for the deficit or debt. Hope that was simple enough for you",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LouisDeLarge",
            "body": "You mean, when Covid happened?",
            "score": 18,
            "replies": [
                {
                    "author": "BigRed079",
                    "body": "He didn't do anything to shrink the defecit before covid either.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Hurricane_Ivan",
                            "body": "He was on a similar spending pace to Obama's 2nd term.\n\nOver $4 trillion of that debt came in his final year.\n\nMeanwhile Biden added $8 trillion and he gets a pass? Guess he fixed the inflation problem or something.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BigRed079",
                                    "body": "Democrats havent been running on \"fiscal responsibility\" my entire life.  Meanwhile every republican increases the national debt more than the democrat before them.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "TheBannedLibertarian",
                                    "body": ">He was on a similar spending pace to Obama's 2nd term.\n\nExactly…that’s not good.\n\n> Meanwhile Biden added $8 trillion and he gets a pass?\n\nYou just gave Trump a pass for COVID spending.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Covid “happening” doesn’t justify indenting future generations to cover the cost of PPP loans, EIDL loans, and stimulus checks to **inflict devastating inflation on the poor** and middle class.\n\nTheir cost of living isn’t going back to 2019 levels.  Their purchase power is diminished.\n\nEarth would have been **better off if the DMV did nothing** during COVID; as Sweden and then Florida eloquently showed.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "Ehronatha",
                            "body": "The fact that you have been voted down shows just how badly this subreddit is infiltrated by non-Libertarians.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "pro_nosepicker",
                            "body": "Except those 3 trillion dollar spending bills arose in Congress, not the exec branch.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "RockMars",
                                    "body": "President can veto a bill. When it’s something bad it’s congress but when it’s something good it’s the executive?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "RocksCanOnlyWait",
                                            "body": "Congress had passed the COVID spending bills by over 2/3, so the veto wasn't going to do anything other than look bad politically.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SatoriSon",
                                    "body": "I agree that Republicans in general have contributed to the anti-libertarian, big-government problem for decades, not just Trump by himself in the first term.  I'm hopeful he's changed from his big-spending tendencies, though.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Interesting_stuff2",
                                            "body": "To be even more correct, the problem is in having career politicians. When this country was founded, Congress met in winter, when people were idle since they couldn’t farm over the winter months. Congressmen traveled to the capital to run the govt for a few months and vote on important issues, then went back to work as farmers and other regular people in their states. It’s similar to many state legislatures today. We need Term Limits to get rid of these career politicians. I have a couple of friends, in both the house and Senate, both parties, and they have held discussions regarding Term Limits, but they quickly get shut down by the career politicians.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Living-Fill-8819",
                            "body": "ENVY lives on this sub blindly sucking off trump lol, he's a broke loser living in some shitty apartment",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Sea_6214",
            "body": "Including what Trump didn't do during his first presidency.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JimmyMcGill15966",
            "body": "Fair criticism for sure, but Trump 2.0 is a very different Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shoetreemoon",
            "body": "$6.7TT, but yeah. It's ridiculous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jackaboi1463",
            "body": "Tbf most of trumps spending was due to covid and precovid out economy and buying power was the shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Actual_Blueberry5940",
            "body": "How much did Biden add to the national debt during his term?\n\nBiden National Debt Growth\n\nPresident Biden added significantly to the national debt, with the U.S. national debt increasing by $7 trillion since he took office as of September 2024. \n\nAdditionally, the cost to service the national debt has grown substantially under his administration, with interest costs skyrocketing by 152 percent since January 2021. This increase in interest costs is partly due to higher inflation, which has led to higher interest rates and thus higher costs to service the debt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JimKkkrow",
            "body": "Thats what happens when you have a competent administration, things actually get done. Shows how fast the government can work if needed",
            "score": 1,
            "replies": []
        },
        {
            "author": "isthisavailable10",
            "body": "Well a huge chunk of that was tax cuts, wich while good only are only helpful if followed by spending cuts, wich wouldent have happened considering half the republican party hated him and fought him tooth and nail because he was mean and it wasn't good optics. The second half of his spending was a bill for covid relife that had more than 2/3 house and senate support so regardless of a veto they would over ride it and put it through.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Express-Ad-9326",
            "body": "by consolidating more and more executive branch power and literally calling himself king...and much of which he's doing is unconstitutional. Yeah that's not good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sukkamadikka",
            "body": "Plz add Corona, a global pandimic",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Soup-7720",
            "body": "If Trump actually wanted to be the hero, he would go after the world’s tax havens and put them on notice they have three months to reconfigure their economies before the rest of the world quarantines them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tycobb48",
            "body": "And Fauci's endaround Obama's no gain of function research lead to the global pandemic that lead to that expenditure...",
            "score": 1,
            "replies": []
        },
        {
            "author": "petertompolicy",
            "body": "They already budgeted adding another 4 trillion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zacspark2",
            "body": "I big chunk of that was the stimulus checks. Personally I think it was an awful move for the US. Not a trump hater but it really dicked up inflation",
            "score": 1,
            "replies": []
        },
        {
            "author": "Enough_Clock_3437",
            "body": "Little thing called Covid",
            "score": 1,
            "replies": []
        },
        {
            "author": "wtfredditacct",
            "body": "Trump had a lot of political insiders in his ear the first time. He had another 4 years in the middle to plan fire this.",
            "score": 0,
            "replies": []
        },
        {
            "author": "jerkhappybob22",
            "body": "6.5 trillion from trump and 7.9 trillion from biden.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Appropriate-Neat-771",
            "body": "Trump is all showbiz and debt balloons. Getting somewhere because of the dumb masses doesn’t count. Not an ubermench.",
            "score": -1,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "568 Redditors disagree.  But you keep on being a narcissistic, armchair liberal.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Callec254",
            "body": ">Trump added over $7 trillion to the national debt during his first term.\n\nLiterally *every* president from *either* party, going all the way back to Eisenhower has posted similarly shocking debt numbers for their time period.  This is more a symptom of just how massive this runaway train we call our government has become - trying to frame it as \"this president good, that president bad\" is a vast oversimplification of a much, much bigger problem.",
            "score": -4,
            "replies": [
                {
                    "author": "RockMars",
                    "body": "That’s just not true. Over Clinton’s two terms  there was a reduction in the national debt relative to GDP, from 47.8% in 1993 to 33.6% by 2000.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Enough_Deer9752",
            "body": "Trump's first term was the learning curve. He found out who he could and could not trust. Look at the cabinet picks now and how he's dismissing the career politicians this term. We act like having a president who hasn't been in politics most of their lives is a normal thing. It's clearly not.",
            "score": -6,
            "replies": [
                {
                    "author": "Living-Fill-8819",
                    "body": "lol he could've vetoed any budget",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Enough_Deer9752",
                            "body": "He did. He vetoed the defense spending for 2021. 740 billion dollars. That was overriden by the Senate.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "The-Dinkus-Aminkus",
            "body": "Idk did he \"add\" it or was that just what the government costs to run for 4 years? Seemed like every four months the last administration was putting up new bills with new larger number to seemingly one up anyone else giving money to other countries.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Cannoli72",
            "body": "Trump added over 8 trillion",
            "score": 0,
            "replies": []
        },
        {
            "author": "Azurill",
            "body": "We gonna be paying more taxes to make up for the tax cuts on the .1%. And they'll gut government assistance. I'm cool with paying less for less but paying more for less? Trump is the anti libertarian aka authoritarian fascist",
            "score": 0,
            "replies": []
        },
        {
            "author": "LaughingBob",
            "body": "Good luck with Polio, and maybe don’t go on an airplane for the next four years. Hope you don’t have kids in the military. Wouldn’t want them to die building Trump Tower in Gaza.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Scrumpledee",
            "body": "\"Rookie Numbers\"-President Musk, 2025",
            "score": 0,
            "replies": []
        },
        {
            "author": "nflreject",
            "body": "Out of honest curiosity.  How can we figure how much of that was for Covid and if that makes the general number any better or worse",
            "score": -1,
            "replies": []
        },
        {
            "author": "Large_McHuge",
            "body": "He didn't have president Musk to help him first time around.  Second term much better",
            "score": -7,
            "replies": []
        },
        {
            "author": "patbagger",
            "body": "Yep",
            "score": -2,
            "replies": []
        },
        {
            "author": "425Marine",
            "body": " I hope you all like the tax cuts he promised. You all got played. 🇷🇺🤡",
            "score": -2,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "This is a libertarian sub, genius.  Not a conservative sub.\n\nLearn the difference before you low-effort troll.\n\nLibertarians think that **both delusional Democrats and Republicans** are part of the problem.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "425Marine",
                            "body": "Libertarians didn’t vote this dumbass in?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "Let’s be clear: Libertarians didn’t put Trump into office.\n\n[Delusional liberals did](https://www.reddit.com/r/Libertarian/comments/1e8w8d9/biden_is_as_sharp_as_a_tack_sharp_sharp_sharp/?rdt=63873).",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "425Marine",
                                            "body": "Never said that, but a majority of libertarians did vote for Trump.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Grant72439",
            "body": "Ya well it was Covid beginning so there’s that",
            "score": -7,
            "replies": []
        }
    ]
}