{
    "title": "We Do Not Have a Free Market in Healthcare",
    "author": "CantAcceptAmRedditor",
    "subreddit": "Libertarian",
    "rank": 259,
    "score": 362,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 58,
    "url": "https://i.redd.it/3qxj18p7cqje1.jpeg",
    "id": "1irohx7",
    "selftext": "",
    "comments": [
        {
            "author": "BEGA500",
            "body": "We have managed to take all of the over-regulatory issues of government healthcare and combined them with all the problems of extreme profit motivated skimping and cost cutting. A real masterpiece.",
            "score": 77,
            "replies": [
                {
                    "author": "bob_maulerantian",
                    "body": "The main reason I've supported single payer system in the past is nuking the current system.\n\nAt this point unless you deal with the corruption it doesn't matter what you do.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "natermer",
                            "body": "The difference is that in USA you still have options. \n\nEven though they make it the biggest pain the ass possible you can simply avoid participating in the system except when it comes to compulsory payment to welfare services.  Like you don't have to pay for insurance. You don't have have to go to hospitals that accept medicare/medicaid (which is how the government enforces its regulations).  The options are rare, but they exist. \n\nIt is worse for people in UK who depend on NHS.  They are forced to pay for the bad system and then on top of that have to pay for private practice if they want decent care in a timely manner. \n\nIt is even worse for people in Canada were private healrhcare is simply not allowed in most situations. They have less freedom then the British do.  People with serious problems just have to run to the USA.  I can't imagine that is that pleasant or cheap.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Opening-Wasabi-9018",
                    "body": "I wish our healthcare was capitalist",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "thebosstiat",
                    "body": "It really is something.\n\nI tell people that the \"capitalist\" part of our healthcare system is that it works at all.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "natermer",
                    "body": "Yes and the \"solution\" that most people on Reddit seem to want is \"More Please\".",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nalsa-",
            "body": "Reminder that there is no country that subsidizes health care more then the USA.\n\nCronyism at it's finest.",
            "score": 41,
            "replies": [
                {
                    "author": "RaptorCaptain",
                    "body": "Can you elaborate, for my education?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheBannedLibertarian",
            "body": "Got the worst of both systems.",
            "score": 14,
            "replies": [
                {
                    "author": "LarryFalwell",
                    "body": "This is true.  And the politicians get say “the free market has failed” when the government is the biggest player.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "jmark71",
            "body": "Absolutely 💯 \n\nShit, Obamacare provided such a windfall for insurance companies via the enormous expansion of Medicaid plus the huge influx of customers forced to purchase individual coverage.\n\nI think everyone agrees the system absolutely sucks but other than more transparency into costs which I assume everyone here would believe in, I’d love to hear people’s thoughts on how best to improve it without the gov’t getting (too) involved.",
            "score": 23,
            "replies": [
                {
                    "author": "Opening-Wasabi-9018",
                    "body": "Answer is to remove government. The end.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jmark71",
                            "body": "Not sure that really helps much?  Companies aren’t going to start being more transparent about costs etc. without some sort of stick.  I do agree that regulation needs to be minimal but the government absolutely has to play a role.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "5HTjm89",
                                    "body": "Prior to some degree of accreditation and regulation we had literal snake oil salesmen traveling the country and scamming people out of their money. \n\nWe’ve swung too far the other way in regulatory burden, but that doesn’t mean going back to zero is going to help more. It’ll leave alot of people worse off, enrich a lot of bad actors. \n\nPrice transparency is helpful for sure but not the end all. Two places can offer similar services but the quality can vary greatly while still being the same on paper. Medical imaging is a great example. Go shop around on a price for an MRI, one center will advertise cheapest cash price in town, but they don’t tell you it’s an outdated machine that can’t provide the same level of detail and diagnostic certainty as a newer higher field strength MRI the hospital uses. Regular people don’t know the difference. But by the time you and up at the right diagnosis and an effective treatment you’ll have paid for the better quality scan and the shitty one. You get what you pay for.\n\nThen take into account validated and studied therapies compared to the rash of other unregulated shit out there, the remnants of snake oil sales culture. Stem cell injections, various cosmetic procedures, naturopathy, chiropractic stuff. None of it stands up to actual scientific rigor.  It’s extensively studied with nothing approaching proof of efficacy. But that doesn’t stop a lot of people from either flirting with or outright falsely advertising about the benefits of a lot of these things. And that’s *with some oversight in place currently. When it’s gone you’re back to the bad old days, people will suffer morbidity and mortality, lucky ones will get patched back together in hospitals. When people get really truly sick they all wind up in one place.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "LarryFalwell",
                                    "body": "Companies will be transparent if they are forced to actually compete with each other.  The bottom line in the healthcare industry is that no one wants to actually pay the cost of healthcare.  So we play all these games to hide the true cost and that leads to a completely dysfunctional market.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Aggressive-Fun979",
                                            "body": "Exactly - so how is that competition forced.  Right now it's so closed off to competition and that works to the benefit of insurers.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "BEGA500",
                                            "body": "Companies will not be transparent if forced to compete. They will buy each other up until the competition is minimized to an acceptable level. They will vertically integrate to try to save cost. They will automate through AI. They will buy off professionals and PBMs. They wont make anything better for the consumer. Their entire financial model is to minimize payouts.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "jmark71",
                                                    "body": "So what’s the answer?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "BEGA500",
                                                            "body": "Speaking as someone who works in healthcare, I see 2 options. \n\n1. No insurance. None. No 3rd party payers ever. People pay for their own meds, visits, procedures, durable medical equipment, and eventual nursing home type care. Without artificial supplementation of the market some of the costs will come down but others wont. There will also be less effective quality control in the care provided. \n\n2. Fully government supplied insurance. Many issues there, obviously. The benefit over what we have now would be that its not attached to employment anymore, you could theoretically vote for change in the way your healthcare is administrated, the system could be streamlined for providers, and quality control would be easy. \n\nOption 1 cant really happen unless we are willing to let people die early from easily preventable diseases. Option 2 is inviting too much governmental control in. However, either one is better than this shit we do now where Im overregulated while dancing through unnecessary moving goalposts for insurance companies to try to help pts who cant afford the copays and coinsurance anyway.",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "jmark71",
                                                                    "body": "Do you think the second option could be handled by the private sector at all?   I don’t think option 1 is viable without significant changes to how healthcare is delivered although I do think it’s the better of the two options.  At the end of the day healthcare is a finite resource so will be either rationed by your ability to pay or by the government dictating what and what won’t be paid for.  Personally even though I’m in a relatively healthy financial position compared to the majority of Americans, I know that I couldn’t afford a long hospital stay, but despite all that I don’t think that means government should ever be in the position to ration care.  The system we have is definitely broken but it doesn’t seem like there is a great way to solve it.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BEGA500",
                                                                            "body": "No. You cant take a pile of government money that is suppose to be paid to people providing healthcare and give to a middle man with a profit motive first. That is the exact problem we have now.",
                                                                            "score": 10,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "None",
                                                                    "body": "Option 2 is single payer healthcare, correct?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BEGA500",
                                                                            "body": "Basically.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "agent_moler",
                                                                    "body": "I would be interested in deregulation of more routine healthcare and switching that to private pay only and having insurance for more complex procedures and care (surgeries, etc). I think if people were able to more easily access primary care, it may take some pressure off of the system and ease the backlogs and provider attrition.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "LarryFalwell",
                                                    "body": "So I guess you don’t believe in markets at all with that logic.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "BEGA500",
                                                            "body": "I dont believe in a healthcare market the way I believe in like normal good/service market because standard market forces dont really apply.",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "International_Lie485",
                                    "body": ">Companies aren’t going to start being more transparent about costs etc. without some sort of stick.\n\nProfit is the stick.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jmark71",
                                            "body": "How would profit cause providers like hospitals and private practices to become more transparent about costs?  Seems like that had the opposite effect in practical terms?",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "International_Lie485",
                                                    "body": "When I pay for something, I look at the price and quality...\n\nDo you not?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "jmark71",
                                                            "body": "My point exactly - you can’t do that today and there’s zero motivation for providers to provide the amount of transparency in order to make a rational economic decision",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "International_Lie485",
                                                                    "body": "That's why we should change the status quo.\n\nCurrently the medical field is controlled and heavily regulated by the government.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LarryFalwell",
                                            "body": "Exactly",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WhoDey918",
            "body": "Anyone that says the US healthcare system is a free market either doesn’t have basic understandings of the US healthcare system or free markets. Or both.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "It's a shitglomorate of regulations and freedom.\n\nWhat would it take to get out of it? I always say: End CON laws, end employer insurance tax discount, let insurers compere across state lines, end the FDA, allow medicine to be imported. But, would that be enough, and what kind of effort would that require?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Silence_1999",
            "body": "We don’t have free market anything",
            "score": 2,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "You have completely described the medical-industrial complex. Couldn’t have say it better myself. This is why it infuriates me when people like Ben Shapiro claim that the status quo is great and don’t want radical change.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Free_Mixture_682",
            "body": "A good start. Add to it the tax structure that maintains employer provided insurance.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ENVYisEVIL",
            "body": "Excellent post.  Are you familiar with **The Surgery Center of Oklahoma?**  [Here is the Mises.org article link](https://mises.org/podcasts/medical-freedom-summit-2021/how-surgery-center-oklahoma-tapped-cash-market).\n\nThey are the closest thing we have to a stellar free market heathcare example.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JBCTech7",
            "body": "preaching to the choir, i'm sure.\n\nOur healthcare system is absolutely fucked. Not because its 'free market' but because its the opposite. Gov't subsidized monopolies.\n\nImagine the innovation and competitiveness of a true free market healthcare system? It would be utopian.",
            "score": 3,
            "replies": [
                {
                    "author": "not_today_thank",
                    "body": "Before the federal government got itself so involved in healthcare (1960), healthcare cost about 9% of median household income. Now it's about 52% of median household income \n\n52% seems too high for me, but here's the math: \n $80,610[median household income]/2.5[people per household]=$27,797per person vs. $14,570 per capita health care spending; 14,570/27,797=52%)  \n\nLife expectancy has increased 12% for men, 10% for women over that period.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaffeinMom",
            "body": "100%!!!\n\nRemove subsidies and direct government payments to the healthcare system and all of the sudden healthcare market would have to adjust prices to the ability of the consumer market to pay. The consumer would have the power to choose what cost:value they are willing to pay for. \n\nOnce the consumer has the power the supplier will be forced to accept the price supported by the market by either lowering prices for volume business or accepting reduced business at higher prices. Either way the business will have to adjust their expected earnings down to the market value supported level.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cannoli72",
            "body": "The just described socialism not capitalism",
            "score": 2,
            "replies": []
        },
        {
            "author": "ArtemisRifle",
            "body": "I disagree. You're using recursive logic to justify the changes you wish to see. A captured regulatory is an inevitability of the free market. Nothing the free market does can be said to anti-free market. That'd be like calling an amendment to the Constitution unconstitutional.",
            "score": 1,
            "replies": [
                {
                    "author": "LibertarianTrashbag",
                    "body": "A captured regulatory is definitionally not an inevitability of the free market as in a free market, the regulatory powers that be aren't strong enough to be worth capturing. \n\nA captured regulatory is, however, an inevitability of a heavily regulated market. Either free the market or (and this isn't ideal, but it works better than what we have right now) universalize it all.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ArtemisRifle",
                            "body": "Why wouldnt it be an inevitably? A free market makes it possible for a business to eventually get so influential where it can affect policy.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "CaterpillarPale9775",
                                    "body": "A free market can no longer be considered free if regulatory capture comes to be. It could be logically argued that regulatory capture is likely development from an originally capitalistic, free-market system, whereby firms seek to maximize profits through any means possible. Though, as soon as crony capitalistic policies and other anticompetitive practices are introduced, the market should no longer be considered free.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "ArtemisRifle",
                                            "body": "If regulatory capture is not allowed to be then it is not a free market.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "CaterpillarPale9775",
                                                    "body": "You basically just said that if government intervention isn’t allowed in a market then it’s not a free market. Don’t know what definition of free market you’re using but seems to directly counter mine.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ArtemisRifle",
                                                            "body": "Yes",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "CaterpillarPale9775",
                                                                    "body": "And you don’t see any issue with that logic?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ArtemisRifle",
                                                                            "body": "No. Free means free.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LibertarianTrashbag",
                                                                                    "body": "Free means free of heavy government oversight. You can't have a free market so long as there exists a regulatory body with enough power to make capture beneficial.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CaterpillarPale9775",
                                                                                            "body": "Free means free from government and other intervention. Plain and simple.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LibertarianTrashbag",
                                    "body": "The defining feature of a free market is that policy doesn't mean much. Wasting money and energy on capturing the regulators is useless when they are systematically unable to stack the deck in your favor.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "not_today_thank",
                    "body": "If you use your recursive logic absolutely everything is ultimately a free market, even communism.  \n\nBut most people define a free market as voluntary exchange of goods and services between buyers and sellers. Regulatory capture is interference with that voluntary exchange and is not free market.  You could argue free markets trend towards regulated markets, but I'd argue it's not fair to say regulated markets are free markets.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thebosstiat",
            "body": "I used to work at a \"Population Health Management\" company (a legal term describing a company that normalized data across a bunch of doctors/hospitals/insurers).\n\nOur public maketting material talked about how you could better spot diseases with all the health data in one spot (technically true), but the only thing that got doctors/hospitals to sign up was better reporting for government incentive programs. 200 people in that company. Untold man hours. All to tell the state of New York that 97% of a doctor's patients had gotten the flu shot so they could get that million dollar check.",
            "score": 1,
            "replies": []
        }
    ]
}