{
    "title": "Part of the Problem",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 233,
    "score": 1527,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 38,
    "url": "https://i.redd.it/uqa34xewczje1.jpeg",
    "id": "1isquo8",
    "selftext": "",
    "comments": [
        {
            "author": "MCE85",
            "body": "Fuck any greedy traitorous fucks. I'm sick of the casual fleecing of America. Lazy ass politicians just collecting a check.",
            "score": 93,
            "replies": [
                {
                    "author": "mcbeezy94",
                    "body": "Worst freeloaders out there. Especially the ones who claim to want to downsize government and never do",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "RobertEHotep",
            "body": "It shows how brainwashed people are that, when you criticize the Dems, they assume you're a Republican. MBIC, I hate Republicans too.",
            "score": 127,
            "replies": [
                {
                    "author": "New_Disaster_5368",
                    "body": "Sometimes I hate Republicans more, because they often claim to stand for good morals, small government, low taxes, softer regulations, etc. and in practice, they're all just as corrupt and greedy as any other politician.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "fasteddieg",
                            "body": "This ^^",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pm_me_ur_bread_bowl",
                    "body": "Yep. I criticized some democrat policies recently and everyone who saw just assumed I support trump and started making odd remarks against him like it would hurt me or something",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Maximumm_Drawdowns",
                    "body": "Agreed. I love watching both sides get bent out of shape when their favored team gets its comeuppance",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Beezel_Pepperstack",
                    "body": "Amen!",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "sirweevr",
                    "body": "Depending on who you attack on any given day you can either be seen as an aspiring Matt Gaetz clone or a tankie trans communist. It's kinda fun, or it would be if it wasn't so telling about the state of politics in the Western world.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Jackaboi1463",
                    "body": "I really dont like a lot of the new libertarians. I cobsider libertarianism to be a right wing ideology but i left the party and am now just an anarchist bc chase oliver is a disgrace. But also i feel the republican party is the lesser of two great evils",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "oilkid69",
            "body": "Love this",
            "score": 11,
            "replies": []
        },
        {
            "author": "harrybush-20",
            "body": "I fucking hope so. If this iteration of a Trump presidency turns out to actually be to the benefit of America, and I have been wrong in the past, then I will gladly announce how wrong I was",
            "score": 17,
            "replies": []
        },
        {
            "author": "WhatRUsernamesUsed4",
            "body": "lmao no they won't expose republicans. Trump is not a libertarian, and he doesn't care about what you think should be cut. Doge is not randomly auditing departments. Its a targeted attack on specific bloat researched well before he took office, and it will only be half effective at best when it doesn't cut GOP bloat. 50% is better than 0, but i highly doubt we remotely approach bipartisan slashes that libertarians would envision. Let me know when Trump cuts oil and gas subsidies or SpaceX contracts that paid for him to get elected.",
            "score": 44,
            "replies": []
        },
        {
            "author": "milovulongtime",
            "body": "Let them all feel what it is to be held to account by those they swore to represent.",
            "score": 9,
            "replies": []
        },
        {
            "author": "embarrassed_error365",
            "body": "Actually, that’s my problem with what’s happening. Is that I don’t believe it will be impartial, nor that they don’t have their own self interests at the forefront.",
            "score": 13,
            "replies": [
                {
                    "author": "Yodzilla",
                    "body": "Surely the president who pardons everyone who kisses his ass including people who defrauded his own followers, gives high ranking appointments to television personalities, and did multiple crypto rug pulls right before taking office will start holding people on his own team accountable. Right?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "captru",
            "body": "People here saying, \"yeah, we hold both sides to the same standard\", but the most recent post about Eric Adams seems to be from four months ago. Where is the outrage of Trump's DOJ killing the investigation into him started by Biden's DOJ? Literally the mainstream Democratic Party holding their own accountable and Republicans enabling corruption. But whatever, let's get some more memes about dems/left bad.",
            "score": 13,
            "replies": []
        },
        {
            "author": "yadaredyadadit",
            "body": "Republicans should be exposed once Musk/Trump gets to Pharma $, Pentagon, and MIC. \n\nAll corrupt politicians and foreign agents should be exposed. \n\nStay tuned....",
            "score": 20,
            "replies": [
                {
                    "author": "Azurill",
                    "body": "I'm glad big tech will expose big pharma but who is gonna expose big tech??",
                    "score": 9,
                    "replies": [
                        {
                            "author": "yadaredyadadit",
                            "body": "That's exactly my point. Who is making sure DOGE is fair across all , Republicans, Dems , Libertarian, Big business, Corporate greed, MIC , woke etc etc",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 5,
                    "replies": [
                        {
                            "author": "legal_opium",
                            "body": "Ummm libertarians aren't for prices controls...",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "legal_opium",
                                            "body": "Chuck schumer in that article killed off a price control legislation, so in a sense, he's being libertarian at least in that specific case.\n\nThe real threat from big pharma is them making a new disease and unleashing it on the public while also having a \"vaccine\" for it developed and patented. That's my concern.\n\nNot price caps or oxycotin",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "yadaredyadadit",
                            "body": "Agree .... read the 2nd sentence of my comment.  All are covered, including folks who are Republicans/ Dems but like to walk around as \"Libertarians.\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "beef5182",
            "body": "May all the guilty find punishment",
            "score": 3,
            "replies": [
                {
                    "author": "thermobear",
                    "body": "Including the man himself?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "VictoriousStalemate",
            "body": "Expose them all.  And then do something about it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sirous",
            "body": "Trump is about the only one able to pull this off so far. The others would just defer it to congress and it would go nowhere. No other politician would dare burn this many bridges. Maybe the Dems will return the favor in kind when they get in power but probably not.   \nUnderstanding there could be a huge constitutional issue with what he is doing. It is nice that someone is at least shedding light on it finally.",
            "score": 10,
            "replies": []
        },
        {
            "author": "thatnetguy666",
            "body": "I think non libertrains and consveratives think that just because the voting bases of Convservatives and Libertrian political parties get along that it means that we like each others politicians when this is almost never the case.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Antique_Promotion743",
            "body": "I belive in people like Ron Paul,Gary johnson and  *Javier Milei* ,not donuld trump and his crew thank!",
            "score": 3,
            "replies": []
        },
        {
            "author": "blue888raven",
            "body": "I think it's funny how so many Leftists seem to think your standard Conservative/Republican/Libertarian type voter has a problem with Republican politicians being held to a higher standard... or at least held to A standard, of some sort. \n\nI personally have no problem with weeding out corruption, fraud, or those that waste our tax dollars. And I don't especially care which Party they are technically part of. Get rid of them and clean up the government, it is just that simple.",
            "score": 11,
            "replies": [
                {
                    "author": "TheBannedLibertarian",
                    "body": "I mean they are not wrong. The second someone suggests Trump face some sort of accountability they meltdown. You get the classic “Trump has to violate the constitution in order to drain the swamp” “Checks and balances are getting in the way of his agenda”\n\nSure they might not care about other republicans but ‘daddy Trump’ is off limits.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "jankdangus",
            "body": "Any government official who engaged in waste, fraud, and abuse should be charged with treason and be tossed into jail and have their wealth stripped and given back to the American people. I’m sick of these traitorous fuck robbing us blind especially the hogs in the Pentagon.\n\nI support a profit motive for the private sector, but why should there be a profit motive for the public sector? Why should socially funded corporations abide by the rules of capitalism? No, unless they are actually spending that money well instead of enriching, themselves there shouldn’t be a profit motive. \n\nThe reason why the government is inefficient is because they are constantly asking the government for more tax-payer money instead of maximizing their existing contract. While we get no stake in them, they squander the money because our politicians are so corrupt, they get even more contracts.\n\nYou want to actually make the government more efficient? How about stop the MIC and Big Pharma from price gouging. The goods are paid by the tax-payers, them having an oligopoly and charging whatever they damn please is completely oppose to the free market.",
            "score": 2,
            "replies": []
        },
        {
            "author": "monet108",
            "body": "Everything is happening so fast and to an extent that I never thought it would within my lifetime. If he keeps this up, the next four years are going to be something. \n\nI think he has been planning this for the past four years. He was so, clearly out of his element during his first term and had no one except family to trust. And he was right to feel that way. A real up in your face exposure to how dirty politics really is. That both sides of the aisle work in unison to keep some lies in play. To make sure those in charge stay in charge using American resources for their own ends and not American's interests. \n\nThis time around he seems to have come into office with a game plan. And he seems to be executing it very well. I Hope him success, because I hope we uncover all the corruption and get rid of it. And if we were going to be transparent, I do not understand why anyone would object to what is being uncovered so far.",
            "score": 2,
            "replies": [
                {
                    "author": "Yabbos77",
                    "body": "If you don’t think he’s part of the corruption, it’s because you are fangirling too close to the sun.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_HopeThat_WasFart",
            "body": "Congress will just pass statute of limitations laws before they all get exposed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wadewadewade777",
            "body": "I like to think of politicians like the crew of the Flying Dutchman from Pirates of the Caribbean. A part of the crew, a part of the ship. The longer they’re in office the more intertwined into the corrupt system.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DemotivationalSpeak",
            "body": "People forget that a lot of libertarians aren’t Republican for a reason lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting_stuff2",
            "body": "So true. We hired this guy to swing a 4x4 board all around DC, and that’s EXACTLY what he is doing. Doesn’t matter to me who he hits, time for some change before we are bankrupt.",
            "score": -1,
            "replies": []
        }
    ]
}