{
    "title": "You can be a libertarian and not have libertarian views on everything+ \"gatekeeper asshole\" who love to throw statement \"you are cannot be libertarian because you view on minor x policy\" make we cannot win election at state level or higher(except gary johnson case)!",
    "author": "Antique_Promotion743",
    "subreddit": "Libertarian",
    "rank": 232,
    "score": 72,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 33,
    "url": "https://www.reddit.com/r/Libertarian/comments/1it9yjs/you_can_be_a_libertarian_and_not_have_libertarian/",
    "id": "1it9yjs",
    "selftext": "Frankly, I don't know why people post \"this isn't a libertarian subreddit because x\" and I know that sounds hypocritical.\n\nFor me i say I belive in NAP,\n\nI support private sector road and bridge\n\n, aboration are not wrong if it not cross NAP line\n\nI support Zero deficit spending. Move to a hard money,\n\nI support president should make FED weaker power or abolish if they can.\n\nI think pharmacy needs more liberated from government regulation! pharmacists Should  have the right to dispense drugs such as birth control pills, herpes drugs, and AIDS drugs, or have the right to store and administer all kind of vaccines to patients!\n\nbut I also say we need herd immunity,vaccination population are important but as libertarian,i not support statism overreach ,i think goverment job are improve healthcare knowlegde of public in libertarian way like make people more easy access to medical reseach and how to read it,not statism overreach\n\nalso I think \"gatekeeper asshole\" who love to throw statement \"you are cannot be libertarian because you view on minor x policy\" make we cannot win election at state level or higher(except gary johnson case)!\n\nand I think \"you can has diffrent view on minor policy if you core value still libertarian value you are libertarian\", you agree with me or not?",
    "comments": [
        {
            "author": "Practical_Advice2376",
            "body": "Yep, inner fighting is pointless right now. Classical Liberals, Libertarians, Minarchist and Anarchist all have way more in common with each other than the Rs and Ds.\n\nReminds me of Monty Pythons Life of Brian Judean People's Front vs The People's Front of Judea!",
            "score": 13,
            "replies": [
                {
                    "author": "interwebzdotnet",
                    "body": "Yes, see where infighting got the Democrats this cycle? Big fat L to a big fat L.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "legal_opium",
                            "body": "Id say it wasn't infighting so much as a large chunk of democrats are the most smug people you'll ever meet. Unless you 100 percent agree with the narrative you become their enemy. They are unwilling to coalition build with people who agree with them on a subject but disagree on another.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sirweevr",
            "body": "Many of the principles are such high levels principles that you could probably put 15 people in a room who all agree with the non-aggression principle and they would all disagree on how it applies to specific situations.\n\nOn the plus side it means there's a ton of discussion going on on virtually every political topic rather than dogma and talking points...",
            "score": 11,
            "replies": [
                {
                    "author": "Silence_1999",
                    "body": "Abortion alone fragments NAP discussion into a thousand pieces.  Other things as well.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Weary_Anybody3643",
            "body": "Yeah I tend to learn hard I to libertarian philosophy on theory and my friends try to shit on me for also having practical stances because the us government will never fully shrink itself ",
            "score": 15,
            "replies": [
                {
                    "author": "Antique_Promotion743",
                    "body": "thank you ! that why I say  \"you can has diffrent view on minor policy if you core value still libertarian value you are libertarian\",we can has diffrent view on minor policy!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Weary_Anybody3643",
                            "body": "It's because we are cats no one is a \"true\" libertarian like I am. We fight with each other more then we fight with the statists ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "legal_opium",
                                    "body": "The true libertarians are the vegans ;) we don't make exceptions to the NAP arbitrarily",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PunkCPA",
            "body": "Many of the things we fight about are so far out of reach that they won't be achieved for decades, if at all. Meanwhile, there are popular and achievable things (civil asset forfeiture, qualified immunity) that we could be working on and enlisting allies for.",
            "score": 5,
            "replies": []
        },
        {
            "author": "ZombiesAtKendall",
            "body": "Yeah, sure seems like people would rather debate theoretical ideas about things that will probably never happen than to try and work together toward common goals.",
            "score": 4,
            "replies": []
        },
        {
            "author": "VexLaLa",
            "body": "True! We libertarians are very different from the classic left and right in many way. But that doesn’t mean that we have to be religiously libertarian about everything!\n\nNot everything is black and white. I strongly believe it’s still very libertarian to have different views on different policies and things. This is what the left and right messed up, they are too orthodox about their ideology.\n\nIsn’t freedom and free thinking a core value? As long as we respect the core value of freedom, reducing government power and overreach and deregulation, plus hold the govt accountable. I think that’s enough to be classified as libertarian.\n\nNo gatekeeping in libertarianism!!!!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Cheap-Event-6422",
            "body": "This right here! That's what I love about libertarianism in the first place: the emphasis on individual choice. As gatekeep-ey as libertarians have a reputation for being (let's be honest, there's kind of a reason for that), libertarianism probably encompasses a broader range of stances on different issues than any other political school of thought out there, and in my eyes, that's the beauty of it. Keep it simple: don't hurt people, don't touch their stuff, think for yourself, and be a responsible person. I think that's a pretty attractive message that resonates with a lot of people, and if we just emphasized it a little more, as opposed to trying to narrow the spectrum of what we allow ourselves to be aligned with to such a stringent degree, I think a lot more people would get on board with it. Even with the porcupine, it'd do us all some good to be a little less prickly.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Get_Wrecked01",
            "body": "Libertarian's love to tell other Libertarians that they've failed the Libertarian Purity Test™.\n\nYou can, in fact, be a Libertarian and be ok with quite a bit of government regulation. You can believe in a free-er but still regulated market. You can believe that some people in the government really do want to have your back and aren't out to enrich themselves and exert control over everyone else. \n\nThere is a wide range inside the idea of \"Minimum government and maximum freedom\".",
            "score": 3,
            "replies": []
        },
        {
            "author": "xfactorx99",
            "body": "Just to be clear, you made this post because you hold like 90% libertarian views but you are pro enforcing people to get vaccines so you got frustrated by people telling you you are not libertarian?\n\nI agree with your overall theme. No one should have to subscribe to an entire set of principles; people should be encouraged to analyze each issue individually",
            "score": 5,
            "replies": []
        },
        {
            "author": "nebbulae",
            "body": "Nullius in verba. There are no final words. Means libertarians hate consensuses and are always looking for new paradigms. \n\nThere's also the problem of wielding the fatal arrogance that you know better than anyone who is or isn't a \"true libertarian\".",
            "score": 2,
            "replies": []
        },
        {
            "author": "Explic11t",
            "body": "The fun part of libertarianism is that depending on your own biases, interpretations, and beliefs, you can make it so everyone else is \"not a libertarian\".\n\nAnyway, if you disagree with me, you're a communist",
            "score": 2,
            "replies": []
        },
        {
            "author": "chmendez",
            "body": "I largely agree with you.\n\nAnd for example, regarding abortion there has never been a minimal consensus in the broad libertarian movement.\n\nI am against it except for the first 8 weeks and even within that exception, I wouldn't encourage anyone to do it.\n\nI am also against so-called \"intellectual property rights\" that many libertarians strongly defend.\n\nHowever, even though I am against any kind of \"libertarian purity tests\", there should be some minimal criteria for the label to have any real meaning. \n\nJust my humble opinion.",
            "score": 2,
            "replies": [
                {
                    "author": "Somerandomedude1q2w",
                    "body": "There is one position on abortion that almost all libertarians agree on. The consensus among most libertarians regarding abortion is let's put abortion to the side and fix all the bigger issues that we all agree on, and once those are solved, we can revisit the abortion thing and come up with a solution that works.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tacocrewman111",
            "body": "When I was a republican saying that I believed in drug legalization no one ever had a problem or if they did they would mention libertarians. Now that I am legally a libertarian I have never been a true Scotsman. Like you guys realislze that the big parties are big because they unify regardless of the minor differences. You sign this party death warrent in hypocrisy when you can't even allow for discussion. The other day someone asked what people thought about taxes and I said that fico was to high but I could be swayed to fair and sustainable tax systems. The back and forth ended up with me getting several down votes for answering the question of what kind of taxes can sway me. Like yeah we all hate taxes baby but that don't mean I disagree with the core of this party if I believe there is a right way.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Somerandomedude1q2w",
            "body": "Considering the state of politics today, libertarianism is probably the biggest tent political movements today. From abortion to Israel to Trump, this entire sub has very mixed opinions on many issues, and as opposed to the rest of Reddit, we tend to disagree yet mostly provide good faith arguments. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "pansexualpastapot",
            "body": "My thought is it's a spectrum, as long as we agree on personal liberty and NAP as guiding principles. \n\nI'm good with conversations on everything else, as long as they're in good faith and not devolve into name calling. I'm absolutely able to change my ideas and good with agreeing to disagree. \n\nI don't want everyone to have my views because life would be boring and dull. Plus I'm not a genius other people could have amazing and revolutionary thoughts I hadn't considered. Maintain the core principles, but stay open to new perspectives is my life motto.",
            "score": 3,
            "replies": [
                {
                    "author": "Antique_Promotion743",
                    "body": "yub, we can disagree with minor policy as long as we agree on personal liberty and NAP!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "djhazmatt503",
            "body": "Libertarians are free thinkers who oppose consolidated power and overregulation.\n\n\nAnd if you don't agree with this, Reddit mods will appear and remind you which rules you broke to deserve a ban.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Leading_Air_3498",
            "body": ">For me i say I belive in NAP,\n\nThe non-aggression principle stipulates that aggression is any initiated action of which violates another's will to be unacceptable. Under that premise, every moral idea is objective and quantifiable through logic. So there is a \"purist\" notion then surrounding what is objectively acceptable (moral) vs. what is immoral. So taking what you've posted as some of your beliefs, let's analyze them using this logic:\n\n>I support private sector road and bridge\n\nBecause anything in the \"public sector\" relies upon theft to fund, so this is moral.\n\n>, aboration are not wrong if it not cross NAP line\n\nThis is fundamentally correct, because in order to commit murder, the entity being killed must have personhood, so the defined attributes of which manifest a person must be there. So while finding out where personhood starts is exceptionally difficult, this statement is still moral.\n\n>I support Zero deficit spending. Move to a hard money,\n\nTaxation is patent theft, so any amount of taxation is immoral. You can get money through consent.\n\n>I support president should make FED weaker power or abolish if they can.\n\nGovernment is intrinsically immoral as no human government has not relied upon coercion to obtain resources/labor from citizenry.\n\n>I think pharmacy needs more liberated from government regulation! pharmacists Should have the right to dispense drugs such as birth control pills, herpes drugs, and AIDS drugs, or have the right to store and administer all kind of vaccines to patients!\n\nThis is largely correct but don't forget that fraud violates the NAP. This means that any pharmaceutical company must tell the truth pertaining to what a drug is for, how it is made, and what side effects it might have.\n\n>but I also say we need herd immunity,vaccination population are important but as libertarian,i not support statism overreach ,i think goverment job are improve healthcare knowlegde of public in libertarian way like make people more easy access to medical reseach and how to read it,not statism overreach\n\nSame as above.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hench999",
            "body": "Some people substitute libertarianism for a religion.  It's the same way the far left woke does the same and is with dissent. If AOC came out and said she supported a secure border and deportations it would be heresy for her side  it wouldn't be a case of \"I like AOC normally but she is dead wrong in this issue\" no she would be labeled a \"far right bigot\" and an overall horrible person even if none of her other other views changed. This is why I can't stand it when people treat libertarianism and the NAP like a religion . They list off libertarian ideals as if each one was a commandment set in stone with no room for nuance or interpretation.",
            "score": 1,
            "replies": [
                {
                    "author": "Puppygorl6969",
                    "body": "I can explain. It’s because the left is the one that gives more voice to human rights which is connected to a person’s worldview. If AOC is okay with violating certain human rights but takes a stand later on other human rights issues, it can make her lose all credibility in terms of advocating for human rights.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Hench999",
                            "body": " Yes, but there are plenty of ways to justify a secure and closed border that doesn't equate to some desire to violate human rights. One differing opinion making you lose credibility on all other issues is dogmatic and in the realm of religion. Someone who claims to be Christian yet goes and robs houses on the weekend loses all credibility regardless of if they keep the other commandments. Someone having a different political opinion on an issue is how improvements get made. Oftentimes, the best changes in history start off with an unpopular opinion. So respecting someone's right to disagree without labeling them a terrible person is pretty important. \n\nI see quite a few libertarians ready to 100% dismiss anyone with a different view as a statist or authoritarian. It is the exact same thing with woke. For some people, these have substituted religion",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Puppygorl6969",
                                    "body": "Okay what? Yes people can agree to disagree and still see each other as credible. The whole religion example you have is lost to me unless you realize that we’re not talking about religion, I was talking about human rights. Human rights are not a religion nor do we call anything dogma for referring to human rights. If AOC is okay with violating one human right but takes a stand on a different one, I’m not going to see her as credible. Human rights are actually nonpartisan issues too. With Harris, I saw her take a stand for victims of sex offer sets. That’s awesome. However, I saw her label trump as a felon which he IS but she never thought about how that stigmatizes all ppl with records which isn’t good for the rights of people with lived experience in the criminal Justice system. And anyone tough on crime but not talking about re-entry programming makes me feel kind of unsafe. Because without re-entry we have increased recidivism. So for this example, it actually comes full circle- protecting victims of violent crimes  means better re-entry. It also means criminal Justice reform. I mean it means a lot of things that need fixing but one thing we know is we aren’t able to improve society without protecting human rights in the criminal Justice system which includes far more than violent rapists (like trump and which re-entry for is the most taboo subject in prison reform so obviously it’s not an easy one to discuss but it was on my mind during her campaign). I hope that helps it make sense that I would hold her to that standard. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hench999",
                                            "body": "It really depends on what you consider to be a right. People have a natural fight to their freedom, to their property and earnings and to their life. However, every year, it seems s the Bernie sanders and AOCs of the world add more and more to their lists of \"rights\" assigned housing, vehicles, healthcare, college tuition UBI, etc. Things that people SHOULD have and have a right to attain, but in order to give them, they have to forcibly take for someone else. As much as people should have access to those things, it is not their right to force someone else to provide. \n\nAs far as religion, I compare it because just like with woke if you have one differing view and you are a heretic and a terrible person. If AOC came out and said she doesn't believe a man can become a woman and that they should not be in woman's sports, she would be instantly cast out and shunned. That is not violating anyone's rights, but she would be hated to the core if she took that opinion none the less.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tacoshortage",
            "body": "Dude, the central tenet of Libertarianism is Gatekeeping Libertarianism.  It is also the reason we are so ineffective.",
            "score": 1,
            "replies": []
        },
        {
            "author": "William-_-Buttlicker",
            "body": "Zero deficit lmao. I'm all for libertarianism but not against education. Did you even take any econ class?",
            "score": -1,
            "replies": [
                {
                    "author": "Antique_Promotion743",
                    "body": "thank you!maybe private sector school, book shop, scincetific gear, craftman gear shop and other education tool buiness shop should fill the gap?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}