{
    "title": "Abolish the IRS",
    "author": "AbolishtheDraft",
    "subreddit": "Libertarian",
    "rank": 219,
    "score": 1204,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 16,
    "url": "https://i.redd.it/tv6jcqeql4ke1.jpeg",
    "id": "1ita7j2",
    "selftext": "",
    "comments": [
        {
            "author": "hamburgersocks",
            "body": "I owe them $16 because *they* did the math wrong and I'm refusing to pay until they realize it has definitely cost them more than $16 to do the math, print the letters, put them in envelopes, and pay for the postage to tell me.\n\nIt's been two years. I will take them to court if they come at me.",
            "score": 50,
            "replies": [
                {
                    "author": "only_grish",
                    "body": "Fuck. I forgot I have to do my taxes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "peren005",
            "body": "its a funny meme but why would the government tax itself? I think it would be better served with Patrick being replaced with your average congressman chad.",
            "score": 26,
            "replies": [
                {
                    "author": "natermer",
                    "body": "The point is that the government is incapable of balancing its books and regularly blows billions of dollars on random stuff that is unaccounted for.\n\nExample; They have repeatedly attempted to audit the Pentagon. But they fail every time it is tried.  Which means that there is literally know way to know where all the money is being spent.  Like you have millions and billions of dollars just disappearing every year. . \n\nThat money goes to _somebody_.  Somebody is getting rich off of it.  Who is it?  It is a mystery.  Nobody can tell you. Nobody in department of defense, or Congress or anywhere else.  \n\nThe defense budget is essentially full of black holes where unknown amounts of money disappears to unknown people for unknown reasons. \n\nAnd guess what?  This, apparently, is acceptable. \n\nWhen congress demands to know where this money is going, people in the Pentagon shuffle papers around for a few months, and eventually just sorts of gives up.  Nobody gets punished for this.  There is no massive investigation.  Nobody is held accountable. The money doesn't get restricted or tagged or tracked any differently.  It all just continues business as normal. \n\n\nIf you did this as a private citizen or small business they would throw you in prison.  For just a few thousand dollars. \n\nThey can happily flush millions of people's worth of working lives down the toilets on a regular basis, but if you make a mistake on your IRS forms it can cost you hundreds if not thousands in fines and interest payments. \n\nIf you end up in the crosshairs of these people they can and will destroy you. \n\nThere is a definite asymmetry of accountability that goes on in our country. \n\nYou lie to the government it is a federal crime. However there is absolutely no penalty for them lying to do all day long about everything. In fact a lot of them feel a moral responsibility to lie to you.\n\nYou withhold money from the federal government and they will ruin your life.  The government blows multiple lifetimes worth of your money and it is just business as usual.  Nobody gets in trouble. Nobody gets fired. Nobody goes to jail.  There is no consequences at all.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "jorgioArmhanny",
                            "body": "Is there anything that can change this or be done? Do really have to just sit there and take it?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "natermer",
                                    "body": "That is the 4 trillion dollar question. \n\nPhilosophically speaking the \"only\" thing that needs to be done is the people to simply start saying NO.  \n\nThe people operating in the government are essentially a parasitical class.  Basically anybody who makes more money from taxes then they pay in taxes are part of this 'parasite' economic class.  Or if you don't like the term 'parasitite' you can substitute \"dependent economic class\". \n\nEverything they do consume some sort of wealth. Some sort of resource. Concrete for offices, steel for tanks, money for think tanks, police pensions, food stamp programs, etc.   \n\nThe wealth they use is generated by the productive people of this country.  The people who actually work honest jobs.  They pay for medicare, the roads, the tanks, the police, the offices. Everything that the government requires to do what it does has to be generated by them first. \n\nSince the people are the source of that wealth all that is required, fundamentally, is for them to start saying NO.  Just refuse to participate, refuse to buy or sell to the government, refuse to pay taxes, etc. \n\nThis is why things like the USA Constitution and rule of law is so important for the government to function.   It is less about protecting the people from the government and more about protecting the government from the people.  Buy following these rules they can justify what they do.\n\nIt is from the people's beliefs in these systems and these legal documents is where they derive their authority. \n\n--------------\n\nFor example imagine you are pulled over by a random stranger who threatens to hurt you while holding a gun if you don't give him 300 dollars.  You are justified in using deadly force to defend yourself because you have no way in knowing if that is all he wants. He could be lying. As soon as you pull out your wallet he might just shoot you in the face and take everything.  Now it may be smarter just to throw money at him and try to drive off, but you do have your rights to defend yourself. \n\nWhere as if it is the police officer doing it... it isn't much different. A guy threatening you with a gun for money. \n\nThe difference is, of course, that the police officer has strict rules to operate off of. There is a long list of procedures and steps that the police have to go through.  it is really a sort of ritual dance, but intellectually.  You can go and dispute the fine or just sign the papers and run off and never pay and hope you don't run into another cop.  Or dispute it in court. \n\nIt is this predictability that eliminates your right to defend yourself with violence. Because it is a sort of conditioned predictable and relatively safe form of violence being directed at you.  As long as the police obey and you obey you don't have anything to worry about.  A few hundred dollars fine really isn't that something so horrible. \n\nAnd if the police behaved as if they were in a TV cop drama were they beat up suspected drug dealers and go around trying to enact \"street justice\" or violating the laws themselves.... They are undermining their own authority.  All of a sudden any potential interaction with cops is dangerous and unpredictable.  There are a lot more citizens out there then normal cops... without the support of the general population there is no way that cops could ever do their job. \n\nIt works that way for the government at large. \n\nSo if people started saying \"No\" then the government would have no choice in backing down if they want to maintain their authority.  They would be forced to play nice and be accountable unless they want to undermine themselves. \n\nWhich is why all real progress happens peacefully.  All these sort of fantasies about \"taking down the government\" in some big fight or whatever is just that... fantasies.  it doesn't work and won't work. \n\n\n--------------\n\nThis isn't true in all countries, mind you.  \n\nIn some countries, typically \"Third World\" the governments there derive their wealth from exporting natural resources and the support of foreign governments.  They don't have to care about the population because the population is not important to them, economically. \n\nBut in western developed countries the population being educated, healthy, and working is critical to the economy and the wealth that the governments depend on to operate. \n\n----------------------------------\n\nNow in terms of actual practical steps...\n\nI don't know.  If people knew what exactly to do it would already be done. \n\nWhat I do know is that:\n\nParticipation in local politics does matter.  Participation in local social institutions do matter.  One of the ways that government increases its power is to take over social institutions. This undermines the people's ability to organize and support each other independently of the government. \n\nLocal county and city governments. Churches, clubs, small business groups, etc.  Get involved, start networking, and such things. \n\nBecause if the country ever does collapse or there is some mega disaster or hyper inflation or whatever... those are the people that you will need to depend on.  Running off to go hide in the woods just makes you a sitting duck.\n\nAlso it strengthen communities and individual independence and makes it that much easier to start saying \"NO\".\n\nThe other approach is Agorism. Parallel markets. Alternative forms of payments. Economic activity that happens \"outside the system\".  Look it up.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "jorgioArmhanny",
                                            "body": "I really appreciate your answer. I agree with your closing statement. Really comes down to having strong communities and being the change you want to see…",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "because Patrick is more believable than the average congressman",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yabbos77",
            "body": "Abolish them after I get my fucking tax return they’ve been holding consequence free for 9 months.",
            "score": 4,
            "replies": []
        },
        {
            "author": "xxirishreaperxx",
            "body": "Underfunding the IRS has led to more audits targeting lower-income individuals rather than wealthier ones. \n\nThe IRS, with a reduced budget (cut by 30% since 2010), lacks the resources to effectively audit high-net-worth individuals or corporations, who can afford legal defenses. Instead, they focus on lower-income taxpayers, who are less likely to contest audits due to financial constraints. \"it is easier to steal candy from babies than adults\"\n\nAudit rates for lower-income earners, particularly those claiming the Earned Income Tax Credit (EITC), have been disproportionately high compared to wealthier taxpayers. \n\nIf Increased IRS funding resulted in improve enforcement against tax evasion by corporations and high earners rather than focusing on lower-income individuals I'd be in favor. \n\nBut would it work out that way? Doubt it\n\nhttps://taxpolicycenter.org/briefing-book/how-have-cuts-irss-appropriations-affected-its-ability-administer-federal-tax-system#:~:text=The%20IRS%20administers%20the%20federal,tax%20laws%20that%20Congress%20enacts.\n\nhttps://www.propublica.org/article/irs-now-audits-poor-americans-at-about-the-same-rate-as-the-top-1-percent",
            "score": 3,
            "replies": []
        },
        {
            "author": "ManifestYourDreams",
            "body": "Yep, definitely should abolish the IRS and make it a states issue to collect taxes and distribute it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Love how it was the democrats who passed that, the ones who virtue signal about wanting to help poor people.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RobotAlbertross",
            "body": "The bosses want to create a tariff tax system so we the people will not know how much we are paying in taxes. \n       of couse yachts, fur coats and stems cells will be tax free.\n  because jobs and greedom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snoo_17731",
            "body": "FUCK THE IRS",
            "score": 1,
            "replies": []
        },
        {
            "author": "drmode2000",
            "body": "Abolish the US",
            "score": -4,
            "replies": []
        }
    ]
}