{
    "title": "We should end subsidies for meat products.",
    "author": "legal_opium",
    "subreddit": "Libertarian",
    "rank": 211,
    "score": 73,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 98,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iu8oog/we_should_end_subsidies_for_meat_products/",
    "id": "1iu8oog",
    "selftext": "To better align with the NAP and libertarian economics. Libertarians and vegans should ally on ending subsidies for animal products so vegan meat alternatives actually compete in a free market. \n",
    "comments": [
        {
            "author": "Practical_Advice2376",
            "body": "Stop at \"subsidies\". The product is irrelevant. No Government subsidies for anything!",
            "score": 136,
            "replies": [
                {
                    "author": "scottyboi1337",
                    "body": "Subsidies are the direct point for a lot of our economic and ecological strains rn. For example: cheese caves, kudzu, bird flu, oil spills, \"carbon footprint,\" and the list goes on",
                    "score": 19,
                    "replies": [
                        {
                            "author": "obtk",
                            "body": "Kudzu, oil spills, and carbon emissions are the fault of subsidies? How so?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "scottyboi1337",
                                    "body": "Kudzu wouldn't have been brought over en masse if it weren't for corn subsidies. Kudzu was used as a field edge bc when it grows, nothing else does. \nOil spills aren't as direct, but oil is subsidized which drives people to look for more. More, potentially, means cutting corners. Cutting corners does lead to a faulty product or disaster.\nThe idea of the \"carbon footprint\" was put forth by BP to try and blame the people for the hole in the ozone instead of looking in the mirror and seeing how the company could reduce their own environment impact.\nSubsidies are a bandaid solution on a hemorrhaging vein.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vegancaptain",
                    "body": "Of course but people are still stuck on \"we should have the good subsidies though\" mindset.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "pureRitual",
                    "body": "Wait till you see what gas costs!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Both-Day-8317",
                            "body": "Yeah, but at the same time it's our tax dollars paying those subsidies.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "letmelickyourbutt12",
                                    "body": "Whose tax dollars pay for the other subsidies?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Both-Day-8317",
                                            "body": "All federal subsidies are paid by anyone who pays income tax.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "letmelickyourbutt12",
                                                    "body": "But the goal is to get rid of all subsidized goods regardless of who or what is paying for them?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "bravehotelfoxtrot",
                                                            "body": "No one is pushing to get rid of any goods—just the government subsidies.\n\nUnless you’re taking for granted that removing a subsidy will remove the product. That would be quite a leap; how could you be sure that no one will continue producing/selling that product or some alternative? At any rate, I doubt that most people here pushing for removal of subsidies assumes the above.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "letmelickyourbutt12",
                                                                    "body": "I didn't say to remove any goods, the original commentor seemed to be supporting subsidies by replying that \"well our taxes pay for it\". My point was that it doesn't matter who is paying for it, it should be removed. I think we are all talking past eachother",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Both-Day-8317",
                                                                            "body": "I wasn't supporting subsidies.  A commenter stated the cost of a product will rise if subsidies cease.. but since our tax dollars are paying for those subsidies the consumer and taxpayer is paying one way or another.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "pureRitual",
                                    "body": "Yes...",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "eico3",
                    "body": "Yup",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoNameGiven20",
            "body": "One of the crazier things about the meat industry subsidies, mainly the cattle men, us they are paid NOT to produce cattle. USDA paid $1.8 billion to not produce cattle on 22 million acres of private land. So not only are we sending money to people to NOT produce something but that then requires the US to rely more on outside sources of beef.",
            "score": 17,
            "replies": []
        },
        {
            "author": "GuyBannister1",
            "body": "The government shouldn't subsidize anything.  If it can't survive the market then it shouldn't exist.",
            "score": 48,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 10,
                    "replies": [
                        {
                            "author": "GuyBannister1",
                            "body": "Food has value so it's not like people would just stop producing it.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Past_Idea",
                            "body": "How and why have your views changed out of interest?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Past_Idea",
                                            "body": "what would your solution be",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "agent_moler",
                                                            "body": "I think for essentials, we do have to have some level of subsidy, especially considering how consolidated mass food production is. What’s to disincentives them from cutting production to raise prices?",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Carlose175",
            "body": "We should end subsidies for everything. Dairy, Oil, EV, Corn.",
            "score": 31,
            "replies": []
        },
        {
            "author": "Practical_End4935",
            "body": "I smell an ulterior motive with this question!  Why stop at meat products?",
            "score": 29,
            "replies": [
                {
                    "author": "Joyce_Hatto",
                    "body": "I want to see what Joni Earnst has to say about corn subsidies.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "odingorilla",
                    "body": "Ditto",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "legal_opium",
                    "body": "Coalition building with vegans. Showing that vegans have a place in the LP. It's something I see commonly suggested in the vegan sub. \n\nPlus the NAP is basically what vegans already preach and practice. The porcupine was picked as the libertarian symbol because it's a herbivore and only hurts others if they try and hurt it.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "CrankySnowman",
                            "body": "I know plenty of vegan libertarians.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "vegancaptain",
                                    "body": "Now you know one more.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Millon1000",
                            "body": "This is only downvoted because this sub is full of conservatives who think veganism is a threat to their concept of masculinity. I'm not a vegan but your comment makes sense.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "cstatus94",
                                    "body": "Nope, I just really like steak and just find Veganism to be extremely unhealthy long term for a lot of people. Almost all the people I know who became vegans were never able to get past 10 years of being a vegan because of health issues. And 10 years is the extreme end of the spectrum.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "vegancaptain",
                                            "body": "You \"find\" veganism to be unhealthy? What are you basing that on?\n\nYour personal anecdotes? That's just dumb. We have data on this. Science you know. \n\nDon't be a sloppy idiot.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "cstatus94",
                                                    "body": "And the data shows that a vegan diet alone is not enough to meet all of your nutritional needs. That is science. Also why insult me?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "vegancaptain",
                                                            "body": "Because you're lying to me. What nutrients can't a vegan diet accommodate exactly? \n\nI know if you will lie again. I know this shit very well. So don't say something that isn't true.\n\nAnd if you're not an expert at this. Why speak at all?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "cstatus94",
                                                                    "body": "Vitamin B12 is the main one. But I'm sure you knew that already. There are a few others I am not going to repeat because if you claim to be the expert that you are then you should know them. \n\nI have no problem with Vegans and Vegetarians that adhere to the diet for their own moral or environmental reason, whether its not to support the use of animal based products but any argument that veganism should be embraced because its healthier than a well balanced diet that incorporates the right type of meats is just not objectively true. Yeah if you are eating crap and then switch to a vegan diet you can achieve some short to medium turn health benefits",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "vegancaptain",
                                                                            "body": "Nope, B12 supplement, 100% efficient, cheap and vegan. You lied.\n\nThere are no others. You lied.\n\nSee? I told you you would lie to me. And you did. Every time.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "cstatus94",
                                                                                    "body": "If you have to supplement then Vegan diet alone isn't meeting your needs. That was my point. Anyways have a good one.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LoneHelldiver",
                            "body": "Vegans are more insufferable than libertarians.  No one wants them.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "vegancaptain",
                                    "body": "Because they ask you not to abuse animals? That's your superior ethics?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Practical_End4935",
                                            "body": "This is why we can’t be friends!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "vegancaptain",
                                                    "body": "Do you have any rational reasons or is this just your emotional outburst?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Practical_End4935",
                                                            "body": "I see you edited your comment!  Noice!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "vegancaptain",
                                                                    "body": "i didnt\n\nWhy would lie about that? This is so odd. Why does so many people just freak out when seeing a vegan. It's insane.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Practical_End4935",
                                                                            "body": "You absolutely did edit it!  You called the guy an idiot!  Hence my comment!  Now you’re just a liar!",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LoneHelldiver",
                                            "body": "You know I'm right.  Do you have any non-vegan friends?  Or any friends at all?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "vegancaptain",
                                                    "body": "That you hate vegans? I bet you do. And I bet it's unsubstantiated.\n\nI have zero vegan friends. And you seem like an abusive person.\n\nWhy behave like this? Why be abusive for no reason? Can't you easily dismantle vegan ethics after all? \n\nYou're acting like a leftist now. Don't just reply emotionally.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LoneHelldiver",
                                                            "body": "I am not alone in saying \"fuck vegans.\"  And they have 100% brought it upon themselves.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "vegancaptain",
                                                                    "body": "A lot of people hate do-gooders. Yes. It's a well researched area of psyhology.\n\nAnd no, there is nothing a vegan can do to NOT get this type of hate. It's hard coded in your DNA to act poorly against people who do good that you don't do.\n\ngoogle \"Do-gooder derogation\" for more information.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jankdangus",
            "body": "Subsidies are corporate welfare, end it all. The government shouldn’t be picking winner and losers. You want a flourishing economy that works for more people? This is a good first step.",
            "score": 27,
            "replies": [
                {
                    "author": "blacklisted320",
                    "body": "I’ll add bailouts to that too",
                    "score": 15,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Agreed, we should have either let them fail or let the government get equity in their company. We would be in a better position with the national debt crisis if we did that. Call it socialism all you want, but government spending shit with our tax money is already baked into the system.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Both-Day-8317",
                            "body": "..yep, bailouts reward bad behavior and mismanagement.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Grouchy-Fisherman-13",
            "body": "abolish subsidies, it inflates prices and is a double hidden tax. If it's too expensive and the industry wants to grow they'll figure out a way to solve the cost and taxing people to pay for the product is ridiculous.",
            "score": 6,
            "replies": [
                {
                    "author": "KillerofGodz",
                    "body": "Most things are too expensive to produce due to regulations. So they then require subsidies to operate.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Grouchy-Fisherman-13",
                            "body": "let them die, people will require cutting the regulations",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "version13",
            "body": "Libertarian vegan here - I concur.",
            "score": 5,
            "replies": [
                {
                    "author": "vegancaptain",
                    "body": "There are dozens of us!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "TurtleIslander",
            "body": "just end all subsidies, but meat is by far one of the worse ones",
            "score": 16,
            "replies": [
                {
                    "author": "snuff74",
                    "body": "I'd argue that the sugar subsidies are the worst, but they all need to go.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "CaptainMcsplash",
                    "body": "If meat is one of the worst ones, then corn is definitely a contender for the worst subsidy. So much land is pissed away producing corn for ethanol and HFCS which is a root cause of obesity in this country.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Thencewasit",
                            "body": "What other use would you use that land for?\n\nWe are using a lot less land than the US used to.  Most of the corn land would likely not have much use for most other crops.  We also have a shit to of land in the US that could be used for crops, it’s just those acres aren’t profitable at todays prices.  The land use argument doesn’t hold a lot of water (pun intended).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Thencewasit",
                    "body": "What subsidies does meat get?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "CalligrapherDizzy201",
            "body": "For fruits and veggies too",
            "score": 3,
            "replies": [
                {
                    "author": "legal_opium",
                    "body": "Organic fruits don't get subsidies and actually are forced to pay alot more to get certified organic by the government",
                    "score": 5,
                    "replies": [
                        {
                            "author": "CalligrapherDizzy201",
                            "body": "That’s nice. Eliminate for non organic then.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "natermer",
            "body": "Subsides for farming is generally done in order to make sure prices stay high. \n\nSo, sure. I support ending them.",
            "score": 4,
            "replies": []
        },
        {
            "author": "vegancaptain",
            "body": "This is my entry point to trying to convince other vegans to not be naive dumbass statists/socialists.   \n  \nSometimes it actually works.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Free_Mixture_682",
            "body": "I am unfamiliar with this. Can you provide data? Are we talking about prices for grazing on BLM land? Some say those grazing fees are below market value. If that is an example, is not the solution to sell the land?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tracieattimes",
            "body": "How about for ALL products?",
            "score": 2,
            "replies": []
        },
        {
            "author": "William-_-Buttlicker",
            "body": "Also should get ride of child tax credit, maternity leave and any forms of subsidies that are intrinsically discriminatory against singles and couples not having children.",
            "score": 7,
            "replies": [
                {
                    "author": "LoneHelldiver",
                    "body": "Is there's no tax there's no tax credit...",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "speedmankelly",
                    "body": "Maternity leave isn’t a problem… private companies can give whatever time off they want to whoever they want. Pregnant women can’t work the same as they can while not pregnant or raising a newborn so having them work anyway is inefficient and likely to be hazardous. It’s like if you had a complicated surgery and were expected to come to work the day after you had it, that’s not a subsidy to encourage you to have surgery; You have a valid reason to take time off and have paid sick leave. And if you did come to work then you drastically increase the risk of injury to yourself and you definitely aren’t going to be efficient in your position. Your notion is ridiculous.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "William-_-Buttlicker",
                            "body": "1. If you don't feel well, negotiate with your employers for sick days. No need for the government to get involved;\n\n2. Maternity leave is as discriminatory as DEI and I don't care if private companies want to give them or not. Unless they give the same amount of paid time-off to those who don't have kids.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "speedmankelly",
                                    "body": "Bud, it falls under medical and family emergency. If you had to take care of your sick mother after you had a major surgery you needed to recover from you should get the same time off. Never said anything about the gov. being involved. It’s all circumstantial though, nobody is giving out maternity leave to discriminate against singles which we aren’t even a protected class so legally it doesn’t even work out. I’m not a parent and I never want to be but I am going into medical and have taken maternal and natal care classes. It’s a lot on the human body and needs time to recover from, and then caring for an infant is a 24/7 job and the mother being away from the child for long periods of time increases risks for the infant in the first few months of life. Maternity leave just combines medical and family emergency. Like I said, if you had a major surgery that needed weeks recovery time you should get the paid time off, and if you had a sick family member to take care of 24/7 for a decent amount of time you should get that off too. I’m not going to talk about DEI because it’s not even remotely within the same sphere.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RequirementUsual1976",
            "body": "Subsidize nothing. Ever.\n\nMock vegans. Always.",
            "score": 2,
            "replies": [
                {
                    "author": "vegancaptain",
                    "body": "You should mock bad ideas. Many vegans are on your side here.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RequirementUsual1976",
                            "body": "I can mock all ideas. If they are good ideas they will weather the storm of my facetious bullshit.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "vegancaptain",
                                    "body": "Like the idea to not abuse or torture animals for fun?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "John_the_Piper",
                                            "body": "See those are the comments that make you lose the average person on your position. Hardly anyone is out there torturing and abusing animals for fun, and you know that.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "vegancaptain",
                                                    "body": "Not really. Most people would agree with me but fail to see how meat consumption fits that description. Then the education starts because almost no one has any idea of how this actually works wrt ecology, animal welfare, factory farming practices or nutrition for that matter.\n\nBut yes, meat consumption is 100% unnecessary so it's done for pleasure, or enjoyment, or fun one might say. \n\nMost people flip out and focus completely on \"attitude\" at this point. Let's see where this goes.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Vegan meat alternatives are fiat food.\n\nJust “no subsidies” full stop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManufacturerPublic",
            "body": "Libertarian ideas by definition must survive the marketplace without subsidizing. Meat subsidizing is to create a floor (raise prices) and you’ll find most Libertarians support ending that. Vegan subsidies are for ‘awareness’ of their meat is murder dogma and to prop up their business that have an unsustainable business model….libertarians are more against that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "COVFEFE-4U",
            "body": "Ending subsidies is fine, but the vegan stuff will still only be for a niche market. They could never compete with the real thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaffeinMom",
            "body": "I don’t understand how meat subsidies impair vegan meat alternative in the market. \n\nEither stop all farming subsidies or allow all farming subsidies. \n\nWhat you’re asking is for government subsidies to help one farming product and not another, in an attempt to make a processed product more competitive in the farming free market category.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MateTheNate",
            "body": "Vegans want to wield the power of the state to regulate away animal farms with onerous “humane” requirements. They are not our friend and their ideals do not align with the NAP.      \n\nThis must be a two-way street, end ALL farm subsidies especially soy and corn.",
            "score": -1,
            "replies": [
                {
                    "author": "vegancaptain",
                    "body": "I don't think it's wise to push for your right to abuse, torture and kill animals for your pleasure.\n\nAnd not very libertarian either. You shouldn't harm those who can suffer. The ethics is quite clear here. \n\nYou're even a minarchist dude, you will accept a government controlling the military, police, courts, maybe even healthcare and pensions but NOT allowing regulations to not abuse or torture animals? Come on. Get your ethics straight!",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "legal_opium",
                    "body": "There is no humane way to murder",
                    "score": -4,
                    "replies": [
                        {
                            "author": "MateTheNate",
                            "body": "Murder is done to other humans NOT animals, they are resources",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "vegancaptain",
                                    "body": "That's psychopathic. And dumb. But mostly psychopathic.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "vegancaptain",
                            "body": "One would think that libertarians in general would understand that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TexasBrett",
            "body": "Whatever gets the cheapest beef on the shelf in the supermarket, all the different cuts, is good by me.",
            "score": -3,
            "replies": [
                {
                    "author": "vegancaptain",
                    "body": "No matter how much torture, abuse or horrific conditions it entails?\n\nIs that really your superior ethics talking?",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}