{
    "title": "Clarksdale Press Register censored for criticizing local government",
    "author": "Fear_The_Creeper",
    "subreddit": "Libertarian",
    "rank": 220,
    "score": 5,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 1,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iu8vmq/clarksdale_press_register_censored_for/",
    "id": "1iu8vmq",
    "selftext": "A judge (Chancery Judge Crystal Wise Martin) has granted the City of Clarksdale, Mississippi’s request to order a newspaper, The Clarksdale Press Register, to delete an editorial criticizing city officials.\n\n[https://freedom.press/issues/mississippi-judge-ignores-constitution-to-order-takedown-of-editorial/](https://freedom.press/issues/mississippi-judge-ignores-constitution-to-order-takedown-of-editorial/)\n\n[https://www.pressregister.com/mississippi-judge-ordered-newspaper-remove-editorial-press-advocates-are-outraged-1](https://www.pressregister.com/mississippi-judge-ordered-newspaper-remove-editorial-press-advocates-are-outraged-1)\n\nHere is the text of the censored editorial. I believe that the Streisand effect applies.\n\n>Your Clarksdale Press Register will be the first to say that a sin tax that would pay police to fight crime in Clarksdale is a good idea.\n\n>So why did the City of Clarksdale fail to go to the public with details about this idea before it sent a resolution to the Mississippi Legislature seeking a two-percent tax on alcohol, marijuana and tobacco?\n\n>Mayor Chuck Espy has always touted how “open” and “transparent” he is and he is “not like previous administrations of the past 30 years.”\n\n>So why did Espy seek a Special Called Meeting of the Board of Mayor and Commissioners to finalize details of this move?\n\n>The notice was posted at city hall as required by law and said stated the city would “give appropriate notice thereof to the media.”\n\n>This newspaper was never notified. We know of no other media organization that was notified.\n\n>But back to what the city was trying to do.\n\n>Yes, there are deadlines for submitting legislation to Jackson. But this tax has been discussed in at least two meetings and has been reported in the pages of your Clarksdale Press Register.\n\n>Have commissioners or the mayor gotten kick-back from the community? Until Tuesday we had not heard of any. Maybe they just want a few nights in Jackson to lobby for this idea - at public expense.\n\n>As with all legislation, the devil is in the details and how legislation often morphs into something else that benefits somebody else.\n\n>An idea that sought to pay police higher wages for the toughest job in any community is admirable. But the way the resolution sought by the city of Clarksdale is now written gives us cause for concern.\n\n>The money - our money - can now be spent to “support and promote public safety, crime prevention and continued economic growth in the city.”\n\n>Does that mean the fire department, 911, Chamber of Commerce and their pet projects?\n\n>Does that promotion mean, giving away candy at Halloween, toy giveaways at Christmas and hosting events where politicians can hand out goody bags to votersin the name of safety?\n\n>This newspaper feels the original intent serves the purpose of all - putting police on the streets of Clarksdale.\n\n>More police will lead to more patrols, more patrols will lead to more arrests, more arrests will lead to less crime and less crime will make us all feel safer in our homes and neighborhoods.\n\n>Our Clarksdale Board of Mayor and Commissioners have stumped their toe on this one. They took a good idea, let their focus drift, and made us suspicious.\n\n",
    "comments": [
        {
            "author": "None",
            "body": "And this is why we need anti-SLAPP laws.",
            "score": 3,
            "replies": []
        }
    ]
}