{
    "title": "Javier Milei just gifted Elon Musk a Libertarian-Chainsaw 😂",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 196,
    "score": 738,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 101,
    "url": "https://v.redd.it/i2lmlwk6udke1",
    "id": "1iudayh",
    "selftext": "",
    "comments": [
        {
            "author": "Yodzilla",
            "body": "Didn’t the Senate pass a budget increasing defense and border spending by something like 250 billion dollars while this dog and pony show was happening?",
            "score": 80,
            "replies": [
                {
                    "author": "AlphaTangoFoxtrt",
                    "body": "And raised the debt ceiling $4T.\n\nRepublicans are not \"Small government fiscal conservatives\"",
                    "score": 62,
                    "replies": [
                        {
                            "author": "Yodzilla",
                            "body": "Exactly. Their plan changes by the day but what was the last thing Trump and Musk said? 20% of the savings go to pay down debt, 20% in rebates to the people, 60% to…somewhere else?\n\nCongrats, Elon gets to fight the boogeyman of DEI and claim he’s saving the country while pumping up an administration that totally rewards people based on merit and not just nepotism.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "AlphaTangoFoxtrt",
                                    "body": "Honestly I'm against rebates. We're $36.5 T in debt, running a $2T deficit. \n\nWe don't have the money to send rebates.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Yodzilla",
                                            "body": "Most sane people are. It’s one of the few things I’ve seen both sides come out hard against. Shit like that is a bandaid to sway short term popular opinion, not actually any sort of a fix to what’s actually broken. And I’m still not convinced that DOGE will be given leeway to really get to the heart of any real problems other than what culture warriors want cut.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cqb-luigi",
            "body": "Afuera!",
            "score": 110,
            "replies": [
                {
                    "author": "Upstairs-Brain4042",
                    "body": "Afuera! Afuera!",
                    "score": 37,
                    "replies": []
                }
            ]
        },
        {
            "author": "Icarusthesecond",
            "body": "What was the meeting? Where did it take place?",
            "score": 61,
            "replies": [
                {
                    "author": "curtainedcurtail",
                    "body": "It was at CPAC (Conservative Political Action Conference).",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "AmericanaCrux",
                    "body": "Yes. The more details on that we can find, the better.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "vodiak",
            "body": "https://preview.redd.it/dwwh69729eke1.png?width=604&format=png&auto=webp&s=0d47d30803cca4c6f8f39bebb27486b3c22af5b3",
            "score": 89,
            "replies": []
        },
        {
            "author": "tee142002",
            "body": "Cool. But also, someone get the kid further from the chainsaw.",
            "score": 53,
            "replies": [
                {
                    "author": "Basdala",
                    "body": "it has a chain? i remember him using one for props during the race, but always with no chain",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Anen-o-me",
                            "body": "It definitely looks like either the chain is on there or the blade has been specially cut to look like they're on there, as it appears to have been customized and laser cut. \n\nI would expect if started the device would not spin a chain at all in either case. It's simple to remove the gear that turns the chain even if the chain was left on. \n\nBut I was certainly concerned for that child since the chainsaw blade appears to have sharp teeth still.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 116,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 82,
                    "replies": [
                        {
                            "author": "helpmespell",
                            "body": "I was arguing with the people who now hate Elon (liberals loved him for green initiatives) how much of a government crook he is 10 years ago. Tesla doesn’t exist without the government giving them so many breaks and handouts. He’s just such a mixed bagged for me, I feel you either love or hate him and I’m stuck in the middle.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "kickroxxx",
                                    "body": "Exactly! Just call it what it is. Get this guy off the government tit and that’s a billion dollars I don’t have to pay toward. This guy has been taking subsidies for every company he’s involved in after PayPal. Feds don’t need armored cybertrucks. We don’t get starlink but pay for it to get “gifted” to Ukraine. Just fix the fucking budget instead of burning money on this guy blowing up rockets .",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "N3wThrowawayWhoDis",
                            "body": "This is such a silly talking point. Yeah, SpaceX takes government contracts. They provide orbital launches and of course the government is one of the largest customers in that industry. It would be one thing if he was abusing his position to upcharge or bastardize the industry, but SpaceX does literally the opposite. Every government contract awarded to them equates to tens of millions of tax dollars saved over what any other competitor could offer.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "kickroxxx",
                                    "body": "How about we stop using taxes to fund these do nothing projects? He wants to send shit up into the sky? Let him pay for it with his own money. Musk gets to give himself MY money and pay for his own pet projects. Sounds like waste and abuse to me. Stop subsidizing starlink and spaceX. Americans don’t get shit for what we spend on it.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "stray_leaf89",
                                            "body": "This is like your HOA forcing you to have a landscaping service and they offer to do it for $500/month and your mad at the guy who does it for $100/month instead of the HOA.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "kickroxxx",
                                                    "body": "Yeah. Except it’s paying a guy to watch him mow his own lawn like a landscaping cuckold. That’s why I don’t live in an HOA. We’re supposed to be getting rid of useless spending. Mow your own fucking lawn. I don’t want to pay for useless shit I get nothing out of. Do you?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "stray_leaf89",
                                                            "body": "You're proving my point. Be mad at the HOA (govt) for forcing you to hire someone for the job, don't be mad a the guy doing it for cheaper than the HOA does it. I want to see government programs cut but I'm not upset at private sector when they're more efficient with taxpayer money than the government.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "N3wThrowawayWhoDis",
                                            "body": "You and all the down voters don’t seem to understand. SpaceX is not subsidized. They are not being given loans or tax cuts to operate. They are awarded contracts for stuff that the government is going to send up with or without SpaceX’s help. SpaceX wins the contracts because they can do it for significantly cheaper than anyone else. They are paid to send up meteorological satellites, maintain GPS, telecommunications, all sorts of shit that keeps our modern lives running in the background. Your tax dollars aren’t paying for Elon’s pet projects. Those all come out of his own pockets.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "kickroxxx",
                                                    "body": "[“As of June 2023 Starlink expenses for Ukraine are covered by the US Department of Defense through a contract with SpaceX.”](https://en.m.wikipedia.org/wiki/Starlink_in_the_Russian-Ukrainian_War)\n\nLiterally a part of the billions being spent on Ukraine .\n\nTesla was built off of Obama DOE fed loans. \n\nSpaceX is suing over not getting *885 million in free federal funding* for just RESEARCHING whether they can get internet to rural areas.\n\nAnd Spacex is absolutely getting grants from the DOD and NASA. Not just contracts. \n\nWelfare Queen. Just another Pelosi fixing the game from both ends now.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "chronicpenguins",
                                                            "body": "Not only was Tesla built off direct subsidies for EVs, 40% of their profits come from the indirect subsidy called regulatory credits.  Elmo has been vocal about removing the consumer tax credit after benefiting from it over a decade - but he’s sure hush about regulatory credits.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SucculentJuJu",
                                            "body": "We get possible space colonization and off of this single point of failure called Earth.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "moosenoise",
                                    "body": "I see they down voted you, therefore you must be right ✅️",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "N3wThrowawayWhoDis",
                                            "body": "Homies too blinded by Elon hate to recognize a business that is beneficial to the United States in every aspect",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "odingorilla",
                    "body": "I’m confused by this he’s one of the first people to actually make any movement on libertarian ideals - he’s not perfect but we’ve been basically ignored for so long - it’s nice to have some movement …",
                    "score": 15,
                    "replies": [
                        {
                            "author": "helpmespell",
                            "body": "Exactly, he’s a mixed bag.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Rude_Hamster123",
                            "body": "Yep.  I’m with you, man.  Some imperfect progress is still progress.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yung_zu",
                    "body": "Taking more regulations off of you and off of modern billionaires would be carried by the same rhetoric but have vastly different effects\n\n\n\nThe other parties are also compromised. Better off abolishing the party system",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "GBrunt",
            "body": "If Musk handed over his entire net worth to plug the US debt mountain, there'd still be a $35+ trillion hole. There's no way that a combination of tax cuts (or his proposed refunds), government contraction, or higher prices/taxes for consumers through tariffs is going to fill the enormous hole. The toxic projection through his ridiculous salute is already damaging US exports abroad and costing US exporters.\n\nUltimately, Trump will balk at the idea of a smaller/lesser America through Government contraction, blow his load to boost his ego and do exactly what he did last time: Tax cuts for corporations, Big Oil, and the rich and load more Government debt onto the back of every American that pays their share.",
            "score": 11,
            "replies": [
                {
                    "author": "pooter6969",
                    "body": "\n\n>If Musk handed over his entire net worth to plug the US debt mountain, there'd still be a $35+ trillion hole.\n\nNot sure what your point is about Elon's net worth not being able to fix our debt problem.. my net worth wouldn't fix it either. The cool part is the government's annual spending is many, many times Elon's net worth, **so there is** absolutely enough headroom to become solvent if you make enough cuts. \n\nIt's true you aren't going to pay off 35 trillion at once but our budget is $6.3Tr and our annual deficit is $1.7Tr.  With a 27% cut we eliminate the annual deficit. So where are you getting this idea that it's impossible to make enough cuts to become solvent on an annual basis and start chipping away at the debt?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GBrunt",
                            "body": "I can guarantee you it's pie-in-the-sky. Tax cuts will be a bigger priority for Trump's backers. Followed by fat Government contracts. He grew the national debt last time. Won't be any different this time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mortis_XII",
            "body": "Was this before or after the libra crypto scheme?",
            "score": 7,
            "replies": []
        },
        {
            "author": "chuckcm89",
            "body": "Did we ever think we'd actually see this sentiment finally implemented in the white house? I'm stunned and overjoyed by this",
            "score": 27,
            "replies": [
                {
                    "author": "JimmyReagan",
                    "body": "Seriously I thought it'd be years if ever.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BucNassty",
            "body": "This is gold!! I can hear the screeching in other subs.",
            "score": 32,
            "replies": []
        },
        {
            "author": "sjuskebabb",
            "body": "Whats with the gold chains?? Throws me off. Had his son wear one during the visit to the oval office as well.\n\n  \nI can't get over the gold chains??",
            "score": 3,
            "replies": [
                {
                    "author": "WaltKerman",
                    "body": "It's a reference to the DOGE meme of him, including that exact pair of sunglasses.\n\nSeems like he liked how it looked.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "sjuskebabb",
                            "body": "Aaah, that explains it! Thank you! (still weird though)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "blacklipsmatter",
            "body": "![gif](giphy|ubSqS9N8LUIvssAiB1|downsized)",
            "score": 21,
            "replies": []
        },
        {
            "author": "None",
            "body": "Is that the guy who rug pull scammed his own country",
            "score": 39,
            "replies": [
                {
                    "author": "Medical_Flower2568",
                    "body": "after rescuing it from hyperinflation, yes\n\nHe is still so much of a net positive it is hilarious",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Heisenburgo",
                            "body": ">He is still so much of a net positive it is hilarious\n\nIt just so happens that the kirchnerist opposition is THAT bad, that Javier is 100% the saner option...",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "Lol that's like raping a woman after saving her from a fire.  Yeah you aren't being burned alive, but did he really have to do the bad thing also?",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Elegant_Rice_8751",
                                    "body": "Argentia was on the verge of a total collapse",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Ok?  So you get a free pass to do a bad thing if you do a good thing?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Elegant_Rice_8751",
                                                    "body": "He did a very good thing. He brought hope to many Argentins that they had never seen before. Yes, he made a mistake but for many he is the only way out.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cold_Rogue",
                                    "body": "Trust me is not comparable, at all, yeah what he fell into was pretty stupid and shows that he needs to have better advisors, but you werent here before him, this country was on the verge of a pre civil war",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Buckets4Days",
                    "body": "What did Milei do?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "https://www.reuters.com/world/americas/argentina-main-stock-index-falls-after-milei-crypto-scandal-2025-02-17/",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Buckets4Days",
                                    "body": "Thanks for the link",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AlanTuring1",
                    "body": "Well, first of all, he didn’t scam, but the owners of the token did. What he did is to spread a scam. \n\nIt is still to be proven whether he knew about the nature of the scam. If he didn’t know, you can blame on him for being ignorant, but not for scamming. Actually, he would have been the very first person being scammed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "J_Bro00",
            "body": "I mean, that's pretty fucking cool",
            "score": 25,
            "replies": []
        },
        {
            "author": "paunchburg3r",
            "body": "![gif](giphy|xT9KVhLU76MRgVg3Qc)",
            "score": 8,
            "replies": []
        },
        {
            "author": "Cptsaber44",
            "body": "probably looking to give elon a blowie so he’ll pay whoever needs to be bribed for them to overlook Milei being stupid enough to promote a shit coin\n\nsometimes i wonder if these senile brainlets go into politics because they’re not capable of doing anything else",
            "score": 24,
            "replies": [
                {
                    "author": "CapnHairgel",
                    "body": "Politics is the refuge of the old.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZombiesAtKendall",
            "body": "I think it’s stupid.",
            "score": 2,
            "replies": []
        },
        {
            "author": "robtimist",
            "body": "Milei and Musk are both part of the Network State. Slash spending all you want, I know what your endgame is here",
            "score": 2,
            "replies": []
        },
        {
            "author": "aquatic_elephant",
            "body": "For those who are interested in such things, [the chainsaw is a TMC MT-598](https://fireandsaw.com/argentina-milei-chainsaws/) customized and modified by Argentinian Tute Di Tella.",
            "score": 5,
            "replies": []
        },
        {
            "author": "HeyBlinkinAbeLincoln",
            "body": "What the hell happened to this sub. Post-inauguration it’s full of shitty memes and celebrating the biggest welfare queen on the planet.",
            "score": 5,
            "replies": []
        },
        {
            "author": "wod_killa",
            "body": "That is a great gift!!",
            "score": 7,
            "replies": [
                {
                    "author": "Ok-Raccoon3829",
                    "body": "Bro typed the same comment three times",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Seared_Gibets",
                            "body": "And they all get an upvote!\n\nReddit mobile is shit, it'll say it's failed to post something when it hasn't actually failed to post it.\n\nUnfortunately it's a guessing game a lot of times.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "wod_killa",
                            "body": "Reddit mobile went all screwy as I was typing it. I had to close the app and when I opened it again, I guess it posted three times.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "CapnHairgel",
                                    "body": "You're lucky you got away with three. One time it posted the same thing like eight times for me",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Derpiliciousderp",
            "body": "Milekowsi pulled the rug out from.under his own people. Fuck that dude",
            "score": 4,
            "replies": []
        },
        {
            "author": "hblok",
            "body": "We desperately need some of those in Europe as well.\n\n(Oh, hold on. There's somebody at the door. Probably the German police coming to check on my Likes).",
            "score": 3,
            "replies": []
        },
        {
            "author": "cathode-raygun",
            "body": "That's pretty fucking awesome gift.",
            "score": -2,
            "replies": []
        },
        {
            "author": "lobby_deeznuts42",
            "body": "Haha so awesome",
            "score": 0,
            "replies": []
        },
        {
            "author": "wake-me-disclosure",
            "body": "Yea, in a word, CHAINSAW",
            "score": 1,
            "replies": []
        },
        {
            "author": "NorthernOracle",
            "body": "It is common for heads of state to exchange gifts. Perhaps Elon really is running the show. He did spend 200 or 300 million on Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thunderbaby2",
            "body": "Michael Scott and Todd Packer reuniting\n\n![gif](giphy|ibolRwTFRfQRcEYQ2k|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "vaulthunter2021",
            "body": "Paid in libras😆😆😆😆😆?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatBCHGuy",
            "body": "Bad ass. Doom slayer.",
            "score": -2,
            "replies": []
        },
        {
            "author": "blix88",
            "body": "Fuck yeah, Slash it!",
            "score": -4,
            "replies": []
        },
        {
            "author": "asilenth",
            "body": "Nothing about this is bad to the bone.\n\nLets see what he looks like trying to cut down a tree.",
            "score": 1,
            "replies": [
                {
                    "author": "WaltKerman",
                    "body": "I'd prefer he keep using it on the government thanks.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "calmglass",
            "body": "I absolutely love this!!",
            "score": -4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Important_Race2018",
            "body": "What Kind of libertarian is musk? In my opinion, showing a national socialism gesture could not be libertarian.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guammar-Maddafi",
            "body": "This is truly my favorite timeline.",
            "score": -6,
            "replies": []
        },
        {
            "author": "wod_killa",
            "body": "That is a great gift",
            "score": -5,
            "replies": []
        },
        {
            "author": "wod_killa",
            "body": "That is a great gift",
            "score": -7,
            "replies": []
        },
        {
            "author": "No-Conclusion6662",
            "body": "What this is awesome",
            "score": -2,
            "replies": []
        },
        {
            "author": "exiledmantis",
            "body": "Amazing",
            "score": -2,
            "replies": []
        },
        {
            "author": "Illustrious-Radio-55",
            "body": "Dos pedazos de mierda",
            "score": -1,
            "replies": []
        },
        {
            "author": "MissingJJ",
            "body": "I was wondering where it came from.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Wespiratory",
            "body": "![gif](giphy|0eVM7GVxTDDKxn7OyX)",
            "score": -1,
            "replies": []
        },
        {
            "author": "Equivalent-Web-1084",
            "body": "Wow a news clip that made me smile. Been awhile.",
            "score": -1,
            "replies": []
        }
    ]
}