{
    "title": "Elon Musk wields chainsaw on stage as Trump's right-hand man boasts of slashing government spending",
    "author": "libertyseer",
    "subreddit": "Libertarian",
    "rank": 195,
    "score": 79,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.dailymail.co.uk/news/article-14421021/Elon-Musk-wields-chainsaw-boasts-slashing-government-spending.html",
    "id": "1iute6d",
    "selftext": "",
    "comments": [
        {
            "author": "egtoss",
            "body": "The entire federal payroll amounts to only 4% of the budget. You could cut everyone and we'd still be running enormous deficits.\n\n\nSpeaking of which, Senate GOP just passed a budget that would increase the deficit by $2.8 trillion, based on the presumption they can cut $2 trillion in spending (unlikely). Without the spending cuts it'd be nearly 5 trillion. \n\n\nThis is all just political theater. ",
            "score": 156,
            "replies": [
                {
                    "author": "WaltKerman",
                    "body": "Sounds like he should cut more than just the federal payroll then, huh?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "bigHam100",
                    "body": "They have only just started with federal payrolls. Pentagon is up next.",
                    "score": -55,
                    "replies": [
                        {
                            "author": "egtoss",
                            "body": "No, the GOP bill includes $150 billion INCREASE in defense spending.\n\n\nHistorically the GOP has always been fiscally irresponsible. National debt tripled under Reagan. Clinton brought us a budget surplus (granted, Gingrich forced his hand). Bush blew massive deficits in a warm economy and Obama steadily decreased deficits in a sluggish economy, only for Trump to add trillions more in debt. I'll grant you Biden was no better. But there's nothing worse for the federal budget than GOP control of Congress + POTUS. ",
                            "score": 74,
                            "replies": [
                                {
                                    "author": "jankdangus",
                                    "body": "Yeah, the GOP are definitely hypocrites on the issue of fiscal responsibility. This is why I’m an independent. I would have definitely vote for Bill Clinton, balancing the budget is a big deal. The hope now is that Trump vetos the bill that increase defense spending.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "Bird_law_esq",
                                    "body": "Honest person alert ^",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "bigHam100",
                                    "body": "I thought I saw Hegseth tell the Pentagon to get ready for 8% cuts. Maybe that will be for next years bill.\n\nAnd agreed on your second paragraph. GOP in the last few decades have been horrible on the deficit, arguably worse than the Dems",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Hegseth did do that, but the crooks at the Pentagon later stated that the savings would be reallocated to other programs such as the Iron Dome. I think the reason why Republicans are pro-military is because the economy is intertwined with global stability which requires America being the global police.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "libertyseer",
                            "body": "This is true.  \"DOGE looks at making cuts at the Department of Defense\"\nhttps://www.foxbusiness.com/politics/doge-looks-making-cuts-department-defense",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JonnyDoeDoe",
            "body": "You can see he's never held a chainsaw in his life...",
            "score": 34,
            "replies": [
                {
                    "author": "Spooky3030",
                    "body": "He sends 10 story rockets into space,  then catches them when they come down.  He's a computer geek.  Not everybody is mechanically inclined.",
                    "score": -15,
                    "replies": [
                        {
                            "author": "Jay_R_Kay",
                            "body": "I mean, *he* doesn't, he just gets money for the people in his company to do that.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "WaltKerman",
                                    "body": "No he sends them. He doesn't build them. He hires people to build them.",
                                    "score": -6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JonnyDoeDoe",
                            "body": "That's a fact...",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "JonnyDoeDoe",
                                    "body": "So now it's controversial to agree that not everyone is mechanically inclined... Unreal...",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kinglizardking",
            "body": "Is the chainsaw that MiIei gave him?",
            "score": 5,
            "replies": [
                {
                    "author": "Bagain",
                    "body": "Yes, Milei was there, they brought him out.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Something something idiocracy",
            "score": 31,
            "replies": []
        },
        {
            "author": "EngagedInConvexation",
            "body": "He's just gonna hock it for more ketamine.",
            "score": 8,
            "replies": []
        },
        {
            "author": "libertyseer",
            "body": "S/S\nLibertarians have long advocated lowering government spending as a way to lower or eliminate the deficit, as well as limiting government power. The chainsaw was given to Elon Musk by Argentina president Milei.",
            "score": 5,
            "replies": [
                {
                    "author": "solipsist2501",
                    "body": "Bro even the libertarian community is full of salty lefties on this site. When do you suppose the USAid money runs out?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dontdoubtthedon",
            "body": "Actions speak louder than .. chainsaws?",
            "score": 4,
            "replies": []
        },
        {
            "author": "NapkinsAndPencils",
            "body": "Cut 65% of Income Security programs spending, $250B from the DoD, $400B from Medicaid, $250B from Medicare, $250B from Social Security, eliminate the DoE, etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nflreject",
            "body": "Perfect",
            "score": 1,
            "replies": []
        },
        {
            "author": "zanpher717",
            "body": "This asshole loves his props",
            "score": 0,
            "replies": []
        }
    ]
}