{
    "title": "As we continue to devolve into Post-Truth Politics, Arendt becomes more relevant than ever. Democracy seems to have no defense against this strategy of lie-bombing.",
    "author": "Anen-o-me",
    "subreddit": "Libertarian",
    "rank": 170,
    "score": 269,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 14,
    "url": "https://i.redd.it/mq1zw5i2lqke1.jpeg",
    "id": "1ivpx39",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Democracy is tyranny of the majority. Read Hoppes [Democracy: The God That Failed](https://www.riosmauricio.com/wp-content/uploads/2013/04/Hoppe_Democracy_The_God_That_Failed.pdf), or other works by libertarians such as [Rothbard](https://mises.org/library/book/anatomy-state), [Spooner](https://oll-resources.s3.us-east-2.amazonaws.com/oll3/store/titles/2194/Spooner_1485_Bk.pdf), or [Hoppe](https://www.youtube.com/watch?v=qrl8YorTa1U) to learn about why so many libertarians [oppose democracy](https://www.youtube.com/watch?v=qrl8YorTa1U). Also check out r/EndDemocracy\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProfessorChiros",
            "body": "https://preview.redd.it/09n0kv20tqke1.png?width=859&format=png&auto=webp&s=5bbd9e2a9b6dc1fd910f43cdc5231f94cb505d7d\n\nLove me some Hannah Arendt",
            "score": 35,
            "replies": []
        },
        {
            "author": "natermer",
            "body": "Truth and politics have always been strangers.\n\nNowadays as politics becomes all-consuming pastime for a large percentage of people they have lost all ability to discern fact from fiction, truth from lies. The only thing that matters is what expedient and what narratives support their positions. \n\nFrom their perspective a person who tells the truth looks like a child babbling.  It doesn't even register as something meaningful or coherent.",
            "score": 17,
            "replies": []
        },
        {
            "author": "sirweevr",
            "body": "I agree with the quote but the missing link (and the only valid defense as far as I can see) is that you need a system where even the most malicious, idiotic, deceitful leaders in your country can do nothing more than talk about 51st states and make antisemitic salutes on stage. The solution, ironically, may be less democracy.\n\nWe've stayed comfortable with an ever increasing centralisation of media, online and political power and now it sucks because we have someone in a position of power who has no issues with using that power to harm his own citizens (and other countries).\n\nI'm not sure we should ever be surprised, this eventually ALWAYS happens with great concentrations of power.",
            "score": 7,
            "replies": [
                {
                    "author": "Anen-o-me",
                    "body": "The answer is decentralization, yes, not democracy. A system where you decide for yourself will outperform any one where someone decides for you, because that is where corruption enters the picture. \n\nThe only person who will never cheat you is yourself. \n\nThat rules out democracy.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Asangkt358",
            "body": "\"Devolve\" implies that at some point in the past we had truthful politics.  We have never had truthful politics.",
            "score": 7,
            "replies": [
                {
                    "author": "Anen-o-me",
                    "body": "No it's only implies that things are getting worse and we're relatively better before, which I think is obviously true. Pre post-truth politics was in some senses better than what's going on now, because Trump is willing to destroy the sense of stability and security not only the US people had but our international allies. And things were better in the US before FDR and Lincoln as well (excepting slavery).",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Asangkt358",
                            "body": "I don't agree.  It only seems worse to some people now because they can finally see that the media peddles nothing but propaganda.  But they've always been peddling propaganda.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Anen-o-me",
                                    "body": "In terms of the system itself, things are worse. Democracy is breaking down. \n\nI think you mean that from our perspective, things are better, because we want it to break down and become less good at killing us.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Asangkt358",
                                            "body": "Oh stop with the hyperbolic nonsense.  Democracy isn't breaking down.",
                                            "score": -16,
                                            "replies": [
                                                {
                                                    "author": "Anen-o-me",
                                                    "body": "Are you serious. Wow. It's breaking down globally. And I'm good with that because democracy is not good enough, we need something better.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fonzane",
                    "body": "I even believe that the political forces that have been gaining power lately are more honest than the old establishment they are fighting. Human rights and all that stuff... Lip services... These high ideals are low tools of power in disguise.... My impression is that Trump's regiment, for example, is less evil than Biden's regiment because it's more honest. But the real danger is ultimately the centralisation of power. And I don't get the impression that Trump has any desire to let go of power and let the people actually make decisions...\n\nThe true superiority of democracy is when people can make policies according to their needs without unnecessary intervention of state politicians or corporations/capitalists. This begins with functioning regional levels of government with elements of direct democracy. Switzerland is a prime example of how well this works. Just look at 1920-1940 Europe. Civil war in Spain, fascism in Italy and Germany, Socialism (Lenin/Stalin) in Russia. Completely derailed, utter chaos and brutality all around. And they managed to stay almost completely out of it. It's a miracle if you ask me. Similar in relation to WW1. People still argue against their democratic system, but all their concerns are theoretical. I honestly think these concerns are based on subtle indoctrination. We are taught to think in abstract, national ways. Decentralization and locality are concepts we are unfamiliar with. We don't trust each other, we have to defend our possessions from each other... Idk.",
                    "score": -14,
                    "replies": [
                        {
                            "author": "Anen-o-me",
                            "body": "Better than direct democracy is unacracy, where each person chooses for themselves sans group voting.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Montananarchist",
            "body": "Very Randian, who influenced whom?",
            "score": -3,
            "replies": []
        }
    ]
}