{
    "title": "How do libertarians feel about militias, especially anti-government militias?",
    "author": "PoeticPeacenik",
    "subreddit": "Libertarian",
    "rank": 141,
    "score": 9,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 61,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ixi8az/how_do_libertarians_feel_about_militias/",
    "id": "1ixi8az",
    "selftext": "Basically the title. How do libertarians feel about militias, especially anti-government militias? And as long as they're not violent/as long as they're not committing acts of violence?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 41,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "Same.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "RingGiver",
            "body": "This question practically glows in the dark.",
            "score": 22,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "What does that mean? And is that good or bad?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DotJata",
                            "body": "You're being accused of being a Fed.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "Why? Just because I asked how libertarians feel about militias? Militias aren't even illegal. Organizing groups aren't even illegal. Heck, groups like the KKK and Hell's Angels exist because they're legal. Some of the activities said groups might do might be illegal. But the existence of the groups themselves are legal. So accusing me of being a fed doesn't make any sense. Plus my account isn't new. I have posts that are a few years old talking about my situation that I'm in, asking for legal advice about my situation. So just read through my post history and comment history if you're suspicious of me lol.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DotJata",
                                            "body": "I couldn't tell you why. I didn't post it. I was just letting you know what glowing/glowie meant. Lol",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PoeticPeacenik",
                                                    "body": "I see comments where other people are accused of being a fed because of something they post. I think sometimes it's just a playful joke or sarcasm and I think sometimes people are genuinely suspicious. But I don't understand it. I mean there's billions of people in the world, millions in the United States. Sure, some posts could be a fed and some posts are definitely from genuine people. I mean you can't tell me I'm the only person that has the questions and curiosity that I have. I'm sure there are several ordinary people who wants to know about militias and similar groups.\n\nAnd here's the thing. Organizing groups is LEGAL. The activities of certain groups might be illegal. But the existence of the groups themselves are NOT illegal. Feds might keep tabs on certain groups just to catch them doing illegal activities but they can't do anything about groups existing. And there's nothing illegal about the group idea I have. Just a civilian defense force to protect communities from bad people and from crooked cops and to protect against a tyrannical government should it ever come to that. None of that is illegal. I was also thinking the group I have in mind would conceal carry everywhere to protect against mass shootings and potential criminals. We need to protect each other and our communities and each other's communities. I thought libertarians would be interested in such an idea.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheFishyNinja",
            "body": "Nice try, fedboi /s",
            "score": 14,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "Well, at least you added an S so I know you're best sarcastic lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BlueStarSpecial",
            "body": "For it.",
            "score": 13,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "Same. I wish there was an apolitical anti-government militia that isn't strictly/specifically Left or Right. Also something like a civilian defense force.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "PhilRubdiez",
                            "body": "Be the change you want to see in the world.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "I don't know how start anything lol. My idea was to talk to other people about my ideas and let others who are interested to put everything into action.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "BlueStarSpecial",
                                            "body": "Most problems I have seen with militias is anything bigger than a squad sized element invites the wrong types (Feds and racists). You are better off training with a group of friends and joining a competitive shooting league.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "PoeticPeacenik",
                                                    "body": "Exactly, that's the problem. Most militias usually lean to one side politically, and are usually right-wing. We need a group that is apolitical, that is neither strictly left nor right. Any bad apples would be kicked out of the group. Anyone who joins would be vetted and screened. Maybe not even call it a militia. But maybe a civilian defense force.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PhilRubdiez",
                                            "body": "First off, I would say a militia of peacenik poets isn’t a great choice for violence.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "PoeticPeacenik",
                                                    "body": "I specifically said as long as they don't commit acts of violence (and I'm talking about actual violence, not defense or self defense). And yeah I prefer nonviolence and I prefer no confrontation but I'm not against self defense or the second ammendment. The peacenik thing was really referring to being against war and senseless violence (like gang violence for example).",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Odins_Infantry",
            "body": "The biggest problems are that racists/hate groups like to use the term militia,  and Secondly when large groups of organized people start arming themselves the fed find an excuse to kill everyone, even the dogs.  Elegegedly",
            "score": 3,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "Okay, we can call it a civilian defense force. Or paramilitary (but I think the term paramilitary has a bad rep too).\n\nBut that's the thing, how do you keep a group from becoming another \"right-wing group\" or from even becoming \"a left-wing group\". How do you keep the group politically neutral and apolitical as a whole and how do you keep the bad apples out of the group?\n\nIt's not just about arming themselves or about guns, although that's part of it. But I have a whole idea in my head.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Odins_Infantry",
                            "body": "Those are the million dollar questions. Which brings up another point, funding. Funding for facilities and training aren't cheap. The more legit you are the more records you will have for transparency. As far as bad apples that's comes down to integrity but some with see kicking people as an issue. You'll have to keep people with records out but that might mean keeping good people who just made a mistake out. I don't think it's impossible but it will be slow and stressful",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "Funding is a big setback for me. I don't even know how to start any kind of group which is why I wanted someone who has the means and the know-how to do it. I don't even know if I want credit for the idea lmao. I once set up an anonymous Facebook page with the idea (had the group name on the page and everything) and I deleted the page.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Odins_Infantry",
                                            "body": "Yeah that's another thing, you might start an honest group but life control and it still be your fault in the end",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PoeticPeacenik",
                                                    "body": "That's true too. But that's why I said I don't want credit for the idea lol.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "amibeingdetained50",
            "body": "We call them \"gun clubs\".",
            "score": 4,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "I'm not talking about a gun club. But guns is definitely part of the idea. And a gun club would be a good place to find people who would be interested in a militia or civilian defense force.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dollar_Bills",
            "body": "If the government isn't doing anything wrong, they have nothing to fear.",
            "score": 5,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "But shouldn't we have a nationwide militia or civilian defense force prepared just in case?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Actual-Jaguar-550",
                            "body": "Shadow army anyone?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Get_Wrecked01",
                            "body": "For what purpose?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "There's quite a few reasons.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dollar_Bills",
                            "body": "Currently, the US military is made up of Americans. If we start going down the Rome route of foreign fighters we are already cooked.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "Can you explain? And I'm not talking about the military but the government itself.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Dollar_Bills",
                                            "body": "What would anyone need a nationwide militia for? Doesn't even make sense.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "PoeticPeacenik",
                                                    "body": "Think of it like an organization that has a chapter in each state.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Dollar_Bills",
                                                            "body": "What is it for?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PoeticPeacenik",
                                                                    "body": "Mind if I dm you?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WanderingPulsar",
            "body": "Anti-law armed activist collectivist groups = terrorists",
            "score": 1,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "That's not what I'm talking about. I think you misunderstood my post.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WanderingPulsar",
                            "body": "Nope\n\nIf someone is to arm, it should be done individually",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "Why? What's wrong with a militia? And I said in my post \"as long as they're not committing acts of violence\". So I'm not talking about terrorists lol. Think of it also as a civilian defense force. Like a self defense group. Definitely the opposite of a terrorist group since terrorists hurts innocent people.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WanderingPulsar",
                                            "body": "I didnt even talk abt violence\n\nAs a citizen, i shouldnt have another armed gang to fear about. Form a security company and hire people, then market your security service to other people\n\nYou can already do that. Any armed group that can decide whats right and whats wrong and act on it collectively is an oxymoron",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PoeticPeacenik",
                                                    "body": "But I'm talking about a good group, not a bad one. Not a group to fear. A group whose purpose it is to protect.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "WanderingPulsar",
                                                            "body": "Theres no such thing as universal good or bad. You are talking abt a group that will decide whats righteous and whats not. Fuck that group, they are not an authority over me. Who are you or them to decide whats right for me?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PoeticPeacenik",
                                                                    "body": "This is not an \"authority-type group\" and has nothing to do with deciding what's right or wrong (other than fighting against what everyone can agree is wrong, such as abuse). More like a defense group to protect people. I think you're taking my idea the wrong way. Think of it like a civilian defense force or a neighborhood watch.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "International_Lie485",
            "body": "Great",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jatvardr-",
            "body": "Well Im not american so f\\*\\*k you feds.\n\n  \nAnd yes, Im completely favorable to anti-government militias. But they can/MUST commit violence agaisnt communists, fascists, or any manifestation envolving taxes, empowering the state, attacks against individual liberties etc.\n\nCommunism, fascism, socialism, left anarquism, social democracy... all scum. They deserve to be considered as terrorists.",
            "score": 1,
            "replies": [
                {
                    "author": "PoeticPeacenik",
                    "body": "I'm not a fed. And I'm glad you refer to them as \"anti-government militias\" because a lot of militias that the media deems as anti-government militias says their not anti-government as if anti-government is such a bad fucking thing (and it's not). Also, don't be afraid to cuss lol. Free speech, dude. It's okay to say fuck (unless you have religious convictions against it and just don't wanna say it lol).\n\nI'm not gonna comment on what you said about violence (in case the feds are watching/reading). I'm not a fan of violence personally (I'm not just saying that for the feds, I really am not a fan of violence or confrontation). Plus you don't want a civilian defense force to be taken as a terrorist organization nor do you want to risk innocent lives (lives you are meant to protect). By the way, wouldnt your idea about violence violate the NAP?\n\nWhat I had in mind was a militia that would conceal carry everywhere (or open carry if allowed) to prevent  mass shootings and other would-be/potential criminals. And a militia that would put the fear of God in abusers such as rapists, etc. and crooked cops. I have other ideas for the group but I don't want to say too much right now unless I'm talking to someone who's seriously interested in the idea and as long as I know they're not a fed. (Only reason a cop would be against my idea anyway though, is if they're one of those cops who beats their wives or commits sex crimes, or if they're a fascist power-tripping/power hungry cop but there's probably more of those types than anyone likes to acknowledge or admit). My group idea is about protecting communities and people, not committing senseless violence to push political ideology or some agenda. I also want the group to be apolitical or politically neutral, so not another \"right-wing group\" and not a \"left-wing group\" either.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Jatvardr-",
                            "body": "Well, I'm interested in hearing your proposal, please proceed, I'm a good listener.  \n  \nIn relation to the NAP, no, it is not an infringement of the NAP. Fighting a killer before he has the opportunity to kill someone doesn't make that aggression unjust; Just as an armed militia repressing and making an hostile front against the commies and fascists is not an unjust aggression, but a legitimate defense of society against these parasites.  \n  \nIn my opinion, a private guard is legitimate, decentralized and financed by voluntary money from individuals aligned with its principles. There must be several of these running and organizing counter-demonstrations to defend their cities or regions from socialism (or as Frederic Bastiát says in his book \"The Law\", legal plunder).\n\n  \nIn my opinion about the apolitical militia, I dont think it is possible since libertarianism is an far right ideology, maintaining it as status quo makes it still far right I guess...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PoeticPeacenik",
                                    "body": "Just because the militia members are \"right-wing\" doesn't mean the group has to be as a whole. We could also have a mix of members from various political ideologies to keep the group politically neutral (if we can get different ideological groups to work together). Also there's right-wing libertarians and left-wing libertarians so libertarianism isn't just a right-wing ideology. Although I see comments and posts from conservative libertarians moreso than from liberal libertarians.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Jatvardr-",
                                            "body": "Interestingly, in my country, liberalism is a right-wing political movement, and liberals are often called fascists by the left. Here, the left is generally protectionist and interventionist, while in the US, the left claims to be liberal and pro-market. Here in Brazil, we have a movement called the \"Mission Party\" from a group called the Free Brazil Movement, moderate liberals, and they are often harassed by student groups, left-wing parliamentarians, and almost the entire spectrum of the left as fascists and far-right.\n\n\n\nBut you touched on a good point, left-libertarianism. This ideology is anti-capitalist and its acts involve physical aggression or extreme sabotage against companies, or potential targets of anti-capitalism, vandalism, etc. The root of left-libertarianism is Marxism, although they are not necessarily Marxists and disagree on their approach to the State.\n\n\n\nLeft-libertarianism is still socialism. Every anti-capitalist ideology without exception is in favor of plundering at some level, some more and some less, so I can assure you that they fit into the category of \"socialists\", and therefore \"terrorists\".\n\n  \nAbout the militia, I think the members opinion dont matter, it would be a private security company yk?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PoeticPeacenik",
                                                    "body": "Interesting and I guess about people's opinion no't mattering. But I don't condone terrorism and while I am not a socialist, I disagree that socialism equals terrorism. I'm talking about a civilian defense force to protect communities and people, not a terrorist organization. Think of it like a neighborhood watch.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Jatvardr-",
                                                            "body": "Socialists want to exploit you for their own benefit, for the benefit of a privileged group, or theoretically for a social class. Even if the government's laws say that this is allowed and legitimate, and therefore legitimize socialism, democrats and progressives, it is still no different from terrorism, even if only morally speaking. I am not saying that this hypothetical militia should kill leftists, of course not, but rather prevent them from raising crowds to endorse this bloodthirsty ideology and perpetuate this genocidal discourse.\n\nIf shooting an invader on my property is legitime, contain leftie crowds are too.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PoeticPeacenik",
                                                                    "body": "I understand what you mean and I'm not advocating for violence.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Jatvardr-",
                                                                            "body": "Oh sure, Im not a fan of it, but it eventually is necessary. (I do respect your pacifism)",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PoeticPeacenik",
                                                                                    "body": "I'm not sure if I would call myself a pacifist (anymore), but I definitely prefer to avoid violence and confrontation if at all possible and to only resort to violence or confrontation as a last resort and I mean absolutely as a last resort.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}