{
    "title": "“The government is excellent and uses your tax dollars efficiently” -Ron Swanson",
    "author": "LowerOurFuckingTaxes",
    "subreddit": "Libertarian",
    "rank": 120,
    "score": 662,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 156,
    "url": "https://i.redd.it/smuxhjxrnale1.jpeg",
    "id": "1ixw1wr",
    "selftext": "Came up with this meme concept",
    "comments": [
        {
            "author": "EndlessExploration",
            "body": "I love the idea of cutting, but I haven't seen it yet. \n\nOn US Spending's report, we've spent $3 trillion YTD. At the same time last year, it was on $2.3 trillion.",
            "score": 230,
            "replies": [
                {
                    "author": "ruleux",
                    "body": "It seems like smoke and Mirrors at this point.  Worse there seems to be a larger personal agenda responsible here.  Im all for reducing goverment waste but even the \"Proof\" being published by the DOGE agency is hasty and not well thought out.  Is it reducing next year's budget?  Is it purely based on canceled tangible programs?  Why are they not selling half empty Goverment office?  I want to believe this is for the good but so far Im not convinced.",
                    "score": 190,
                    "replies": [
                        {
                            "author": "EndlessExploration",
                            "body": "That was my thought!\n\nHonestly speaking, any spending cut that can lower the debt will cause a recession. I welcome those cuts, but we should be able to feel them. At this point, it just seems like a publicly stunt.",
                            "score": 38,
                            "replies": []
                        },
                        {
                            "author": "StoppableHulk",
                            "body": "It's meme policy made by unserious memelords. \n\nDo people not understand the army of forensic accountants it would take to legitimately analyze the federal budget and make logical cuts? \n\nI would love for that to be a project that was *seriously undertaken* by *serious people* who were doing it with the explicit goals of legitimate transparency and the reduction of the average citizens' tax bill and the restoration of citizens' liberty.\n\nThat is not what this is. \n\nThese are 20-year-olds with ChatGPT. They have no fucking idea what they're looking at. This is to mollify and distract rubes while they steal whatever they want for themselves, and if you take what they're telling you at face-value then you need to sharpen your political wit because this is the most obvious con in the history of cons.",
                            "score": 112,
                            "replies": [
                                {
                                    "author": "Arc_2142",
                                    "body": "It’s not just dumb 20 year olds, despite what the media tells you. They work in teams of 4, consisting of an attorney, an HR specialist, an engineer, and a lead.\n\nIt’s wild that on the “libertarian” subreddit, any amount of government cuts are discouraged.",
                                    "score": -41,
                                    "replies": [
                                        {
                                            "author": "StoppableHulk",
                                            "body": "Lmao and who among them is an actual accountant, or anyone who knows their own dick from a pole in the ground.\n\nThe White House will not and cannot even confirm in court who actually leads the agency doing the cuts to begin with. You have literally no idea who is even working on that team, because the only word is the word of serial liars to begin with, and the person who claims to be leading the team (despite the White House officially denying him doing so) keeps saying it is \"illegal\" to know the identities of the people working on the team. \n\nSo you're just out there trusting that some rudderless organization, accountable to no one, whose identity is denied by same White House that enshrined the organization, is going to competently audit the entire federal budget and make sure *your* tax dollars get back into *your* pocket. \n\nAlright friend. Apropos of nothing, would you like to buy a bridge?",
                                            "score": 53,
                                            "replies": [
                                                {
                                                    "author": "CkresCho",
                                                    "body": "I'm pretty sure it's the same guy who has a whoopee cushion sound for the seats in his car company.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Arc_2142",
                                                    "body": "Yeah, lawyers and engineers totally don’t know their dick from a pole in the ground.\n\nDo you hear yourself right now?",
                                                    "score": -30,
                                                    "replies": [
                                                        {
                                                            "author": "StoppableHulk",
                                                            "body": "Mate, they're not accountants lmao. These are random SpaceX engineers who have never touched an accounting system in their lives, and the lawyers are there to protect *them* from lawsuits *made by the taxpayers* for all the data they're fucking up. \n\nWhat do you actually think this team is doing? How do you think the fucking lawyer is helping identify which line items in the federal budget are able to be \"cut?\"",
                                                            "score": 23,
                                                            "replies": [
                                                                {
                                                                    "author": "kkdawg22",
                                                                    "body": "I mean, I work in the accounting world, the bar isn't exactly high... I would rather have me (not an accountant) doing my taxes than many accountants.",
                                                                    "score": -3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Arc_2142",
                                                                    "body": "The lawyers are there to ensure the team is operating within the confines of the law. If you consider that protecting them from lawsuits, then so be it.\n\nThis composition makes more sense because they’re using software to comb through numerous databases to find wasteful expenditures. I’m sure an accountant would find a similar route, as it is far from feasible to manually go through an entire system that has been adding up for decades at this point. Having a program comb it is more efficient.",
                                                                    "score": -15,
                                                                    "replies": [
                                                                        {
                                                                            "author": "StoppableHulk",
                                                                            "body": "> This composition makes more sense because they’re using software to comb through numerous databases to find wasteful expenditures. \n\nAgain, how. Be specific. \n\nHow do a handful of twenty-something engineers, working on projects not even remotely related to finance, magically find \"waste.\" \n\nHow do they even *define* waste? By vibes? By prompting ChatGPT to \"find waste?\" \n\nI mean truly, I want you to just go through the thought exercise of actually trying to understand what they're doing, and how. And how *you* will ever see a red cent of anything they cut.\n\nYou can't answer it, because *they* don't have an answer, because they're not legitimately looking for waste. You are just naive if you think this has literally anything to do with legitimately finding waste. Why do you believe them? \n\nTrump's last term, he exploded the fucking deficit. He's a career fraudster. \n\nThey are very transparently looking for $3 trillion they can cut to give tax cuts to billionaires, which is why the world's richest billionaire is literally leading the charge, despite the White House denying his involvement in court.\n\nIf these clowns cannot articulate the methodology they're using to make cuts, if they cannot even have someone public-facing explaining what they're doing and how it will materially benefit *you*, how it will reduce *your* taxes and restore *your* liberty, then it's a fucking scam, mate.",
                                                                            "score": 30,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "No_Temperature_8662",
                                                                                    "body": "I agree they could use a finer toothed comb. I, for one, would love if we had some accountants with experiance in sleuthing out cooperate waste, uncovering RICO schemes, and unmasking shell companies. That said it seems that they are not having to cut very deep to find heaps of issues. Hoping this is the prelude for deeper cuts.",
                                                                                    "score": -8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "No_Temperature_8662",
                                                                                            "body": "Interesting that I'm being downvoted here. Replying to a person who objects that there are no accountants. I say I want more accountants and for them to dig deeper. I get downvoted. I'm beginning to think that they weren't really objecting to the lack of accountants.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Arc_2142",
                                                                                                    "body": "I’m fairly confident that the majority in this thread don’t actually believe in libertarian values.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "SippinOnHatorade",
                                                            "body": "You know what, fuck it, let’s get firefighters to do open heart surgery\n\nBraindead take.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Arc_2142",
                                                                    "body": "False equivalence.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PurposelyVague",
                            "body": "If you look at the savings column on the doge website, it's ridiculously low compared to what is being reported. Some contracts that were cancelled show $0 savings. Meanwhile, Congress is pushing to increase the debt with their proposed package.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "djleepanda",
                            "body": "I think it is just a half-assed attempt to go the sledge hammer direction in dismantling the machine without getting congress to approve disbandment of agencies.\n\nedit: I forgot to add that the cost savings by DOGE will likely end up being used on other \"more efficient\" way of governing. I bet you they will come up with new ABC agencies and there will be 0 cost savings in the end.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "GazelleThick9697",
                            "body": "Yup, fed worker here who was pumped about the idea of doge and what they said their goals were. Severely disappointed with this clown show though. It’s such an ass backwards approach that’s unnecessarily cruel and will end up costing us money in the end. The flat out lies are the worst. And the public doesn’t know the half of it. Already ranted about this in another post \n\nhttps://www.reddit.com/r/Libertarian/s/fqIh1hdsDB",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Makiaveli01",
                            "body": "And why didn’t DOGE start with the defense department arguably the biggest space for waste and corruption",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aalox",
                    "body": "Current budget seems to promote extending $4.5 Trillion in tax cuts (income), increase debt by $4 Trillion, with $2 Trillion in spending cuts. \n\nhttps://apnews.com/article/house-republicans-budget-blueprint-trump-tax-cuts-ff2bddf31f4e7cb0928139072392a091\n\nBalancing budget doesn’t seem to be the goal. Cutting services and increasing the debt to extend cuts that mostly favor the richest 5% seem to be the goal.\n\nhttps://www.cbpp.org/research/federal-tax/the-2017-trump-tax-law-was-skewed-to-the-rich-expensive-and-failed-to-deliver",
                    "score": 23,
                    "replies": [
                        {
                            "author": "EndlessExploration",
                            "body": "I'll focus on the AP article since the other predates this presidency. \n\nThey didn't say explicitly, but that number seems to be over 10 years. \n\nAccording to your source: -$4.5 trillion (tax cuts) + $2 trillion (spending reduction) = $250 billion added debt per year. \n\nWe were at -$1.8 trillion last year, so this is (sadly) a minor addition. However, 10-year budget projections are pretty worthless, as the next election is guaranteed to change everything. \n\nHis debt increases don't surprise me. Republicans can make all the excuses they want, but Trump massively raised the debt his first term (and primarily cut taxes for the rich, as you said). He couldn't do it before, so why should we expect it now?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "aalox",
                                    "body": "The reason for the 2017 tax cut data is because those tax cuts expire this year. Congress is working to extend them, so the data should still be accurate as to who they help and what it’ll cost as far as increasing the debt.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "viking_",
                    "body": "Musk's \"updates\" look silly with any sense of scale. 10 million dollars? So 3 cents per American? Literally 1 one-millionth of federal budget?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "iroll20s",
                    "body": "Aren’t they still required to pay a lot of people awhile yet? Itll take a bit for that to drop off and anything like severance etc. Id be more interested in the projected 2026 numbers if i was wondering what it will look like.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "PurposelyVague",
                            "body": "That's why they tried illegally firing probationary employees instead of doing a rif, no severance. But hopefully those mass firings will be challenged.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarquisDeBoston",
                    "body": "It’s been a month. They are probably paying November/December invoices. Still on the last guy.\n\nI know it feels like he been president awhile already, but it’s been 1 month.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "EndlessExploration",
                            "body": "There's an idea in economics that (generally) when you cut spending, you slow the economy. \n\nThe US government makes up about 20% of US GDP, and roughly 1/3 of government spending last year was debt. (Sorry for all the numbers. )\n\nThe basic idea is that if they're actually doing something, we should be headed for a recession.  There's really no way around that.  But we're not in a recession. We aren't feeling the cuts. That's really not possible unless the cuts are superficial.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "But if you cut regulation you speed up the economy. Hoping there are regulations cuts coming. Also a good bit of what was being cut was money going to places outside of the US. If that is being cut and those dollars are being spent locally instead that will also speed up the economy, at least in the US.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "EndlessExploration",
                                            "body": "It's about $1.8 trillion dollars a year to clear the deficit. There aren't any regulations that would even touch that number.  \n\nForeign aid was [$74 billion ](https://www.pewresearch.org/short-reads/2025/02/06/what-the-data-says-about-us-foreign-aid/) last year, so that's a drop on the bucket. And a large amount of foreign aid is in goods (like weapons) which create jobs for Americans. \n\nThink of it like this: we've been running up credit card bills for decades. That debt has to be dealt with, and dealing with it will hurt. Older generations hace kicked the can down the road for so long that we're in a heap of trash. We need to deal with it, but that means significant sacrifices for everyone.\n\nEdit: If you don't feel like you're paying for decades of absurd spending, then you're not. We're so far in the hole that there are no mild solutions.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "Agreed there. More resources, more markets, new technology, different currencies, new frontiers are all ideas I'm hearing floated. Those are some positive ways we can go (provided we don't try just taking them from other people, that is a terrible idea - not advocating for empire here). But yep, we are going to need to do more. This is a good place to start, effectively cleaning out any parasites we find in our organizations. But more is needed, much more. It was big government that got us into this mess, I don't think that big government is going to get us out.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "EndlessExploration",
                                                            "body": "Trump isn't the President to do it, but the national legalization of drugs, prostitution, and gambling would add a few hundred billion to our GDP ( estimates vary, but the black market for drugs generates $200-$800 billion/year). \n\nThere are also lots of smaller regulations that you might fit into your idea: The Jones Act, electric vehicle tariffs, medical resident caps, and hospital certificates of need. Removing these would increase business in some specific industries.  \n\nUnfortunately, we're not getting to that $1.8 trillion mark without much deeper cuts. Roughly 55% of government spending is:\n1. Military (~28%)\n2. Medicare (~14%)\n3. Social Security (~13%)\n\nNext is the interest on the debt we're trying to fix:\n\n4. Debt (~11%)\n\n1-3 are around $3 trillion dollars of a $6 trillion budget. We need to cut almost $2 trillion to break even.  The conclusion is obvious: major cuts to the military, Social Security, and Medicare. The alternative is to run up the debt until we default (1990s Russia-style).\n\nIt's such a desperate situation, and that's why I've spent all this time talking about it. There are no simple solutions anymore. If we imagine this to be like credit card debt, we're at the \"Ramen noodles while you live out of your car\" stage.  \n\nI just wish people knew it.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "No_Temperature_8662",
                                                                    "body": "Some of us do. Don't stop talking about it. Are you ok with people quoting you?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "EndlessExploration",
                                                                            "body": "Of course! And thank you!",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Montague-Knightley",
            "body": "Correct me if I’m wrong, but aren’t they cutting from programs that actually generate money like the Nation Park Service?",
            "score": 44,
            "replies": [
                {
                    "author": "FlimsyIndependent752",
                    "body": "Can’t wait to visit Yosemite national park brought to you by Colgate and powered by AWS!",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "rn15",
                    "body": "ALL federal agencies. Hope you enjoyed your last trip to a national park, they’ll be privatized soon just like all the land in “freedom” loving Texas",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "djleepanda",
            "body": "This whole \"what did you do last week\" effort is equivalent to expecting people being pulled over on the highway by mall security to show their IDs for a ticket. Surely, there is a better way to perform DOGE initiatives.",
            "score": 204,
            "replies": [
                {
                    "author": "ATCBob",
                    "body": "This here is the problem. I can easily answer what I did, but I don’t have that authority. What I do is not classified but it is considered sensitive information, which I could describe in generic terms to answer the email. But why would I report what I do to an unknown person who is not anywhere in my reporting chain.",
                    "score": 93,
                    "replies": [
                        {
                            "author": "djleepanda",
                            "body": "It's going to be a shit show. DOGE as completely undermined the chain of command and the secretaries put in to place by the POTUS. This will cause a lot of friction between DOGE and those agencies/secretaries.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "ATCBob",
                                    "body": "And I’m all for cuts. The problem is when you do things this way the good gets axed and the cronies stay in place and keep collecting money.",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "author": "djleepanda",
                                            "body": "This has always has been the case. They really should start with the Senators with insider trading.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "I can't see why they can't do both. I too want to see the congress insider trading end.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MGSBigBoss",
                                    "body": "Because history shows these guys did a great job ",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "shiggidyschwag",
                            "body": "Why would you report anything to a dubious email claiming to be the government that isn't digitally signed.\n\nThe email they sent out should have been forwarded to a security officer and then deleted by anyone who understands the required cyber training material.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rhbast2",
                    "body": "I think it was just a pulse check to see if it is a real person.",
                    "score": -19,
                    "replies": []
                },
                {
                    "author": "EvanOnTheFly",
                    "body": "I think most are missing the point. The point is there are possibly thousands who don't even check email because it's a job filled by dead or faked employees.\n\nRequiring a small interaction with email helps point to those that don't even bother to log in or check.",
                    "score": -28,
                    "replies": [
                        {
                            "author": "cc4295",
                            "body": "There are also people on leave or have mandated crew rest or work outside working on a fighter jet without internet connection. Also why should people with an existing appraising system have to justify their job/beg. Also any decent writer can make their job sound amazing and important. To me it felt like a flex for god king musk.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "EvanOnTheFly",
                                    "body": "And arguably, those people have manager or commanding officers that can help explain those things or fight for their team. \n\nAgain, everyone is so focused on the nitty gritty rather than the directional nature of this type of stuff.",
                                    "score": -10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Daltoz69",
                    "body": "If you can’t justify your own job, why should you keep said job?",
                    "score": -51,
                    "replies": [
                        {
                            "author": "djleepanda",
                            "body": "But why would anyone justify their responsibilities to a random email that doesn't fall in their chain of command? Furthermore, there are probably hundreds of thousands of federal employee that work blue collar professions and in environments (deployed) that does not have a readily available computer.  There is a clear chain of command that everyone needs to follow regardless of their government positions. DOGE should have gone through each Agency's leader for this.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "Daltoz69",
                                    "body": "lol nobody asks road builders if they do their jobs. It’s obvious if they do or not. Either the road gets built or it doesn’t. That isn’t an argument. You’re a federal employee, anything is in the chain of command. A government employee should be under the most scrutiny when it only exists because of you and me.",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "djleepanda",
                                            "body": "That is same as any other profession. You can't take a sledgehammer approach for a scalpel operation. If they want to do this correctly, they'll either have to completely overhaul and disband agencies through the congress or spend extra money to analyze each job. \"What did you do last week\" email is just more waste involved, it doesn't accomplish anything, just extra work down stream to legitimize the firings or worse, bring back essential personnel who were fired by mistake (already happening in multiple cases).",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "Daltoz69",
                                                    "body": "So what? If answering one email is waste in your eyes, you must not be aware of most corporate jobs lol",
                                                    "score": -16,
                                                    "replies": [
                                                        {
                                                            "author": "djleepanda",
                                                            "body": "You are completely missing my point.",
                                                            "score": 16,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "cc4295",
                                                            "body": "And u must not understand the scope of all federal jobs",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "author": "Daltoz69",
                                                                    "body": "What.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cc4295",
                                                                            "body": "Does ur corporate job have mandatory crew rest? Does it work in environments that don’t have reliable internet? Are there corporate jobs that don’t sit at a desk most of the time?",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "No_Temperature_8662",
                                                                                    "body": "No, it doesn't have mandatory crew rest. In fact we are 'on-call' in case of emergencies. It doesn't work, by design, in environments without reliable internet. We are, in fact, required to maintain good connections to the internet (mainly by paying for our own internet connections and making sure they work reliably) as part of our job. People have certainly been fired over not being able to do something as basic as check their email on a daily basis. \n\nThis sort of update is not onerous or an overdue burden. I'm required to give daily updates to my team as part of my work, and team updates on at least a weekly basis to other teams so we can coordinate efforts. \n\nThe fact that people are complaining about something as simple as a single one week update is a huge red flag.\n\nEdit: typo, said someone instead of something.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Daltoz69",
                                                                                    "body": "What?",
                                                                                    "score": -1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "djleepanda",
                                            "body": "I could care less. But if they really want to go on with the sledge hammer approach. Just do it correctly, get congress to vote on the disbandment of agencies.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Daltoz69",
                                                    "body": "One step at a time my friend.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "No_Temperature_8662",
                                                            "body": "Agreed. We need to demonstrate the waste by showing it to the public and proving that even with cuts life will go on. The support in congress will come when the inefficiencies are shown. Congress is slow and almost never acts against its own self interest. Keeping these agencies bloated is in the interest of a corrupt congress. If the waste is exposed congress will start to join in the cuts so they look good to the voters back home.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Daltoz69",
                                                                    "body": "Exactly. A sledgehammer won’t bring down a skyscraper, but a slow calculated deconstruction followed by controlled demolition will.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "This is completely contry to how chains of command work in practice. If you work at a company and the CEO's right hand person comes up to and asks what your contributions are you don't look at your manager and ask 'Mother may I?' You certainly don't run to your manager and ask to be shielded from scrutiny.\n\nBringing 3rd party consultants in to review the performance of employees and the structure of departments without the input of their managers is so common place in business it was parodied in 'Office Space'.",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "author": "djleepanda",
                                            "body": "Tell me you've never served in the Military or any hierarchical organization without telling me..",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "Hhahhaah. Oh wait, were you serious? Let me laugh harder.\n\nIf someone out ranks your boss and you are in a hierarchical organization then they certainly outrank you. If they tell you to do something that counters your bosse's standing orders it is ok to perhaps tell them why you are doing what you are doing but it is not ok to refuse their lawful order. \n\nPulling rank is a term for a reason.\n\nIt is, in fact, the hierarchy of a hierarchical organization. \n\nThe 3rd party review bit does tend to ruffle the feathers of such organizations but ultimately they are called for by people higher up the chain. That is why they get done, not because the managers agree to them.",
                                                    "score": -9,
                                                    "replies": [
                                                        {
                                                            "author": "djleepanda",
                                                            "body": "Have you ever stood guard duty? 11 General Orders?",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "shiggidyschwag",
                                            "body": "Your analogy sucks.  The president is not a god-king with full authority over everything that happens in the country, or even in government.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "You right he isn't, but he is the head of the executive branch. The buck stops with him on all executive branch decisions.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Embarrassed-Waltz649",
                            "body": "I’d rather keep people who are good at their jobs than people who are good at bsing about what they do in resumes and in 5 bullet points…this technique is shallow and will fail miserably.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "This approach has worked in every company I've worked for. It exposes who is just not working really quick. You don't even have to read and judge all the replies, you start by just cutting those who cannot be bothered to reply to a lightweight and easy request.\n\nAre there those who may be so busy that they cannot reply in time? Sure, that can happen, anything is possible. But if you are that employee and you are making herculean efforts to keep the lights on your manager, and their manger, are probably already aware and fighting for you to keep your job. If you don't reply to something like that it is far more likely you aren't really doing your job.\n\nStill, not being able to basically say, 'yeah this is what I do' is pretty inexcusable.",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "Daltoz69",
                                    "body": "Again, if you can’t justify that you’re good at your job. You must not be very good.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "Embarrassed-Waltz649",
                                            "body": "You don’t understand how you are prioritizing people who are good at TALKING about how good they are at their jobs vs someone who actually does the work well?",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "Daltoz69",
                                                    "body": "I really don’t care. If you don’t care enough about your job to answer an email, that’s on you.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "Embarrassed-Waltz649",
                                                            "body": "Licking boots wasn’t in my job description.",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "Daltoz69",
                                                                    "body": "Whose boots are being licked? Lmao are you aware of what sub you’re in?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "No_Temperature_8662",
                                                                    "body": "Being able to say what you did last week isn't boot licking. It is the bare minimum when working as part of a team.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "am_guy_do_know",
                            "body": "Hi, I own a business. It’s different from yours, but I’m in a relationship with your boss. He’s says it’s cool if I decide if your job is worth having. I know you’re on bid leave this week and out of town, but if you don’t respond within 8 hours I’ll consider this your resignation. Also, I know you cannot access your email from outside of the intranet and also that you’ve been told not to respond to emails from outside your business. Anyway, it’s just a simple email. \n\nHope this helps!",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "djleepanda",
                                    "body": "Better than my analogy.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "It was 24 hours. And yeah, I'm sure they will be allowing for people being on vacation etc. So this feels like a strawman. 'Hey, I was hiking in the woods for three days with no service.' Is pretty valid if you requested time off. And if you are making a case for medical leave there are laws about that, especially for federal workers.\n\nAll in all though this is a pretty edge case argument you are making. Most of those not replying will be those cannot be bothered to work.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "am_guy_do_know",
                                            "body": "It’s not 24 hours to respond if the email went out on the weekend and you don’t report for duty until Monday. It’s effectively one work shift(8 hours) to respond. \n\nAnd as far as the straw man goes, the scenario I wrote out is my exact situation at the moment. \n\nYou’re sure they’ll allow for exceptions based on what? All we know is what was tweeted and emailed. To that extent the threat was termination within those terms. \n\nWhen people show you who they are, believe them.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "Unless you are arguing relativity 24 hours is not 8 hours. That said if you were on authorized leave and you didn't respond while on leave you have a pretty good case. You should fight it.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Daltoz69",
                                    "body": "Womp womp. I really don’t care.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "am_guy_do_know",
                                            "body": "Cool, stay ignorant, king.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "Daltoz69",
                                                    "body": "I’d much rather pay one person, whose job is to fire hundreds. Then continue to pay those hundreds of people who do nothing.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "am_guy_do_know",
                                                            "body": "Well, I hope you don’t like travel, the economy, or receiving goods within a reasonable timeline since air traffic is just “hundreds of people who do nothing”.",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "Daltoz69",
                                                                    "body": "Lol what? I’m talking about the email/laptop class. I’m pretty sure air traffic controllers can justify their jobs in an email.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "am_guy_do_know",
                                                                            "body": "I’m out of town on leave. We were sent an email on Saturday afternoon and told to respond by Monday before 1159 or it would be considered our resignation. That was over my RDOs and I am currently out of town and cannot send an email. \n\nMaybe you’re starting to understand the issue here?",
                                                                            "score": 13,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Daltoz69",
                                                                                    "body": "Well the time you’ve taken to respond to me you could have replied. Might want to prioritize your job over a stranger on the internet.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "am_guy_do_know",
                                                                                            "body": "Are you that dense? I cannot reply. While on vacation and out of town I am not at work. Work is where the intranet and government computers are. Without intranet and government computers I cannot access my government email. I cannot respond to your hero on my government email if I do not have access to my government email. \n\nHow much further do I need to break this down for you?",
                                                                                            "score": 8,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Daltoz69",
                                                                                                    "body": "This might help: Www.indeed.com",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "Daltoz69",
                                                                                                    "body": "Sucks to be you.",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "am_guy_do_know",
                                                                                                            "body": "Nah, it’s only sad that this is your response.",
                                                                                                            "score": 7,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Daltoz69",
                                                                                                                    "body": "Better start looking for a job dude. I’m tired of paying your salary anyway. Need help updating your resume?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "am_guy_do_know",
                                                                                                                            "body": "lol. I really trolled him, mom! You should have seen it!",
                                                                                                                            "score": 7,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Daltoz69",
                                                                                                                                    "body": "No troll. I hope you find another job!",
                                                                                                                                    "score": 3,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No_Temperature_8662",
                    "body": "You mean the law? Where I live it is the law that you have an ID on you in public - sure it is not a widely enforced law but it is the law. This goes double if you are driving. ID and registration/proof of insurance is the standard and has been for quite some time. As far as the mall security aspect, I think it is silly to compare people operating at the request of the president to mall security. One has the full backing of the constitution and the other is often only contracted to 'observe and report' .",
                    "score": -8,
                    "replies": [
                        {
                            "author": "shiggidyschwag",
                            "body": "> One has the full backing of the constitution and the other is often only contracted to 'observe and report' .\n\nThere's nothing unconstitutional about mall security.  doge on the other hand...",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Is empowered by the current head of the executive branch.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "shiggidyschwag",
                                            "body": "Which has no constitutional authority to just create new agencies and give them power to fire anyone they want from the federal government.\n\nAn executive order does not have the same authority as a decree of an emperor.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": ">Article II of the U.S. Constitution establishes the Executive Branch of the federal government. The Executive Vesting Clause, in Section 1, Clause 1, provides that the federal executive power is vested in the President. Section 3 of Article II further requires the President to take Care that the Laws be faithfully executed.1 The executive power thus consists of the authority to enforce laws and to appoint the agents charged with the duty of such enforcement.2 The President also has distinct authority over foreign affairs, and alone has the power to speak or listen as a representative of the nation.3 As a general matter, the Supreme Court has recognized that the Constitution vests the President not only with the authorities expressly delineated therein, but also with certain implied authorities,4 such as the ability to supervise (and generally to remove) executive officials5 and the power to recognize foreign governments.6 At the same time, the Court has said that by granting the President the power of faithfully executing the laws, the Constitution refutes the idea that the President was intended to be a lawmaker.7 Nonetheless, the Court has recognized that officials appointed by the President—even those located within the Executive Branch—may exercise regulatory or adjudicative powers that are quasi-legislative or quasi-judicial.8 Broadly, the Court has recognized that Executive Officers exercise authority to enforce and administer the laws, including rulemaking, administrative determinations, and the filing of lawsuits.9\n\n[Link to quoted site](https://constitution.congress.gov/browse/essay/artII-1/ALDE_00000243/)",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NotAnAngryGeek",
            "body": "Did you really think Musk/DOGE was going to read through 500,000 emails?  This was another excuse to fire people.  \n\nIf they were really interested in reform, they’d be asking:  “What got in your way?”",
            "score": 54,
            "replies": []
        },
        {
            "author": "LiveFreelyOrDie",
            "body": "To be fair, I really hate it when people I don’t report to at work ask me to do things to validate their projects. DOGE is bullshit, they’re focusing way too much on going after people’s jobs. I’m all for smaller government and slashing expenses, but there really should be more to it than cheering on people going on unemployment.",
            "score": 18,
            "replies": []
        },
        {
            "author": "ClovenChief",
            "body": "So, for the record, you want them to stop what their doing and write an email explaining what they did last week. \n\nSo, FBI, CIA, DOD, etc, if they are working on classified material, you just want them to send an email to a guy who doesn't have classified clearance. On top of that, it was a \"prank\" regardless.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Maxpwer222",
            "body": "![gif](giphy|3ornka9rAaKRA2Rkac)",
            "score": 17,
            "replies": []
        },
        {
            "author": "Daytonabitchridda",
            "body": "I’m not telling a South African shit",
            "score": 20,
            "replies": []
        },
        {
            "author": "bioMatrix",
            "body": "Submit, peasants.\n\nWhat's worse is as this stands fright now, DOGE will end up costing the government money to settle the cascade of lawsuits coming...",
            "score": 22,
            "replies": []
        },
        {
            "author": "ShooterMcSwaggin",
            "body": "love the energy but the amount of elon glazers that think this is being done in the spirit of efficiency and not motivated by personal oligarchical enrichment is wild.",
            "score": 8,
            "replies": []
        },
        {
            "author": "AllLeftiesHere",
            "body": "I like the desire for responsibility and doing a job you're paid for, but the method could have been better. \n\n\nIn my two jobs with the biggest companies, we had to do a weekly report exactly like this. Every friggin week, because the company still had to be productive. ",
            "score": 4,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "Yup but just a single weekly email is not going to break your work week, especially if it is just 5 bullet points and , as another person who pointed out to me, you are already doing this sort of report for accountability to other parts of the government.\n\nI do a heck of a lot more than that for my daily and weekly team coordination efforts in my private sector job.\n\nYou are going to get very little sympathy from me, a taxpayer who is robbed at gunpoint by the government all the time to pay your salary, if you react this way.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "kushkupid",
            "body": "I can't wait till somebody responds with classified information and the unqualified people running DOGE either lose it or sell it to somebody. 😭",
            "score": 11,
            "replies": []
        },
        {
            "author": "Savvy-or-die",
            "body": "Actively weakening the United States for Russian interests. They are not “fixing” anything. Trumptard and his counterparts are traitors.",
            "score": 32,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "Canceling wastful spending is not weakening anything. It strengthens us.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "BulimicSnorlax",
                            "body": "This isn’t about waste.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "I'm willing to hear you out. In your opinion what is this about?\n\nEdit: typo on word about",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "rn15",
                                            "body": "If it were about waste then why are they spending more than dems ever have? Why is musk getting so many subsidies from taxpayers? How can you be so dense as to actually believe this is about saving taxpayer money when they are firing people at random including veterans. I know 2 vets who lost their jobs at the fucking VA for being in their probationary period (2 years). They now lost their income, health insurance, pension, and add however much else stress in to their life. If you genuinely think what they’re doing is a good thing you need to do some reflection and stop taking musk and Trump at their word",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "From what I've seen so far I don't think the cuts are purely performative. I certainly hope they are not. Yes, congress is pushing forward yet another ridiculous budget. I hope that is paired back too. However this is the first time in decades I've seen any movement, performative or otherwise, towards transparency and account ability for these agencies. Meanwhile they seem to always be taking more money and performing less. \n\nMy heart goes out to your VA friends. It really does. I've been hit with layoffs before too. Each time I've bounced back to a better place and I truly hope that is the case for your friends as well. That said I really have a hard time finding sympathy for these organizations that have  so often failed and are funded with money that is literally stolen from me at gun point. I have many vets in my life that have been completely screwed over by the VA. Something has to be done there and giving them more money is obviously not the right answer.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "rn15",
                                                            "body": "I know people who work in HR in the VA. Elon and his crew have locked them out completely of all their internal systems that they need to use to onboard and process employees. They have been locked out since trump was elected, this was purely a performative move so now weeks later they can point back and say “look how inefficient they are! They need to be cut!” \n\nThey are firing people, then realizing they need them, and trying to rehire people. This has been happening with the FDA. Have some humanity and just look at how Elon is fucking with people’s lives. I don’t care if it’s a private business or a government agency, it’s inhumane and disgusting. Even if you think every federal employee should be living on the streets, you would find how they’re doing this absolutely ridiculous. \n\nLike I said, they don’t even know what people do before firing them. There will be so many lawsuits that come from this and I hope the fall out is as messy as possible between Trump and Elon. I don’t get how you can say any of this is transparent. After some pushback from agency heads Elon literally tweeted that it was a “joke”. You don’t fuck with people’s livelihoods like that. \n\nI get supporting reform, but this isn’t that. Especially when it comes to the VA this will only hurt veterans. They were already in a frenzy trying to onboard more physicians, there’s a reason for that, vets need doctors. Well congrats, Elon literally made it impossible to onboard a fucking doctor that they need by locking them out of information infrastructure.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "Honestly asks them to tell me what they mean so I can understand their viewpoint, get downvoted. Classic.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LaughingBob",
            "body": "- by a fascist pr*ck no one voted for!",
            "score": 10,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "Nope, we just all voted for the guy who said this was his goal.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "bigggieee",
            "body": "spending tens to hundreds of millions of dollars to have every employee write an email that nobody will ever read rather than do their job. That’s called using tax dollars efficiently.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CountClais",
            "body": "inb4 reddit ‘libertarians’ arrive at this thread to say that federal employees not justifying what they’re doing & what they’re spending money on is somehow good for us",
            "score": -16,
            "replies": [
                {
                    "author": "cambat2",
                    "body": "True libertarians are pro government waste as long as it owns Elon Musk. \n\nEdit: all of you statists downvoting me should listen and learn because this is what a true, and likely the only, libertarian is saying. \n\nYou call yourselves libertarians, which means your pro job creation, right? Well it looks to me like the fed is creating totally real and valid jobs. The people voted in the powers that be that created the jobs, and the people are literally the free market. Therefore, government jobs were created by the free market. This is not a hard concept to get.\n\nWhen I become the first libertarian president, the first thing in doing is your raising taxes so I can create more jobs. That's the free market at work.",
                    "score": -26,
                    "replies": [
                        {
                            "author": "Parabellum12",
                            "body": "…what?",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "cambat2",
                                    "body": "You heard me, now pipe down before I raise your property taxes and send the extra to Ukraine. This is for your own benefit",
                                    "score": -19,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "The sarcasm is hilarious. :) Thank you for that.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "cambat2",
                                                    "body": "Welcome. Glad someone appreciates it at least lol",
                                                    "score": -3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LowerOurFuckingTaxes",
                    "body": "If that was your takeaway from the meme, it was incorrect. They should be able to easily justify their worth and they are whining about it. Slash and burn.",
                    "score": -33,
                    "replies": [
                        {
                            "author": "Nickthetaco",
                            "body": "Not if you are like some people I know that work for DoD and work with classified info that they can’t just email to a completely different agency.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Email literally said not to mention classified things. People who work on classified things know how to allude to what they do without specifics and saying classified things. That is literally part of their job.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "ziegen76",
                                            "body": "I am one of those people and although I know how to convey what I do without including privileged information, I don’t see how productive it is to send a random phishing attempt looking email a list of bullets that says - analysis on xxx, research on xxx, prep xxx, coordinated with offices of xxx, etc. It doesn’t really have any value. I am pro reduction of the federal force in general but not when the people doing it have no idea what they are doing. The first step in evaluating productivity is weighing what has value, why, and how much. This was a piss poor attempt at that. If they had included anything more than a single sentence request then I would be on board. Regardless, the DoD was told to ignore and I did. This was after the high level meetings on a weekend wondering WTF this was about.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "This is just a very wide net with a very low bar. I agree that it doesn't really give a deep analysis, I don't think it is intended to. I would be surprised if the content the emails is even evaluated closely. This is just to clear out the obvious garbage and dead accounts. It is a good place to start though and pretty 'low impact high return' in seeing the extent of the problem.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "ziegen76",
                                                            "body": "I don’t disagree with the intent but there are infinitely easier ways to see if there are dead accounts. This does nothing. A lot of that is already mandated, at least for the DoD network. If you don’t use your account or do your stupid cyber annual training you are locked out almost instantly. Also, email addresses are not really a way to see active users (think shared emails or inboxes). Why not work through agency HR departments and their associated time keeping tools to get this information easier.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "No_Temperature_8662",
                                                                    "body": "Would genuinely be interested in hearing your suggestions for easier ways. I'm always looking for more tools in my toolbox. The lock out bit should be pretty automatic, I agree, but showing up to an annual training or just logging in from time to time is definitely something I've seen people do in the private sector. Any other suggestions?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ziegen76",
                                                                            "body": "I’m no expert but I’d like to think that some of the money I’ve spent on black belt and lean 6 bullshit has helped me have some sort of idea on productivity and simplification. The government compared to the private sector lacks a lot, I’ve worked in both (Army, Amazon Corporate, now GS Fed). Specifically with accountability tools. That doesnt mean they aren’t there. I’m a proponent of trusting your senior leaders and instilling a culture of accountability. I really don’t think an agency head and their subordinate leaders are just letting people get away with shit. There needs to be a way to more effectively track daily work though. It’s hard to do this for indirect positions without engineered standards but that goes back to what I said about knowing your standards and priorities and understanding how it adds value. There could be study on how much time is spent actively working towards agency goals and rewarding positive results. Also like I mentioned, the time keeping systems can be used to track not just time but time spent in which path or function. Using this data agency heads can determine where there needs to be cuts or improvements. The problem is the government is like the blind leading the blind. You cannot effect meaningful change without having the data to do so. I just know a single email isn’t it, although I understand the intent.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "No_Temperature_8662",
                                                                                    "body": "Under normal circumstances I would agree that working with leadership is the way to go. Likewise I'm a big believer in needing to be able to measure something in order to improve it. Anything we do needs to have a measured component so we can show the results of the change. However, at this point, we have what are supposed to non-partisan institutions that have a demonstrated pattern of ideological capture and a total failure of their proclaimed goals. \n\nIn such circumstances it is specifically the leadership that are the problem and expecting them to be anything other than a roadblock to change would be a mistake. \n\nIf you need a clear cut example of that look no further than the department of education. They have consistently failed to improve the education outcomes of our students, year over year, for decades. We do have tones of metrics for reporting on education that clearly show this. Instead they have been pushing a non-stop stream of ideological messages to our schools. It appears leadership there is more interested in propaganda and social engineering than actual education results. \n\nIn the pentagon we have a organization that has failed to audit themselves 7 years running. Frankly that means we cannot trust any numbers the leadership hands us. In the private sector if that happened two years in a row I would expect to see members of leadership fired. If it happened 5 years in a row I would expect the shareholders to have the C-Suite executives replaced. But instead we get, 'well we will get it right next time, trust us.' And, 'oh look, the marines did it right this year.' Are you kidding me? In an organization where information reporting and coordination are paramount this comes off as malicious refusal to perform the audit.\n\nAs another poster on this thread pointed out, as a nation, we are in the 'eating Ramen while living out of our car' stage of debt recovery. Some drastic changes are needed. From a business change perspective these institutions need disruption. They appear to be frozen and 'very little' to 'no good' change, cost cutting measures, and positive results seem to be coming out of them.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ziegen76",
                                                                                            "body": "Yeah, I agree with all that you said. I just don’t think a knee jerk email with vague instructions addresses any of that. Additionally, the email carried a toothless “threat”. That already destroys any semblance of credibility it was trying to achieve no matter how well intentioned it was. The system is a lot more complex than it appears on the surface and there needs to be better transparency and communication for buy-in  to exist.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RonaldFKNSwanson",
                            "body": "My takeaway from your title is that it's missing context. It was said as a joke, just like the entire character.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "CountClais",
                            "body": "i was agreeing with you",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SCB024",
            "body": "Any competent employee can easily justify their job.",
            "score": -11,
            "replies": [
                {
                    "author": "endthepainowplz",
                    "body": "I couldn't at my last job, I kept trying to get work, but there just wasn't much to do some weeks. I could  work from home or in the office, and there were many days I would sit at home, send emails out to my coworkers, asking if they needed any help, emailing my boss asking him for more work. Then I would charge my time to our government contract jobs, so my time theft was actually just taking from the government. \n\nWhen I put in my notice, my boss was sad, and said I brought a lot of experience to the team and that I was killing it. Left me wondering what everyone else was doing.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SCB024",
                            "body": "If you cannot justify your job, what are you doing and why? If you aren't doing work, are you working?\n\nOnly Redditors would downvote my OP. \n\nIt is completely true.\n\nReddit hates reality.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tkenny1999",
                    "body": "I think that whole “competency” thing is most of the problem",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "KeenKeister",
            "body": "So true.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BJosephD",
            "body": "Federal workers worried about accountability for the first time. In the private sector I need to plan my week ahead and report on my daily activities. 5 bullet points should be easy to if you’re doing something…",
            "score": -23,
            "replies": [
                {
                    "author": "nopetraintofuckthat",
                    "body": "As if the problem with Government is not too much accountability. Layers and layers of it. Thats why it's so slow and expensive. I know, wild thought. And now another supervisor wants a weekly report, while pretending documenting and filling out forms and cover-you-ass-meetings are not already abundant and not the core problem with government.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "No_Temperature_8662",
                            "body": "Copy paste is not hard. If you already doing that report then this is even less of an issue. Also if you are really doing your job then you should be happy that they are cutting dead weight from your department. Being one of the real employees and being able to stand up and say 'hey, we got rid of all this garbage and we are still performing just as well or better' is a huge win. In the private sector it is the sort of thing that gets you a raise, promotion, or lands you an even better job in another department/company.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "nopetraintofuckthat",
                                    "body": "Trust issues, maybe the sunglasses and the chainsaw play into that?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "How is that breaking your ctrl c ctrl v fingers?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}