{
    "title": "Libertarians: No, MORE emails!",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 123,
    "score": 133,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 10,
    "url": "https://i.redd.it/xjl0niajwble1.jpeg",
    "id": "1iy222h",
    "selftext": "",
    "comments": [
        {
            "author": "GazelleThick9697",
            "body": "If I may, as a fed worker…. My issue with the 5 bullet points request is not about my resistance to providing transparency about my productivity. I’m a beast at work, I make your tax dollars stretch to the max extent and am often doing other people’s jobs because I run circles around a lot of these clowns. Which is why I’m actually in support of cutting the fat, and getting rid of useless pricks that treat fed employment like it’s a welfare program. But I digress…\n\nThe issue myself and others have is that we don’t actually know the purpose or end use of the info we provide, nor trust it to be properly handled. I don’t answer to that douchey tiny crooked dick spaceman nor do I trust in his motives or end game. It is suspected that the purpose for the email responses is to help them build an org chart of all fed employees. Ok, no big deal. But if it were you, would you trust that he won’t also display on that org chart personal information? Or even character assassinate at his whim. For instance, when a certain redditor calls him douchey tiny crooked dick spaceman, then said Redditor is fired illegally because he’s an insecure c@N+, he won’t stamp “loser” across my name? And then the ignorant masses will cheer “yea, fuck the beaurocracy!” while turning a blind eye to the total abuse of power, lies and smoke and mirrors used to pander?\n\nEarly on in the administration, agencies were directed to provide a list of all probationary employees. HR was like, wait, you don’t mean the folks who are permanent but on probation because they got a promotion or transferred between agencies? Yup, send them all don’t worry about it. Are you sure though, this isn’t right. YES send it. Weeks later, mass terminations of everyone on that list. And guess who they blamed? HR for “screwing up the data on the probationy list.” Before you get hyped up about then end result of reducing govt and waste, keep reading…..\n\nI was in the wave of people fired that shouldn’t have been. The action was blatantly illegal. All the termination letters cited “performance” as the cause. While it may have been true in some cases, it was not for at least 10 colleagues in my circle. Why does this matter? Well, we sat at home for a week filing appeals, searching for jobs, filed for unemployment, etc only to be reinstated because of the error. So now you have a stupid amount of admin burden, cost and loss of productivity for HR to undo things (and this happened to A LOT of people), cost of back paying us (a week loss of productivity from each individual), and for all of our leadership who didn’t even know the terminations were sent out and who spent a week trying to figure out what the hell happened and how to fix it, etc. \n\nSo, we’re reinstated on a Thursday at 8pm, sent to our work email which nobody can even receive because most are still locked out of their computers. I wasn’t. I was told to report to work the following Monday. I chose to return to work the next day to bust my ass and catch up and lend a hand to my team who’s had to pickup the slack for the last week. \n\nMonday morning rolls around, I open my email, and I’m told to report my “5 accomplishments” for last week. No problem, I did more in my one day than most do in a week I can give you 10 bullets. But do you think doge’s AI that will screen my response cares that I lost 4 days productivity through no fault of my own, that I worked the one day when not even required to, or even understands the complexity of my work to measure by whatever evaluation factors some 19 year old has devised? \n\nI’m all for reducing govt, spending, and waste. But y’all need to understand that what’s going on now is causing spending and waste that won’t come to light (if at all) for some time. \n\nOk, rant over for now. But if anyone wants me to expand on the bullshit lies about money saved with these government contracts let me know. I’m a contract specialist and doge is flat out lying to the public about what he’s “saving” and is in fact causing more waste.",
            "score": 22,
            "replies": [
                {
                    "author": "Whiskey-Sippin-Pyro",
                    "body": "My e-mail was extremely passive aggressive. I’m not required to use e-mail for my job. Most of my coworkers and I haven’t logged into our government e-mail in months or even years. As a result, it was a giant pain to sit on hold with IT to get our passwords reset. But hey, if Elon in his infinite wisdom thinks that having me sit on the phone for an hour and a half on overtime to send a stupid email is the best use of taxpayer dollars, who am I to argue…",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GazelleThick9697",
                            "body": "Oh gosh, that’s right. When I started with the Navy I was an electronics mechanic. We had one shared computer for the whole trade shop. Of course there were always the same 2 bums surfing the internet. The old guy that read all the trash news and a mechanic that was also our union rep - not once did I see that guy pick up a tool.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Inevitable-Waltz-889",
                    "body": "Sir, you just typed out War and Peace.  I think you can do the 5 bullet points.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "ninjacereal",
                    "body": ">if anyone wants me to expand\n\nI beg you not to.l",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spiritual_Coast_Dude",
            "body": "Terminate bureaucratic waste",
            "score": 3,
            "replies": []
        },
        {
            "author": "natermer",
            "body": "This one is actually funny.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hblok",
            "body": "Good job!",
            "score": -1,
            "replies": []
        },
        {
            "author": "Jombes_Industries",
            "body": "Really funny, best one on the subject so far.",
            "score": -3,
            "replies": []
        }
    ]
}