{
    "title": "Thomas Massie only \"Republican\" to vote no on Trump budget bill. Legend.",
    "author": "NonPartisanFinance",
    "subreddit": "Libertarian",
    "rank": 97,
    "score": 632,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 29,
    "url": "https://www.newsweek.com/republican-breaks-gop-budget-plan-vote-2036282",
    "id": "1iyok82",
    "selftext": "",
    "comments": [
        {
            "author": "rocknthenumbers8",
            "body": "It would be so awesome if he took the turtle’s senate seat.",
            "score": 127,
            "replies": [
                {
                    "author": "Specialist_Box_610",
                    "body": "Agreed.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "B1G_Fan",
                    "body": "Yep\n\nIt’s worth noting that Kentucky’s Governor Andy Beshear arguably only has his job because the Libertarian candidate (John Hicks) won 1.97% of the vote, allowing Beshear’s 49.2% of the vote to beat Matt Bevin’s 48.84% of the vote\n\nA sane Republican would have a lot in common with a sane Libertarian. Such a politician would probably be quite popular in Kentucky and elsewhere.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "RocksCanOnlyWait",
                            "body": "Arguably not. Libertarian party candidate votes split almost evenly between Republicans and Democrats when asked for a second choice.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jahwls",
            "body": "A Republican Party member with an actual spine.",
            "score": 140,
            "replies": []
        },
        {
            "author": "revoman",
            "body": "So happy I can vote for him!",
            "score": 51,
            "replies": [
                {
                    "author": "Animator-These",
                    "body": "I'm an American, living in Canada. The plan between my wife and I was she'd finish school, do her residency and then we'd move to his district, she was 100% on board....then the Canadian dollar bottomed out and we lost tens of thousands in the currency conversion if we sold the house. A 5% swing in exchange rate succcccckkks especially when it's over stupid statist shit . We were looking at Campbell County specifically.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "AllLeftiesHere",
            "body": "I haven't seen much on the bill. Would someone mind giving a few pros and cons?",
            "score": 17,
            "replies": [
                {
                    "author": "Lando25",
                    "body": "Its confusing because everyone says it starts no tax on tips, overtime etc, but he explicitly said it doesnt.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "AllLeftiesHere",
                            "body": "Yeah, I keep hearing people talk about it, but noting verbatim. Hard to know. ",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Lando25",
                                    "body": "I respect Massie for his conviction, but people on here would follow the guy off a cliff which is dangerous no matter how much you may agree with him.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mfe13056",
                    "body": "https://preview.redd.it/65u8fem9aole1.jpeg?width=1284&format=pjpg&auto=webp&s=8972ba8dc3054f3314a21050992574079e56567d\n\nHere is the tax cut plan in an easy to understand flow chart for mouth breathers",
                    "score": 14,
                    "replies": [
                        {
                            "author": "AzarathineMonk",
                            "body": "Mouth breathers will simply say it’s fake news.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "AlphaTangoFoxtrt",
                            "body": "Except that chart is a gross oversimplification that makes a lot of assumptions regarding things like tax credits (what if you have no children and the reduced child tax credit doesn't impact you?) and how much tariffs will impact you.\n\nTrumps tax plan sucks, because it increases the deficit, but it's not something that can be boiled down into a 100 word reddit image. It's far more complicated than this, and that chart makes far too many assumptions.\n\nThough Redditors will eat that shit up and then act smug and smart about it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "foople",
                                    "body": "[This seems to be a more detailed breakdown of their calculations.](https://itep.org/federal-tax-debate-2025-trump-tax-changes/)",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "AlphaTangoFoxtrt",
                                            "body": "And in there the lions share of the increase is from Tariffs. And Tariffs are a tax, and are anti-free market.\n\n*BUT* Tariffs are heavily dependent upon your spending habits. For example I don't have a very consumerist lifestyle, over the past 2 years my average saving/investment % as compared to my earnings is 56%. That's inclusive of retirement contributions, but exclusive of taxes. A lot of my food is local as well. Tariffs won't impact me as much as thy would someone else. I also have no kids, so the child tax credit being reduced would have no impact on me at all.\n\nThat's why the chart is an oversimplification.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "mfe13056",
                                    "body": "It's simply a continuation of current tax cuts that end this year. There's no assumptions when it's the current way.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AlphaTangoFoxtrt",
                                            "body": "It's not, and a 5 second google will show you that. The Tax bill is not \"simply a continuation\". While it does continue the tax rates from the TCJA, it eliminates or reduces several forms of tax credits, and it includes higher tariffs.\n\n* https://about.bgov.com/insights/elections/2025-tax-policy-crossroads-what-will-happen-when-the-tcja-expires/\n* https://itep.org/house-budget-resolution-tees-up-damaging-trump-tax-cuts-agenda/\n* https://taxfoundation.org/research/federal-tax/trump-administration-tax-proposals/\n\nPlease actually do some reading and research, don't rely on a reddit graphic that is a gross oversimplification and relies on a lot of assumptions about what tax credits you utilize.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "chainsawx72",
                    "body": "One, it extends the Trump tax cuts.  This is said to increase the deficit, because consideration for booming and tanking economies is not calculated.  \n\nTax rate of zero: no money due to no taxes.\n\nTax rate of 100%: no money due to no GDP.\n\nNO ONE KNOWS WHAT THE IDEAL TAX RATE IS.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Jolly_Job_9852",
                    "body": "It's a resolution to lay the framework of the massive reconciliation bill the House is pushing. It's one single bill while the Senate wants two bills.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "tsamvi",
                    "body": "It's general cuts to entitlements to all for a massive tax cut for the super rich.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YardChair456",
            "body": "This generations Ron Paul",
            "score": 10,
            "replies": []
        },
        {
            "author": "Specialist_Box_610",
            "body": "Good Ole Mr. No.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Remarkable-Tale428",
            "body": "Love it",
            "score": 2,
            "replies": []
        },
        {
            "author": "mfe13056",
            "body": "https://preview.redd.it/d2zotu3daole1.jpeg?width=1284&format=pjpg&auto=webp&s=f77d5db8724e6db9e8f6234ad25203919896b9fb",
            "score": 3,
            "replies": []
        },
        {
            "author": "SaltyyDoggg",
            "body": "Massie for President",
            "score": 2,
            "replies": [
                {
                    "author": "bt4bm01",
                    "body": "Maddie needs to stay in congress. He’s irreplaceable",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}