{
    "title": "Fire every last public employee (taxpayer leech)",
    "author": "EndDemocracy1",
    "subreddit": "Libertarian",
    "rank": 96,
    "score": 535,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 56,
    "url": "https://i.redd.it/2szqo0yvsile1.jpeg",
    "id": "1iytbus",
    "selftext": "",
    "comments": [
        {
            "author": "Im-a-bench-AMA",
            "body": "(The entire budget for all workers paid by the federal government, including *all* members of the executive, judicial, and legislative branches, makes up roughly 4% of the federal budget)",
            "score": 66,
            "replies": [
                {
                    "author": "TheHuskerdoo",
                    "body": "That's why we also need to cancel a lot of the projects while firing them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GGM8EZ",
                    "body": "if there is no federal workers nobody can use the funds or tax us anymore so actually it's 100%",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Im-a-bench-AMA",
                            "body": "Do you really truly think the federal government would cut even the very last set of workers that insure they recieve tax revenue? Even if they abolish the irs they will still collect taxes.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JonnyDoeDoe",
            "body": "Really wish the Anarchists would separate themselves from Libertarians...",
            "score": 132,
            "replies": [
                {
                    "author": "ConscientiousPath",
                    "body": "Both are so far from the status quo that from the perspective of accomplishing anything (with any method short of coup and forced revolution), they're identical. \n\nThe government is easily 1,000x the size any actually libertarian regime would be, which means that even for a libertarian who's not an anarchist, this meme is only wrong in 0.1% of cases. It's a good meme.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "JonnyDoeDoe",
                            "body": "I wasn't commenting on the meme... \n\nBut yes, as a Classical Liberal, we are not close to where I want to be...",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Temperature_8662",
                    "body": "Why? Don't both want a smaller goverment?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "hotdog_terminator",
                            "body": "Anarchists want no government, libertarians want a very small government but still believe it should exist in some capacity.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Sounds like there is a lot of work both of those groups could do together before they come into conflict. The government is currently massive.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "hotdog_terminator",
                                            "body": "I agree, we are both small groups, so we need to work together as much as possible to try and get our opinions heard",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 73,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 56,
            "replies": [
                {
                    "author": "JimKkkrow",
                    "body": "Does the truth hurt that bad?",
                    "score": -52,
                    "replies": [
                        {
                            "author": "hoops-mcloops",
                            "body": "You're a flat earther, I don't think you're qualified to dictate truth.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "Brocks_UCL",
                                    "body": "As if the username alone wasnt a dead giveaway that hes a waste of time",
                                    "score": 25,
                                    "replies": []
                                },
                                {
                                    "author": "JimKkkrow",
                                    "body": "Explain to me this then. Besides the standard government bureaucracy why on earth does every little thing take beyond forever to get done? I.E sitting at the DMV for on average 4hrs just to get a car titled especially since they're almost always full staffed?",
                                    "score": -31,
                                    "replies": [
                                        {
                                            "author": "Cubicleism",
                                            "body": "I haven't sat at the DMV that long in years. I had to renew my license last year and it took 15 minutes from when I walked in to when I left, including an eye test and photo. I do my registration online. It takes no time at all",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "hoops-mcloops",
                                            "body": "No.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 39,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 13,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KindofNeatGuy",
            "body": "I love Ron Swanson.  This made me laugh.  I just wish for much smaller government, though.",
            "score": 6,
            "replies": []
        },
        {
            "author": "JustDesserts29",
            "body": "If you think that the government doesn’t do anything important, then you have never worked with the government. I’m in tech consulting and I’ve worked on commercial projects as well as public projects. On a commercial project, some people might lose some money and will eventually be compensated for it if something gets fucked up. On a public project, people can literally die if something gets fucked up. The perceived “inefficiency” of the government is due to the fact that the government focuses on social issues which are typically much more complex and difficult to resolve than what commercial entities are willing to take on. You also have to have a lot of regulations when you try to address social problems because a mistake can quickly result in someone’s death. \n\nFor example, I worked on some software that is used to manage prisons. I saw a bug one time where an inmate’s record got duplicated somehow. If I didn’t catch that and it made it into production, then you could end up with one record for an inmate that shows that they got into a fight with another inmate and another record for the same inmate that doesn’t have the record of that incident. That’s a pretty big deal because if the person assigning the inmate to a cell looks at the wrong record, they can wind up assigning them to the cell that the guy that they just fought is currently assigned to. That’s a good way to get an inmate killed. This is just one example of why comparing private entities to the government is idiotic. There really aren’t any scenarios on any commercial project I’ve been on where the consequences of a bug are nearly as dire. It’s why a lot of government processes require a ton of reviews and sign offs. \n\nAnother big difference between commercial and public projects is funding. Anyone claiming that the government just throws away/wastes money has no idea how the government actually works. Government agencies are massive penny pinchers. It’s to the point where consulting agencies typically won’t try to win work with them unless it’s a package deal. We try to get multiple projects with the same agency at once because the profit margins on a single public project often aren’t worth the hassle. They will try to find any angle to get us to give them work for free. The people who move up to management positions in these agencies are the people who are really good at making the funding that they have go as far as possible. There’s always a game that clients like to play where they claim that they asked us to build a certain feature/functionality into the app that they never asked for, but the government does this to a degree that I never see on commercial projects. I’ve been on a project where the client expanded the scope of the project so much that the company that I worked for wound up paying for the development of their software for two years. The reason the government is like this is because the project can be defunded next year. They know that they have the funding now, so they have to make it go as far as possible before it gets cut off. Corporations will just throw money at us so that we can tell them what they’re doing wrong and they can ignore us until the issue pops up again. Commercial projects are much more likely to be ones where I end up wondering why the company is spending money on us.",
            "score": 44,
            "replies": [
                {
                    "author": "ConscientiousPath",
                    "body": "Just because the government _has_ done something that is important, doesn't mean that government was the only choice or the best choice to do that important thing. If you think that government was the only choice, the most likely reason is that you've not applied your creativity to come up with a way to do it without government. If you think government was the best way to accomplish it, the most likely reason is that you've not applied your creativity to find a way that doesn't requiring stealing other people's money to accomplish the goal.\n\nEven your example of finding a duplicated record for a prisoner, _happened in government data_. Government didn't do anything better than anyone else in that example. You just happened to have found the problem early enough. The fact that you haven't personally worked on any commercial project with similarly dire stakes isn't evidence that such companies don't exist. SpaceX for example would get people killed if their manned rockets blew up. Banks could get people killed if they made a mistake with money in accounts. There's nothing special about government that eliminates these kinds of risks in software. \n\n>Another big difference between commercial and public projects is funding. Anyone claiming that the government just throws away/wastes money has no idea how the government actually works. Government agencies are massive penny pinchers. \n\nROFL  I'm sure that within a given department at a given agency, they're often pinching pennies on their assigned budgets because they're trying to fit all their salaries into it. But the waste comes from the fact that their department exists in the first place. The waste comes from their inflated salaries and associated state retirement plans. The waste comes from putting in tons of effort to accomplish something that almost no one wanted in the first place given the costs of accomplishing it. Government waste is often like someone building an extravagant mansion and then hiring illegal immigrants to clean it. You don't get credit for pinching pennies if you're fumbling Benjamins.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "JustDesserts29",
                            "body": "Nice counter-factual argument there. The reason government takes on these issues is because they cost money and there isn’t an easy way to profit off of it or adding a profit-motive would result in worse outcomes. “Why not just have charities do it?” Well, we’ve tried having charities take on these issues and they just aren’t as effective as government programs. These programs and their corresponding taxes to fund them exist because individuals living in a democratic republic voted for representatives who then passed laws to create the programs and to fund them. That’s how democratic republics work. We as a society vote and people decided that they wanted someone in office who would create and fund these programs. So, you do actually have a say in how money is spent by the government. The issue you seem to have with that is the fact that other people also have a say and they might not agree with you. Want a program defunded? Then convince your friends to vote for someone who will defund it. \n\nLol, the issue I found was a result of testing. It wasn’t a result of government data. I created the data to check to see if I could cause the issue. That’s how we find issues before we release software to the public. This is how every software project works. All software has a bunch of bugs before it gets released. Also, it was a developer working for a private entity who developed the code that had the bug in it. SpaceX benefits from government subsidies. There are tons of government regulations that they have to abide by to develop their rockets. Their projects involve a ton of government oversight and they basically partner with the government for their projects. Government projects are actually set up so that there’s more oversight over quality. So they are actually set up in a way that makes it more likely for issues to get caught early. Lol, you think that people in the government make good salaries. People don’t go into public service for the money, that’s for sure. They all could be making a lot more money in private industry with the same skill set. Their departments exist because people for it. People definitely asked for them to exist because they voted representatives into office who ran on funding or creating those departments. Thankfully, the government insures bank deposits so that people don’t die if a bank has issues. Even in the banking scenario, it would take a failure of government for anyone to actually die.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "LarryFalwell",
                            "body": "Well said.  It’s ridiculous to assert that mistakes in corporations won’t kill people.  There are so many examples to the contrary.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ok-Fisherman3085",
                    "body": "I have worked for the government. Everyone I know that still works there is lazy, stupid, or trapped in their job. Everyone who is decent and not under circumstance that create a situation where they are nearly forced to stay, left. Why did they leave? Because its inefficient, their co workers are lazy, stupid, or both. Fire them all.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "cc4295",
            "body": "How would air travel continue if all air traffic controllers were fired? The amount of institutional knowledge to operate the busiest airports would vanish. But the FAA could just pull military controllers…but wait, most of the institutional knowledge there is held by federal employees too. But who cares let’s pull uniformed military controllers to fill…wouldn’t they be federal employees now tho? What money was saved if we just replace them with less knowledgeable/experienced people? All we did was make things less safe, less efficient, caused some chaos, cost more to hire/train/move the new guys into facilities, and saved zero dollars.",
            "score": 8,
            "replies": []
        },
        {
            "author": "RandoWebPerson",
            "body": "You realize this means get rid of NASA right? No more mars rovers, JWST is space trash, no more ISS. Great idea /s",
            "score": 17,
            "replies": [
                {
                    "author": "LarryFalwell",
                    "body": "As much of a space nerd as I am, it’s hard to say that NASA is efficient.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "RandoWebPerson",
                            "body": "Ok so make it more efficient but don’t get rid of every single NASA employee like OP is suggesting",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "ConcretMan69",
                            "body": "I mean when you strip them of any ability to compete they look like shit 🤷 thanks obama",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Notryanz",
                                    "body": "Silly liberals! Don’t you know that private sector will always do better than the public sector at everything (when I hamstring the public sector)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConscientiousPath",
            "body": "I love how Ron Swanson was created with the intent of making a snide caricature of a libertarian, but every time I see a clip of him I just wish everyone could be at least that awesome.",
            "score": 8,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "Of course I am. I'm Ron F***ing Swanson!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "JonnyDoeDoe",
            "body": "Yes, but no... \n\nYou could split off the zero government anarchists and still have a wide spectrum of minarchists... So plenty of discussion and disagreements over what government should exist, but that's good and doesn't exclude out of hand... \n\nFor years as the Rothbardians entered the party, I would try to reason with them that since getting to no government will require getting to limited government first, why not help us minarchists get to limited government first... Almost every answer consisted of some form of \"you are a statist\" and \"bootlicker\"... \n\nIn theory libertarians can use the government to get to a limited government... Anarchists have no real vehicle of change other than violence...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hench999",
            "body": "A lot of leftist and/or federal employees on this sub that do nothing but complain, especially with posts aimed at DOGE. they pretend to be libertarians attacking the cuts to the federal administration. If there was any doubt in my mind on the number of socialists and leftists that post here pretending to be libertarians, it vanished when I got downvoted almost 20 times just for calling Bernie Sanders a fraud(which pretty much any libertarian knows that he is at this point).\n\nI don't need every initial post to be some long depth article. Oftentimes, a mindless meme is enough to spark a decent debate or conversation. Sifting through dumb memes is a lot less annoying than sifting through post after post of \"you're not a true libertarian\" or \"that wasn't real socialism\"",
            "score": -4,
            "replies": [
                {
                    "author": "Cubicleism",
                    "body": "Some of us are just smart enough to understand that randomly hacking away at the government isn't an effective way to reduce spending over time, not to mention they Republicans have already allocated the anticipated savings from DOGE. They are just picking money up and putting it down elsewhere. We won't see a red cent as tax payers and I'm curious how much is going to go to Elon with new government contracts. He has already received $38 Billion from daddy government in contracts over the years - I want the corruption and conflicts of interest to END not continue \n\nLiking Elon isn't a required tenant of libertarianism.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Hench999",
                            "body": "You're right it shouldn't be randomly hacked it should be burnt and buried. In reality, the cuts likely won't be enough, but it is something, at least. All they have done is expand government for the last 100 years. Never before has anything like this been done. It's flawed, often times ugly, and Elon is often an asshole. I don't care. It is more than we have ever had. If they are going to give the people back a portion of the money they stole from them, then I'm ok with that. If they spend the money on other crap l, I'm not OK with that. \n\nYou don't have to like Elon or believe this is going to be some golden age to at least acknowledge that more is being done now than ever. I don't believe most of the people on here complaining about it are libertarians though. Rather than pointing out the flaws and acknowledging the good, they are just flipping out about it like every other big government progressive.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Cubicleism",
                                    "body": "I don't think more is being done now than ever. Government reform has been going on in many forms over the years. This is just the most salacious so it's talked about more often. \n\nJust like how everyone is freaking out about the airplane crashes. There are no more incidents than in years past, it's just being talked about so everyone is paying attention and they feel like it's a bigger deal than it actually is.\n\nI don't think our system is completely broken and needs to be burned to the ground. A lot of it works and should be appropriately given merit and used as a template where needed. What DOGE is currently doing is ineffective and will create more waste. I will continue to believe that until we get some real transparency on the cuts being made and the selection process.\n\nAnd I actually do care if they spend the money on other stuff. I want less government, not the same amount with just a different face. And if they are going to spend it, I want it going to fellow, hard working, middle and low class Americans who are the backbone of this country - not billionaires and wars and other countries.\n\nAs for the prevalence of libertarians vs. liberals on this sub? Who is to say. I've seen quite a bit of conservative ideals and trump worshipping here, too. I don't think one downvoted comment is an adequate measure.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AutoModerator",
                    "body": "[Reminder: 'not-true'-socialism has killed 100 million people.](https://en.wikipedia.org/wiki/The_Black_Book_of_Communism) But wait, that was actually *state capitalism*! Carry on, comrade!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "veryaveragepp",
            "body": "I work closely with federal employees (engineers) and the amount of paid leave that they take is unbelievable. I’m not even talking about the 3 months of parental leave that both male and females take.\n\nI also don’t see people commenting on the “sandbagging” culture. If the holidays don’t start until weeks later, they’ll act as if progress is impossible until after the holidays. Screw all the citizens that need things done on the public side to continue their lives…we’re government employees!",
            "score": -4,
            "replies": [
                {
                    "author": "the_loon_man",
                    "body": "Are private sector engineers lazy and inefficient for using their paid leave and benefits? I dont really understand this attack. Lower productivity over the holidays due to people being on \"use or lose\" leave is also very common in both public and private sectors, especially in engineering/consulting type work.  I know because I have worked both.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "countGockula",
                    "body": "Can you elaborate upon the \"unbelievable\" amount of paid leave? What makes it unbelievable?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vindaloo6363",
            "body": "At least we’ll have people to pick the vegetables when the illegals are deported.",
            "score": -1,
            "replies": []
        },
        {
            "author": "gwhh",
            "body": "So true.",
            "score": -17,
            "replies": []
        }
    ]
}