{
    "title": "Out of the box idea on cutting the gov workforce",
    "author": "liljoeo",
    "subreddit": "Libertarian",
    "rank": 95,
    "score": 0,
    "upvote_ratio": 0.41,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Libertarian/comments/1j089we/out_of_the_box_idea_on_cutting_the_gov_workforce/",
    "id": "1j089we",
    "selftext": "I am all about firing gov workers, but I find the method distasteful to normies. Instead, I would propose cutting pay and lowing GS pay ranges especially on the higher end. That would not only piss off gov workers but would lead to mass walk offs, which is really what we should want (not getting fired but instead voluntarily quit) \n\nNow I am not saying lets pay GS 1 and 2 less. Taxation is theft, but we all do still live in a progressive tax system, and as a result we should be supporting a progressive pay cut in which the more you make the more you have your paycheck cut. \n\nThoughts? People say working in gov is a public service, I would like that be more the case by impoverishing you if you work in the gov lol. ",
    "comments": [
        {
            "author": "Free_Mixture_682",
            "body": "I think pay scales are set by law and would require congressional approval to be reduced. That is a hard sell for members of Congress in tight districts afraid of losing votes.\n\nJust one more reason why I say democracy rewards deficit spending, especially in a single-member district.",
            "score": 9,
            "replies": []
        },
        {
            "author": "SettingCEstraight",
            "body": "I don’t know where I heard this so take it with a grain of salt, but some 130k federal workers are millionaires. If that’s the case, how does that even happen?",
            "score": 2,
            "replies": [
                {
                    "author": "pooter6969",
                    "body": "I mean.. it's pretty easy to become a millionaire on even a modest salary if you make basic, sound financial decisions.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "No_Helicopter_9826",
                            "body": "Yup.  Unfortunately, the USD has been devalued to the point that \"millionaire\" is no longer impressive.  It's more like a minimum prerequisite for retirement. \n\nWhen the term first came to prominence, I think in the 1920s (?), a millionaire was Mr. Warbucks being chauffeured around in a limo.  Now it's Bob down the street with the late-model Hyundai.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "se69xy",
            "body": "Seems to me a hiring freeze and not back filling positions is a good way to start. Also, the voluntary resignations with a severance was/is also a good way to lots of workers close to retirement age would take it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cannoli72",
            "body": "Nope!!! Cut every job that is outside of article one section 8. These existing jobs are extremely detrimental to our economy and liberties",
            "score": 4,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "Move the headquarters to some Federal building on Montana and require 3 days a week in person.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ballzy214",
            "body": "Bob Murphy had the idea to fire any government employee who’s job isn’t specifically referenced in the constitution. The kicker is to pay them a for a year afterwords even if they get another job. That way people complain less, gov employees do less damage and after just that one year you save a shit ton in spending.",
            "score": 1,
            "replies": []
        }
    ]
}