{
    "title": "Thomas Massie is one of the only members of Congress who isn't beholden to the military industrial complex",
    "author": "AbolishtheDraft",
    "subreddit": "Libertarian",
    "rank": 67,
    "score": 403,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 13,
    "url": "https://i.redd.it/fl5nipdr8wle1.jpeg",
    "id": "1j09hba",
    "selftext": "",
    "comments": [
        {
            "author": "blacklisted320",
            "body": "How great KY got him and how awful they also got Mitch McConnell ",
            "score": 29,
            "replies": [
                {
                    "author": "worcesterbeerguy",
                    "body": "He's the hero KY needs but doesn't deserve.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Arc_2142",
                    "body": "McConnell’s not running another term, so hopefully we get another Massie/Paul type Republican in office. Massie has even floated the idea of running for McConnell’s seat.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Sea_Journalist_3615",
                            "body": "Paul is a boot licker. he supported trump in expanding the background check system. Seriously eff that guy.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Arc_2142",
                                    "body": "I didn’t say he was perfect, but we’d be better off having another one of him rather than another McConnell or a Dem, don’t you think?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Sea_Journalist_3615",
                                            "body": "You will never be better off with people who rule over you. Slavery is always bad even with a nicer Master.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Arc_2142",
                                                    "body": "Sure. When do you expect all the rulers to step down? For now we’re stuck with picking the least of few evils.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sea_Journalist_3615",
                                                            "body": "\"Sure. When do you expect all the rulers to step down?\"\n\nWhen people stop being cowards and we lock them up for their crimes. I do not expect criminals to stop being criminals peacefully.  You don't ask a mugger to step down lol.\n\n\"For now we’re stuck with picking the least of few evils.\"\n\nBecause of cowards",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NonPartisanFinance",
            "body": "Libertarians are just republicans who smoke weed /s\n\nClearly...",
            "score": 6,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "Or AIPAC!",
            "score": 2,
            "replies": []
        },
        {
            "author": "revoman",
            "body": "So glad I can vote for him!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sure_Opportunity_543",
            "body": "This is a true hero looks like!!!    Need many.  Many more to stand with him!",
            "score": 1,
            "replies": []
        },
        {
            "author": "OniTYME",
            "body": "The Military Industrial Complex AKA the Deep State AKA Our Greatest Ally.",
            "score": 1,
            "replies": []
        }
    ]
}