{
    "title": "Should we have absolute free speech or could we reasonably draw the line somewhere?",
    "author": "Canofair8300",
    "subreddit": "Libertarian",
    "rank": 46,
    "score": 0,
    "upvote_ratio": 0.22,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Libertarian/comments/1j2tcf1/should_we_have_absolute_free_speech_or_could_we/",
    "id": "1j2tcf1",
    "selftext": "I am a big supporter of challenging speech through more speech, as opposed to silencing speech, irrespective of whether its misinformed or hate.\n\nWith that said, I hope I can get some clarification on if this can be reconciled with two kinds of situation.\n\nFirst, suppose a neighbour starts blasting a speech through a loudspeaker towards someone's house. The neighbour does this from their own property. It is deafening and highly disruptive to the recipient, and so I would like to think that would count as a reasonable noise complaint even if the consequence may be silencing the speech. I'm not so sure if this violates free speech or not; arguably, I've thought it may not because it's not the content of the speech that is problematic but the noise level and so it isn't so much *what* they say but whether the noise is sufficiently loud to intervene on their private property.\n\nSecondly, should a line be drawn onto incitements of violence or things like death threats, despite the subjectivity, and provided context is considered. The issue is that if the law can only be enforced once such a crime happens, then the damage has already been done.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "mcnello",
            "body": "Yeah, shit like this is where anarchism just falls apart.\n\nI'm a minarchist so here is my stance:\n\n(1.) Direct threats or calls to violence can, and should, be treated as criminal. Saying \"I'm going home to get my gun and when I get back I will kill you with it\" should be an arrestable offense.\n\n(2.) Your freedom of speech does not trump my freedom of association. You can talk all you want, but I don't have to stand there and listen to you until the end of time. I'm going to just walk away.\n\nNuisance laws exist and should be respected. An ice cream truck blasting advertisements over a megaphone at 3 a.m. in New York City violates other's right to not associate with the ice cream vendor. (This was an actual case that went to the Supreme Court.)\n\n(3.) Fraud is a crime and should be prosecuted. Knowingly lying to your customers or investors, cooking the books and reporting false data, etc. should all be prosecutable. Shit like what Sam Bankmen Fried did should land people in prison. The dude literally tried to flee the country with all the remaining money and had to be extradited back to the U.S.\n\nI'm not in favor of setting up any regulatory agencies  to enforce any of this. All of the current existing agencies should be abolished. This is all shit police and prosecutors can handle.",
            "score": 7,
            "replies": []
        },
        {
            "author": "RobertEHotep",
            "body": "One my favorite annual spectacles is libraries having \"banned books\" week where they feature things like THE HANDMAID'S TALE and 1984, eg books easily available to anyone but we're supposed to pretend have been \"censored\" b/c some elementary school board in Podunk, Indiana didn't want to buy it for their library. Meanwhile, those same people will feel fully justified in public libraries not carrying the works of David Irving or THE TURNER DIARIES or THE CAMP OF SAINTS on the grounds that they're \"protecting\" the public.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Parabellum12",
            "body": "The first example isn’t a free speech issue, as the content of the speech isn’t the issue, but the loudness. \n\nThe second example would not be an example of free speech either, as incitements of violence are not protected by the first amendment. Death threats are not free speech.",
            "score": 6,
            "replies": [
                {
                    "author": "Canofair8300",
                    "body": "I see, thanks for clarifying. By free speech I wasn't referring to the law in the US specifically but more as a general concept, I see death threats as a kind of speech but it's a reasonable line to draw it at.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "MilleChaton",
                    "body": "Isn't this avoiding the question by shifting it from arguing if something should be allowed to arguing if something should be defined as something that, if it is defined as being such, is allowed?  The same standards used to declare something as not being free speech and thus acceptable to regulate would work equally well as saying something is free speech but that it should still be regulated.  The terminology is defined a bit differently, but the overall arguments are homomorphic.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "William-_-Buttlicker",
                    "body": "I would say the first scenario would have violated NAP even just a few years ago. But it's 2025 and if you don't like the noise, put on noise cancelling headphones. They work perfectly.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RobertEHotep",
            "body": "Free speech isn't possible in a diverse, massive, low-trust society. There is no shared agreement on what it means. It's reasonable to draw lines, sure, but the thing is that as soon as you establish a precedent for restraining speech, some govt entity is bound to abuse it. And as we saw during COVID, you'll have tons of people supporting the restriction/abridgment/authoritarianism in the name of \"safety.\"",
            "score": 3,
            "replies": [
                {
                    "author": "Canofair8300",
                    "body": "Indeed, once restrictions of any level are in place, its far easier for the government to extend them to affect the innocent, so we need to take that into consideration. It's remains subjective but I do think inciting violence is a unique exception that can be distinguished at least in some form. It's something that could be investigable as its a precursor to violating someone's rights. That is significantly different from if someone spreads misinformation or hate, which is much more subjective to define and its not directly harmful (because its our responsibility to evaluate and not act upon it).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RobertEHotep",
                            "body": "I don't buy the inciting violence exception. It's the kind of thing that seems like a reasonable restriction in theory but in practice I've never seen it. Someone can walk up and down the street saying, \"Beat up every \\[insert whatever group you want\\] that you see! K\\*ll them all!\" and it would not incite me to do a damn thing. If I decided to follow through with any kind of physical assault, that would be on me, not the person speaking.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Canofair8300",
                                    "body": "I agree the speech itself technically is not the harm worthy of criminalising, however, to me it seems cruel or at least ill advised if the police should turn a blind eye to that, being only able to intervene once the person its directed at is dead. Certainly, that is not guaranteed to ensue but I think because of the seriousness of death and risk of it happening, I wouldn't be against drawing some kind of line there.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "findabetterusername",
                    "body": "Acting like we somehow live in a dictatorship and not in a democracy with elected officials",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mastiffmory",
            "body": "The first is a noise disturbance the second isn’t considered free speech under American laws.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Abi_giggles",
            "body": "You have the right to any speech. I only have 1 father in this world and it’s not some schmuck in the government telling me what words are permissible to them. You just cannot infringe on another’s’ right to life and liberty. I see that mainly as direct threat and intent to commit violence or harm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gabrielsol",
            "body": "I think neither of your examples are protected by free speech.\n\nThe way I see both of those examples they are deserving of having them considered as crimes.\n\nNoise level for residential area is something neighbors can agree upon, set up a contract and then have government enforce such contract in case there is a violation.\n\nThe other one depends on how credible the threat is and the intent to carry it out maybe determined.\n\nI would say it would have to be written wisely to not pursue Anonymous threats online or that sort of thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "libertarianinus",
            "body": "100% free speech.....if your speech has crazy wacky ideas, let everyone hear how crazy you are.... facts will Win the argument.... \n\nBut in today's world you just scream and call people racists to make your point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WanderingPulsar",
            "body": "As long as i am the one drawing the line, sure\n\nOh you dont like how that sounds? Then no line at all",
            "score": 1,
            "replies": []
        },
        {
            "author": "PickleRickyyyyy",
            "body": "No line needs to drawn. People should have common sense to not say terrible shit. \n\nBut…there should be consequences for actively spreading misinformation/propaganda such as folks claiming Trump has removed sanctions against Russia. \n\nThings like that is why most countries around the world are so misinformed. \n\nThey fall into the trap set by their adversaries and then spread that misinformation themselves. \n\nThis does nothing for this planet but cause chaos.",
            "score": 1,
            "replies": [
                {
                    "author": "Parabellum12",
                    "body": "Then who decides what is and isn’t misinformation? Who decides what the punishment is? That’s a slippery slope that we have already started sliding down, as we have seen with the media and the government the past several years. \n\nHow often have those “fact checkers” been dishonest and disingenuous themselves? Way too frequently for my comfort.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Canofair8300",
                    "body": "Just to add to u/Parabellum12's comment, even if one could objectively define what's misinformation and what isn't, by trying to restrict it people tend to give it a light with sayingy \"this is what they don't want you to know!\" thus exacerbating the issue. It's very hard to completely prevent people from saying certain things. It's just more effective to rebut their comments.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unable-Assist9894",
            "body": "*where* do you have free speech as an American? Because I think most of you are role-playing free speech. ",
            "score": -7,
            "replies": [
                {
                    "author": "gabrielsol",
                    "body": "Are you a bot? You're not even interacting with the post.",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}