{
    "title": "Questions for libertarians",
    "author": "vasilijenovakovicc",
    "subreddit": "Libertarian",
    "rank": 20,
    "score": 13,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/Libertarian/comments/1j39huo/questions_for_libertarians/",
    "id": "1j39huo",
    "selftext": "I'm starting to educate myself on economics and the free market, and I have to say that I like a lot of your ideology - But, as I've been researching, I've come across some questions and potential problems that I'd like to hear your thoughts on:\n\n\n1.Does a completely free market inevitably lead to some kind of aristocracy? If the most successful capitalists can amass wealth and power without limit, wouldn't they naturally be in a position to virtually control society as some sort of new aristocracy?\n\n2.What prevents ultra-rich individuals from becoming more powerful than the state itself? Could companies and billionaires replace the government, create their own rules and govern effectively?\n\n\n3.How do you prevent capitalists from simply bribing all the politicians and regulators, given that they have almost unlimited resources? If the market is dominant, what would prevent them from buying the legal system, the courts and all the institutions that should theoretically control them?\n\n\n4.If the market allows too much concentration of power, what would prevent a situation in which people no longer have a real choice, but have to accept the conditions dictated by the ultra-rich?\n\n\n\n5.If someone owns most of the land, infrastructure, and basic resources, would their word be above the law, because they simply control everything important to the survival of others?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hoppy_Hessian",
            "body": "All of your questions come down to not a free market.  You are asking things based on a system of crony capitalism (which is what we have right now.)\n\nCurrently: Large corporations buy the politicians and the regulators and keep smaller competitors from the market thus concentrating their power.\n\nIn a true free market you have competition.  Consumers are free to choose a product or service from a company they like at a price they deem acceptable.  If they don't feel like there is something for them then they are free to start their own company...with blackjack and hookers.\n\nIn the absence of government control you will have more choices and the rise of more entrepreneurs.  Individuals have more control but also more responsibility because their is no big daddy in Washington to bully people into complying with what you want.",
            "score": 12,
            "replies": [
                {
                    "author": "fillllll",
                    "body": "in this free market, can corporations lobby like today, or is that freedom taken away?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "_beef_supreme",
                            "body": "If you reduce the power of government, then lobbying becomes, in effect, useless. This is the core of Libertarian philosophy.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "nebbulae",
                            "body": "Lobbyists can't buy favors the corrupt politician doesn't have for sale. \n\nThis is why libertarians propose the state should only take care of defense, police and justice (basically the enforcement of the non-aggression principle and the enforcement of free contracts agreed to by equals). Then it needs to stay out of people's lives. That means it doesn't have any say in healthcare, education, housing, trade, etc.\n\nAt that point you can lobby all you want but the state doesn't have the power to give you what you want.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "fillllll",
                                    "body": "Please make it make sense.... How is a gun manufacturer prevented from lobbying and offering kickbacks to being awarded government contract? The Libertarian fairy magically tells everyone about the secret corruption?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "rendrag099",
                                            "body": ">How is a gun manufacturer prevented from lobbying and offering kickbacks to being awarded government contract?\n\nNothing, inherently, but a much smaller government doing far fewer things is much easier to keep tabs on",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "fillllll",
                                                    "body": "Bruh, do you know how kickbacks work? Your idea does not prevent corruption at all. In fact it makes it easier to bribe, by getting rid of the bribery police",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Efficient_Waltz5952",
                    "body": "I will disagree about the first question. The free market could lead to an aristocratic-like group. BUT it is infinitely harder than what we have.\n\nSaying something is improbable doesn't make them impossible. And I would argue that ignoring a possible outcome is akin to a leftist defending socialism.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sbrisbestpart41",
            "body": "For the first one. The answer is somewhat yes. But that is assuming that youre a Rothbardian or Hoppean. There will be a faux-aristocracy which arises from anarcho-capitalism. Some people want it to act like an actual aristocracy while others care little about it.\n\nThe thing which keeps these aristocrats from developing into a state is the dominance of principles, voluntary interacts, and competition.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Weary_Anybody3643",
            "body": "Half of these can be answered by not having a state at all can't bribe the state if it doesn't exist ",
            "score": 4,
            "replies": []
        },
        {
            "author": "AdrienJarretier",
            "body": "Those are great complex questions, some of which are really hard to answer simply.\n\nI'll start with the last one which is the easiest to dismiss.\n\n>5.If someone owns most of the land, infrastructure, and basic resources, would their word be above the law, because they simply control everything important to the survival of others?\n\n\"owning\" anything doesn't mean much if you can't do with it whatever you like, that also means being able to defend it. Owning land on paper is meaningless unless you have the firepower to defend against someone taking your land for themselves.\n\nif one owns most the lands it seems implausible for one to defend those lands alone against everyone else.  \nIf the state provides this defense, then clearly the state is more powerful and land owner can't be above the law.  \nIf private institutions provide defense, then the land owners must pay for it, that means at some point it would cost too much to defend unused land, say you have farm land, but everyone else boycotts you and plant vegetable in their garden, how are you gonna pay for security ?\n\nOf course these answers assume a non warlord land owner, not keeping others under control using agression. This is where your other questions come into play.\n\n>1.Does a completely free market inevitably lead to some kind of aristocracy? If the most successful capitalists can amass wealth and power without limit, wouldn't they naturally be in a position to virtually control society as some sort of new aristocracy?\n\n\"wealth and power\" are really ambiguous terms, we must define what we mean if we are to make any good arguments using those terms. Same goes for \"capitalism / capitalists\".  \nI define Capitalism as a political and economical systems synonymous with the free market, or almost. A system where rights of private property are somehow protected/respected, leading to people being able to transfer property titles to others, usually through trade based on voluntary transactions. The \"capital\" part is simply private property, one owns \"capital\" and may either consume it or delay that consumption to try and use that capital to gain more capital.\n\nWealth isn't only money then, anything that people own is wealth. But it's not only material either, I'd argue that having access to better mode of transport, communications technologies, a big variety of food, various services from medical care to musical concerts is real wealth.  \nMoney is the means to exchange titles of property. It's the tool to cooperate with strangers in using resources which have alternative uses.\n\nPower : if power is having more choices because one has more money, then this isn't an issue for anyone. The issue is coercion. The NAP means you may not coerce someone into doing something they don't want to,n provide money incentives is not coercion.  \nIf power is the right to initiate violence, then capitalism doesn't gives you that by itself, in today's countries the states is the only one with that right, and this is not capitalism.  \nIf power is the ability to initiate violence, then we have our core issue. How do an Ancap society prevents some people from initiating violence, from being aggressors ?",
            "score": 2,
            "replies": []
        },
        {
            "author": "libertyfo",
            "body": "Hi thanks for posting, here's what I think, and happy to go back and forth on any of these:\n\n>1.Does a completely free market inevitably lead to some kind of aristocracy? If the most successful capitalists can amass wealth and power without limit, wouldn't they naturally be in a position to virtually control society as some sort of new aristocracy?\n\n\nYes, as in any system, the inevitability of an aristocratic class is there, however, in a free market these aristocrats would have to be of benefit to the rest of the people in order to get them to give them their money (essentially, the theory that you would never give up your money through your own free will to someone else unless you think what they are offering is more valuable than what you are paying), as opposed to the current system where billionaires just bribe the state to take your money and give it to them..\n\n\n\n> 2.What prevents ultra-rich individuals from becoming more powerful than the state itself? \n\nIn what aspect? Building roads, schools, infrastructure, etc? Sure, cause if they do a shitty job they don't get paid/ compared with the government who gets paid regardless..\n\n\nThe police and judicial system, you get into anarcho-capitalism vs minarchism I think, and I haven't read enough to not start misrepresenting sides..\n\n\n>Could companies and billionaires replace the government, create their own rules and govern effectively?\n\nI mean, they might, if people want to be ruled by them voluntarily, like current day cult stuff, they could do that, they would have to offer their followers a lot to get them to do it I would think... \n\nBut if a billionaire were able to ammass a war power so big that he over throws the government and \"enslaves the people\", however, war is extremely expensive and an armed population and the inability to print money out of thin air means that this \"war\" probably won't be worth it at all...\n\n\n> 3.How do you prevent capitalists from simply bribing all the politicians and regulators, given that they have almost unlimited resources? If the market is dominant, what would prevent them from buying the legal system, the courts and all the institutions that should theoretically control them? \n\nCouple of points here: the only unlimited resource we see today is the fiat currency, because it's literally unlimited, they print and borrow whenever they need more, other than that, resources are extremely limited and would not be thrown around how you imagine..\n\n> simply bribing all the politicians and regulators, given that they have almost unlimited resources?\n\n\nWhat's stopping this now? Do you believe it's working? What stops billionaires from approaching corrupt politians in a libertarian society would be that people are not forced to give their money to billionaires, and the fact that corrupt politicians don't have the capacity to enact a law that would benefit the billionaire \n\n\n\nI'll get to the rest later",
            "score": 1,
            "replies": []
        },
        {
            "author": "OilPristine376",
            "body": "Ludwig Lachmann work explains how stable could be free markets.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot_Egg5840",
            "body": "1) can't buy what isn't for sale. 3) virtues and morals impose proper constraints. 4) you falsely equate money with power.\nYou are contriving a false world where ultra rich are maniacal and everyone else must succumb to their will. In such an extreme fantasy, no pure system survives.",
            "score": 1,
            "replies": [
                {
                    "author": "knowheredesign",
                    "body": "It's a fantasy to think that a just civilization can be run on good virtues and morals. First who teaches these morals?\nIt's human nature to accumulate resources for their own tribe/family and fuck over other tribes in process. \nI'm also curious how you don't equate money with power, can you explain that?\nAlso I don't know if in your scenario you are restarting civilization or are we just changing the rules mid game?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scary-Strawberry-504",
            "body": "Most of the concerns you listed already happen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeoMoose",
            "body": "1. Every system of government creates hierarchies. Ours is just the most free.\n\n2. See answer 1, but you can add in anti-trust laws. We have them today, but corpos have bought the gov't so they aren't enforced.\n\n3. End Citizens United.\n\n4. An unchallenged corpo in a free market invites competition.\n\n5. Anti-trust laws. Blackrock and Monsanto should have been in the crosshairs long ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeitherManner",
            "body": "Buying politicians just means common people voted them. It's like saying drug seller is sole criminal and end user is clueless victim. ",
            "score": 0,
            "replies": [
                {
                    "author": "fillllll",
                    "body": "nice try Diddy",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GGM8EZ",
            "body": "This wouldn't happen since there would be real competition. without government backing\n\nNot without consent they can't\n\nGive the government no say in the economy\n\nIt is ones own responsibility to ensure this doesn't happen. And as said in 1, it wouldn't happen since there would be competition\n\nit is not anyone else's responsibility to clothe feed and house you just because they are more fortunate. this wouldn't happen though since it would be impossible to amass this much without government backing. number 1\n\nPretty much monopoly hates the free market, any monopoly there is has been backed by government or violent power whitch under libertarianism is bad.",
            "score": 0,
            "replies": []
        },
        {
            "author": "OilPristine376",
            "body": "For all that you say, yes, it is possible, but it is more likely that an aristocracy would emerge in a monarchical or bureaucratic regime. In democratic-liberal systems, it can happen, but they are unstable in the long term. In an ancap society, it would be much more difficult for power to rise and concentrate in the hands of only a few people.",
            "score": 0,
            "replies": []
        }
    ]
}