{
    "title": "This is Why College and Healthcare is Expensive",
    "author": "CantAcceptAmRedditor",
    "subreddit": "Libertarian",
    "rank": 8,
    "score": 788,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 34,
    "url": "https://i.redd.it/4ihaauxilpme1.jpeg",
    "id": "1j3ggwl",
    "selftext": "",
    "comments": [
        {
            "author": "Practical_Advice2376",
            "body": "Healthcare is more complicated, AND, various forms of government are still the root cause.",
            "score": 37,
            "replies": [
                {
                    "author": "davisriordan",
                    "body": "Correct, although I worked in insurance and can give an example, but it's ironic. MRIs cost more to run than amount Medicare is willing to reimburse; as a result, they charge under 65 insurance more for MRIs to make up the loss. This artificially affects the rate at which they are prescribed based off age as well as need.\n\n\nSo ironically, when it comes to Medicare reimbursement, the government is perceived to have strong bargaining power, however the size leaves it open to localized exploitation, such as medical devices advertised on TV.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Practical_Advice2376",
                            "body": "That's crazy, I'm sure there's a lot more examples like this that equate to a gigant blob of ridiculousness!\n\n\nGet government 100% out of Healthcare, including health insurance.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "davisriordan",
                                    "body": "That would likely make it worse in my experience. Who covers people with developmental disabilities? What happens if there is a genetic component to the likelihood they can prove?\n\nDiabetes is a good example, they on average used to cost $1000/month more for employers provided insurance. Most of the people I know with diabetes are genetic, not lifestyle based. Self-insurance providers mentioned firing employees with diabetes to reduce employer costs was illegal, so to advise them to do it for a different reason if costs were an issue.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Practical_Advice2376",
                                            "body": "Employers should not provide health insurance, that only exists because they get a huge tax break vs consumers. Do employers provide your house and car insurance? Health should be the same.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "davisriordan",
                                                    "body": "Some do, depends on the job. The problem is there's levels of people based off career, or at least that's how they see it. No matter the system, it ends up spiraling towards being prohibitively expensive for those with the lowest income.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Plastic-Bluebird2491",
            "body": "The magic of third party transactions.   What's the common theme in housing, healthcare and high education?  3 of the most broken markets in the country - Ah yes- gov't intervention",
            "score": 22,
            "replies": [
                {
                    "author": "Anxious_Whereas_6736",
                    "body": "Yes. Many leftists boast Milton Friedman was wrong because he said that in 2020 people would work 15 hours a week. But the truth is that he could have probably been right if the three largest markets weren't destroyed by the government and half of their income taken by the government.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Xmanticoreddit",
                    "body": "NELA appreciates your contribution",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CoolTravel1914",
            "body": "College cost increase isn’t because of subsidies. Subsidies are why the most funded schools are often the cheapest. College costs rise because the tuition matches what the government is willing to lend. If they’ll allow an undergrad to indenture themselves for $200k, $200k is now the going rate.",
            "score": 37,
            "replies": [
                {
                    "author": "natermer",
                    "body": "The guaranteed student loan program is the subsidies. It eliminates risk on the side of the lender, heavily benefits the universities financially, while placing all the burden on the students (and often their parents). \n\nAnd since the students have gone to public schools so are lousy at math, have no understanding of personal finance, and have been propagandized their entire lives about the value of higher education... they don't realize how badly they are getting screwed over by the whole deal. \n\nNormally in loans there is natural self-regulation both in terms of lender and borrower. The borrower is taking risk by borrowing, the lender it taking risk by lending.  If you, the borrower, runs into bad luck and can't get a job and can't pay it off then the lender is shit out of luck. \n\nBy eliminating risk on the lender then it is effectively free money as far as they are concerned. Which is exactly what is going on with government-ran student loan program in the USA.  Since the borrower is not allowed to bankrupt out of a student loan then piling up fines and interest rates through missed and deferred payments just means more profits.  \n\nThey are pretty much guaranteed to make money regardless of the fortunes of the student borrower. Even if they end up bombing out and not getting a degree at all the lender still profits.  And so does the university. \n\nThe end result is effectively a \"college attendance tax\".  \n\nThe effect on prices is going to be the same as if the government simply taxed the crap out of anybody who has graduated from college with a 4 year degree and just used the money to pay for the next generation of students, and the next few decades of Universities profits.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "shiggidyschwag",
                            "body": "All true, but there were also traditional subsidies in the before times when government didn’t guarantee the loans from the lenders and students could get out of loans through bankruptcy. Back when there was real risk as you described, and tuition prices were lower, there were also federal subsidies to universities to help cover tuition costs and help the costs to students stay even lower.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "davisriordan",
                    "body": "Student loan program increased supply of college students, without a plan to utilize those degrees within the economy.\n\nI know at the very least Exxon did a high school STEM campaign to reduce pay competition for their work visa employees. Essentially, make more American engineers to hire work visa employees for less. Guess how it turned out?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "akindofuser",
                    "body": "Bingo. It’s basically a durable goods bubble of 2008 with no durable goods or asset pinned to it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "agolfman",
            "body": "If you think it’s expensive now, just wait until the government makes it free!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dollar_Bills",
            "body": "College is expensive because the government makes it impossible to default on the loan.\n\nHealthcare is expensive because the ACA gave them record profits and they needed to increase those profits because that's the only metric that matters for bad business",
            "score": 2,
            "replies": []
        },
        {
            "author": "MichigaCur",
            "body": "What's a million dollars when your used to spending hundreds of billions.... Smh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anxious_Whereas_6736",
            "body": "I don't like my bachelor's degree. \nI study economics, which is interesting but not enough for me to spend four years on this.\nMy degree is fully subsidized by my country and a scholarship I have. I pay absolutely nothing.\nBut even that I don't enjoy my degree and it teaches me almost nothing practical for my job I still study for it. This is because I would struggle to get a good paying corporate job without it.\nNobody would want to employ me.\nThe employers must pay me a minimum wage or above for internship. Which means that I my marginal productivity needs to be worth at least minimum wage plus training cost.  So employers don't want to take risks with someone who doesn't have a bachelor's degree. \nAnd let me tell something, I will probably study for a pointless master's degree abroad, because I want to immigrate and in many countries students get visa. If Joe wants to move to England let's say, he can't just accept a job that pays 80,000 pounds a year, but his friend Tom who studies a trashy master's can get a visa for his 40,000 pounds job.\nThat means that Britain gave up on a high tax payer with no degree for a low tax payer with a degree.\nMost students are like me. People like to lie that they enjoy college, but most people hate college, the same way that most people hate school. It's boring and pointless. \nThis is pure waste of time and money.\nWe need to eliminate minimum wage for internships (or always) and stop subsidizing higher education. And then cheap and efficient alternatives to academia will arise, and a very small number of people who are very suited for academia would go to university and pay for it.\nThe state should stop its pointless and destructive interventions in the market.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnyWeakness6062",
            "body": "Friedman explained it well in his four ways to spend money",
            "score": 1,
            "replies": []
        },
        {
            "author": "DifficultSmile7027",
            "body": "Aren’t insurance companies to blame for this as well?",
            "score": 0,
            "replies": [
                {
                    "author": "HotFoxedbuns",
                    "body": "No because by definition they want to minimise how much they pay out",
                    "score": 1,
                    "replies": [
                        {
                            "author": "impulsesair",
                            "body": "They do that by denying you and as many other people as they can the service you paid for.\n\nAnd when they do occasionally pay, they pay a lot. Because the ones who set the prices... know insurance can afford it.\n\nWhich sounds bad for insurance, until you realize that the high prices mean, people need or at least feel the need for insurance. And that's a win for insurance.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Syskokatak",
            "body": "Or, and hear me out, we make it where the subsidies to internet service providers for example or even medical insurance companies cannot be given while these companies charge obscene prices compared to other markets in industrialized countries while also not providing the services that the subsidies are given out for in the first place. Oh oh and also make it where these billion dollar industries cannot give money to campaigns for government officials, and also remove the recognition of corporations as people while we're at it! \n\nYou know, quit relying on corporations to solve our problems and instead take part in a government that is supposed to be representative of the human beings living in said country and run more like a cooperative than a tool of enslavement by the ruling class which stifles any real development or progress of humanity.\n\nJust an idea.",
            "score": -6,
            "replies": [
                {
                    "author": "comradekeyboard123",
                    "body": "I have a few ideas on how we can make the economy more democratic but that would be communist...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Xmanticoreddit",
                            "body": "I think you mean “socialist”.  Unless you’re being sarcastic.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "comradekeyboard123",
                                    "body": "I meant what I said. I use communism and socialism interchangeably.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Xmanticoreddit",
                                            "body": "The reason people use “communism” differently is because of the implied use of violence. What’s your hot take?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ok_Huckleberry1027",
                                                    "body": "Socialism also has an implication of violence.  When we can be imprisoned for lack of compliance the government is inherently violent and inhumane.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Xmanticoreddit",
                                                            "body": "So you just ignore the whole reason those are different terms?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "comradekeyboard123",
            "body": "I'm sure the government can compare the bills sent by multiple providers and pick the one with the lowest costs and the highest quality of service, no? That's what I do as a consumer when I buy goods.\n\nOf course, whether the government actually does this is a separate matter.",
            "score": 0,
            "replies": [
                {
                    "author": "plastic_Man_75",
                    "body": "Bold of you to assume the government has your best interest",
                    "score": 6,
                    "replies": [
                        {
                            "author": "bravehotelfoxtrot",
                            "body": "Or that government even has any way of knowing what his interests are.\n\nEven if the US had only a million citizens, the federal government *still* would have zero way to know of or have reason to care about any random person’s needs or wants.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jhoes11",
            "body": "Black-box-problem irl",
            "score": -1,
            "replies": []
        },
        {
            "author": "Themaskedsocialist",
            "body": "Thanks a lot capitalism …",
            "score": -7,
            "replies": []
        }
    ]
}