{
    "title": "Exactly what britain needed",
    "author": "Bialooki",
    "subreddit": "Warthunder",
    "rank": 14,
    "score": 1103,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 112,
    "url": "https://i.redd.it/a02a2ap38fpe1.png",
    "id": "1je1dtr",
    "selftext": "Now i g et to pick from 5 different SPAA's for my 10.3 lineup",
    "comments": [
        {
            "author": "Accomplished-Cow4686",
            "body": "We need SPAA to fill the damn 5.3 to 8.3 gap, not 8 SPAA at 10.0-10.3",
            "score": 636,
            "replies": [
                {
                    "author": "ThatMallGuyTMG",
                    "body": "dont forget gaijin is allergic to giving good stuff to brits",
                    "score": 218,
                    "replies": [
                        {
                            "author": "Accomplished-Cow4686",
                            "body": "I mean, Britain has good stuff imo, just that, a lot of it also suffers",
                            "score": 84,
                            "replies": [
                                {
                                    "author": "Nagodreth",
                                    "body": "The Rapier in the OP is literally an example of good stuff that Britain gets, it has been requested for a long time and is a non-prototype, non-copypaste vehicle that actually served with the UK military. The only bad thing about it is that it's at a really dense BR bracket.",
                                    "score": 106,
                                    "replies": [
                                        {
                                            "author": "PembyVillageIdiot",
                                            "body": "And the fact its missile are horrendous in game due to the microscopic warhead",
                                            "score": 40,
                                            "replies": []
                                        },
                                        {
                                            "author": "No_Anxiety285",
                                            "body": "It literally can't do damage",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "Rippthrough",
                                            "body": "And that it doesn't fucking work.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ottodeadman",
                            "body": "I guess the Fox, scimitar, fv4030, olifant mk2, rooi, strela, challengers, bishma, firefly, avenger(that just got a massive buff), better typhoon than Germany, the 4.3 typhoon,spitfires etc don’t exist then.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "AscendMoros",
                                    "body": "Fox and Scimitar just got a nerf, the bug report about it was an absolute joke. \n\nThe FV4005 has the largest conventional cannon in the game for a tank, can’t overpressure, has a 30 second reload and can be .50. I know you didn’t mention it but still worth a mention that a 183mm Hesh performs worse against armor then smaller HE rounds. \n\nDon’t think I’ve ever hear anyone call the Olifant op. As it’s a centurion at like 8.7 at the end of the day.\n\nPremium Rooi is still really good. Tech tree one with the 76 is just a dice roll on if it does any damage post pen. The MTTD is good. \n\nChallenger 2s are all terribly modeled and have things wrong with them that hurt the vehicle a lot. Good tanks. I say they’re off Meta. \n\nBISHMA is quite mid, as imo I’d rather use the Chally Mark3, or the Vickers. Reverse gears are helpful to have. \n\nFirefly’s and Avenger are really good. \n\nAnd yes they got a slightly better version of the EF then Germany. Yet it’s radar is bugged. And has been for three months. Good thing they nerfed the flight model before fixing its radar. \n\nI fox3 harriers are all new airframes except the British one. Making it way worse. Can’t go down though because of compression. \n\nBritain also could have gotten two different F18s this update and instead got a premium harrier worse then the American one. For their one air vehicle of the update. \n\nThe spitfires are great. Love them.\n\nI could go on, theres plenty of tanks that are good, and then theres a decent chunk of tanks Gaijin refuses to fix. LOOKING AT YOU TES. Made a fucking dev blog about how it was right even though anyone with a brian can see that it isn't. Like common sense says the 3x as big ERA blocks would protect from more kenetic damage then the smaller ones. Yet its a flat 30mm accross like three different types of ERA.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Accomplished-Cow4686",
                                    "body": "What buff did Avenger get?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "perpendiculator",
                                            "body": "Turret rotation speed is now on par with the firefly.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ThatMallGuyTMG",
                                    "body": "fox and scimitar were nerfed (i know someone else replied to you but im just gonna go over all of them) so they have a shit turret traverse; the fv4030 sits at a weird BR, where you either uptier \\*it\\* or something else, also it has the mobility of a drunk snail; the olifant has a single upside and thats the MMMMMMMMM crispy good sights, otherwise its almost as heavy as a leopard 2a4, is slow as hell, a massive target, 6.7 sec reload for a 105mm with average rounds is iffy, it has an abysmal turret traverse, and no armour; idk which rooikat you mean but the 105 is amazing, yes; strela is not british and everyone hates copy paste, also no radar so everything will go by 'has the enemy jet even rendered in yet', otherwise the missiles are great; DID YOU LEGIT SAY THE CHALLY FAMILY IS GOOD? fucking hell you're delusional; bhishma is just a turms for the brits so nothing to brag about; firefly had its vertical angles nerfed a few months ago, also unstable platform with AP in an APHE meta BR; avenger is actually playable now; and i cant say anything about planes cuz i play ground exclusively",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Pumper24",
                            "body": "No. They are allergic to anything that poses a threat to air units.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ActualWeed",
                            "body": "The vark spaas are good anti airs, you get the stabilizers at lower br's and of all the 7.7 super heavies you get the best one.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Gold-Comparison1826",
                                    "body": "Conq?.. the best?.......",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ActualWeed",
                                            "body": "Yeah and im tired of pretending it isn't. ",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "andrewads2001",
                                            "body": "Isn't it, I love it but the reload is quite ass",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Gold-Comparison1826",
                                                    "body": "Maybe if you like assists",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Mechronis",
                                                            "body": "Fuckin shoot better man",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "zxhb",
                                                                    "body": "You can shoot a crewman directly and the apds will vanish before hitting him",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Mechronis",
                                                                            "body": "The conq is quite literally one of my favourite tabks and I have been having an absolute blast in it outside of getting bumrushed by the occasional light tank.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "AscendMoros",
                                                                    "body": "Hits the ammo. Watches it go black and not explode. Guess I should have aimed better.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Mechronis",
                                                                            "body": "I have had that happen zero times so far man.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Gold-Comparison1826",
                                                                    "body": "Lol ok",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "CountGrimthorpe",
                                    "body": "Conq super underrated, but the French 7.7 heavies are just too dumb IMO.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Invicturion",
                    "body": "This..... Im sick and tired of using a skink at 7.0 while waiting for my falcon at 8.3",
                    "score": 12,
                    "replies": [
                        {
                            "author": "StarstreakII",
                            "body": "Someone suggested they should split falcon into the late and early prototype iterations, the latter gets its smoke dischargers and APDS, and the early just normal ammo. That would be great",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Positive-Duck3871",
                                    "body": "WE NEED THIS\n\nHonestly, the Falcon made me question the game design a lot. Why the heck does an SPAA has 150+ APDS rounds? Take them out - and it's suddenly just about 7.0...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "burnerredditmobile",
                    "body": "The bosvark works well above it's BR but it would be nice to see at least something around 7.0 to bolster until you get to 8.3.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "StarstreakII",
                            "body": "It’s giant size and limited fire angles offset it’s good AA firepower, it frustrated me so much I went back to the Skink.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Rippthrough",
                                    "body": "I stick with the Yestervark all the way up to the Falcon, better than both Bosvark and Skink tbfh",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "LightningFerret04",
                                    "body": "Funny enough I’m the exact opposite, the Skink frustrates me so much that I need use the Bosvark in my lineups\n\nAre the firing angles that hard to work around? All I need to do is spawn in, turn around and post up next to a building. Instant no-fly zone",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Big_Yeash",
                    "body": "Pure pain. Bluntly, Skink bad (above 7), and there's no 8.3 or real 8.0 lineup to match Falcon with! And she still has no radar.\n\nAPDS works, kinda, I guess at the BR but the tanks are soft as hell and have lots of other drawbacks.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AscendMoros",
                            "body": "There was an 8.3 Lineup for awhile. Then stuff like the Mark 3 Chieftain got moved up to the same BR as the much better Mark 5. Long story short, they had an 8.3, then Gaijin slowly moved everything up to 8.7. Same way they've done with each of the 4.7 SPAA's they've added.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Positive-Duck3871",
                                    "body": "Dunno, I feel something like Warrior + Marksman + ZT3A2/Striker + Vickers Mk. 3 + Scout should be fine.\n\nBut I play 8.7 with Rooikat instead of Vickers.\n\nOh, and 10.3 with Rooikat Mk. 1 and Superhind.\n\nYeah yeah, I'm out of my mind. It's fun though.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AscendMoros",
                                            "body": "I absolutely hated the Warrior. Its Fat, Slow for an IFV, Bad gun at least when i played it, no stabilizer, decent ATGM that is slow. Combine that with the fact you're at a BR where most nations have STAB when you don't. It just wasn't fun for me, most of my gameplay was watching the tank my missile was about to hit blow up.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Big_Yeash",
                                            "body": "I'm stuck at 7.7 and it's hard. I've had one good match in months, and it was playing \"come to me\" sat on the spawn ridge on my side of the map and waiting for their team to come to me.\n\nAny other map layout or objective set (including the same map but from the opposite spawn), and I cannot make Britain work.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Positive-Duck3871",
                                                    "body": "I absolutely loved playing 7.7. You have stabilizers, everyone else doesn't.\n\nCenturion 3 is a beast, Caernarvon (I feel like I misspelled it but you know) is the same but slightly more armor, Fox is OP.\n\nOh, and I love Conqueror. After researching the additional armor modification, this thing is almost unkillable with ATGMs.\n\nAn important thing: don't bring more than 9 ammo on Cent, Caen and Conq. Every single shell after that goes straight to your front. The first shot in LFP is fatal.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LUnacy45",
                                                            "body": "9 shells? That's like 3 kills with the APDS these things get, I get nervous if I have under 20 rounds in most tanks",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Positive-Duck3871",
                                                                    "body": "Well, it's enough.\n\nEspecially considering how much time Conqueror needs to fire all of them (not even counting the fact that you have a loader in the crew)...",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Offenbanch",
                    "body": "You cannot play against propped planes using unkillabe spaa with shilka's guns?)",
                    "score": -25,
                    "replies": [
                        {
                            "author": "Aiden51R",
                            "body": "Unkillable? Its very good but don’t talk like its a coelian.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "INeatFreak",
            "body": "You can have an entire lineup of SPAAs at 10.3 now",
            "score": 156,
            "replies": [
                {
                    "author": "Cardborg",
                    "body": "You can unlock the next BR rank solely by researching the SPAA line.",
                    "score": 59,
                    "replies": []
                },
                {
                    "author": "AnimeRoadster",
                    "body": "And you'd think that'd make the skies a No-Fly zone when facing Britain...",
                    "score": 30,
                    "replies": [
                        {
                            "author": "INeatFreak",
                            "body": "Don't be silly, this isn't Russia",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "MEIZOMEGA",
                                    "body": "sadly true, pretty much the reason i only play ussr now, bmp2m+ pantsir+ su34 go brrrrr",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zerocookiecake",
            "body": "I mean, if they removed the Osa and Strela it would be fine. I still don't know why they were added to begin with",
            "score": 214,
            "replies": [
                {
                    "author": "ThatMallGuyTMG",
                    "body": "cuz hurr durr indian subtree. they'd rather give some foreign copy paste to fill the gap than to actually do work and give domestic productions",
                    "score": 130,
                    "replies": [
                        {
                            "author": "creator712",
                            "body": "It filled a non existend gap too. They had the Stormer HVM and AD at 10.0/.3\n\nThey could have added only Rapier instead of Osa and Strela and everyone would be happy",
                            "score": 74,
                            "replies": [
                                {
                                    "author": "PembyVillageIdiot",
                                    "body": "Except you’d be back to the British can’t have nice things narrative because both the HVM and the rapier are trash in comparison",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "thegriddlethatcould",
                                            "body": "Well the nice thing about the rapier is its less massive than the osa and has smokeless motors making it much easier to hit aircraft.\n\nNow the abysmal warhead is ass.",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "SerpentStOrange",
                                            "body": "The HVM creates a heli no-fly zone and the Rapier (with the Mk2 missiles) is good at swatting planes from the sky and comparable to the OSA. The Mk1 missile is shit though and the Mk2 should be stock.\n\nThe Strela is admittedly nice for it's IR missiles, the Stormer AD is *fine* against low strafing cas but it really should be moved down to 9.7 at a minimum, 9.3 preferably.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "AscendMoros",
                                                    "body": "Stormers Star Streak Missiles while great against Helis, are still tied to ping. Which has been years at this point. They can protect themselves against light enough vehicles sides. Like an HSTVL",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "SerpentStOrange",
                                                            "body": "I mean every weapon system in the game is tied to ping. It's just most notable when you are trying to guide a mach fuck.0 tungsten dart into the cockpit of a moving jet 5 kilometres away. \n\nUnfortunately there's not a realistic solution for Gaijin to make the Starstreak usable on 100+ ping without making it very unfair for the recipient of the missile. \n\nJust like in fighting games, mobas, shooters etc unfortunately some characters/heroes/vehicles are more ping-dependent than others. I'll probably get downvoted for this, but that's just the reality of the situation.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "inconstantdespair-44",
                            "body": "I ain't complaining. 👍",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kopernagel",
                    "body": "They are copy paste so gaijin can claim they implement vehicles in other techtrees while putting in 0 effort",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Former_child_star",
                    "body": "Would make sense for a commonwealth sub tree",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Bialooki",
                    "body": "I can't get a grasp on it either that Strela was dominating  as SPAA and suddenly they gave others both Strela's and Osa's",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "IDontGiveACrap2",
            "body": "Man, either they really fucked this thing up or it’s just bad. \n\nMost of the time firing from the frontal arc, the missiles don’t track and just wonder off into space.\n\nTheres a bug report for it, but what’s the point in the dev server when fundamental issues like that just go ignored and shit gets released in a broken state anyway.",
            "score": 18,
            "replies": [
                {
                    "author": "sadcat_jpg",
                    "body": "It took 6 missiles to knock out the slow bomber flying overhead in test drive, like 4 for the helicopter, and that's when the missiles were being responsive enough to actually follow my crosshair. Even for British standards, this is terrible.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "MyNameWasTaken2020",
                            "body": "I had this same fucking problem. Shot 6 missiles at the MiG-15 and only got hits and last one cut it's wing off. Like happened multiple times even after restarting the test drive. Shit does literally like 0.1 damage. Shit is so fucked wth",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "DutchCupid62",
                            "body": "What the hell are you doing that makes it take that many missiles??? Like serious question, because everything I shot at in the test drive died in 1-2 missiles.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Theartofmemeology",
                    "body": "even though it isn't british the ADATS is in the exact same boat lol  \nalbeit it's 100x better than the rapier it still doesn't have half of its irl features that would make it competent  \nntm there's been an accepted bug report on it for almost a year and nothing's changed",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "smokey032791",
            "body": "UK 10.3-10.7 is pretty spicy",
            "score": 13,
            "replies": []
        },
        {
            "author": "allenz6834",
            "body": "Meanwhile usa, china, japan, Israel and Italy",
            "score": 36,
            "replies": [
                {
                    "author": "AscendMoros",
                    "body": "Cool? Britain isn't in a much better boat. They've just got small batches of SPAA. Like from 5.3-8.3 there is no spaa, but theres 3 at 8.3. Then once again no SPAA to 10.0. Then its five SPAA from 10.0-11.0. \n\nThen there's the ADATs at 11.7.\n\nGaijin for some reason just refuses to give America or Britain a new top of the line SPAA. And They seem to refuse to add British SPAA outside of like 2 BRs after 5.3.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Novakine",
                    "body": "France too. Mistrals are nerfed at least by 2 times in terms of max G, for example. The flight model also sucks ass. Not to mention that the Rolands wobble like crazy.\n\nAs for the Mistrals on the SANTAL, I found this nice excerpt. Btw, you can only lock helis at around 2.5km in-game: \"The Rodeo-2 radar can detect helicopters camouflaged on the ground at ranges above 6 km, and those in open positions - at ranges above 8 km. The range of detection of flying aircraft and helicopters exceeds 12 km\".",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Suitable_Bag_3956",
            "body": "Yes, unironically (I hate CAS).",
            "score": 37,
            "replies": [
                {
                    "author": "Tuga_Lissabon",
                    "body": "You're doing everything nice, dueling with another guy trading shots at range, then a bomb lands on you or him and ruins it. Hate it.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Toerbitz",
                            "body": "Got a nice flank off with my buddy. Get laser guided bomb direct hit. Spawn back in with ticket to help him. Drive 5 meters and get bombed by the same guy again. Fun game thanks gaijin. Guy had 1 and a kill btw before hopping in his plane and going top of the scoreboard with 5 kills and a cap",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Tuga_Lissabon",
                                    "body": "You go round the flank, prepared to do your run in - blast. Return, finally get into position, get a shot off and cripple it, charge in to finish the work - blast.\n\nFFF\\_\\_\\_\\_\\_OFFFF!!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Positive-Duck3871",
                    "body": "Yes.\n\nI rush the point to get my downtiered heli.\n\nWhile I fly to the battlefield (love the 7km distance at 8.3) hear another heli\n\nIt's a Mi-24 which kills me with UNGUIDED ROCKETS\n\nSpawn in SPAA\n\nGive him ~20 \"Hit\"s\n\nDie from a plane \n\nRespawn in the same SPAA with a ticket\n\nHeli dies the moment you spawn\n\nKill the plane\n\nDie from another plane.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThatChris9",
            "body": "The 2 Stormers and the rapier. That’s all that is needed at this BR",
            "score": 19,
            "replies": [
                {
                    "author": "IncognitoAlt11",
                    "body": "The Rapier might be one of the worst AA in this game.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Positive-Duck3871",
                            "body": "Rapier - not so.\n\nI'd say HVM is much worse, since its stated 47g is actually just above 15. This thing can't hit a Canberra in a turn...",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "IncognitoAlt11",
                                    "body": "We are using different vehicles. The HVM can actually kill what it hits. Very effective against helis. The Rapier is shit all around.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lmaopavel",
            "body": "now Britain has 5 spaa's on 10.0-10.3 and 3 spaa's on 8.3 with 1 of them being rank lower. that's cool having a lot of vehicles to chose from, but there are bigger gaps in GB + still 0 usable spaa for Israel",
            "score": 8,
            "replies": []
        },
        {
            "author": "SableFarm",
            "body": "Didn’t people ask for the Tracked Rapier to be in the game? This was pretty much expected.",
            "score": 4,
            "replies": []
        },
        {
            "author": "blehblehbleh83",
            "body": "How many SAM's between 10.0 and 10.3 does one nation needs\n\n\nJesus.",
            "score": 3,
            "replies": [
                {
                    "author": "AscendMoros",
                    "body": "It’s even better when your realize they have none between 8.3-10.0. And none from 5.3-8.3. Like stop fucking adding SPAA to the gaps that are already filled. As I take a plane for my 7.7 SPAA.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Bialooki",
                    "body": "Yes.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Benzoat_",
            "body": "I just want a better Anti Air System for 11.7 instead of the ADATS a little more range would be amazing",
            "score": 5,
            "replies": []
        },
        {
            "author": "Treners",
            "body": "What we needed was a better top tier option... India has signed a contract to produce pantsirs, I'm just sayin :)",
            "score": 7,
            "replies": [
                {
                    "author": "Positive-Duck3871",
                    "body": "Really? Because I found a South-African SAM carrier, called \"Umkhonto\".\n\nBasically, it's even better than Pantsir.\n\nThere's this launch range of 60km, AND 50g missiles, AND it even has some armour (probably enough to tank a 7.62).\n\nBut Pantsir is what we need. I should search it up myself. Thanks for the info.\n\nP. S. You know there were some pretty funny planes for UK in datamines?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "vanillaice2cold",
            "body": "The Rapier is so ass unironically, you can shoot multiple missiles spot on with it and only get hits",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dear-Cow-9465",
            "body": "It also does no damage whatsoever, possibly bugged",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gold-Comparison1826",
            "body": "Worst part is the Rapier could be 9.7 and the Stormer AD at 9.3 :/",
            "score": 2,
            "replies": []
        },
        {
            "author": "StrwBerrywafersslap",
            "body": "I pray that by the time I get to 10.0 I will have Britain on my side so I can see those CAS Rats be ERADICATED",
            "score": 4,
            "replies": [
                {
                    "author": "Dirty_Soil32",
                    "body": "Yeah youre expecting a bit much from them",
                    "score": 5,
                    "replies": [
                        {
                            "author": "StrwBerrywafersslap",
                            "body": "its better than nothin",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sarsburner",
            "body": "and it doesnt work at all on launch\n\nthe missiles actually deals no damage, failing to kill the test drive zsu, and kill a plane with less than like 4 missiles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Teach2359",
            "body": "10.3 British spaa only lineup goes hard",
            "score": 1,
            "replies": []
        },
        {
            "author": "cdhmedia",
            "body": "I have no complaints tbh, they all fill a different role and let's you pick and choose what you want to use. We defiantly need a 9.3ish aa though.",
            "score": 1,
            "replies": [
                {
                    "author": "Positive-Duck3871",
                    "body": "Not really related, but could you explain your flair pls?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "cdhmedia",
                            "body": "I would like the ajax ifv in the game, has been passed to devs but it takes ages for it to be implemented.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Positive-Duck3871",
                                    "body": "ok, thanks",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Snipe508",
            "body": "Community \"we need spaa between these specific br ranges for all nations aside from russia\"\n\nSnail *gives more spaa to ussr/Germany, at 10.0*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Successful-Price-514",
            "body": "I don't know if other people have had the same issue but so far the Rapier seems entirely useless. Just playing about in the test flight it sometimes takes about 6 missiles to kill anything. Seems like it might be an issue with the missile proxy fusing so early they do LITERALLY ZERO DAMAGE to the AI aircraft - even when the helicopter is basically stationary they do fuck all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EM2Hero",
            "body": "On side note since everyone is mentioning copy pasta, here's me hoping that the British tech tree gets some proper commonwealth love with vehicles such as the Canadian and Australian copy paste vehicles like the CF-18 Hornets, F-101 Voodoo, M1a1 Abrams, AVGP/LAV-1's, LAV-3's, and even some domestically produced vehicles such as the CF-100 Canuck, and the AVRO Arrow. I would actually spend the money to get the Arrow.",
            "score": 1,
            "replies": [
                {
                    "author": "Totally-Real-Human",
                    "body": "100% yes\n\nI want the raaf f18 with asraams, the mirage III O, the CAC Sabre, the Aslav varianrs, Leo AS1, the weird M113s, the macchi MB336H, the bushranger Huey, the ARH tiger and more\n\nI mean, tiger ARH is a no brainer at this point, it would give the UK more than just 1 non premium heli at top tier, and it's the last tiger variant not in game\n\nAnd the raaf hornet could be the perfect platform to introduce the asraam, which is missing from the typhoons and the Indian jaguar\n\nI just hope they keep everything in the British tech tree and not spread it out. I wanna do a full Aussie line up, it's so frustrating the AIM is in the us tree. They could have just used the morrocan SA which is the exact same model as the AIM just with depleted uranium, instead and put the AIM as a UK squadron vehicle.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AscendMoros",
                    "body": "The Brits will probably get an F18 6th months from now as a selling point in an update where they get nothing else.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dtc8977",
            "body": "AND the Rapier SUCKS!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Promcsnipe",
            "body": "Goddamnit, right when I’ve almost finished researching the Stormer AD because I can’t buy my ADATS until I’ve researched Stormer and OSA",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImShockin",
            "body": "Jimmy Savile is in the lineup?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Esteban-vz",
            "body": "Idk if im dumb but in the test drive i only get hits with no damage",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pumper24",
            "body": "They seriously need to stop adding aa to 7.0 and up and bulster everything below it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "boilingfrogsinpants",
            "body": "Israel's best SPAA is 9.7 btw. Britain has been handed 4 SPAA in the 10-10.7 range in the past 6 months. Israel still doesn't have a single radar SPAA and is absolutely miserable to play above 9.7 because of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LemonadeTango",
            "body": "\"Oi, bruv, fancy you got your flyin' loicense?\"",
            "score": -1,
            "replies": []
        },
        {
            "author": "EM2Hero",
            "body": "On side note since everyone is mentioning copy pasta, here's me hoping that the British tech tree gets some proper commonwealth love with vehicles such as the Canadian and Australian copy paste vehicles like the CF-18 Hornets, F-101 Voodoo, M1a1 Abrams, AVGP/LAV-1's, LAV-3's, and even some domestically produced vehicles such as the CF-100 Canuck, and the AVRO Arrow. I would actually spend the money to get the Arrow.",
            "score": -1,
            "replies": []
        },
        {
            "author": "gugngd",
            "body": "Pov: you misspell the new vehicle",
            "score": -6,
            "replies": [
                {
                    "author": "AscendMoros",
                    "body": "Don't worry Gaijin didn't even make sure the missiles were useable before adding them to the live sever.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}