{
    "title": "I think I know why the update took so long",
    "author": "MrPigeon70",
    "subreddit": "Warthunder",
    "rank": 10,
    "score": 1503,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 77,
    "url": "https://i.redd.it/fjd8d7dw7fpe1.png",
    "id": "1je1cjd",
    "selftext": "its so detailed?!",
    "comments": [
        {
            "author": "DAS-SANDWITCH",
            "body": "What vehicle is that?",
            "score": 214,
            "replies": [
                {
                    "author": "MrPigeon70",
                    "body": "AH-64",
                    "score": 145,
                    "replies": [
                        {
                            "author": "EnduringFrost",
                            "body": "The amount of detail into this is crazy, especially considering that for helicopters a grain of rice makes it explode regardless.",
                            "score": 69,
                            "replies": [
                                {
                                    "author": "MrPigeon70",
                                    "body": "I 100% support them doing this but please bomber cockpits first",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "VinPre",
                                            "body": "There are no bomber cockpits in ba sing se.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "ABetterKamahl1234",
                                            "body": "> but please bomber cockpits first\n\nGotta make people both want to have bombers exist in air, but also want to fly bombers in cockpit outside of sim (or planes in general) to really make this make literally any sense from both business and development priorities.\n\nCause damn, module accuracy is a legitimate gameplay impact.\n\nCockpits don't have a gameplay impact, it's purely visual, but costs a ton of money to develop, bombers specifically cited at roughly the cost of a full single-seat fighter (cockpit included). \n\nIt doesn't make any sense to put this over a gameplay impact expense. \n\n\n*I like bombers* and this argument doesn't make sense to put a visual improvement over a gameplay one.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Flash24rus",
            "body": "[Model could be bought](https://www.turbosquid.com/3d-models/3d-apache-engine-model/838217) and imported with some changes",
            "score": 56,
            "replies": [
                {
                    "author": "Dino0407",
                    "body": "Why are there such 3d models lol",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Altawi",
                            "body": "Think of it like stock images.\n\nThey are useful in their own way and they cut down on unnecessary development time and expenses.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Dino0407",
                                    "body": "I'm not questioning why they are using such assets, I'm questioning why such assets exist",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MrPigeon70",
                                            "body": "Aviation enthusiasts",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Shredded_Locomotive",
                            "body": "Outsourcing but easier.\n\nIf there are potential buyers they will keep making them.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Srgblackbear",
            "body": "That's-\n\nI mean it looks awesome!\n\nBut, too much snail, too much, please add creative vehicles instead",
            "score": 177,
            "replies": [
                {
                    "author": "MrPigeon70",
                    "body": "This. It's nice and all but please focus that talent elsewhere",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Srgblackbear",
                            "body": "Boy I can't wait for another batch of T-80 premiums",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "czartrak",
                            "body": "THESE MODULES WERE LITERALLY VOTED FOR BY THE FUCKING PLAYERBASE",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Dino0407",
                                    "body": "Yes, however I don't think that the majority meant for it to be this detailed and therefore costly",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "MrPigeon70",
                                    "body": "BACK TO r/foundtheprotogen WITH THY SWEARING ASS!",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Miserable_Cloud_1532",
                                            "body": "Lol",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HMS_Great_Downgrade",
                    "body": "Gaijin i'm still waiting for my Alvis Saladin, Scorpion 90 and Contentious I.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DanielWhiteShooterYT",
                    "body": "Gaijin where's my CATTB?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThisIsntAndre",
            "body": "Stuff like that is why we lack content btw",
            "score": 749,
            "replies": [
                {
                    "author": "WillMcNoob",
                    "body": "we dont, gaijin outsources the modelling",
                    "score": 415,
                    "replies": [
                        {
                            "author": "Fantastic_Bag5019",
                            "body": "Their response for not modeling bombers is that it costs too much due to how long they take to model.\n\nSo yes, it is.",
                            "score": 343,
                            "replies": [
                                {
                                    "author": "Dramatic-Bluejay-",
                                    "body": "Or, hear me out...\n\nIt's because Gaijins being cheap asses.",
                                    "score": 204,
                                    "replies": [
                                        {
                                            "author": "Tessaaa58",
                                            "body": "Or because they’d rather spend their resources on things a larger % of the playerbase interacts with.",
                                            "score": 75,
                                            "replies": [
                                                {
                                                    "author": "Dramatic-Bluejay-",
                                                    "body": "Or maybe no one plays bomber because they don't put any resources into making them fun to play in the first place? \n\nBut no your right, the majority of the playerbase do love counting the increasing amount of engine polygons while in x ray. Such a meaningful quality of life improvement.  /s  🙄\n\nStruggling Indie company btw, how much are those new premiums again?",
                                                    "score": 115,
                                                    "replies": [
                                                        {
                                                            "author": "monstargh",
                                                            "body": "I miss the old bombers where you had to be always moving around at under 900m or risk getting shot by even the ai gunners, made it so bombers were fun to play caus you could actually make a bombing run before being swarmed and shot down by a bf109",
                                                            "score": 34,
                                                            "replies": [
                                                                {
                                                                    "author": "Madalossooo",
                                                                    "body": "I miss the old times when we had to really fight for our food",
                                                                    "score": 9,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Davies301",
                                                            "body": "The fact they probably see more play in Ground RB than actual Air Battles is a pretty big glaring issue.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Tsunami-Piggy2008",
                                                                    "body": "I hate planes in ground rb",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ABetterKamahl1234",
                                                            "body": "> But no your right, the majority of the playerbase do love counting the increasing amount of engine polygons while in x ray. Such a meaningful quality of life improvement. /s 🙄\n\nTo a degree, you can at least argue there's gameplay reasons to want accurate module models, as it increases the accuracy of damage.\n\nCause like, we could save a ton of time and money on development and have generic blocks, too. It'd probably even decrease the \"need\" for premiums to pay for things too. \n\nI love accurate damage models, it's pretty important to gameplay.",
                                                            "score": 0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Velo180",
                                                            "body": "He is right, though. Gaijin could do literally every single improvement suggested over the last 12 years for bombers and they would still be a small majority of the playerbase deserving less dev time and resources.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TheFalkonett",
                                    "body": "Outsourcing still costs different amounts of money depending on how long a job takes.",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "SteelWarrior-",
                                    "body": "The cost they've given us per cockpit is like 20k, far fewer people care about the bomber cockpit than care about the AH-64.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Fantastic_Bag5019",
                                            "body": "Less people care about bomber cockpits than an engine model that you can only see the outline of in the hangar?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "SteelWarrior-",
                                                    "body": "You can see this in game at any point, outside of sim.\n\nPossibly, I certainly know more people want to play any helicopter than any bomber. It would be a massive resource sink to model a detailed cockpit for every single bomber and there is so little value to the playerbase because only such a small fraction would even care. \n\nA helicopter engine being modeled to a higher degree may not matter much to you or I but surely you can see the difference in spending money to appease a miniscule fraction of players who fly bombers in sim and those who fly helicopters.",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ABetterKamahl1234",
                                                    "body": ">  than an engine model that you can only see the outline of in the hangar?\n\nDoesn't this model act as the collision model for module damage?",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "_maple_panda",
                            "body": "I was under the impression that they outsource exterior/visual models but do the damage model modeling in house.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Claudy_Focan",
                    "body": "We dont need content, we need QoL updates, more game modes, maps tied to BR ranges and AB/RB/SB modes",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Destroythisapp",
                            "body": "Right. I’m happy with the amount of content, there is literally years and years and years of content for the average player. \n\nWhat we need is exactly what you said. Game modes and maps.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hobelonthetobel",
                    "body": "haha wtf? \"we lack content btw\" WT is the game that puts out the most content in its field, more than any other. \n\n\n\nno other game or soft sim has so much content.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "EarNatural1915",
                            "body": "the only content they put is reskins and copy pasta",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "InattentiveChild",
                                    "body": "I'd still be happy with the remaining content if Gaijin got rid of all the C&P (referring to the vehicles that are straight up just reskins), in fact, I'd be delighted.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Khomuna",
                    "body": ">we lack content btw\n\nBrother, there's 5 updates every year, with like 20 vehicles in each of them and has been that way for over 10 years. What content are we lacking?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "swagseven13",
                    "body": "the only content we actual need is more game modes",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "SeeminglyUselessData",
                    "body": "Not even remotely. This doesn’t matter and it’s great to see detailed modules.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "UnmannedConflict",
                    "body": "Y'all are never happy with anything fr",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ma_wee_wee_go",
            "body": "Give Heli propeller blades actual damage models so they can be damaged by weapons ❌\n\n Change the impact logic so they receive varying damage from impacts rather than clipping a branch breaking the same as flying into a building ❌\n\nGive propellers pulse Doppler returns so they can actually be seen by CAP ❌\n\n4k ultra high definition visual model of the APU which does literally nothing if it breaks ✅",
            "score": 16,
            "replies": []
        },
        {
            "author": "HondaOddessy",
            "body": "yeah, it really pisses me off. Instead of making modules for other helis, they spent unnessary amount of time on a module where you can't see it. A block would've been just fine",
            "score": 11,
            "replies": [
                {
                    "author": "InattentiveChild",
                    "body": "It's a non-issue. It's a bad trait to get infuriated that easily on the internet.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NERPAE",
                            "body": "Says the one calling someone a dumbass 10 days ago for not agreeing on your assessment of a comment he left.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "HondaOddessy",
                            "body": "guess we both have that bad trait",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Impressive-Money5535",
            "body": "So we haven't got modeled bomber cockpits, but dw we can see each part of our tank's engine. Amazing.",
            "score": 24,
            "replies": [
                {
                    "author": "45-70_OnlyGovtITrust",
                    "body": "Costs too much money to make bomber cockpits that no one will see or use comrade! Instead, have this 5,000 polygon engine module model that you will literally never be able to see.\n\nOh, also, here’s this new $90 premium aircraft. ",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Impressive-Money5535",
                            "body": "Honestly I love B-17s and it just feels like they are spitting in the face of these historic machines.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "45-70_OnlyGovtITrust",
                                    "body": "It’s beyond the point of being ridiculous. Very lazy and offensive to just not give a shit like they do.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CobaltCats",
            "body": "I assure you dear player, that was completely and Totally necessary",
            "score": 3,
            "replies": []
        },
        {
            "author": "WinkyBumCat",
            "body": "Adding internal components has been a complete waste of time.  It has had no impact on the survivability or effectiveness of helicopters.  If it did we would have seen them get a BR decrease, right?   Right??\n\n\nI mean surely it couldn't be the case that they actually just pull the BRs out of their arses, could it??",
            "score": 24,
            "replies": [
                {
                    "author": "ABetterKamahl1234",
                    "body": ">I mean surely it couldn't be the case that they actually just pull the BRs out of their arses, could it??\n\nStarting BRs are more or less this, changed and updated as performance dictates.\n\nKind of how balancing should be done in games, rather than knee-jerk changes without consistency. Like, if this makes a big impact, sure, BR decrease, but if it doesn't really do a whole lot in the grand scheme, why buff it for the sake of buffing it by decreasing the BR?\n\nYou want big impact things to bring BR changes directly, with how helicopter damage models currently work, I'm not sure this will make a huge enough impact, but time will tell.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beep_in_the_sea_",
            "body": "Lmao it's actually hilarious",
            "score": 6,
            "replies": []
        },
        {
            "author": "vinitblizzard",
            "body": "Orgasmic ahh engine model. Will make sure to eyegasm when I login next time",
            "score": 2,
            "replies": []
        },
        {
            "author": "HANANASLP",
            "body": "You are already done; I still have 17 more hours to go.",
            "score": 1,
            "replies": [
                {
                    "author": "MrPigeon70",
                    "body": "Good luck",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ALocalBarista",
            "body": "\"new helicopter patch has 1million+ polygons!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medj_boring1997",
            "body": "You should take a look at the Mi-8s",
            "score": 1,
            "replies": []
        },
        {
            "author": "R_122",
            "body": "Rare naval W?",
            "score": -16,
            "replies": [
                {
                    "author": "aaf191",
                    "body": "Its a heli..",
                    "score": 54,
                    "replies": [
                        {
                            "author": "Dry-Alternative-7152",
                            "body": "i can see the resemblance at first glance",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "AppleOrigin",
                            "body": "i thought it was a tank 😭",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "R_122",
                            "body": "😭",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "aaf191",
                                    "body": "naval never wins :sob:",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RyuShev",
                            "body": "its a big brain satire post about the fact that whatever something may be, its never a naval W",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "aaf191",
                                    "body": "forgotten gamemode..",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "talhahtaco",
                    "body": "Nonexistent naval w",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MrPigeon70",
                    "body": "Altho this is a heli I will say the naval internal models are fairly well done",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Odd-Anybody8398",
                    "body": "bro's getting shit on for no reason xd",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}