{
    "title": "Yeah, I totally believe that one of the worst top tier tanks priced at $70 is a \"best seller\", Gaijin.",
    "author": "estifxy220",
    "subreddit": "Warthunder",
    "rank": 16,
    "score": 107,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 31,
    "url": "https://i.redd.it/lueq87nxjipe1.png",
    "id": "1jeg11g",
    "selftext": "",
    "comments": [
        {
            "author": "Bluishdoor76",
            "body": "I mean, I've seen several of them already in just a few matches so I'd say it's selling pretty well.",
            "score": 56,
            "replies": [
                {
                    "author": "estifxy220",
                    "body": "I'm genuinely surprised to hear that. I haven't played top tier since the update so I guess I gotta go and see for myself too.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Impressive-Money5535",
                            "body": "I'm not. This game has a huge number of whales that throw money at it without any thought whatsoever. You could literally add a tank which is slow, has no armor, is huge and all it's main gun does is a fart sound effect, price it at 80$ and people would still buy it. ",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "bane_undone",
                                    "body": "Honestly interested in the fart mechanic. $80 you say?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Impressive-Money5535",
                                            "body": "Yes 80$ indeed. But for 150$ you get the fart mechanic AND a snail decal! What a deal am I right?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "StevoMS",
                                    "body": "The Challenger 2 OES' gun isnt that bad.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kal69er",
                            "body": "When people mention whales they aren't really making something up. There's actually people who spend thousands and thousands of dollars on this game, and other games.\n\n\n\nOfcourse doesn't mean that everyone who bought this is a whale, but there's also people who are more conservative with their spending, but not to the point where they don't mind spending $70 on a vehicle.\n\n\nSure if you want to grind Italy you could start with the pzh2000, or the OF-40, but most of these people probably just buy whatever is the highest tier.\n\n\nThere is also the centauro, which I'm sure a decent amount of people bought too. But even though the ariete has bad armor for an MBT, you're generally probably better off in an MBT compared to the paper thin armor of the centauro.\n\n\nSo this drops and people buy it. Some may buy it to have an extra vehicle to play along the centauro they had already bought.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zsmudz",
                    "body": "Yeah people are dumb enough to buy it because they want to grind out the Italian tech tree. Spoiler alert, it’s a lot more fun to do it without a premium vehicle.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bluishdoor76",
                            "body": "It's fine if you don't wanna play with the WW2 vehicles imo. But honestly, Italy already had 2 damn good prems with the Vrcc and the Centauro. The Ariete is a bit redundant in terms of prems except for it giving you an mbt prem option if that's what you prefer.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skelezig",
            "body": "I bought it, so that definitely made it a best seller.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Visible_Structure762",
            "body": "Well DM53 in a premium is pretty bonkers",
            "score": 20,
            "replies": [
                {
                    "author": "Personal-Amoeba-4265",
                    "body": "Orrrr.... Just squadron unlock leopard 2 pl....",
                    "score": -13,
                    "replies": [
                        {
                            "author": "Maslaw05",
                            "body": "It gets DM43 tho",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "MLGrocket",
                                    "body": "honestly i don't see why it didn't get DM53, it was going to when it went up to 11.7, same time as when the click bait and the tech tree HC went to 11.7 and got M829A2, but gaijin decided right before implementing the BR changes that it shouldn't get DM53",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SuppliceVI",
                            "body": "Last time I checked I couldn't grind the greatest wheeled battle implement, the Freccia, with the L2PL",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Superb_Worth_5934",
            "body": "Honestly, we’re in a little bubble in this sub Reddit. You’d be surprised how many players play that just don’t give a fuck and pay whatever just to play the vehicle they want.",
            "score": 1,
            "replies": [
                {
                    "author": "Ikaruga1",
                    "body": "This",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crankylamp",
            "body": "Never been destroyed by any ariete until today. Tiday i were destroyed by 6 diffrent players in their premium ariete",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeautifulHand2510",
            "body": "I throw my kf41 and freccia in with my 2A7 lineup and it works so well Italy above 9.3 isn’t that bad to play it’s fun in my opinion but it isn’t great either it’s a grey area.",
            "score": 4,
            "replies": [
                {
                    "author": "Primary_Ad_1562",
                    "body": "I love Italy for the variety. I have the kf41 and freccia as well as the centauro 120. Just so many fun light tanks even if gaijin doesn't buff them often cus Italy.\n\nRIP otomatic",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zsmudz",
                    "body": "I would argue that Italy below 9.3 is better honestly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pieckfromaot",
            "body": "im gonna love getting shit on by it",
            "score": 1,
            "replies": [
                {
                    "author": "Zsmudz",
                    "body": "Is this a certified skill issue?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dry_Acadia_9312",
            "body": "Even bad tanks can be pretty fun, and it’s a top tier grinder for Italy which has its own niche of players",
            "score": 1,
            "replies": []
        },
        {
            "author": "bruno_hoecker",
            "body": "I'm seeing it a lot, you would be surprised.",
            "score": 1,
            "replies": []
        },
        {
            "author": "igotherb",
            "body": "Anything with the word ariete is trash at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Condottiero_",
            "body": "Let people buy it, more play Italy is better for the TT.\n\nPS though it seems there is no hope they fix \"heavy air\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Excellent_Silver_845",
            "body": "Imagine buying that, even better imagine grinding italy above 9.3 br",
            "score": -8,
            "replies": [
                {
                    "author": "mazzymiata",
                    "body": "The ariete (p) is very good.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Ulfur64",
                            "body": "Plus, Freccia and Leo 2a4 just carry",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "estifxy220",
                    "body": ">imagine grinding Italy above 9.3 br\n\nItaly 10.7 lineup is pretty good. The Dardo and VCC 80/30 are some of the most enjoyable IFV's I've ever played.",
                    "score": 11,
                    "replies": []
                }
            ]
        }
    ]
}