{
    "title": "Think of the comments as inverted Uber ratings. (click to find out what this means)",
    "author": "eganist",
    "subreddit": "relationship_advice",
    "rank": 0,
    "score": 286,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 103,
    "url": "https://www.reddit.com/r/relationship_advice/comments/1dc8ke8/think_of_the_comments_as_inverted_uber_ratings/",
    "id": "1dc8ke8",
    "selftext": "I last posted a variation of this a little over 5 years ago. We're a little overdue for a repost.\n\n---\n\nYou know how every Uber rating is right on the verge of 5 stars unless something's particularly off? Everyone's all \"A+++ would ride again.\" Same for eBay, Amazon, etc.\n\nYou can think of /r/relationship_advice comments in much the same way, only inverted. Just about every post here talking about a problem is going to be a magnet for \"break up with them\" and \"get rid of them\" comments. Two things to keep front of mind when you're submitting:\n\n1. The vast majority of people posting here are posting because they've got a challenge they probably haven't been able to resolve on their own. \n\n2. In many cases, these challenges are either insurmountable or exceedingly difficult to manage. \n\nThe majority of commenters aren't *necessarily* cynical/assholes, but combine both a one-sided account of what happened—your account—with each commenter's own potential history, grievances, etc., and the resulting brew is pretty dark, meaning that every post will get drenched in comments suggesting ending the dynamic. \n\nThe number of serious comments suggesting _an alternative to ending things_ is a good way to tell whether or not there's merit to, well, ending things. I'll carry that Uber analogy a bit further:\n\n* Let's say you're asking about behavior that's so bad, the red flag's basically bleeding. Nearly every single comment will tell you to run, and you're having a hard time finding well-reasoned counter-arguments to it. Sounds like running is good advice. **Zero stars** on our inverted Uber scale; the relationship is cooked.\n\n* Together but your s/o cheated on you once? Most comments will probably tell you to run because \"once a cheater, always a cheater.\" Some comments might suggest you should stay and work it out, but the details of how the cheating happened might vary the number of these comments. Great; **One or Two Stars.**\n\n* Married but your s/o got drunk and made out with someone else, felt awful about it, immediately left the event where they met that other person and told you what happened and apologized with no prior history of cheating? Many people might _still_ tell you to leave (same reason), but odds are good that a fair number of people might suggest staying. Awesome; **Two, maybe even three stars.**\n\n* Good relationship with your S/O but they forget to treat you in the love language you normally need to thrive? Maybe they forget to bring you token flowers/trinkets or other signs of appreciation but otherwise everything's pretty good? Many comments will probably be advice on how to communicate; there'll probably still be a good number of people suggesting you should just leave, but you can take these with a grain of salt. **Three to four stars.**\n\n* Everything's rosey and you're looking for a way to celebrate your s/o's special promotion, anniversary, birthday, or something else? There'll be a few trolls who tell you to break up for asking the subreddit for advice, but it sounds like the relationship is **four to five stars.**\n\nYou can apply this to any type of relationship question asked here. Platonic, professional, and other relationships that aren't exactly romantic, this still works. You get the idea.\n\nBasically, the people telling you to leave probably outnumber the people with less jaded opinions by an order of magnitude because many, many people have had shitty experiences that dominate their memories, so the best way to consider most advice here is to see whether other advice shines through the cosmic negativity background. If everyone's telling you to break up, that's probably what you should do, but if 1/4 of the comments are telling you another way, you'd benefit by giving that 25% a chance.\n\n---\n\n##TL;DR: \n\nThe vast majority of comments will tell you to end things. It's a side effect of the fact that many people reading either have a very dim view of relationships or just do it for the drama. The more people tell you to consider something _other_ than running, the more value there is in trying that other approach, whatever it is.\n\n(inspired to repost this thanks to [this comment](https://www.reddit.com/r/mildlyinfuriating/comments/1dc05p7/had_to_end_my_birthday_party_early_because_a_1/l7vtsis/?context=3) by u/NotAmericanDontCare. Comments open for a little bit because I know some of y'all want to vent about this, but try to be civil about it.)",
    "comments": [
        {
            "author": "eganist",
            "body": "Comments open for about as long as makes sense. Just try not to be a jerk. The usual rules about namecalling, bad faith comments, etc. still apply.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zaf317",
            "body": "Yeah sounds like you should dump him",
            "score": 52,
            "replies": []
        },
        {
            "author": "tmsagtottawa",
            "body": "the comments here are toxic",
            "score": 65,
            "replies": [
                {
                    "author": "TotalLiftEz",
                    "body": "**100% this!**\n\nHalf the posters here also are just looking for support on how to \"be right\". Think of the kind of person who comes to a website to get ammunition to bring into the relationship. You can see the poster going to their Partner, \"See, reddit agrees with me! You are abusing me and toxic. We are incompatible and I am perfect. So F off. Wait, you are mad and hate that I went to reddit to win an argument using bullshit logic? But they say I will be better off alone. I am so lonely. I am going to go to reddit and get revenge.\"\n\nYou can smell the villain arc in so many posts. If the post isn't asking for advice about their own behavior, assume they are using anything you say as a way to fight their partner.",
                    "score": 44,
                    "replies": []
                }
            ]
        },
        {
            "author": "MelodyCristo",
            "body": "Also there seems to be an overreliance on arbitrary \"rules\" like \"age gap bad\" (obviously some age gaps really are bad but five years in your 20s shouldn't be such a big deal IMO) or \"high school sweethearts bad.\" It's true that sometimes certain things like that can cause problems, but if the post isn't asking about something that is very obviously related to one of these \"rules,\" there shouldn't be so much focus on stuff like \"you're dating your high school sweetheart, that's Bad, break up.\"",
            "score": 40,
            "replies": [
                {
                    "author": "ImJustKat",
                    "body": "Definitely true. My parents in law have been together for 40 years, married for 32. They started dating when she was 16 and he was 24! Something that's literally illegal in most places now and situations like that are generally bad, but in this one specific scenario, there wasn't any ill intent or grooming or anything like that. They're genuinely happy together and things really worked out well. High-school sweetheart and age gap lol.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "electrolitebuzz",
            "body": "I totally agree that there is a general trend to project personal issues and give drastic advice, especially since... well, it's not your life.\n\nI particularly notice it when it comes to fear of a partner cheating, or in general, jealousy about suspicious friends of the opposite gender. Most commenters jump to the cheating conclusion or come up with allegedly universal rules for not having friends of the opposite gender, not being amicable with exes, and so on. Which, for me, is the definition of toxic control. People are different.\n\nAnother topic that is like fire on fuel is the \"boyfriend not proposing\" trend.\n\nMany people also don't really read between the lines – if they read the full post at all and don't detect or take into account very obvious bias from the OP in narrating the story.\n\nAll of this said, there are so many stories every day of obvious, textbook emotional and physical abuse, or years-long relationship with a partner who behaves in a blatant disrespectful, childish, unfair way, despite being a full grown adult. Many times, the \"break up\" comments are actually the best advice. It's a reality check that can give you a hard but useful idea of how your relationship looks like to someone who is not deep in the fog as you are. But of course, some deeper analysis and more thoughtful advice is more useful.\n\nPersonally, after these 3 years following the subreddit, I find there is often very biased, non-pertinent, drastic advice when it comes to the jealousy/insecurity sphere, but I always see very well written, thoughtful, useful comments when it comes to toxic relationships.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Elddif_Dog",
            "body": "Kind of solid advise. When you ask strangers for advise who dont know you they can only advise based on what info you give and its very hard for them, for us, not to connect those sittuations to similar of our own. This is unavoidable prohection.\n\n\nBut at the same time, just because the mob says thr same thing dont make the mob always right. ",
            "score": 11,
            "replies": []
        },
        {
            "author": "MurtaghInfin8",
            "body": "I'd just tag on that posters pay attention to all advice posted, regardless of the upvotes/downvotes. The hivemind here can be brutal. \n\nThis is PARTICULARLY problematic when advice gets legal advice adjacent. Sometimes the right thing to do and the smart thing to do, don't line up. This sub will upvote the moral choice, every time (alright, I guess this is a little hyperbolic). Don't treat any of the advice you read here as wise/informed. Read it with a critical eye: the repercussions of acting on our advice will be yours to deal with. Read our advice as relationship advice ONLY: there's good reason why we aren't allowed to give advice on legal matters.\n\nTake the advice as if it's coming from your salty, newly single bff that considered using ivermectin for non-FDA approved reasons. We aren't experts and most of us have been burned.",
            "score": 15,
            "replies": [
                {
                    "author": "Electronic-Chef-5487",
                    "body": "Absolutely. I see so many comments  that say things like \"call the police\" about things that aren't illegal, like - as much as you might WANT some things to be illegal doesn't mean they actually are. And even if it might technically meet the definition doesn't mean it's actually likely to get a result or be helpful.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SoThrowawayy0",
                            "body": "I've seen the opposite. I've seen people encourage illegal acts.\n\nIt was a recent post about a PS5. The girlfriend bought their boyfriend a PS5 for his birthday and like a week later he said he wants to break up or something, can't remember the details. The poster was asking if she should take the PS5 when she leaves.\n\nEveryone was saying \"*Yeah girl, take it, you paid for it and he is breaking up with you*\", failing to realise that it was a gift and therefore, his property.\n\nTheft is **the taking of another person's personal property with the intent of depriving that person of the use of their property.**\n\nI had to call those people out and some doubled down still thinking their were correct, comparing it to a wedding ring or something (some places protect wedding rings, so if you propose and give her a ring, you can get it back). People failed to realise, a PS5 is not a wedding ring.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "writerbusiness",
            "body": "This is good and all, but I find it a bit confusing. There has to be something better than a \"inverted Uber ratings\". :D",
            "score": 7,
            "replies": []
        },
        {
            "author": "WiseOldBMW",
            "body": "This is a neat way to look at it! And yeah, for cases that are more nuanced, when I give advice on here, I make it a point to try and see what might be going on from the other side, then suggest courses of action that could lead to a compromise, depending on the severity of the conflict.\n\nOf course, that's very much a \"within reason\" thing. If I see nothing but misery if the relationship in question should continue, much less if I think OP is unsafe, I'll say something like \"You need to leave\", and I'll make it clear WHY I think they should leave.",
            "score": 5,
            "replies": []
        },
        {
            "author": "daisyshwayze",
            "body": "Really solid points and then there's space for legitimate concern regarding abusive relationships. Basically, the “Power & Control Wheel”, like instances of sexual harassment/ assault, emotional abuse, being intimidated, being isolated, economic abuse, male privilege, gaslighting, being coerced and threatened. These are all very valid abusive behaviors that should be highlighted as such and not pushed into the general consensus of anyone “overreacting”.\n\nI might even argue victims that are still in abusive relationships passively reading those posts and subsequent comments are receiving (recognizing the above listed abusive situations) valid reassurance about their own situation & then leaving without having to post themselves. *On that note, there should be a pinned post with the “Power & Control Wheel”.*\n\nOn another note, we're not therapists. So, as much as legal advice is reserved for lawyers, I think relationship advice ideally should come from therapists. This is why the ‘advice’ is biased because most folks on here don't have the proper education to evaluate a situation in depth as well as the mostly singular situations presented here being hard to evaluate even by a therapist (they usually would ask for other instances when this occurred etc).",
            "score": 5,
            "replies": []
        },
        {
            "author": "SunnyClime",
            "body": "Another green flag (on reddit in general honestly) is anyone willing to ask for info/context before giving their thoughts and anyone willing to provide more info/context when asked. Those are two things that are very hard for people to do if they are projecting from personal experience, because context/detail/info grounded in reality of the situation is often inconvenient to the habit of making assumptions or confirming biases and predicted patterns.",
            "score": 5,
            "replies": []
        },
        {
            "author": "dt7cv",
            "body": "Way too many of us here are quick to project personal experiences onto others in a similar position uncritically",
            "score": 6,
            "replies": []
        },
        {
            "author": "ValerieVexen",
            "body": "There is no hard yes and hard no. You can't trust strangers on the internet for good advice or conversely to be wrong. If you're reading comments or posts and wondering if a person is also here and wrote to you, they aren't, you're relating because you can probably see yourself in the situation. Maybe you're then good guy, maybe you're the bad guy. But if it hurts or you;re feeling it, go with that, either way you only learn and only know for sure through your own actions.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kaimoritimer47",
            "body": "I learnt never to trust a person with 100%. I always have rules for people and myself that I date. \n\n1. Rule if you or I cheat then leave\n2. If you are angry don't shout but talk it out.\n3. Always be honest and upfront regardless how hard it is.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Darksheerio",
            "body": "maybe, it is also that a majority of people understand how life works, either through anecdotal evidence or general life experience.\n\n80% of marriages dissolve during 5 years after d-day (cheating, betrayal, sth to that regard), regardless of counseling.\n\nso, there's a good reason to assume it is a rather risky bet to assume one belongs to the 20% and is able to manage the issues past causing further harm or strain on the relationship in the mid-, long-term.\n\nand then again, there is the fact, that of those 20% again 50% of marriages fail during the next 5 years.",
            "score": 5,
            "replies": [
                {
                    "author": "I_Found_Away",
                    "body": "Just to correct this statistic this guy is throwing around - the divorce rate in the US is 42%. First peak in divorces are first 5 years.. then another at 15 - 20. \n\nSo, no, a majority of people don’t know how statistics work I guess, and just believe whatever they want to.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "JohannVII",
                            "body": "Ze's saying within 5 years of a serious betrayal, like cheating, not within 5 years of marriage. Your statiatics are for marriages in general (this is a good demonstration of why it's generally a good idea to avoid passive-aggressive comments like your dig about most people's understanding of statistics).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Darksheerio",
                    "body": "marriage counselors dislike this post, hahaha.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Any_Incident6528",
            "body": "Stop being so fn hard to post to!",
            "score": 2,
            "replies": []
        },
        {
            "author": "citrushibiscus",
            "body": "I tell folks to end their relationship if it’s clear they can’t work (or don’t want to work) through their issues. It’s not a bad thing if you need to end the relationship.\n\nI’ve seen a lot of misogyny and fatphobic bullshit in the comments, too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "eganist",
                    "body": "Those are all reportable tbh.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sea-Amphibian-4459",
            "body": "Sad but true, i always like to play the safe route and ask probing questions to make the other person think about the scenario first then draw a conclusion after gathering more moral based information surrounding the post, then provide input, unless OP basically states the other person cheated, but cheating is habitual and that is pretty much the reason i would say end things, relationship advice should be about relationships and once a cheater cheats on you the possibility of repeating that skyrockets.",
            "score": 2,
            "replies": []
        },
        {
            "author": "VocalicMedusa",
            "body": "I understand thank you for taking the time to explain using this helpful uber analogy",
            "score": 2,
            "replies": []
        },
        {
            "author": "iwillneverletyouknow",
            "body": "The longer I hang out here, the more astounded I am how easy it is for people to throw around 'break up/divorce/dump him/her'. Almost as if they found some wicked satisfaction in pushing real people in real relationships over the edge. There are so many better ways to waste one's time than making other people waste their lives...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Necessary-Ad-1374",
            "body": "Ykw this makes alot of sense. I'm ngl i do say break up especially with cheaters but most times i try to give another option. It might be a terrible idea to break up and there goes a relationship that deserved the fight it needed. \n\n\n(Not really trauma dumping, just dumping but my ex broke uo with me bc of an issue within himself and even though i tried to fight for our relationship, i could twll he didnt know how and all he knew was to run. So yeah, break up or figure it out bc that might be the person that would burn the world if it meant you could be the happiest peraon alive.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TemtCampingRick",
            "body": " ,",
            "score": 1,
            "replies": []
        },
        {
            "author": "solviaqaant",
            "body": "I hate these fucking posting rules",
            "score": 1,
            "replies": []
        }
    ]
}