{
    "title": "My fiance (29f) is obsessed with DND. How do I (28f) address this?",
    "author": "animetrixy11",
    "subreddit": "relationship_advice",
    "rank": 15,
    "score": 15,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.reddit.com/r/relationship_advice/comments/1je7mq9/my_fiance_29f_is_obsessed_with_dnd_how_do_i_28f/",
    "id": "1je7mq9",
    "selftext": "EDIT*** Fiance is Male didn't mean to write 29f he is 29m\n\nHi I don't play DND, I don't know much about it other than when he shares what's going on in his campaigns. I've read some of the player handbook mostly about the classes and races. I really try to take somewhat of an interest in it but it isn't for me and we are both ok with that. \n Whilst I love that it's a passion of his I'm tired of having the same conversations over and over about how often he is on his phone playing this game. He has an online campaign and also an in person one. He meets with the in person group 2 weeks on 2 weeks off.  But the online group is continuous. They play every day and it's really getting to me. Due to us being in the UK and his players being in the states they just text whenever they can. However there will be times I just catch him when we have a conversation or go out to dinner or even at the vets for our cats appointments texting the DND server. I really really hate it. I want to tell him to limit the online campaign to twice a week at designated times but I feel that sounds super controlling. I really don't mind that he plays the game I hate how much he isn't able to fully focus on me or something we are doing because he is anxious to reply to them. \n\nAlso at work he has been told he is on his phone too much. He came home and told me this and he was super defensive about it but today whilst I was on his PC playing a game I saw pop ups on discord and he was playing DND whilst he is meant to be working. \n\nHow do I address this without coming across as unreasonable? What kind of boundaries can I put in place?\n\nTldr: fiance plays DND a lot and is often distracted on his phone because of it. I want to ask him to play less but fear that's me being controlling and stopping him from doing something he loves. \n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* We do not allow users to privately message other users based on their posts here. Users found to be engaging in this conduct will be banned. **We highly encourage OP to turn off the ability to be privately messaged in their settings.** \n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* Anyone found to be directly messaging users for any reason whatsoever will be banned.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n***This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.***\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnotherJournal",
            "body": "I think you really need to be straightforward and tell him his hobby isn't leaving enough room for your relationship.\n\nIt's not about DND, it's about your need for attention and couple time. I think you need to tell him how much couple time you need. If he can't meet your needs, you can actually in that.",
            "score": 74,
            "replies": [
                {
                    "author": "Knale",
                    "body": "> It's not about DND, it's about your need for attention and couple time.\n\nAlso the fact that he's apparently getting in trouble at work.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "lkdubdub",
                    "body": "Exactly. It's about consideration and respect, not the hobby",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Big_Falcon89",
                    "body": "It's not even about the hobby- it sounds like he has a good campaign going in-person- but more specifically it's about him being constantly posting in an asychronous text campaign on a discord server.  This is almost more like a social media addiction than anything specifically D&D based.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "insidioussnailshell",
            "body": "As a dnd player… playing 24/7 is WILD to me lol. I would not be able to do that at all and be present with my life and I hear you there. I really have no advice other than maybe the two of you should get into some couples counselling to try to find and enforce healthy boundaries around this together to work through it. Playing any game actively on call 24/7 isn’t really healthy but if he has to live like that in order to be happy maybe he has to sacrifice his relationship? Again relationship counselling can sort that out for you guys for real ",
            "score": 46,
            "replies": [
                {
                    "author": "Primary-Friend-7615",
                    "body": "I’ve played in a forum-based online tabletop game that was effectively 24/7, and that worked pretty well. But it was 24/7 in that people could post their actions, and any conversations etc between player characters, at any time that was convenient for them, and then we’d wait for other players or the DM to respond.\n\nIt slowed down the pace a bit, but it was basically the only option that let us all play together, and it was nice to have a record of exactly what we said or did previously. It was also much easier to split the party and do smaller or individual things, because no one was sitting there being excluded. Sometimes we’d get a good chain going where a bunch of people were around on the same evening, which was fun\n\nBut replying constantly, _while_ having an in-person game going every weeknight, sounds like way too much time spent on D&D to the detriment of the relationship.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "insidioussnailshell",
                            "body": "Even that arrangement sounds like a bit of a nightmare for me solely bc I like to create an intentional space and hang out when I play and get into the headspace together. That’s what makes it fun for me! I totally get other ways to play and all that but I just wouldn’t be able to play 24/7 like that, it would take away from the other things I like to do with my time - but hey that’s just me!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Primary-Friend-7615",
                                    "body": "In our case it was a necessary evil, and the alternative would have been no game at all - one of our regular group got sent away for work for an extended period, one got switched to the night shift, one just had a baby, one was moving, etc. I think most of us just checked in once every day or two to see if there were any replies, or coordinated a specific couple of hours to post an in-character conversation back and forth.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Asprinkleofglitter7",
            "body": "Who plays d&d continuously? It’s played in sessions. \nBut anyway, he’s playing too much. It’s damaging his relationship and work. It’s definitely a problem at this point",
            "score": 41,
            "replies": [
                {
                    "author": "animetrixy11",
                    "body": "He says because they are spread out in different time zones people just text whenever they can, and sometimes they catch eachother online at the same time but it's rare.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Asprinkleofglitter7",
                            "body": "I’ve played d&d and I just can’t comprehend how anyone would be able to play that way",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "phishtrader",
                                    "body": "It sounds similar to play-by-post (PbP), which was a somewhat popular alternative way to play before online tools made online game sessions more practical.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "anonidfk",
                            "body": "I know a lotttt of D&D players, I’ve played several times myself, but I have never ever heard of it being played like this, that’s crazy lol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LadyFoxfire",
                    "body": "It sounds like play by post, where you write down what your character is doing in a group thread or forum of some kind.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Big_Falcon89",
                    "body": "Text-based RP has been around pretty much forever on the internet.  There are a ton of people out there who don't even use rules and just do it freeform.  Livejournal was a hub for stuff like that, as I recall.  I did some play-by-post games maybe 10-15 years ago but none ever really got off the ground.\n\n\nGiven what I know about how it works these days (I E it's all on Discord but otherwise pretty similar), there's a greater aspect of creative writing to it, and in a lot of ways it's more like a social media addiction than a D&D game.  Dude is functionally refreshing Facebook all day.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Expensive-Day-3551",
            "body": "It’s affecting his work and relationships. Sounds like an addiction. I would ask him to get help and set limits.",
            "score": 11,
            "replies": []
        },
        {
            "author": "sheppy_5150",
            "body": "He has an addiction and needs help. While giving you what appears little to no attention, it's beginning to affect his actual job.\n\nHobbies are one thing, but when it overtakes your life and focus, it's no longer a hobby.\n\nSee if he can/will taper off and possibly talk to someone. If it's met with hostility, you may have to issue an ultimatum.",
            "score": 6,
            "replies": []
        },
        {
            "author": "barnstablepearl",
            "body": "When you talk to him, don't focus on the DND. Focus on the needs within your relationship that aren't being met. Are you looking for weekly date nights? Phone-free meals? A half hour of uninterrupted time together every night? \n\nUltimately, it's his responsibility to fit in his hobbies with all his other responsibilities and relationships. It's your job to communicate what you need to maintain your relationship.",
            "score": 11,
            "replies": [
                {
                    "author": "animetrixy11",
                    "body": "I get what you're saying about me staying what I need versus saying what he needs to stop doing. The issue is, I feel at times that he's just itching to go on his phone and check the DND server. Also him getting in trouble at work for it. Surely it would be best if I asked him to only play twice a week at designated times. Or do you think that's unreasonable?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "barnstablepearl",
                            "body": "If you feel like he's not present when he's hanging out with you, communicate that. If he's getting in trouble at work, that's something you can also address. \n\nBut again, it's his responsibility to figure out how to play DND in a sustainable way. He needs to be an adult about this.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Defiant-Tap7603",
                            "body": "It's not about it being unreasonable.  It's completely reasonable.  But he's proven he's gonna be unreasonable about this.\n\nIt's about the fact that if you make it about the DND directly, he *will not hear you.*  He is happy with his amount of DND play, and there's nothing you can say that will cause him to change that mindset.  If you make it about your relationship, your needs, he's far less likely to go into that defensive shell, far more likely to hear you out, far more likely to actually make a change.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "phishtrader",
                            "body": "The behavior is kind of side effect of the style of game he's running (and the dopamine hit his brain gets). An old school, traditional play-by-post game would have him waiting for players to send him mail for several days and them in turn waiting for his reply, instead he's waiting for messages on Discord or whatever platform they're using. The ease of replying and the near instant delivery, means he can stay involved as long as the players continue to reply. If he was running a more traditional style of online game that met once a week for a few hours, he'd be interacting much less frequently.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Oddname123",
            "body": "I think asking him to limit the online campaign isn’t a big ask.",
            "score": 7,
            "replies": []
        },
        {
            "author": "LadyFoxfire",
            "body": "Don’t phrase it as “you need to only play twice a week or I leave,” try something like “I feel like you’re spending so much time gaming that you don’t have time for me anymore. Can we work out a solution where you only play on certain days and dedicate other days to hanging out with me?”",
            "score": 5,
            "replies": []
        },
        {
            "author": "Aleatorytanowls",
            "body": "This problem extends far beyond your relationship and an obsession with DnD. \n\nYou need to address this with him, it’s not unreasonable to want your partner to be present. You can put boundaries into place, if he’s spending time with you he should not be playing DnD. He can’t be present if he’s constantly thinking about his characters next move. \n\nYou should understand this issue isn’t going to resolve unless he puts a lot of work in. He probably needs therapy, and the two of you would probably benefit from couples therapy. It’s like he is living a double life, there’s probably a reason he is running from the real world that he needs to work out. \n\nHow long have you been together? Had this been happening the whole time or did something set it off?",
            "score": 3,
            "replies": [
                {
                    "author": "animetrixy11",
                    "body": "I feel like I've been so patient. We have been together 10 years! He has been playing with these people for about 5 years and I'm actually sick of it. He is the dungeon master so he is in control of how often he plays and he needs to tell his group they need to play less. He often says DND and myself and his biggest joys in life so I feel bad asking him to reduce it idk",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Aleatorytanowls",
                            "body": "You are so valid, 10 years is a very long time to be patient. You shouldn’t feel bad asking for him to compromise, this sounds way too excessive of an involvement even for a DM. Let him know what about it concerns you, it seems like you’re worried he’s going to lose his job, and your relationship can’t be flourishing while he is on another planet. \n\nYou can provide alternatives in addition to him playing less often. Maybe if he expedited the campaign ending the two of you could join a local campaign together, get out of the house and meet with people irl one time a week. Maybe you two could play baulders gate together, or try out other games or hobbies you are both interested in. \n\nBut really, think about what you would do if things don’t change. If you aren’t seeing him take your very reasonable request seriously you should think about what you want the next ten years of your life to look like. Figure out if you are content to be a side character in your fiancés story forever.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "stonecoldsilly",
                            "body": "ask him to do a session for you - reading the dry handbook is nothing like an actual go at the game, and he can use his knowledge of your likes and dislikes to tailor it to your tastes. \nthen it’s something you share, and he might find it even more fun to play live with you! \nif he’s been DM for five years with one group he’s doing fantastic, let him thrive a bit !",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "animetrixy11",
                                    "body": "But playing everyday is unreasonable no? I have tried DND he has done a one shot with me and I just don't enjoy it. We do other things together like play board games and video games I'm with DND being his thing I just think the frequency isnt right",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "rahirah",
                                            "body": "I've been playing D&D for forty plus years and this is WILDLY unreasonable.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "commissarchris",
            "body": "I can not fathom playing DnD continuously over text. I would go insane.\n\nEven across different timezones, it is very possible to have a time that everyone logs on and plays an actual session together (Unless they're literally all across the world - but at that point, unless they're lifelong friends, why do that instead of finding a group that works out timing-wise?)",
            "score": 2,
            "replies": []
        },
        {
            "author": "avid-learner-bot",
            "body": "It's normal to feel a bit overwhelmed when someone you care about seems more interested in their hobbies than spending time with you. Communication is key here, you might find it helpful to sit down and have an open chat with your fiance about how his DND activities are affecting your relationship. Maybe you can suggest setting aside specific times for both of you to share what's on your mind, which could include his gaming experiences as well as other aspects of life. This way, he can still enjoy playing without it feeling like a big deal... and it gives you the chance to feel heard and valued too. Trust me, talking things through is often more productive than bottling up feelings. So give it a shot, and hopefully, it'll help smooth things out between you both",
            "score": 1,
            "replies": []
        },
        {
            "author": "onlinefeyre",
            "body": "when did he pick up this hobby? if it's been a month or two, he may just be hyperfixated. having new friendships who share your same interest (and are as dedicated as you are) can be very exciting, specially when you have nobody else that shares said interest. this tends to happen quite commonly with autistic folks; altough it isn't exclusive to them. if this were the case; i say you give him a talk about being more responsible with how he spends his time, but it's likely he'll mellow out eventually and the issue will fix on it's own. \n\nhowever, any longer than that and he might have an addiction, in which case a therapist would do him good. in any case, I wish you the best of luck! :3c",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big_Falcon89",
            "body": "His online campaign sounds like it's text-based?  Back in the day I was on internet forums where we called those \"play by post\" games, and they tend to be a lot more creative writing exercises.  Nowadays I guess it's all on Discord. And one of the things about them is that they're asynchronous by nature.\n\n\nI understand where he's coming from, to be honest.  It is *incredibly* rare, in my experience, for one of those games to last if you're not, like, continually updating.  It sounds like he's worried that if he stops being so committed, his friends will lose interest.  But clearly his current activity is unsustainable.  It's not only affecting your relationship but his work as well.  \n\n\nHonestly, as someone who'd give his left kidney to be in a committed D&D group?  I'd tell him he should probably go cold turkey.  Giving up your part in a gaming group doesn't mean giving up the hobby.  He should still play either in-person or via webcam at set times, but the asynchronous RP is interfering with his life too much right now, and cutting back will in all likelyhood lead to a slow death of the campaign due to lack of interest, so I would recommend just ripping that bandage off fast and encourage him to quit the group and refocus on life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CuriousPenguinSocks",
            "body": "This isn't about the D&D, I play as well with my spouse and we still make time for each other.\n\nYou are right it would come off as controlling to tell him what to do. However, have a very serious conversation about his playing bleeding over into things you are doing and that's not acceptable.\n\nA boundary on this would be \"I want a partner who prioritizes time with me and wants to participate in our life together, not their game.\"\n\nYou have to be willing to walk away though. A crossed boundary needs consequences to hold weight and the only play you have is breaking up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yetisa",
            "body": "Why are both of you female in your title but your refer to the finance as male in the post?",
            "score": 0,
            "replies": [
                {
                    "author": "animetrixy11",
                    "body": "Accident! I put an edit at the top of the post  sorry",
                    "score": 3,
                    "replies": [
                        {
                            "author": "yetisa",
                            "body": "Ok that makes sense, thanks!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cheska1234",
            "body": "Your problem isn’t with dnd it’s your partners lack of respect for any boundaries at all.  Dnd is just the thing that’s making it obvious. If he was playing dnd like a normal hahaha person, it wouldn’t be at work, it wouldn’t be st all hours day and night, it wouldn’t generally bleed into every other thing. \n\nSide note: do not think you can understand the game by reading the players handbook. Heck no. Try a game or watch critical role or something. It’s not like the manuals. That’s like saying you don’t want to use an instapot after trying to read the user manual start to finish. Give it a shot. Yes I’m biased. I gm a game and run in another. Twice per week total.",
            "score": 0,
            "replies": []
        }
    ]
}