{
    "title": "My (29F) twin sister's boyfriend (28M) is ruining our relationship and she is defending him despite all my reasoning. What are my options?",
    "author": "relochi",
    "subreddit": "relationship_advice",
    "rank": 12,
    "score": 17,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/relationship_advice/comments/1je963k/my_29f_twin_sisters_boyfriend_28m_is_ruining_our/",
    "id": "1je963k",
    "selftext": "My twin sister and I are very close to say the least. She (29F) has been dating her boyfriend (28M) for over 7 years. We've all been living together for the past 5+ years after college so I'm present in a lot of their fights and have supported her emotionally through hardships relating to their relationship. I try my best to not get emotionally invested since it is not my relationship but I've recently hit a breaking point after all that has happened to my sister. I love my sister and I want the best for her. I truly do not think her boyfriend is a good match for her and she herself has told me that she is unhappy and doesn't see a bright future with him but she is unable to let go. This is her first ever boyfriend and she mentioned to me that she is too weak to leave and scared to start dating again at her age, so she continues to stay comfortable and crawl back to him despite being disrespected repeatedly. Below are more details.\n\n\n\n**Reasons why I think my sister's boyfriend is not good for her**\n\n* He's emotionally immature and is terrible at communication. He constantly stonewalls her and she has to hold his hand through adult conversations and overall is unable to process his own emotions.\n* He doesn't have any strong relationships in his life with friends or family. He has a twin sister who he isn't close to, he doesn't have any close friends, he's not close to his family.\n* He is disinterested around our family and always acts like he doesn't enjoy being around them, despite them being super nice to him.\n* He overall, doesn't treat her well or puts her as a priority. She constantly has to tell him what to do and how to treat her. He doesn't know how to think for himself.\n* He has an alcohol problem where when they go out, he gets really aggressive. Also, 9/10 he will be flirting with other girls and my sister will try to ignore it or get mad about it but then he never apologizes for his actions and it's like pulling teeth to get him to admit his wrongdoing.\n* My sister always has to go out with him to watch over him to make sure he doesn't get too drunk or flirts with other girls.\n* Nobody in her life, including my sister's other close friends, think that her boyfriend is good for her, which she acknowledges, but doesn't ever decide to leave him. He has a dead end job and likely wants to stay with my sister because she is a doctor...\n* My sister cannot name a single thing that she likes about him other than his looks...\n\n**What was the last straw for me?**\n\n* My sister and boyfriend went out to a bar and he got really drunk. A girl was flirting with the boyfriend and he was flirting back which made my sister really mad. He also was yelling at her in the bar and she was very embarrassed because all her friends were there. When we got back to the apartment, this is the first time she ever wanted to sleep on an air mattress and not in the room with him. She slept on the air mattress for over 2 weeks and not once did the boyfriend come out to apologize or care about my sister. \n* I sent a super long text msg to him expressing my feelings that if he doesn't care or love my sister, then he should reconsider the relationship and leave. He reacted with a laughing emoji to my msg and didn't respond with anything else.\n* My sister eventually had to initiate talking with the boyfriend and she somehow always crawls back to him.\n* These incidents involving alcohol and other girls have been occurring repeatedly over the past 7 years and I'm really desensitized to it.\n\n**Steps I've taken after the last straw incident / closing thoughts**\n\n* For my own mental health, I've blocked him on everything phone and social media wise\n* I informed my sister than I never want to see him again and seeing them together makes me really mad, so I will be moving out in the coming months. My sister keeps trying to guilt trip me by saying that if I am cutting him off, that is essentially cutting her off too since they are a pair.\n* I expressed that I am very disappointed that she keeps crawling back to him despite all these red flags. My sister has the audacity to tell me that it is my fault for feeling all this hatred toward him and that I should talk it out with the boyfriend. My sister thinks that my love for her should be stronger than my hatred for him so I should be the bigger person and accept their relationship, but that doesn't make sense to me. \n\nAt the end of the day, I know I can't force my sister to leave her toxic relationship, but I would hate having to lose her if she continues to choose him. What are my options outside of what I've already done?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* We do not allow users to privately message other users based on their posts here. Users found to be engaging in this conduct will be banned. **We highly encourage OP to turn off the ability to be privately messaged in their settings.** \n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* Anyone found to be directly messaging users for any reason whatsoever will be banned.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n***This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.***\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "airaqua",
            "body": "There really are no options left.\n\nUnless your sister starts intensive therapy to work on herself, nothing will change. All you can hope is that she doesn't bring any kids into this mess any time soon.",
            "score": 31,
            "replies": [
                {
                    "author": "Plus_Data_1099",
                    "body": "She could ask him to leave if it's her home aswell  this is not working ask your parents to mediate between you and your sister. They also need to know how he is treating her",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Away-Research4299",
            "body": ">My sister thinks that my love for her should be stronger than my hatred for him\n\nSometimes, love means not tolerating bad behavior.",
            "score": 18,
            "replies": []
        },
        {
            "author": "No_Ad_770",
            "body": "Follow through on leaving.\n\n\nTell your sister that you love her so much, you cannot watch her stay with this man. She knows why.\n\n\nTell her you will always be there for her but you don't want anything to do with her boyfriend. You wish her the best, but you honestly can't see her achieving the best when she resorts to being a doormat or punching bag. You've aired your grievances with her boyfriend, he sent a laughing emoji in response.\n\n\nShe's an adult, she'll likely need to hit rock bottom before she realises how much time she's wasted out of fear. Tell her to look up the sunk cost fallacy, pack your bags and go.",
            "score": 9,
            "replies": []
        },
        {
            "author": "DowntownMonitor3524",
            "body": "Show this to your parents.",
            "score": 5,
            "replies": []
        },
        {
            "author": "BigBobsBeepers32",
            "body": "I'm sorry you're in this position, OP. It's really hard when someone we love doesn't see that they deserve better. \n\nI think my first piece of advice would be for you to come to terms with the fact that this is something you have no control over. If you had the power to convince your sister to leave this guy, she would have left him by now. You've made your feelings about him clear- she knows you want her to leave him. So, when you feel yourself wanting to get involved in their drama again, try to remember it's not worth the time and energy. Unless your sister asks you for advice directly or is in grave danger, don't get involved in their drama anymore. It's going to be hard, because you love your sister and want to fight for her, but I promise that you being calm, cool and collected and not engaging with their issues will be a lot more effective than trying to get in the middle of their shit. From today going forward, act like you simply don't care and it doesn't affect you. You can listen to your sister and support her if she comes to you after another fight, but don't say a word about what you think of their relationship or that you want her to leave him.\n\nFor people in toxic relationships, having loved ones trying to pressure them to end things can have the opposite effect. It can create this, \"it's us against the world\" mentality and make them more inclined to stay in the relationship. On some level, she may even be staying because she doesn't want you or anyone else to be right. So, if you stop caring whether she stays or leaves, if you stop trying to convince her to go and that she deserves better, she's no longer dealing with the constant shame of staying in a toxic relationship. If you just show her love and acceptance and never fight her on her relationship, it might actually help her realize this isn't a relationship she wants to be in any more. \n\nAlso, I'm not sure if this is realistic for your situation, but if you're in a position where you can move out, it might be time to consider not living with them anymore. Because a) I think it would be good for you to really remove yourself from their toxicity and protect your own well-being. and b). if you move out, she can't rely on you to be there every time she fights with her boyfriend anymore. If she's left alone with him to face all their issues alone, I think that would open her eyes more. Plus, if you move out, you're essentially leading by example and showing her it's possible to start over and it isn't as scary as she thinks.  \n\nBasically, just protect your peace and try to remove yourself from their drama as much as you possibly can. I think your sister will come to her senses if you give her the space to do so.",
            "score": 5,
            "replies": []
        },
        {
            "author": "AffectionateBite3827",
            "body": ">My sister thinks that my love for her should be stronger than my hatred for him so I should be the bigger person and accept their relationship\n\n\"Sister, my love for you IS stronger than my dislike for him. And that is why it's so hard to witness this repeatedly and regularly. I will always support you, but I don't support you being mistreated in a relationship.\"",
            "score": 1,
            "replies": []
        }
    ]
}