{
    "title": "How to navigate meals with my (31f) ‘chicken nugget’ boyfriend (37m)?",
    "author": "Senoritasmack",
    "subreddit": "relationship_advice",
    "rank": 7,
    "score": 69,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.reddit.com/r/relationship_advice/comments/1jeawrb/how_to_navigate_meals_with_my_31f_chicken_nugget/",
    "id": "1jeawrb",
    "selftext": "I’ve moved in with my boyfriend of 2 years Eric, and we’ve agreed to split cooking 50/50, which means one week I cook all the meals and the next week, he cooks all the meals.\n\nTo say he is a chicken nugget boyfriend is hyperbolic, but to put it into context, I grew up with a French chef for a dad, so I’ve learned to cook good, varied and healthy meals. My boyfriend can make spaghetti, chilli con carne and other quite basic ‘meat and veg’ sort of dishes.\n\nI’m not trying to make mad elaborate dishes like coq au vin or anything, but he doesn’t like any kind of fish unless it’s breaded, so no salmon, mackerel or anything like that. Cant serve any meat that is ‘on the bone’ so no wings, chicken thighs or anything soups that require a meat broth. For vegetables I can’t go too elaborate either (broccoli, peas, carrot fine). Took the first year to get him to eat a salad.\n\nRecently he came to visit my family in France for Christmas where my chef dad wanted to make a huge elaborate meal for us and I had to veto basically everything except classic meat and veg, which was a bit embarrassing (and was served on the bone which he ate!!). If forced (ie in front of dad) he will eat everything and always enjoys it!\n\nI would like a healthy varied diet, and on the weeks I cook, I’d like to try new recipes - Thai, Vietnamese, fish dishes etc and I don’t know whether it’s unfair to just cook what I like and tell him to lump it, or to cater for him when it’s my week to cook and just do what I know he’ll eat. His cooking weeks are pretty basic but I don’t complain. However I’d like to do what I want when it’s my week. \n\nAny thoughts? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* We do not allow users to privately message other users based on their posts here. Users found to be engaging in this conduct will be banned. **We highly encourage OP to turn off the ability to be privately messaged in their settings.** \n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* Anyone found to be directly messaging users for any reason whatsoever will be banned.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n***This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.***\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cultural_Shape3518",
            "body": "> If forced (ie in front of dad) he will eat everything and always enjoys it!\n\nThen I don’t think you need to concern yourself with him starving if you decide to take a risk sometimes.  Not to mention he’s a big boy and can fix himself a sandwich or some spaghetti if he doesn’t like what’s on offer.\n\nIf you feel bad about just plopping something new in front of him and telling him to deal, though, maybe ask him if he’ll agree to 1-2 nights a week where you might push things out of his comfort zone and he gives it a fair shot.  Hopefully he’ll like at least some of those meals enough that you can add them to the rotation, or up the frequency of experimentation.  (Another way to ease him into it might be to use ingredients he’s comfortable with, but in new preparations.)",
            "score": 302,
            "replies": [
                {
                    "author": "Senoritasmack",
                    "body": "That’s a good idea, thanks!!",
                    "score": 31,
                    "replies": [
                        {
                            "author": "PoetryOfLogicalIdeas",
                            "body": "I would add, on nights when you branch out a little on the main, you might have a safe side. So, you might make a lovely salmon and serve it with baked potatoes or maybe a thai curry with plain rice. \n\nWhen I was encouraging young kids to enjoy a varied diet, I never forced them to eat anything and always made a familiar option available, but I also didn't make that option very attractive. For instance, they would eat an unending amount of boxed mac and cheese, and they would always choose that over anything else. So if I wanted to encourage them to try something new, I shouldn't have the mac and cheese available; instead, they could have plain rice and baby carrots if they didn't want the new food. No one was tormented or went hungry, but they also had a bit of a push to the new things.",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "Jazmadoodle",
                                    "body": "My sister does this with oatmeal. Her kids are always free to turn down whatever she's made for dinner, but the alternative is a bowl of oatmeal. It's healthy and filling but not exciting.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LivingBestLife777",
                            "body": "You might want to freeze extra servings of the meals that he makes (and the meals of yours that he likes), so that he has back-up when you create something new and amazing.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Lokifin",
                                    "body": "And freeze the extras he doesn't eat of her cookong so.she can have something nice when he does spaghetti for the thousandth time.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LivingBestLife777",
                                            "body": "Yessssss!    I love \" cook aheads\"!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AffectionateBite3827",
                            "body": ">he doesn’t like any kind of fish unless it’s breaded\n\nIs his name Dennis Duffy?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TheMoatCalin",
                            "body": "It sounds like you two are talking about feeding a toddler or small child. Yikes.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ay-nahl-reip",
                    "body": "Coming from a 30 year old who within the last 2 years went from not eating a single vegetable to now being able to eat most everything and being willing to try everything. I'm still working on fish. (I also didn't drink water until I was 21, not proud of that lol) \n\n\nAnyway, I dated a bunch of people who were very much like \"I'm gonna get you to eat vegetables\" and I'd sort of try stuff, but still dislike it. It wasn't until I actually decided in my head that I needed to be healthier and that it was getting annoying having to constantly eat before parties just in case they didn't have something I could eat. Or, going to nicer restaurants and seeing all this really good smelling food come out, but still being disgusted by it.\n\n\nIt just started to weigh on me and really just made me feel embarrassed and like I was a child. And, less desirable by the people I was interested in.\n\n\nI knew it was going to be hard, but basically I just forced myself to suffer for a bit vegetable by vegetable. I'd do broccoli dishes for 2 weeks until I finally liked broccoli, then I did corn, then carrots, then onions, and so on... For like the first couple dishes of each thing I made I'd honestly still be gagging a little at first and forced myself to finish things or eat as much as I could stand. After that I finally realized how good all that food can be.\n\n\nUltimately it took me feeling ashamed and feeling like I had to make a change before I actually buckled down and did it. Maybe if he felt like he had to change, he'd actually put effort into it.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nanamoo2008",
            "body": "I'd cook what you want to cook, he'll either eat it, go hungry or make himself something.",
            "score": 265,
            "replies": [
                {
                    "author": "Abject-Rich",
                    "body": "It’s just manners.   My child will swallow food whole with a smile when invited.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "monkey_trumpets",
                            "body": "Same. Even my sister in laws dessicated chicken breasts.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Additional-Day-698",
            "body": "If it was me I would probably re-evaluate the cooking split. My roommate is picky, but there are also meals we both like and we like eating together. The day we go grocery shopping we’ll talk on if there are any shared meals we both like that we want to have during the upcoming week and when. The other days, or all the days if no shared upon meals are wanted that week, we cook separately. I know it’s just a roommate and not a significant other, but you could look into doing something like that. Or just always plan to each cook and clean your own meal",
            "score": 41,
            "replies": []
        },
        {
            "author": "VOR343",
            "body": "He prepares what he likes on his week and you should do the same on your week. You're trying to be nice and think of him when it doesn't seem like he's thinking of you. It might be better if you just cook for yourselves if he's not willing to compromise.",
            "score": 26,
            "replies": []
        },
        {
            "author": "UsuallyWrite2",
            "body": "I have a picky eating partner and his now 12YO son to navigate so I feel for you. \n\nI menu plan for the week and I cook 3-4 days and make sure there are leftovers and he’s in charge 1-2 days per week. \n\nYour situation is far more severe though. I’d be inclined to tell him to just cook for himself and you cook for you. \n\nI can largely sort things by making smaller portions of the things I know I’m the only one who will eat (veggies for example).  But I’m not going to eat garbage nuggets or frozen pizzas.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Fickle-Lemon-5982",
            "body": "My husband is also a VERY basic eater.... will not eat fish or seafood of ANY kind (he's not allergic.....just doesn't like it) etc. When we first started living together we had a \"something new\" once a week rule.... we would make something different once a week to try and see if we liked it and if one of us didn't then it wasn't on the menu again......this actually helped a lot with our variety of foods we eat..... and we now know that we both hate duck 😂😂",
            "score": 20,
            "replies": []
        },
        {
            "author": "henicorina",
            "body": "If you want to eat completely different food, why not just cook individually? You can collaborate on meals that are adaptable for both tastes when you feel like it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "blue_cornflowers",
            "body": "No one has died in front of a full plate. Cook what you like, either he eats it, goes hungry or makes something for himself. You are not his private chef",
            "score": 10,
            "replies": []
        },
        {
            "author": "yennyyenyen",
            "body": "He's 37. He can learn to try your meals and make himself a sandwich if he doesn't like it. Clearly he will eat whatever is served to him and enjoy it in front of others, so he should make an effort with you too. Do you really want to spend the rest of your life catering to him and eating like a toddler?",
            "score": 24,
            "replies": [
                {
                    "author": "lalalalydia",
                    "body": "Yeah cos toddlers grow out of it. At 37...coaxing and training him to eat foods has got to be so exhausting",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Less_Watch7655",
                    "body": "Yeah, I was going to add, in the grand scheme of things it doesn’t sound like a big deal, my only caution is to not start catering to his likes and dislikes. He’s a grown man at this point, I think it’s fine if you attempt to cook things he might like as even couples with no food differences do that for each other, but I don’t think you need to work so hard to make him the way you are. Just don’t be about changing him you know?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "darthrio",
            "body": "My wife is the very definition of a “foodie”, she’ll eat or at least try pretty much anything. I on the other hand have the palate of an autistic 8 year old. We make our own meals.",
            "score": 5,
            "replies": []
        },
        {
            "author": "KillerKittenInPJs",
            "body": "Honestly it sounds like a compatibility issue. He's not going to change, so you have to decide if you can live with his eating habits. Have you talked to him about how his limited diet is impacting you and asked if he's willing to try new things?",
            "score": 7,
            "replies": []
        },
        {
            "author": "LucyLovesApples",
            "body": "He hasn’t been exposed to many things like you have and he’s not going to change overnight. \nHow about you are both responsible for your own meals and with him maybe trying at his own will a little of your food ?\n\nWhat is off putting to anyone is nagging someone or moaning about their lack of plate. That’s NOT going to entice anyone to try new foods",
            "score": 4,
            "replies": []
        },
        {
            "author": "Expensive_Visual_594",
            "body": "Each person should just cook for themselves. Problem solved. ",
            "score": 4,
            "replies": []
        },
        {
            "author": "Alarmed_Quit_9697",
            "body": "I’d ask him how it is that he enjoys your father’s cooking but not yours. You can also tell him that you aren’t that thrilled with his meals,  yet you eat them, and there really is no reason for him to show you the same courtesy.",
            "score": 12,
            "replies": [
                {
                    "author": "LucyLovesApples",
                    "body": "It could be that he’s trying to be polite",
                    "score": 8,
                    "replies": [
                        {
                            "author": "lalalalydia",
                            "body": "He should be polite to his gf too",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Wafflehouseofpain",
                                    "body": "It’s easier to be polite and eat something you don’t like once than to do it continuously all the time.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "gcot802",
            "body": "You both need to accommodate eachother.\n\nIt sounds like you are willing to eat the meals he likes on his week, so he should be willing to either eat yours on your week or feed himself.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Expensive-Opening-55",
            "body": "I’d cook what you want and tell him to try it or he can eat something else. He’s a big boy, this is ridiculous. For example, I don’t necessarily like meat on the bone but I will cut it off for myself or eat the sides. My bf makes a lot of meals I wouldn’t make myself but I often find that when I try them, they’re pretty good. He’s making what he wants on his weeks. It’s not the food you’d prefer. Why should you do any different? You aren’t making food he’s allergic to or truly cannot eat. Worst case scenario, invite me over for dinner. This sounds delicious!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Runnrgirl",
            "body": "Tell him to make extra on his week. Get meal\nPrep containers and throw some in the freezer. You cook what you want and if he’s not a fan then he grabs a prepped meal.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Psydop",
            "body": "This sounds like you guys are putting a lot of pressure on each other and yourselves to hold up the deal. \n\nWhy not just work together to make meals? Why set expectations on something so nuanced? If I don't feel like cooking, and my wife doesn't feel like cooking, maybe we'll order in or go out. Or possibly make a sandwich. I certainly wouldn't agree to cook several meals every other week. That sounds so exhausting.\n\nAdditionally, if you are cooking, cook what you want. If he doesn't like the meal you make, he should find something for his own dinner that night. Same if you don't like what he makes sometimes. I wouldn't expect my partner to stop making their favorite meal because I hate it. I would just eat something else when they made it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "raisedbypoubelle",
            "body": "I'm confused how you got to this point.  To me, this is a matter of values and priorities (as silly as it may sound to call eating/making food \"values\").  You are moving in with a meat and potatoes kind of dude and that's what he will like.  Each dish that you \"win\" on is going to require work and effort.  But it's also a little unfair, he just doesn't like that.  Maybe he needed to end up with someone who has a killer green bean casserole recipe instead of a killer cassoulet recipe.  \n\nI know I literally broke up with someone over this.  She only ate like 5 dishes and never wanted to travel anywhere.  The woman I married and I, on the other hand, recently ate a mealworm bagel to see how it was (pretty good).\n\nThe relationship advice I'd give is that if you love him and everything else is really good, then you have to indulge in this stuff yourself.  You should cook for yourself and invite him to eat with you when you're making something that meets his parameters.  Otherwise, you two should not be sharing cooking duties for one another.  Perhaps you eat out more often and save money in other areas.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Primary-Friend-7615",
            "body": "If you care about your partner and want to build a life together, I don’t know that I’d listen to the advice to just make what you want on your nights and let him eat a sandwich. It’s more convenient for you, sure - you get to make and eat what you want. But it sounds like you’re willing to eat everything he likes… so then it’s not a fair division of labour if he’s making food for both of you one week, and then making food for himself the next. That’s only going to breed resentment, because he’s always having to make food while you get every other week off.\n\nI’ve been with my partner for 20 years, and we both have things we love that the other doesn’t eat; I won’t eat anything out of the water and don’t like meat on the bone, while my partner won’t eat rice or gourds. But there are plenty of things out there that don’t contain fish, or where rice can be substituted with something else. And if I really want a curry and they really want fish, we go to a restaurant, or make separate dinners. \n\nYou need to deal with this as a team. So draw up a 1 or 2 week menu of foods you both like, and maybe throw in a “wildcard” night each week where 1 person gets to serve whatever they want, and/or 1 night where you each fend for yourselves.\n\nThen, on _some_ of your “wildcard” nights, you can serve something that’s a little out of his comfort zone. Substitute chicken breast for thigh, or take the meat off the bone before it’s served. Try things that have  similar flavour and texture component to the things he does like - if he likes spaghetti, try different pasta and different sauces, add spinach to your meat sauce, etc. If he likes stew, substitute lamb for beef, or add tomato to change the broth profile (or both, tomato lamb stew is so good). Go through recipe books and recipe websites together, and try to find things that he likes the sound of, or that could be adjusted a bit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JellicoAlpha_3_1",
            "body": "Look\n\nYou made the decision to date a man who will NEVER Share your love of food.\n\nPartners are not DIY projects\n\nThis is who he is.  \n\nSo stop expecting him to magically change for you.  Some people do not enjoy trying new things.\n\nAnd that is OK.\n\nIf you want a man with a refined palate...date someone else\n\nThis guy is a basic dude with some food quirks.  And that is ALWAYS who he is going to be\n\nTake it or leave it",
            "score": 6,
            "replies": [
                {
                    "author": "Unfair_Finger5531",
                    "body": "I agree with this. It is just not sustainable.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FragrantOpportunity3",
            "body": "I couldn't be with someone who is so limited in what they eat. I love different cuisines and am always ready to try something new. That's a deal breaker for me.  I want a partner that eats like an adult.",
            "score": 10,
            "replies": [
                {
                    "author": "Unfair_Finger5531",
                    "body": "Adults eat differently. You are implying that maturity = expanded palate. But we all have food preferences, and some people just aren’t into exploring a wide variety of foods.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FragrantOpportunity3",
                            "body": "True but my preference is to not be with someone who thinks dinner is chicken nuggets. I want to be with someone who also enjoys exploring different cuisines.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TroublesomeTurnip",
                    "body": "Agreed. Food should add joy to your life, not stress.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TroublesomeTurnip",
                    "body": "Agreed. Food should add joy to your life, not stress.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MoldyWolf",
            "body": "As a big fancy cooker myself what's worked since I moved in with my partner has been cooking something elaborate/fancy/unusual on the weekend and then having things that are quick and easy to make for the weekdays. I find this to be a good balance between the creative cook energy I gotta get out somehow and also recognizing you might be tired/not want to spend 2 hours in the kitchen on a weekday. If you make the weekend meal big enough it can be lunches for the week you can take as leftovers and then you can make stuff like some basic tacos, pasta, salad, etc for easy meals during the week.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pl487",
            "body": "Make a larger batch of the food he wants one night, the next night he can have leftovers or the food you want. Everyone wins except maybe the grocery bill. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "SnooPets8873",
            "body": "Aren’t you exaggerating a little? No meat broth based soups? Why? I make them all the time with no bones. Use boxed broth if he can’t stand to have broth that you made yourself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Basic-Leek4440",
            "body": "It sounds like this switching each week arrangement you have simply isn't working.  Since you are both established adults in your 30's, it's probably time to just cook for yourselves.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChemistryPerfect4534",
            "body": "He *may* change. I know a lot of the comments are telling you he won't, but that isn't certain.\n\nI am an *incredibly* picky eater. I always have been. My wife knew this going in. We agreed since I was better at cooking the *very* limited menu that I would eat, I got to do the cooking. When we had kids, we would switch, because we didn't want any kids to grow up as picky as me if we could avoid it.\n\nAs it turns out, those kids never happened, so almost three decades later, I still do all the cooking.\n\nOur meals were *very* repetitive. I actually enjoy cooking, and was very good at a very small number of things. But there's a ton I won't eat.  Seafood is out. I hate it all.  Breaded or not, it's a no go. My wife likes it a *little* more than I do.  A couple times a year she will order fish and chips when we go out. This one isn't a big issue for us.\n\nI don't eat *most* meats, and I absolutely can't eat beef. I won't keep it down. While I like some more exotic, and pricey, meat, the only really budget friendly meat I will voluntarily consume is pork. I work around that most of the time without issue.\n\nI hate most vegetables, and the few I like almost all need to be raw. For example, I like raw carrots, but I *hate* them cooked. This is harder to work around.\n\nFor the first eight years of our marriage we basically rotated through half a dozen things I would eat. My wife was very patient. I *was* willing to try new recipes, as long as they were made of things I liked, so there was some relief for her.\n\nThen for about five years we had a significantly larger amount of money, so we ate out *a lot*. But good fortunes come and go.\n\nAbout a decade ago, I had a stroke while I was still in my 30s. I couldn't work. So now I was cooking *all* my meals, three times a day. I was fairly content eating the same things every day while she was at work. Supper was frustrating though. After close to two decades, the repetitiveness was getting to her. The longest part of supper was deciding *what* I would make. And my reduced ability post-stroke meant some things were off the table on some days. Then quarantine happened.\n\nNow I was making *both* of us food three times a day. Suddenly making the same things every day became a problem. I'd always found my own pickiness frustrating.  Like your boyfriend, I could force myself to eat *some* things when I was with company, but there were still very strict limits. Eating at other people's homes was often problematic. Even going out to eat *always* meant Googling a menu so I knew there was *something* I'd eat.\n\nPOST TOO LONG - CONTINUED BELOW",
            "score": 2,
            "replies": [
                {
                    "author": "ChemistryPerfect4534",
                    "body": "We had discussed ways to try to make cooking easier on me. We talked about meal kits, but I was in no hurry to do so. Then a door-t-door sales guy came around during late quarantine. We pulled the trigger.  \n\nCertain things were non-negotiable. Meat wasn't changing, but I was determined to eat outside my comfort zone, if only to add some variety. So with a commitment to three meals a week, I started making things I never had.\n\nAt age 46, twenty-five years into our marriage, I made rice for the first time. Mayonnaise was suddenly a part of a disturbingly high percentage of our meals. More vegetables than ever were being consumed. I was determined I would try anything at least once.\n\nSome things were only once.  It wasn't magic. I still *hate* a lot of foods. But it was better. *A lot* better. I'm never going to eat beef. Mushrooms are still anathema. But I routinely have bok choy in the fridge. I think I have *four* different kinds or rice on hand, each for different applications. I own a rice cooker. I voluntarily buy mayo, mustard, and vinegar, *all* things I wouldn't touch before. Sure, it needs to be the *right* kind of mustard, and a *particular* vinegar, but I eat them now.\n\nI'm still a picky eater. But I'm 1000% better than I was. We *can* change, because eventually repetition gets to us. There's no guarantee *he* will, but don't listen to all the posts saying he *can't*. There is hope.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "martesjupiter",
            "body": "Someone else commented mentioning 1-2 days a week you push him out of his comfort zone. I like this idea !! But also \nI suggest to go through recipes together, finding something you would both enjoy trying (with no pressure to love it !!) and making it together. Like a date night while exploring new tastes together, I think it could be very romantic..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unfair_Finger5531",
            "body": "I think you are really into food and he really isn’t. This isn’t even about him being a picky eater really. Some people just aren’t foodies and have a limited palate, and they are comfortable with that. Food is tied to security, and having foods one is comfortable with is a source of security. I think adults should be able to eat however and whatever they want. It’s a privilege of adulthood, and it’s a fundamental right to choose what goes into your body. \n\nYou should be with someone who shares your love for food. You grew up with a chef; you developed an appreciation for a wide variety of foods in your formative years. So, it is an important part of your life. Your bf, on the other hand, is one of those people who eats to live. He just doesn’t have a passion for food, and that’s okay too, \n\nBut I think this is an incompatibility issue. If you find his unwillingness to explore new foods problematic, just break up with him. Don’t keep trying to make him do it. I personally think this situation could be addressed by coming up with dishes you both love for dinner, but I think you are not open to this because you feel he should expand his palate. Unfortunately, you cannot make him do this, and you should not try. So, just accept that this relationship is not working for you and move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Less_Watch7655",
            "body": "I mean, what’s the issue exactly? Is it that you don’t like what he makes when it’s his week? As long as he’s not trying to feed you a steady diet of true crap, I think this is one of those things where you have to accept who he is. He’s not your dad, an actual chef, y’know? I guess I’m unclear on exactly what result you’d like. Can you elaborate?",
            "score": 1,
            "replies": []
        },
        {
            "author": "hillsb1",
            "body": "You sound a little snobbish, tbh. There's literally nothing wrong with classic meat and veg",
            "score": 1,
            "replies": []
        },
        {
            "author": "Honest_Bit_6770",
            "body": "Oh boy. I would as I do with my 6 year old. You don’t like what I’ve cooked tonight? There’s yogurt or peanut butter and jelly in the fridge, help yourself. He’s a grown up, so he can even move up onto chicken nuggets in the oven himself if he wants to.",
            "score": 5,
            "replies": []
        },
        {
            "author": "jamicam",
            "body": "If you are cooking for someone else, then you should try to accommodate their preferences as far as is reasonable. What is reasonable is up to the two of you to decide. Just talk it out with each other and figure out how to let you experiment with new recipes while keeping in mind his limitations. Maybe this one week at a time cooking isn't the best plan. Maybe you can menu plan together. There are lots of ways to figure this out - but it should be figured out together by communicating, being open with each other, and respectful of each other.",
            "score": 2,
            "replies": []
        },
        {
            "author": "gotalifetolive",
            "body": "Who made him and his boring pallet the decision maker on your week? Maybe your efforts will expand his pallet.  Make shepherds pie one night and tell him it's your ode to meat and potatoes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Slight-Pea5238",
            "body": "Could it possibly be sensory related?",
            "score": 2,
            "replies": [
                {
                    "author": "Senoritasmack",
                    "body": "I do think that’s a possibility, and I can relate in fairness",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Slight-Pea5238",
                            "body": "Have you asked him what he dislikes about the food? I have a cousin similar to your boyfriend, she won’t eat any meat with bones, limited vegetables,  she says she can’t get past the textures. She’s basically a chicken tender girl. If you want to explore culinary with him maybe look into food therapy.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Slight-Pea5238",
                            "body": "Have you asked him what he dislikes about the food? I have a cousin similar to your boyfriend, she won’t eat any meat with bones, limited vegetables,  she says she can’t get past the textures. She’s basically a chicken tender girl. If you want to explore culinary with him maybe look into food therapy.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FairyCompetent",
            "body": "I would treat this the same way as I do making dinner for my child. I cook what I like; I always include one thing I know she likes. I ask her to try a bite of everything. If she doesn't like it she can make herself a sandwich, no hard feelings at all. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Existing-Ad-4961",
            "body": "Sensory issues? Possibly the Tism or ADHD? \n\nI get the ick from certain foods randomly",
            "score": 3,
            "replies": []
        },
        {
            "author": "hael_frankie",
            "body": "I think stepping out of your comfort zone can be challenging, I personally eat everything though. I agree with others saying start off with one adventurous meal a week and build from there",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pandas-Brat",
            "body": "Just cook for yourselves for a while and see if that makes it easier. He will only change his habits if he wants to. You can't force him to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jownesv",
            "body": "I used to be really fussy with food and when I moved in with my boyfriend it got much better.  Hopefully he will try more foods and grow out of it like I did.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chaos-Rainbow",
            "body": "Alternate more adventurous meals with ones he's likely to eat. Make some extra of the familiar meal so he can reheat it next day if your meal of choice is not something he enjoys.\n\nAnd for things like the family meal I wouldn't veto what everyone eats just for the boyfriend. Just ask that there be a couple of things on the menu that will appeal to him - he doesn't have to love or eat every dish. And having it available may actually cause him to try something and realize he likes it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "personaperplexa",
            "body": "Hopefully your boyfriend will broaden his palate over time. My partner also doesn't like bone in meat or chicken thigh. You can adapt a lot of recipes to use chicken breast (with less cooking time for the breast). For his cooking, send him to recipetineats website. The instructions are particularly easy to follow and there's a range of dishes that he might be keen on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Open_Ebb9532",
            "body": "be thankful you don't have an actual chicken nugget partner",
            "score": 1,
            "replies": []
        },
        {
            "author": "paper_wavements",
            "body": "I married someone who, over a decade in, I suspect has ARFID. I am not going to lie, it isn't easy. Food is mixed in with our lives. We basically can't accept dinner invitations to people's homes because he is so picky—not just a long list of foods he doesn't eat, but he needs to know what else is part of the meal, because he needs to eat this food with this other food, etc. He gets very nervous about potlucks because he worries he won't get enough to eat. And that's part of it, worrying about being hungry. For me, if I was concerned, I'd bring a protein bar or two & eat that, because I don't want to make trouble, but apparently that isn't an option for him. \n\nWe have made it work by finding a few things we both eat, some nights we fend for ourselves, & one night a week we get takeout, & another night we eat the leftover takeout. \n\nYou have my sympathy, & he had better be EXCEPTIONAL in EVERY other way for you to tolerate this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zanne54",
            "body": "I once had a first date with a vegan. Nice enough guy, but food restrictions/not being able to cook with or share meals was not for me. \n\nPersonally, food is too important to me; I wouldn't have made it to 2 years with a toddler's palate. I don't want that for the rest of my life.\n\nYMMV",
            "score": 1,
            "replies": []
        },
        {
            "author": "will555556",
            "body": "Grab a bag of frozen chicken nuggets and tell him he can eat this or make something else on so-so day this week, your(I'm) eating *insert new food* there will be extra if you want some.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FalseAd4246",
            "body": "I think your characterization of him as a “chicken nugget boyfriend” is over the top and snooty. His dad wasn’t a chef, but you admit he can cook basic things. He doesn’t like fish and the way you’ve written this makes it seem like you take it as a personal affront. I don’t like bone-in foods either because they’re messy and I hate fighting with my food, and I like meat not gristle and tendon and blood vessel. You need to grow up a little and stop acting like your boyfriend not liking some of the same foods as you is some sort of failing on his part.",
            "score": -5,
            "replies": [
                {
                    "author": "Less_Watch7655",
                    "body": "I would put it a little more gently but I agree. There are SO many other things to get worked up about!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "txlady100",
            "body": "I. Could. Not.",
            "score": 0,
            "replies": []
        },
        {
            "author": "InvisibleChance",
            "body": "He is being a big baby. Not even soup with bone broth? Give me a break. Cook what you want. Let your dad cook what he wants. If your boyfriend doesn't like it, he can heat up his frozen chicken nuggets in 15 minutes or less.",
            "score": 0,
            "replies": []
        },
        {
            "author": "OwO-ga",
            "body": "Real answer, you’re going to be with this man for the rest of your life. Doesn’t that scare you? Find a man who’s not a chicken nugget boy and you’ll be much happier.",
            "score": 0,
            "replies": []
        },
        {
            "author": "blue_cornflowers",
            "body": "No one has died in front of a full plate. Cook what you like, either he eats it, goes hungry or makes something for himself. You are not his private chef",
            "score": 0,
            "replies": []
        },
        {
            "author": "dell828",
            "body": "Right now, he makes what he likes, and you make what he likes. Does that mean that you never get to eat what you like?",
            "score": 0,
            "replies": []
        },
        {
            "author": "ZealousidealRice8461",
            "body": "Cook what you want to eat. If he eats it great, if not that’s his choice. He needs exposure to increase his palate.",
            "score": 0,
            "replies": []
        },
        {
            "author": "AcidicAtheistPotato",
            "body": "Why is everything catered toward his taste though? When it’s your turn, cook whatever you like, he’s welcome to eat whatever you make, and when it’s his turn, he can cook however he likes. Otherwise, each one eats whatever they cook, save the leftovers of what the other would’ve eaten and you can eat that the next day 🤷🏻‍♀️",
            "score": 0,
            "replies": []
        },
        {
            "author": "rarflye",
            "body": "So the boy lives off highly processed food. Barely eats fibre.\n\nif you're in it for the long haul, start slow, like with any picky eater. Introduce one single side dish, or an ingredient that he can opt to add. This will be a battle, and may even have mental health causes.\n\nAnd at 37, this is quite the age to have these kinds of preferences. I wouldn't be able to compromise on food at that point. I'd let him cook what he wants, and make what I want and forget the 50/50 system. I'm not dumbing down my palate to toddler levels for anyone.",
            "score": 0,
            "replies": []
        },
        {
            "author": "FartMasterChamp",
            "body": "You're the one that chose to raise this grown ass man and be his mommy.\n\n\nWhy are you complaining now?",
            "score": -1,
            "replies": []
        },
        {
            "author": "Worldly_Yellow9134",
            "body": "Could never date, let alone live with someone, with such a bland and childish mindset toward food.\n\n\nMake food you want and he will eat if he's hungry.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Hummingbird4Ever41",
            "body": "He is 37 he should be eating everything you make on your week. You shouldn’t have to cater to him just cause he doesn’t like anything you make. If he complains then tell him he can cook for himself for now on",
            "score": -1,
            "replies": [
                {
                    "author": "Unfair_Finger5531",
                    "body": "Being an adult doesn’t make you like foods you don’t like. He could be 67 and still not like certain foods.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Expensive-Opening-55",
            "body": "I’d cook what you want and tell him to try it or he can eat something else. He’s a big boy, this is ridiculous. For example, I don’t necessarily like meat on the bone but I will cut it off for myself or eat the sides. My bf makes a lot of meals I wouldn’t make myself but I often find that when I try them, they’re pretty good. He’s making what he wants on his weeks. It’s not the food you’d prefer. Why should you do any different? You aren’t making food he’s allergic to or truly cannot eat. Worst case scenario, invite me over for dinner. This sounds delicious!",
            "score": 0,
            "replies": [
                {
                    "author": "Less_Watch7655",
                    "body": "Agreed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cressidacole",
            "body": "Make whatever you want. Doesn't sound like he cares about catering to your wishes on his weeks.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ImmanualKant",
            "body": "I hope this isn't too harsh, but the reason he is like this is because he's entitled and has people in his life who cater to his entitlement.  Tell him to stop being such a baby and eat the food you serve him. He's not going to starve to death.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hefty-Analysis-4856",
            "body": "This is an ED, and usually a commodity with neurodivergence. He has something called ARFID (avoidant restrictive food intake disorder). He has a better cause than I’ve heard from most, but definitely  something that’s out of your pay grade.",
            "score": -2,
            "replies": []
        },
        {
            "author": "FalseAd4246",
            "body": "I think your characterization of him as a “chicken nugget boyfriend” is over the top and snooty. His dad wasn’t a chef, but you admit he can cook basic things. He doesn’t like fish and the way you’ve written this makes it seem like you take it as a personal affront. I don’t like bone-in foods either because they’re messy and I hate fighting with my food, and I like meat not gristle and tendon and blood vessel. You need to grow up a little and stop acting like your boyfriend not liking some of the same foods as you is some sort of failing on his part.",
            "score": -7,
            "replies": []
        }
    ]
}