{
    "title": "Kaitlin Olson Says Her and Rob McElhenney's Kids Adopted Their 'Horrifically Inappropriate' Humor: 'You Can't Say That at School'",
    "author": "cmaia1503",
    "subreddit": "entertainment",
    "rank": 15,
    "score": 4778,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 72,
    "url": "https://people.com/kaitlin-olson-says-her-kids-adopted-her-horrifically-inappropriate-humor-11695372",
    "id": "1jdgdd1",
    "selftext": "",
    "comments": [
        {
            "author": "cmaia1503",
            "body": ">“My son, my 14-year-old, is…we’ve tried to keep both of them away from Sunny,\" she begins. \"I had both of them while we were shooting the show. That’s how long it’s been. And we can’t keep it from him anymore.\" \n\n\n\n>Seth Meyers asks if they're young teens, which Olson affirms, saying they're 12 and 14.\n\n\n\n>Meyers then asks if they ever try to get away with things like comedy bits, since they're entering their teenage years.\n\n\n\n>“Listen, they’re both very funny. But at this age, the sense of humor they’ve adapted from us is just so horrifically inappropriate,\" jokes Olson. \"We’re like, ‘Ooo! You’re so close! Like in a few years, you’re going to fine-tune that and be so funny, but you can’t say that at school.’\"\n\n\n\n>\"It’s really, it’s such a fine line. I mean, they make us laugh, but it’s a fine line,\" she continues. \"I talked to my therapist about it, and she was like, ‘Okay, you can laugh, but what you need to say is, “Now, I think that’s funny, but let’s imagine you’re out in the real world. People don’t understand who you are. They might think you’re a rapist or a murderer.”’",
            "score": 1151,
            "replies": [
                {
                    "author": "KillMeNowFFS",
                    "body": "\nThink about it. She’s out on a field trip, in the middle of nowhere with some classmate she barely knows. She looks around her, what does she see? Nothing, not even a teacher. ***“Oh, there’s nowhere for me to run, what am I gonna do, say no?”***",
                    "score": 491,
                    "replies": [
                        {
                            "author": "CutlerAF",
                            "body": "Dennis probably loves the concept of a permission slip.",
                            "score": 176,
                            "replies": []
                        },
                        {
                            "author": "khaleesi-90",
                            "body": "Makes me laugh since I watched this show when it first started airing and I was 15 🤣 it for sure shaped my sense of humor",
                            "score": 43,
                            "replies": []
                        },
                        {
                            "author": "ButtBread98",
                            "body": "Because of the implication",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Roguespiffy",
                                    "body": "Are you going to hurt these women?!",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ButtBread98",
                                            "body": "No, no one is in any danger!",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tbiards",
            "body": "“Rob, Kaitlin your kids are running around calling people birds and stupid bitches”",
            "score": 580,
            "replies": [
                {
                    "author": "theBERZERKER13",
                    "body": "Their dogs were also running around freely back a few years ago, at a birthday party for a ten year old at their house. One of their untrained German Shepherds bit the face of a 2 year old girl, nearly ripping her cheek off. They were repeatedly asked to tie the dog up but they refused and then inevitably this happened.\n\nThey have tried to scrub the internet of the incident but you can still find it.\n\n[edit] it was actually an 18 month old that was mauled, not a ten year old.",
                    "score": 179,
                    "replies": [
                        {
                            "author": "tbiards",
                            "body": "Whoa holy shit. I never heard of this. That’s wild and pretty shitty of them.",
                            "score": 80,
                            "replies": []
                        },
                        {
                            "author": "Boring-Monk2194",
                            "body": ">Their dogs were also running around freely back a few years ago, at a birthday party for a ten year old at their house. One of their untrained German Shepherds bit the face of a 2 year old girl, nearly ripping her cheek off. They were repeatedly asked to tie the dog up but they refused and then inevitably this happened.\n\n>They have tried to scrub the internet of the incident but you can still find it.\n\n>[edit] it was actually an 18 month old that was mauled, not a ten year old.\n\n\nThis is the content I come to Reddit for",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "LongConFebrero",
                                    "body": "Yeah first hand accounts of the most obscure subject never fails to entertain me.",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mikeylee31",
                            "body": "I just googled this and found several articles about it. I don't think they've tried to \"scrub the internet of the incident\" as much as it happened in 2012, they were sued and the situation has been settled one way or another.\n\nThere was a reddit post four years ago where someone said: [Kaitlin did mention this on a Instagram a few years ago when someone brought up this incident on one of her dog posts. She seemed to speak with a lot of regret and remorse about the incident, but of course Instagram makes it impossible to find posts like these.](https://www.reddit.com/r/IASIP/comments/pbjpeu/comment/hacgnni/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) So I'm sure it's just something they don't like to talk about because of the regret they likely have.\n\nAlso, saying their dogs were running around freely makes it sound like they were roaming the neighborhood and attacked a baby. The incident happened at their house. Sure, they could have put the dogs inside or leashed them, but if the mother of the child was so worried and asked them to leash the dogs, why did she allow her daughter to pet the dog? From a Metro Philadelphia article about the incident that references the mother's blog:\n\n[Even the dog’s owners were clearly horrified and shocked that their dog had done this. Z was petting the dog when out of nowhere the dog snapped and attacked her viciously. This happened within a foot of me, and Z was thrown to the ground, badly bitten on her face, and the dog had her pinned down on her back on the ground. The right side of her face was so severely bitten it was no longer connected, save one small area.](https://metrophiladelphia.com/professional-acupuncturist-sues-always-sunny-stars-for-alleged-dog-bite-ofbaby/)\n\nShe was so concerned but was allowing her daughter to pet the dog and was within a foot of the whole thing?\n\nHer blog post was linked in that article but the post isn't even on her blog any longer. [https://www.realfitmama.org/2013524national-dog-bite-prevention-week/](https://www.realfitmama.org/2013524national-dog-bite-prevention-week/)\n\nI don't know though. Just seems odd to say they're trying to scrub the internet of this to try and paint them in some villainous light.  \n\n  \n\n  \n\nEdit: I searched her blog and found a post talking about the accident and she doesn't seem to harbor any negative feelings towards the family. The post is titled [The Power of Prevention ](https://www.realfitmama.org/the-power-of-prevention/)and she says: \"The dog that attacked my daughter was an older, friendly, kid-friendly and much-beloved family pet. The owners were as shocked as we were that this happened. This was a dog with a loving home, with small children in the home, and who played daily with kids and showed no traceable signs of aggression.\" She talks about the statistics of dog bites on small children and what parents can do to help prevent these types of accidents. I also think you're a little out of place calling the dog untrained and I have not found anything where the dog was aggressive or they were asked repeatedly to leash the dog.[ A TMZ post says: The child's mom, Julie DeLagarde, says she let it be known she didn't want her daughter around the dog ... but Kaitlin and Rob (who are married) did not leash the dog.](https://www.tmz.com/2014/06/16/its-always-sunny-in-philadelphia-dog-bite-lawsuit/) Yet again, she was letting her daughter pet the dog. \n\nLast point, it wasn't a birthday party, it was at a Father's Day party. So yeah, there were probably a good amount of kids there, but I don't think it was as overstimulating as a kids birthday party like I saw you mention in another comment.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "B00k555",
                                    "body": "You have provided some very important context! Thank you!",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pvt-Snafu",
                    "body": "At least they're quoting the classics.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "GeddyVedder",
            "body": "Kaitlin to her kids:  “You just said a lot of bad words.”",
            "score": 151,
            "replies": [
                {
                    "author": "HerbaDerbaSchnerba",
                    "body": "Your mom doesn’t know dick. She’s a dumb fat cow. And your sister… she’s a stupid little shitmouth bitch, isn’t she.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "spssky",
                            "body": "Moms are stupid …. *doiiiiiiyyyyyyy*",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "uncoolcentral",
            "body": "“We walked in on him the other day, the 14-year-old, watching the episode where Mac builds the Ass-Pounder 4000… an exercise bike that has a penis coming out of it to motivate you…”",
            "score": 114,
            "replies": [
                {
                    "author": "Gang_Bang_Bang",
                    "body": "***Fist** coming out of it to motivate you.,",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "thomasbourne",
            "body": "I just picture their kids saying “god…dammit” in an exasperated way like Mac always does lol",
            "score": 32,
            "replies": []
        },
        {
            "author": "NoEmu5969",
            "body": "She’s still my favorite Olsen twin. /s",
            "score": 73,
            "replies": [
                {
                    "author": "Liaooky",
                    "body": "You made me double check if they're atleast related though. Even with the sarcasm tag :|",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "2hats4bats",
            "body": "We too are a “you can’t say that at school” family instead of a “you can’t say that” family",
            "score": 22,
            "replies": []
        },
        {
            "author": "DefNotAFamousPerson",
            "body": "The kids both wanted to play Murtaugh…",
            "score": 6,
            "replies": []
        },
        {
            "author": "Ok-Address-9685",
            "body": "Whatever. Dee is a bird.",
            "score": 39,
            "replies": [
                {
                    "author": "Tyler_durdens_son",
                    "body": "Bird arent real.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Sambo_the_Rambo",
                            "body": "Bird law says otherwise.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "chucklingabyss",
                                    "body": "Filibuster",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ElDuderino_92",
            "body": "Their kids walk into class “what up, boners”",
            "score": 14,
            "replies": []
        },
        {
            "author": "CombinationNo5828",
            "body": "holy shit i can't believe axel is 14!! i remember when he was born!",
            "score": 12,
            "replies": []
        },
        {
            "author": "Capt_REDBEARD___",
            "body": "I love IASIP and I love the Mac and Dee characters but I really can’t stand either of them as real people.",
            "score": 26,
            "replies": [
                {
                    "author": "Saint-45",
                    "body": "Why not?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Capt_REDBEARD___",
                            "body": "I don’t like their IRL personalities. I don’t like their personalities in the show too, but I like the comedic beats they hit and I think they did a great job giving life to those characters and I can respect them for that. But that doesn’t mean that I like them as people, which I don’t. I also really dislike Ryan Renyold’s personality so it tracks that I wouldn’t like his friends either.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "Haecede",
                                    "body": "I low key hate Ryan Renoylds too. I'm pretty sure I wouldn't be able to stand hanging out with him but I love his acting.",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "unclericostan",
                                    "body": "It’s so refreshing to hear someone else who loves the show say this. I get supremely bad vibes from them *and* Ryan Reynolds and there are many indications they all kind of suck. Every time I mention it, people crawl out of the woodwork like I just insulted their own personal best friends. Parasocial. Anywho, muting this comment for that very reason. Later, boners.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Saint-45",
                                    "body": "Ohhhhh so you’re just a hater",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "NoOneExpectsDaCheese",
                                            "body": "There are some inclinations that rob is an arsehole, as seen how he potentially (being a key word) treated his ex who would have been Dee on the show.\n\nAlso you can tell by his persona from the podcasts etc he is up his own arse. And this is from someone who's a huge fan of the show.",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -13,
                                                    "replies": [
                                                        {
                                                            "author": "Tasty-Traffic-680",
                                                            "body": ">What have you accomplished?\n\nSo far I've beat Metroid Fusion and Zero Mission at least 3 times each so I get where Rob is coming from. Once you've seen the world from so high up it's hard to bring yourself back down sometimes.",
                                                            "score": 26,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "VociferousReapers",
                                                            "body": "I built an Ass-Pounder 4000. What have you done?",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Boring-Monk2194",
                                                                    "body": "I touch computers so good someone flew me to Japan to talk about it\n\n>!published scientist, professional hacker, and *single*!<",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Capt_REDBEARD___",
                                            "body": "I guess so - if not liking someone is being a hater? I didn’t realize I had to like everyone.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "pepperNlime4to0",
                                                    "body": "No, you don’t have to like everyone. But hating on someone for no actual reason does, in fact, make you a hater",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "theBERZERKER13",
                                            "body": "They also let their untrained German Shepard bite and almost the rip the cheek off a 18 month old girl’s face at a birthday party they were having at their house. Even after repeated requests to tie the dog up on a leash, it was allowed to roam around freely, then the inevitable happened. \n\nThey’ve tried to have the incident scrubbed from the internet but you can still find it\n\n[edit] 18 month old was attacked, not a ten year old.",
                                            "score": 36,
                                            "replies": [
                                                {
                                                    "author": "MiserableSkill4",
                                                    "body": "\"Inevitable\" i don't think you know what that means. There are millions of events with dogs happening all the time where a dog doesn't bite a child's cheek off",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "author": "theBERZERKER13",
                                                            "body": "When the untrained dog is showing aggressive behavior and is surrounded by unfamiliar people (children especially) in a hectic environment like a child’s birthday party…. When guests ask you to tie the dog up because it’s acting aggressively around the children and you refuse.\n\nYeah these things are inevitable with factors like those.",
                                                            "score": 35,
                                                            "replies": [
                                                                {
                                                                    "author": "UKophile",
                                                                    "body": "Strong reply.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Tinkerer0fTerror",
                                                            "body": "Maybe it’s just you who doesn’t get it.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DetroitLionsEh",
                                            "body": "Exactly lol",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ihopeicanforgive",
                                    "body": "You know them personally eh?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Capt_REDBEARD___",
                                            "body": "I dislike the IRL personality they have curated and marketed through their publicist. I don’t like the IRL product they are selling. I like the IASIP product. I do not like the Rob McElroy and Kaitlin Olson product. I like the Mac and Dee product.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "struggle2win",
            "body": "You mean you taught your kids your humor. Good job.",
            "score": 12,
            "replies": []
        },
        {
            "author": "NYtoJers",
            "body": "So like every other teenager, amazing i guess ...",
            "score": 5,
            "replies": []
        },
        {
            "author": "ARoodyPooCandyAss",
            "body": "Sunny is the most underrated show. There are 15 seasons of it and most are BRILLIANT!",
            "score": 7,
            "replies": [
                {
                    "author": "esmerelda_b",
                    "body": "I’m doing my first watch now. On season 5. Keeps getting better.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "disposable_hat",
            "body": "\"They just kept running around the classroom throwing salt and yelling \"get out of here Snail!\"\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bodaciousbob3",
            "body": "I bet is is hard for the teachers to not laugh while telling their kids that they can do or say those things.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CheeseMate38",
            "body": "Hopefully the kids don't adopt their parents plastic surgery habits.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Winter_Whole2080",
            "body": "Where do you think we learned all that bullshit?",
            "score": 1,
            "replies": []
        },
        {
            "author": "a_velis",
            "body": "Comedy is the art of getting away with it. Always Sunny comedy is not gonna work with everyone and thats fine. As long as the kids adapt to their audience they should be good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CarneyVore14",
            "body": "That’s poor parenting?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Numerous_Mud_3009",
            "body": "What’s with everyone using bad grammar - SHE, not her!",
            "score": -20,
            "replies": [
                {
                    "author": "opesosorry",
                    "body": "You’re so confidently incorrect",
                    "score": 23,
                    "replies": []
                }
            ]
        }
    ]
}