{
    "title": "Chet Hanks Says His Parents Stuck with Him 'Through Thick and Thin' as He Talks About Sobriety: 'Really Grateful for Them'",
    "author": "mcfw31",
    "subreddit": "entertainment",
    "rank": 7,
    "score": 194,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 57,
    "url": "https://people.com/chet-hanks-says-his-parents-stuck-with-him-sobriety-tom-hanks-rita-wilson-11698906",
    "id": "1jed0fy",
    "selftext": "",
    "comments": [
        {
            "author": "markazali",
            "body": "People can change",
            "score": 1,
            "replies": [
                {
                    "author": "davetoxik",
                    "body": "People can change. I used to be a piece of shit. Spiked up blond hair, little bitty jeans, chicken spaghetti at Chikaleny’s. People can change. Let the boy hold the baby.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "markazali",
                            "body": "Live for new years",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Andrew1990M",
            "body": "Tom Hanks not a piece of shit. More at 11. ",
            "score": 101,
            "replies": [
                {
                    "author": "davetoxik",
                    "body": "He used to do sloppy steaks, though, and possibly had slicked back hair.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Andrew1990M",
                            "body": "[Oh yeah, that would slick back really nice](https://i.redd.it/s0xg31lljax81.jpg)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "I_chortled",
                                    "body": "YOU THINK THATS SLICKED BACK???",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheRed_Warrior",
                                            "body": "THIS IS PUSSSHHHHHED BACK",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ExtraGloves",
                    "body": "Chet Hanks rules. Back at 12.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Jakeanetik",
                            "body": "Let’s not go that far",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "-Quothe-",
                    "body": "To be fair, trump seems to be standing by Jr as he struggles with sobriety.  Or is oblivious, whichever.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GaJayhawker0513",
                            "body": "What the fuck does that have to do with this?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mcfw31",
            "body": "> \"What I've learned along the way is that family, whether it's blood or found, do make you feel shy and embarrassed when you're not doing the right things and the most proud when you are,\" she said.\n\n> Chet shared his own experience and praised his parents for supporting him \"through thick and thin.\"\n\n> \"I don't take it for granted. I'm really, really grateful for both my parents. I'm at the age where I'm just really grateful for them,\" he said. \"I really cherish the time that I have spent with them.\"",
            "score": 20,
            "replies": []
        },
        {
            "author": "Sphiffi",
            "body": "I’ll always laugh at Chet revealing that Tom Hanks asked him for a TLDR of Kendrick/Drake beef",
            "score": 1,
            "replies": []
        },
        {
            "author": "That_Palpitation_107",
            "body": "Has he eventually come right ? Good for him",
            "score": 1,
            "replies": [
                {
                    "author": "Klexington47",
                    "body": "Yup! Watch the new Netflix show with Kate Hudson, he's great in it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "heepofsheep",
            "body": "Is this the son who had the bizarre fake Jamaican accent for some reason?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MDFHASDIED",
            "body": "Sober Boy Summer.",
            "score": 20,
            "replies": [
                {
                    "author": "HanSolosSizzledHeart",
                    "body": "It’s still White Boy Summer, but Sober White Boy lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SkylerBeanzor",
            "body": "You mean Tom Hanks is a good parent? Totally not shocked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlbertaAcreageBoy",
            "body": "I thought he only had one son. Who the fuck is Chet? Good for him though.",
            "score": 1,
            "replies": [
                {
                    "author": "ExtraGloves",
                    "body": "Chet is the cool one.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "me_no_no",
                    "body": "He has 3 sons and 1 daughter",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ceruveal_brooks",
            "body": "I want to like him.  Maybe this is the start of that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "why_am_i_here_999",
            "body": "I knew the drugs made him think he could rap lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "DumplingBoiii",
            "body": "Glad to hear Tom Hanks is a good dad",
            "score": 1,
            "replies": []
        },
        {
            "author": "GunnieGraves",
            "body": "Is he still speaking with a fake Jamaican accent?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConsciousReason7709",
            "body": "Blood is thicker than water.  Throughout my life, I have made many baffling and stupid decisions that put my parents in bad positions, yet they have always supported me and helped me through it.  They didn’t have to, but they did.  I’ll always be thankful and love them for that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mcgoof41",
            "body": "I was impressed with him on that Netflix show.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Littleittle",
            "body": "Met him on a flight he was really kind and talked to me for awhile. He watched Office Space",
            "score": 1,
            "replies": []
        },
        {
            "author": "seeyousoon2",
            "body": "Dude your dad played Mr Rogers and nobody had anything bad to say about that. I'm not surprised by this story at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "coatdogg",
            "body": "Seeing Chet on the Adam Friedland show changed my mind about him. He seems like a good person underneath it all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mother_of_wagons",
            "body": "Wasn’t he a Covid denier/anti-vax guy during the pandemic?",
            "score": 1,
            "replies": []
        },
        {
            "author": "sagsfour20",
            "body": "Tom Hanks is the greatest of all time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheRauk",
            "body": "Yes drug and alcohol free finally at 34.  One has to wonder what kind of upbringing and parental care led him to alcohol and drug abuse for two decades.",
            "score": 1,
            "replies": [
                {
                    "author": "Jayrodtremonki",
                    "body": "One also has to wonder what kind of upbringing led to Colin Hanks?  Or his other 2 kids?  We literally have zero information on the matter and it's weird to speculate when addiction can come from anywhere.  ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheRauk",
                            "body": "Then it is of course weird to celebrate that Tom Hanks is father of the year?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Stanley_Yelnats42069",
                                    "body": "Who said he was father of the year? You’re being a little dramatic.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheRauk",
                                            "body": "This is r/entertainment it is all dramatic.  Tom raised a drug addict who found sobriety at 34, good for Chet.  \n\nDown vote as much as you want.  Drew Barrymore’s parents were super stars as well, she is sober now too.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Stanley_Yelnats42069",
                                                    "body": "I didn’t downvote you drama queen, but I did now. Not that it matters.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TheRauk",
                                                            "body": "Well thanks for making a post to specifically highlight your downvote.  Who is the drama queen?\n\nAdios!",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Stanley_Yelnats42069",
                                                                    "body": "Still you",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Jayrodtremonki",
                                    "body": "Well, when it's his own child championing that cause I would like to think that he's a little bit more informed than the baseless speculation that you're engaging in.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheRauk",
                                            "body": "His own child through a press agent, please.  Tom Hanks, he’s the best.  I bet he is right up there with Courtney Love as parent of the year.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Jayrodtremonki",
                                                    "body": "His own child through the interview that this entire thread was posted about and quoted.\n\nIf you don't want to put Tom Hanks on a pedestal, that's perfectly fine.  He's a human with flaws that people love to pick apart because it makes us feel righteous to be judgmental.  I don't mean that condescendingly, we all do it.  \n\nBut you're just defaulting to the negative and then feeling indignant when nobody is coming along for the ride when the overwhelming evidence is to the contrary.  You are assuming that he mistreated or did a poor job raising his son because he became an addict, but you leave out the part where that son is the one crediting him with his sobriety and talking about how lucky he is to have him as a father.  Because you're only giving credence to the parts that confirm what you already believe.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "itsalicianotalicia",
                    "body": "Woah. Sometimes addiction can stem from innocence. And it's usually not a straight path once you're on that road. You deny. Try. Deny. Try again. \nIt seems like his trying has finally stuck this time around and I hope he continues to try... and not speak patois",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheRauk",
                            "body": "I hope he does as well, I am note sure what patois has to do with it.  What I am sure of is celebrating Tom Hanks here isn’t the win.  Good job by Chet, sorry his upbringing brought him these challenges.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "itsalicianotalicia",
                                    "body": "You have no idea if it was his upbringing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheRauk",
                                            "body": "And you have no idea if it was Tom, what’s your point.  \n\nThis feel good Tom Hanks is the best is disingenuous at best.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "itsalicianotalicia",
                                                    "body": "I don't even like the guy, you just seem like you have an ax to grind. This was about CHET hanks being thankful for having supportive parents through addiction. There's nothing disingenuous unless you know these people personally. I dont, do you?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}