{
    "title": "Eureka Seven 20th Anniversary Project Key Visual",
    "author": "ToonAdventure",
    "subreddit": "anime",
    "rank": 6,
    "score": 481,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 81,
    "url": "https://i.redd.it/t2mbqa1oqepe1.jpeg",
    "id": "1je04bk",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Spoiler tags are no longer required for events depicted in the anime up to this point, including those depicted in trailers, promotional videos (PV), key visuals (KV), teaser visuals, and next episode preview threads. However, **any spoilers regarding future plot points or events that occur later in the narrative, including information from source material or prequels, must still be appropriately spoiler tagged.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/anime) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Andreiyutzzzz",
            "body": "Maybe the 5th time is the charm, after a sequel and 3 movies almost no one liked",
            "score": 112,
            "replies": [
                {
                    "author": "BLACKOUT-MK2",
                    "body": "Being an Eureka fan is pain, man. So much stuff released after the main series and none of it as good.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "remmanuelv",
                            "body": "The two games for the ps2 were decent with nice stories. Specially the second one.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "OtherwiseDog",
                            "body": "I mean Xam'd was something....... not good, just something....",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "ant900",
                                    "body": "X'amed was fine, but it also has nothing to do with E7. Though it does get a lot closer to the feel than anything with E7 actually in the title",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NekoWafers",
                    "body": "I'm one of those few that actually kind of likes AO.\n\nI can't really defend much about the movies though. Those just felt like a half-assed attempt to replicate the Eva Rebuilds.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Andreiyutzzzz",
                            "body": "I also think the sequel was alright, but more so if it was its own thing. It hardly even feels like a sequel to Eureka Seven, just a mech show where the MC is coincidently the kid of Renton and Eureka. Change Nirvash's name and give Ao different parents and it would have been the exact same story",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "NekoWafers",
                                    "body": "Yeah, that describes it pretty perfectly.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "xCherry",
                            "body": "Idk creator did those movies because he hated the anime ending and wanted to canonize the bad ending he had originally in mind.\nTurns out that the production comitee was right to change the ending, everyone hates the movies.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Aetherdraw",
                            "body": "The movies were so bad they made me like AO even more.\n\nAnd Keiji Fujiwara , (RIP king) voicing adult Renton was peak ngl.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "MillenniumKing",
                            "body": "I enjoyed AO, honestly some of the best music in the series.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cosmiczar",
                    "body": "This is not an announcement of a new show or whatever. When an anime talks about an \"anniversary project\" they're usually announcing they are *commemorating* the show in some way, it could maybe be exhibitions, thetrical showings, or it could simply be this one key visual and nothing more. *If* there's going to be a new anime, the announcement still hasn't come.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Andreiyutzzzz",
                            "body": "Well I hope there isn't after all the failed attempts",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Comprehensive_Dog651",
                    "body": "And all those other Mecha shows that Bones did after to capitalise on its success",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Eddy207",
                            "body": "I mean, Star Driver was pretty sic, at least.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "liforrevenge",
                                    "body": "Loved that show. Character and mech designs were amazing and the music was fantastic too.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "404-User-Not-Found_",
                                    "body": "（<ゝω·）綺羅星☆",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "DirectionExact31",
                                    "body": "Star Driver was a little hard to follow imo, but pretty good in the end!\n\nI expected more from Captain Earth tbh",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SleeplessGrimm",
                    "body": "They were alright, but didnt come close to capturing the same magic as the original series",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Altruistic-Farmer275",
            "body": "Oh for the fucks sake Bones just don't torture our memories.\nPlease just don't try to re-tell the story, IF you don't have a planned 75 episode season with fully 2d animated LFO sequences and NO! Using the old 480p footage us NOT an option. \nE7 has a timeless story that has resonated with kids and adults back in 2006, and I'm sure it will resonate with children who just born today when they become adults. \nİt has the market and perfect source material and now hire a dozen studios, give them time and resources and don't get stingy.",
            "score": 53,
            "replies": [
                {
                    "author": "SkyPirateVyse",
                    "body": "Someone at Bones:\n\n\n\"Sooo, there's this new thing called _AI-animation_.......\"",
                    "score": 24,
                    "replies": [
                        {
                            "author": "AdNecessary7641",
                            "body": "Bones is legit one of the last possible studios I would expect to have to resort to AI.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Altruistic-Farmer275",
                            "body": "I can DEFINITELY see them using the AI crap.\nBut... last time they didn't use shitty cgi, I mean they DID use it but it was pretty cool.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Knuckleheaded-beardo",
                            "body": "AI-nimation.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shocketheth",
            "body": "Dunno if you saw it beforehand but I'm tagging you anyway.\n\n/u/Shimmering-Sky",
            "score": 14,
            "replies": [
                {
                    "author": "Shimmering-Sky",
                    "body": "I just woke up.\n\n[](#tiredaoi)",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Shocketheth",
                            "body": "[](#loliwave)",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rhaynebow",
            "body": "*Sees Charles and Ray*\n\nCome on BONES, my heart JUST finished healing.",
            "score": 16,
            "replies": []
        },
        {
            "author": "PainStorm14",
            "body": "Regular reminder for people to watch original Eureka Seven series\n\nStill THE best mecha anime ever and one of the best anime ever made",
            "score": 30,
            "replies": [
                {
                    "author": "Shimmering-Sky",
                    "body": "I'm hosting a rewatch for the original series right now and most of the people who're watching it for the first time are *loving* it, so yeah can confirm it's really really good.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "DireSickFish",
                    "body": "But it makes me sad.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "PainStorm14",
                            "body": "But happy eventually",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Beefmytaco",
                    "body": "Maybe I should rewatch it, cause I remember when it was on Adult Swim I honestly didn't like it at all. To me then it was cringe, dragged on way too long and seemed like so many periods of nothing was happening, then the ending was like wtf way out there.\n\nI just never saw how it was good like everyone else did, but hell when I was a kid I didn't like FLCL and grew to absolutely love it later on.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "PainStorm14",
                            "body": "It's definitely one to binge\n\nJust let the world suck you in and enjoy the ride",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "kenpachirama",
                            "body": "I actually cringed alot too when I was younger. Probably saw it around the same time as you. As I got older and watched it again in like my late 20's, Its nowhere near as cringe to me. Probably because I can sympathise with how kids act and I actually understand the story being told. \n\nHighly rec the rewatch. I actually think its only gotten better with time.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "HammeredWharf",
                            "body": "It's pretty slow and a little... strange in how it portrays characters. Like the whole series is full of extreme child abuse, but everyone just mildly disapproves of it, and then you're supposed to sympathize with these people.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ChrisG683",
                            "body": "I'm kind of the same way, every time it came on Adult Swim I just couldn't bring myself to finish an entire episode even though I love mecha.\n\nProbably my fault for not watching it properly, but so many other shows have never had the problem of drawing me in.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "HerpanDerpus",
                            "body": "I also watched it many many years ago and all I can remember is absolutely hating Renton lol\n\nI did not make it very far, but calling it the best mecha anime seems like...a take.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Fun_Procedure946",
                            "body": "My biggest problem with the show were the crew that Renton was a part of. Except for maybe Holland, none of them were interesting in the slightest. It's not like they all needed an arc of something but they were just so painfully boring. You could cut the amount of crew in half and it wouldn't even put a dent in the show at all. The enemy millitary guys that Dominic was with were way better than Renton's crew.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "walker_paranor",
                                    "body": "I call BS, the cast is memorable as hell and is one of the things that makes the show so endearing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MajorSery",
                                            "body": "Literally the only member of the crew I actually remember doing anything more than existing is the captain, and that's mostly because he was voiced by Crispin Freeman.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "walker_paranor",
                                                    "body": "If you don't remember Matthieu, Stoner, Moon Doggie or Talho then you simply were not paying attention to the show",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MajorSery",
                                                            "body": "Or it was 20 years ago and I found the show to be meh, so I just haven't thought about any of those characters enough times to retain any memory of them.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SpiritofBad",
                    "body": "Watch it where? I remember it wasn’t licensed anywhere.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SunLittle215",
                    "body": "I'm pretty sure there's a rule against calling something the best mecha anime of all time when you haven't seen a single Tomino show :p",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Joshawott27",
            "body": "I still haven't seen the third Hi-Evolution movie (the UK release has been MIA after mysteriously dropping from the release schedule over a year ago), but I have a special place in my heart for *Anemone* \\- it's not great, but had some unique ideas. Certainly more palatable than *Good Night, Sleep Tight, Young Lovers*.\n\n  \nAt this stage, I'm more morbidly curious to see what the hell they come up with next.",
            "score": 7,
            "replies": [
                {
                    "author": "Ojuice96",
                    "body": "Yeah, I thought the music was great too. If you liked Anemone, you should check out the last movie. I think it's much better, but you'll probably have to rewatch Anemone to refresh yourself, or else you'll feel pretty lost.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Joshawott27",
                            "body": "I wonder what’s happened to the UK release of *Eureka*. Anime Limited announced it, then quietly pulled the listing and haven’t spoken about it since.\n\nI appreciate how *Anemone* flipped the entire franchise on its head, and played around with aspect ratios and animation styles to depict the different realities. Even if the execution was shaky, I can’t help but feel charmed by the idea.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Ojuice96",
                                    "body": "I'm not sure but it took a long time for it to come to the US as well so I just ended up pirating it. If you'd like, I can dm you a link where you can stream or download it. Apart from that, the US has all 3 movies on Crunchyroll I believe, or you could try renting or buying from a service like Apple or Amazon.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BufalloCrapSmeller",
            "body": "20 years already?\n\nBONES should try doing another mecha anime if they can.",
            "score": 6,
            "replies": [
                {
                    "author": "B3nde",
                    "body": "They kinda tried with Metallic Rouge, and it was made by the Hi-Evo team too which means those are people still capable of doing 2D mechanical animation (which in today's industry is a gift from god). Idk if there would be demand for a new mech show anymore, since Gundam basically owns the market.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "walker_paranor",
                            "body": "1. Metallic Rouge isn't a mecha anime (it also sucked)\n2. Gundam has always \"owned\" the market, and there has always been room for great mecha anime that's different.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mami-kouga",
            "body": "I mentally cannot take much more of their attempts to make new projects from this franchise, please let this be anything other than an anime.",
            "score": 4,
            "replies": []
        },
        {
            "author": "dagreenman18",
            "body": "“Guys I promise we’ll get it right the 5th time! Really!” \n\n(Though GNSTYL was the best of everything that came after even if the bar is LOW)\n\nAnd what the FUCK do you mean “20th anniversary”?",
            "score": 7,
            "replies": []
        },
        {
            "author": "Infinity-Kitten",
            "body": "I really wanna know why E7 in particular keeps getting new projects. I thought it was a relatively obscure IP, does it generate a lot of revenue in Japan?\n\n\n\nOr to rephrase the question, where is my Full Metal Panic finale?",
            "score": 3,
            "replies": [
                {
                    "author": "Fun_Procedure946",
                    "body": "I read somewhere that the original creator of the series was never happy with the way that the original series ended and wanted it to be much darker or something but Bones wouldn't let him do that and now because of how instrumental this show was in putting Bones Studio on the map, they just let the creator do whatever he wants to with the series now as a way of showing gratitude because it's still his IP that put them on the map.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Styleranker",
                    "body": "Original series was quite successful after taking into account re-releases. It’s probably Bones most successful original ip from their og days.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NationalStrategy",
            "body": "I don’t know, the Hi Evolution movies kinda ruined the IP for me.",
            "score": 5,
            "replies": []
        },
        {
            "author": "BJRone",
            "body": "I don't know if the new project will be shit or not(only watched the OG series but its one of my all time favs), but this art goes hard.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RedRubyLush",
            "body": "lets hope they get it right this time",
            "score": 2,
            "replies": []
        },
        {
            "author": "countryd0ctor",
            "body": "So, how are they going to shit it up this time? I thought it's physically impossible after hi-evo.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Frontier246",
            "body": "I'm so burned out on Eureka 7 continuations after the original anime being pretty bad that I have no expectations for this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "liforrevenge",
            "body": "Can we just get the original show in a wide screen format?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Paradethejared",
            "body": "Please be something worthwhile, I absolutely loved the original.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ReforgedToTFTMod",
            "body": "I love eureka seven so much, such a great anime",
            "score": 2,
            "replies": []
        },
        {
            "author": "Styleranker",
            "body": "Maybe a remaster of the original series? Would be amazing if they cleanup some of the later episodes animation. Just PLEASE not another sequel",
            "score": 2,
            "replies": []
        },
        {
            "author": "ballisticwooter",
            "body": "I miss Keiji Fujiwara. Feels weird having an E7 without him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ToonAdventure",
            "body": "Source: [https://x.com/EUREKASEVEN\\_PJT/status/1901906424717853110](https://x.com/EUREKASEVEN_PJT/status/1901906424717853110)",
            "score": 3,
            "replies": []
        },
        {
            "author": "OtherwiseDog",
            "body": "I'm feeling old dog...... It's unreal how much time had past since this classic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zsmg",
            "body": "For once I'm actually hoping it's a pachinko machine, none of the sequel material captured the charm of E7.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaltAndABattery",
            "body": "Ugh, crap, now I've got Days stuck in my head again...",
            "score": 1,
            "replies": []
        },
        {
            "author": "botenerik",
            "body": "Pls just re-release the blue rays. That's all I need.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FuaT10",
            "body": "Eureka 7 was really good. But damn did they drop the ball with Eureka 7 AO and the movies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RulerKun_FGO",
            "body": "> 20th anniversary\n\ngod 😭😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "KTR1988",
            "body": "Somebody please lock Tomoki Kyoda out of the studio. I've had it with his 20 year misery fetish attempting to undo the original's happy ending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "7DeadlySynergy",
            "body": "the anime that Darling in the Franxx took their ideas from",
            "score": 1,
            "replies": []
        },
        {
            "author": "InternationalCan3189",
            "body": "Last time I watched this show was like 20 years ago when the finale aired here in Canada. I remember it very vividly. I should really check it out again, but these comments make me feel a little less enthusiastic lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "_kishin_",
            "body": "Loved E7 but sad ending to the OG",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoloWingRedTip",
            "body": "Declare Alternate Ocean non canon or I don't care",
            "score": 1,
            "replies": []
        }
    ]
}