{
    "title": "[Medalist] Episode 12 Preview",
    "author": "marshmallow_sunshine",
    "subreddit": "anime",
    "rank": 16,
    "score": 61,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.youtube.com/watch?v=g6zBZWZK7QY",
    "id": "1je2byr",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Spoiler tags are no longer required for events depicted in the anime up to this point, including those depicted in trailers, promotional videos (PV), key visuals (KV), teaser visuals, and next episode preview threads. However, **any spoilers regarding future plot points or events that occur later in the narrative, including information from source material or prequels, must still be appropriately spoiler tagged.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/anime) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "marshmallow_sunshine",
            "body": "[Smug Inori](https://imgur.com/a/8XQEBRF) most likely bragging about her coach's skating is sending me.",
            "score": 29,
            "replies": [
                {
                    "author": "zairaner",
                    "body": "They probably didn't even hesitate on the question of what to use as thumbnail for this preview.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "abandoned_idol",
                    "body": "Inori best self-insert.\n\nThe end of this season might be lethal for me.  No Medalist, no Dungeon Meshi, no Dorohedoro...\n\nMy one hope at filling this hole of lovable characters next season is looking to be \"Anne Shirley\", though I am grossly unfamiliar with the canadian novel.  Please be amazing, please be amazing!\n\nDon't take Inori away from us!  I'll do anything!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "pober",
                            "body": "I'm not sure how manga-averse you are, but the manga is ongoing and a literal masterpiece if you want more of the story.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EnthusiasmOnly22",
                    "body": "Sending Rioh to the rage zone",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MeatballZeitgeist",
                    "body": "Possibly my favorite Inori face in the entire series, which is saying something given how fierce the competition is for Best Inori Face.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}