{
    "title": "Amagami-san Chi no Enmusubi • Tying the Knot with an Amagami Sister - Episode 23 discussion",
    "author": "AutoLovepon",
    "subreddit": "anime",
    "rank": 5,
    "score": 158,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 65,
    "url": "https://www.reddit.com/r/anime/comments/1je733e/amagamisan_chi_no_enmusubi_tying_the_knot_with_an/",
    "id": "1je733e",
    "selftext": "*Amagami-san Chi no Enmusubi*, episode 23\n\n\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/tying-the-knot-with-an-amagami-sister)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/55071/)\n* [AniList](https://anilist.co/anime/164172)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&aid=17994)\n* [Anime-Planet](https://www.anime-planet.com/anime/tying-the-knot-with-an-amagami-sister)\n* [Official Website](https://amagami-anime.com/)\n* **/r/Amagamisis**\n\n---\n\n**All discussions**\n\nEpisode|Link|Episode|Link\n:-:|:-:|:-:|:-:\n1|[Link](https://redd.it/1ftqazl)|14|[Link](https://redd.it/1i182yl)\n2|[Link](https://redd.it/1fz1zuj)|15|[Link](https://redd.it/1i6kkd3)\n3|[Link](https://redd.it/1g49xvg)|16|[Link](https://redd.it/1ic3jai)\n4|[Link](https://redd.it/1g9k9ut)|17|[Link](https://redd.it/1ihjqbz)\n5|[Link](https://redd.it/1gewqyj)|18|[Link](https://redd.it/1in0lyk)\n6|[Link](https://redd.it/1gk8tpo)|19|[Link](https://redd.it/1isep40)\n7|[Link](https://redd.it/1gpmtmt)|20|[Link](https://redd.it/1ixx00n)\n8|[Link](https://redd.it/1guz7xk)|21|[Link](https://redd.it/1j3crot)\n9|[Link](https://redd.it/1h0dy0l)|22|[Link](https://redd.it/1j8ssf8)\n10|[Link](https://redd.it/1h5pe07)|23|[Link](https://redd.it/1je733e)\n11|[Link](https://redd.it/1hb3rzw)\n12|[Link](https://redd.it/1hgcijp)\n13|[Link](https://redd.it/1hlfbt5)\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# Source Material Corner\n\nReply to this comment for any source-related discussion, future spoilers (including future characters, events and general hype about future content), comparison of the anime adaptation to the original, or just general talk about the source material. **You are still required to tag all spoilers.** Discussions about the source outside of this comment tree will be removed, and replying with spoilers outside of the source corner will lead to bans.\n\nThe spoiler syntax is:\n`[Spoiler source] >!Spoiler goes here!<`\n\n# **All untagged spoilers and hints in this thread will receive immediate 8-day bans (minimum).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/anime) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "tripleaamin",
                    "body": "This adapted chapters 78-80. This is the moment where introducing her earlier pays dividends because adding the anime original scenes where you can see where her feelings are conflicted. Adaptation really turning out great.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "quixxleo",
            "body": "Time for Shirahi to hit the Makeine subreddit",
            "score": 45,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "Shirahi: \"I made a wish to a dark God to rewire reality so that I could be my childhood friends' girlfriend.\"\n\nNukumizu: \"Okay, gotta admit, this is a first for me.\"\n\nAnna: \"I FEEL YOU GIRL!!!\"",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "NeoAnkara",
            "body": "See this is the beauty of Amagami. The way it mingles the interpersonal drama with the supernatural is so beautiful. It really complemented each other so well.\n\nAlso I have a confession. I come from two weeks in the future and in my future they announced Amagami second season after this season ends next week.",
            "score": 40,
            "replies": [
                {
                    "author": "KumaKumaGambler",
                    "body": "Since I believe in the power of shrines, I shall also believe in time travel (at least for this post). Lol!\n\nI hope to see some mini-arcs for Omiichan, Makoto and Karen. :D",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Frontier246",
                    "body": "Even in a world rewoven by a Dark God, Shirahi's earnest and sincere feelings for Uryu and guilt over what she did because she loved him too much and hated herself for losing her chance shine through. \n\nImagine Amagami Mama shows up at the end to announce she's magically concocted season 2 lol.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ILikeFPS",
                    "body": "I think there will be a second season, I feel it.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "silkystrawberrymilk2",
                            "body": "Honestly I knew a season 2 was possible when I saw the opening for cour 1. That opening is still on my mind everyone I think about this show",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "shad79",
                    "body": ">See this is the beauty of Amagami. The way it mingles the interpersonal drama with the supernatural is so beautiful. It really complemented each other so well.\n\nVery well said! The supernatural elements, especially since they started to intensify from Yae's arc, really set this show apart from other harem shows and made me love it so much.\n\n>Also I have a confession. I come from two weeks in the future and in my future they announced Amagami second season after this season ends next week.\n\nI really hope what you wrote is true. If not, I'll find the Kurogami shrine and make a wish that you'll be punished for lying and getting my hopes up xD",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "P_Tranquility9",
                    "body": "The next season gonna have even more peak romance between the girls and Uryuu 📈",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aerodynamic41",
            "body": "And so Shirahi joins the ranks of childhood friends who lost.",
            "score": 34,
            "replies": [
                {
                    "author": "PeaceAlien",
                    "body": "Watching Uryuu being a womanizer at the festival",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "FarCritical",
                    "body": "In the very least, Yae can still fight on for their honor.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ObvsThrowaway5120",
            "body": "I guess Shirahi‘s conscience got the better of her. I’m glad she fessed up and admitted to what she did and apologized to everyone for messing with the timeline. I really do feel bad for her. But at least she’s got some new friends. The girls really seem to have warmed to her. \n\nHopefully Yomiko can send them all home. I have a feeling it won’t be so easy though. Messing with the timeline like that must have some kind of price to pay I bet..",
            "score": 20,
            "replies": [
                {
                    "author": "PeaceAlien",
                    "body": "Wondering if we'll see more of Shirahi at the shrine when they go back, since she enjoyed herself",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Frontier246",
                            "body": "Honestly she'd be a welcome part-time shrine maiden but I feel like she'd be torturing herself sticking by Uryu and the Amagami Sisters.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "PeaceAlien",
                                    "body": ">Torturing herself\n\nSo usual losing heroine behaviour",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shad79",
                    "body": ">I guess Shirahi‘s conscience got the better of her. I’m glad she fessed up and admitted to what she did and apologized to everyone for messing with the timeline. I really do feel bad for her.\n\nI was really glad that [Shirahi](https://imgchest.com/p/qe4georab7j) knew what she did was wrong and [didn't try to hide anything from Uryuu](https://cdn.imgchest.com/files/ye3c2p96qr4.png), including her true feelings, in today's episode.\n\nI was glad because if you remember her from the previous episode ([her looking like a crazy yandere girlfriend](https://cdn.imgchest.com/files/yrgcnkgw324.png), calling [the Amagami sisters](https://cdn.imgchest.com/files/yq9c35gpno4.png) [the three evil spirits](https://cdn.imgchest.com/files/7pjcqx582j7.png), etc.), there was a chance she'd act completely different than she did today.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "redlaWw",
                            "body": "> calling the Amagami sisters the three evil spirits\n\nThat was just her mocking Uryuu's terrible drawing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Frontier246",
                    "body": "Shirahi may have done something really bad, but she ultimately isn't a bad person and all things considered it's not like this was a dark apocalypse of a timeline. She just simply wanted the guy she likes to be with her and always knew it was her own fault that she didn't get him.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "dagreenman18",
            "body": "There’s still one path forward for you, Shirahi:\n\nBecome an Amagami sister. Join the shrine. They’re all adopted anyway. You got an in!",
            "score": 14,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "They've already seen how great she looks in the uniform, she's an orphan already, it could totally work!",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "The_frost__",
                    "body": "She looks great in the shrine maiden uniform so we already know she'd fit in easily lol.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "NationalStrategy",
            "body": "I feel so bad for Shirahi, even changing the timeline couldn't save her from her fate of being a childhood friend losing heroine",
            "score": 15,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "Girl even gave a whole speech about why childhood friend love interests always lose and then had to sit through Uryu getting along well with the rest of his Harem like she never even actually changed the timeline.\n\nShe never had a chance.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "EnsonAmata",
            "body": "The gods have sent him back in time, trapped him in a time loop, switched his body, and warped his reality. \n\nIf I’m being honest, I wouldn’t worship them either. They’re kind of shitty. Lmao",
            "score": 9,
            "replies": []
        },
        {
            "author": "StrawSolider",
            "body": "I really liked some of the shot compositions in the first hal. The use of lights and shadows were really nice. Wish it used throughout the whole episode",
            "score": 5,
            "replies": []
        },
        {
            "author": "shad79",
            "body": "Beautiful but also quite sad episode. I'm glad [Shirahi](https://imgchest.com/p/qe4georab7j) didn't try to deny her responsibility for creating this new world, [she knew what she did was wrong](https://cdn.imgchest.com/files/yq9c35wmv24.png), she finally revealed her true feelings for Uryuu and accepted the fact that [Uryuu is in love (even if he can't say it in words) with the Amagami sister](https://cdn.imgchest.com/files/4gdcxv6ej94.png), although the question is, [which one?](https://cdn.imgchest.com/files/7bwckgzwe87.png) xD\n\n[Uryuu](https://imgchest.com/p/ne7b58x8v75) and [Shirahi](https://imgchest.com/p/qe4georab7j) had [some really great scenes together](https://imgchest.com/p/9249vojoa7n) in today's episode, [her teasing Uryuu](https://cdn.imgchest.com/files/ye3c2p96gk4.png) was so good as usual. I especially loved [Uryuu's reaction](https://cdn.imgchest.com/files/y8xcnljm5l4.png) when [Shirahi started talking about their future \"first time\"](https://cdn.imgchest.com/files/yrgcnkp39p4.png).\n\n[Shirahi looked great in shrine maiden outfit!](https://cdn.imgchest.com/files/yd5cez8pma4.png) I really hope that when she and Uryuu come back, [she helps out at the shrine from time to time](https://cdn.imgchest.com/files/4jdcvwl83a4.png).\n\n[The Amagami sisters](https://imgchest.com/p/bp453adwg75) were more in the background today since the central characters of today's episode were [Uryuu](https://imgchest.com/p/ne7b58x8v75) and [Shirahi](https://imgchest.com/p/qe4georab7j), but [they still had their moments to shine](https://imgchest.com/p/agyv2memz48). I love them so much, [they're so fun together](https://cdn.imgchest.com/files/yvdcwb5pg9y.png)!\n\nAnd just as I thought, [Yomiko will help Uryuu and Shirahi return in the next episode](https://cdn.imgchest.com/files/739cxn2kzd7.png), which will unfortunately be the last one :( I'm still looking forward to it though!\n\nHere my screenshot albums from the episode:\n\n* [Shirahi](https://imgchest.com/p/qe4georab7j)\n* [Shirahi & Uryuu (Group scenes)](https://imgchest.com/p/9249vojoa7n)\n* [Amagami Sisters (Group & Single scenes)](https://imgchest.com/p/bp453adwg75)\n* [Group scenes](https://imgchest.com/p/agyv2memz48)\n* [Uryuu](https://imgchest.com/p/ne7b58x8v75)\n* [Others](https://imgchest.com/p/vj4j9rqv5y8)\n\n*EDIT. I added my screenshot albums.*",
            "score": 7,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": ">with the Amagami sister, although the question is, which one? xD\n\nAll three of them, if you ask me...",
                    "score": 6,
                    "replies": [
                        {
                            "author": "shad79",
                            "body": "Sure, that's probably true, but [I don't think that answer would satisfy Amagami sisters](https://cdn.imgchest.com/files/7bwckgzwe87.png) xD",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KumaKumaGambler",
            "body": "Yae, Yuna and Asahi are the main female characters of this title, so they are the most likely contenders to end up with Uryu, but Shirahi is the one whom I can empathize the most with. I am sure most of us have been a losing hero or heroine at some point in our lives. Furthermore for Shirahi, Uryu is the person closest to her, so I can understand why she does not want to lose him to anyone else. Desperate people may sometimes make desperate wishes.\n\nNonetheless, I am relieved to see Shirahi received only a (potential) losing end, not a bad end. To a certain extent, it means the bonds she has forged with Uryu over the years is relatively strong.  \n  \nYay, my wish got granted! Yomiko appeared once more and her mischievous expression probably means she knows and may have a solution to return Uryu and Shirahi to their original world. As expected of an experienced senior priestess!",
            "score": 4,
            "replies": []
        },
        {
            "author": "oxlemf10",
            "body": "It was really funny to see how the girls, despite not knowing Uryu very well in this reality, felt a twinge of jealousy when they saw him and Shirahi talking or as \"lovers\". \n\nAnd about that, it was very clear how Shirahi let her obsession go to her head, she loves Uryu and seeing 3 random girls getting more and more intimate with him was the maximum level of envy and jealousy, but still our protagonist in another moment of brilliance tried to resolve the situation peacefully and respecting the feelings of the temporary yandere. \n\nAnd it was obvious how Uryu really likes Asahi, Yae and Yuna when he saw their appearance, Shirahi realized her defeat, but at least admitted it peacefully. \n\nYomiko decided to show up right at the end, I'm curious to know if she will have some role to play in getting the two of them out of this other reality.",
            "score": 4,
            "replies": []
        },
        {
            "author": "LeonKevlar",
            "body": "###Stitches!\n\n* [Shirahi Changing](https://cdn.imgchest.com/files/7ogcb8mdn8y.jpg)\n\n* [Shirahi Teasing](https://cdn.imgchest.com/files/y2pck9glrx7.jpg)\n\n* [Blushing Shirahi](https://cdn.imgchest.com/files/4jdcvwl89n4.jpg)\n\n* [Sleeping Shirahi](https://cdn.imgchest.com/files/yq9c35wmnm4.jpg)\n\n* [Apologetic Shirahi](https://cdn.imgchest.com/files/yd5cez8pll4.jpg)\n\n* [Shrine Maiden Shirahi](https://cdn.imgchest.com/files/yrgcnkp3o64.jpg)\n\nShirahi is really making it clear to the girls [that Uryuu is her boyfriend.](https://i.imgur.com/IhBZEPf.jpeg) I do love how [they grill Uryuu about this](https://i.imgur.com/XXyjw5Y.jpeg) especially since he never told them he has a girlfriend after everything he said to them last episode. \nYae's insults at Uryuu was hilarious! [A Meddling, Perverted, Narcissistic Playboy from Another World](https://i.imgur.com/L9zikF5.jpeg) sounds like it could be an LN title though. xD\n\nNot gonna lie, when [Shirahi revealed that she just wants to study with Uryuu](https://i.imgur.com/ptUZjVp.jpeg) I was kinda expecting that she did that on purpose because she knew [the girls are outside the door](https://i.imgur.com/E92x2LV.jpeg) listening in and was just waiting for them to leave. [She really did just want to study!](https://i.imgur.com/bMsaGv4.jpeg)\n\n[Uryuu finally confronts Shirahi!](https://i.imgur.com/FTWV1G2.jpeg) I guess he figured it out from Shirahi's sleep talk. My opinion of her lowered when this arc started but I'm glad [she admitted to Uryuu that this entire thing was her fault](https://i.imgur.com/JUqqbxE.jpeg) instead of dragging it out. But to be fair to Shirahi, she couldn't have know that the Kuragami Shrine has actual powers. \n\n[We finally get to see Shirahi in a shrine maiden outfit!](https://i.imgur.com/NA9zZ05.jpeg) This isn't the first time she helped out at the Shrine but this is definitely the first time she put on the outfit. I guess the author was saving it for her arc. [Even if it's just for one episode, Shirahi became a temporary Amagami Sister.](https://i.imgur.com/NA9zZ05.jpeg)\n\n[Even if Uryuu couldn't say it](https://i.imgur.com/7EP2tkO.jpeg), his reaction when he saw the girls doing their shrine maiden dance [was more than enough for Shirahi](https://i.imgur.com/YtksMnj.jpeg) to realize how Uryuu really feels about them. \n\n[Yomiko is finally here to solve their problems!](https://i.imgur.com/ZDJtGNr.jpeg) I'm curious how she'll send them back. Is she going to exorcise the Kurogami Shrine? She might need some extra help from Mama Chiharu if they're dealing with another god. It won't happen but I'm kinda hoping for a supernatural battle next episode. lol",
            "score": 7,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "They really had to throw in one last scene of Shirahi in her underwear in this Shirahi world...not to mention her maximizing wearing just a shirt around Uryu. You can't say the girl didn't give her all into seducing him. It's no wonder Uryu didn't completely hate this timeline lol. \n\nIt's kind of cute how she totally had their dream married couple life all figured out. Too bad it's just not meant to be.  \n\nImagine if the girls had stayed behind long enough for Shirahi to bring up having their \"first time\" after exams lol. \n\nShirahi is the classic childhood friend and as such she lost the way a lot of childhood friends did because they can never be honest with their feelings despite wanting their childhood friend to return them and then it becomes too late when he meets a new girl(s) who steals her chance from her. And the worst part is she realized it and accepted her mistakes, and changing the world with her wish didn't make up for it and only made her feel worse because of the lie of a relationship it was built around. \n\nShe wears the shrine maiden uniform well. Actually, the fact that they mentioned having a part-timer makes me wonder if that might become a plot point later. \n\nUryu didn't even formally reject Shirahi but taking her with him as she got in romcom moments with all three sisters and was utterly mesmerized accomplished that without him even needing to say anything. I feel bad for Shirahi again. \n\nCould we see a team-up of the two Amagami Mama's to set this world back on the correct path?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FarCritical",
            "body": "The sisters being so welcoming of Shirahi as an honorary shrine maiden was really bitterwsweet. It was like getting a glimpse into another (another) reality where she was doomed with just the childhood friend curse instead of both that and the side heroine curse.",
            "score": 6,
            "replies": [
                {
                    "author": "KumaKumaGambler",
                    "body": "I particularly liked the scene in which a female student requested for a charm relating to love when Shirahi was working as part time shrine maiden. Shirahi could definitely empathize with how the female student felt.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Frontier246",
                            "body": "And also showing why Uryu's decision to inherit the shrine is so meaningful because he wants to both be a doctor and a man who can help fulfill the wishes of earnest people who pray to the Gods.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Frontier246",
                    "body": "Maybe Shirahi would have won if she'd just wished that she was the secret fourth Amagami Sister instead of trying to do away with Uryu's relationship with them in general.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SimoneX93Kumoko",
            "body": "Now, hear me out... why fight them, when you can join the harem? The real question is, how does this world works? Did they possess the Uryu/Shirahi of this world, and they'll be back to be a couple after they leave?",
            "score": 3,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "She **does** look good in a shrine maiden uniform...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "djthomp",
            "body": "Good voice work by Shirahi's VA when she was confessing and getting all choked up.\n\nIt helps her character that she didn't try to hide anything after Uryu asked the right question, and it was really quite heartwarming watching the entire gang treat her kindly afterwards. Even got a tease of fourth shrine sister Shirahi which I assume is all it'll ever be.\n\nThat shot of Shirahi looking at Uryu's expression while all three sisters were dancing freshly convinces me that a true harem ending is going to be the eventual outcome, I just have a hard time seeing him pick only one since he clearly loves all of them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "VinylAndOctavia",
            "body": "I wonder if there's a parallel Uryu who randomly wakes up in some religious shrine surrounded by 3 strangers who are in love with him for some reason?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ocixo",
            "body": "[POV: You're a table.](https://cdn.imgchest.com/files/7kzcaej2297.png)\n\nJokes aside, Chika Anzai delivered a wonderful performance as Shirahi in today's episode. You could hear the emotion in her voice. It was heartbreaking to watch [Shirahi forcing the words out of her throat](https://cdn.imgchest.com/files/yq9c35wmgm4.png) as she told Uryu the whole truth.\n\nI genuinely felt sorry for her. [Shirahi knew that she was in the wrong](https://cdn.imgchest.com/files/45xcvkr3nx7.png) and blamed herself for not having taken the opportunity to confess her feelings earlier. I really do understand why she was afraid of a possible rejection and [her dream](https://cdn.imgchest.com/files/4jdcvwl88n4.png) be lost forever.\n\nA cheat code for Shirahi to stay in the harem is perhaps [joining the three sisters as a part-time shrine maiden](https://cdn.imgchest.com/files/yrgcnkp3364.png).\n\nBonus: [an album of Shirahi's facial expressions](https://imgchest.com/p/9249voj6a7n) from this episode.",
            "score": 5,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "Shirahi out there representing how all losing childhood friend heroines feel and how tough it is being a losing childhood friend. Even trying to change the world doesn't solve anything because you're not a bad person and it doesn't mean you really \"win.\" \n\nCould honorary Amagami Sister status be in her future? It's like the only way she doesn't get left behind even more than she already has been lol.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ocixo",
                            "body": "> Could honorary Amagami Sister status be in her future?\n\nIf Shirahi cannot beat the sisters, then she might as well join them! Honestly, it would be a great excuse to stay close with Uryu. That way, she'll able [to keep smiling](https://cdn.imgchest.com/files/ye3c2p96aq4.png).",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "xFluffyDemon",
            "body": "This arc really put a sour taste in the appreciation i have of this series, the fact that there's 0 consequences for her actions is what irks me the most",
            "score": 3,
            "replies": [
                {
                    "author": "SimoneX93Kumoko",
                    "body": "I would say that she has suffered enough, don't be petty.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "xFluffyDemon",
                            "body": "Let's set aside my feelings about the anime for a sec, what you're saying amounts to one can do whatever the fuck one wants as long as one suffered enough for it? That's not a great outlook on things.\n\n\nBack to the anime, what has she suffered through? A unrequited love, one that's her fault for not making a move in the nearly 10 or so years they've known eachother. Sorry but 0 empathy there, been there done that, it's not great I'll admit, but that's not suffering.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "SimoneX93Kumoko",
                                    "body": "So what \"consequences\" do you want? Send her to jail? You can tell from his reaction that it would have worked if she had told him, that's suffering enough.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mrmickfran",
                    "body": "Seeing how Uryu looks at the sisters was punishment enough for her.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Frontier246",
                            "body": "And he made sure she had to watch him have moments with all three of them!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Frontier246",
                    "body": "I think it helps, in my opinion, that she acknowledged what she did was wrong, the guilt was eating away at her, and it ultimately didn't really achieve anything because she realized the Amagami Sisters had Uryu's heart in a way she didn't and had it basically thrown in her face.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EnsonAmata",
                    "body": "To be fair, she made a wish at a shrine, like thousands of people do every day. There’s no way she could have known it would warp all of reality.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Frontier246",
            "body": "Shirahi is treating the audience to a strip show as she helps herself to the Amagami Sisters' bath while the Amagami Sisters treat Uryu to the third degree over Shirahi and his relationship status. I guess even in this timeline the Amagami Sisters can still get jealous.\n\nAw, Uryu is back in his old room! Just in time for Shirahi to appear wearing nothing but a shirt that looks like it's about to fall off! Though she's not here to seduce Uryu but to instead study with him! They've got to get into Kyoto U so they can live out their dream as a husband-and-wife doctor team and run Kisaki-En together! With maybe sex coming after they finish their exams! Or not, Shirahi sure does love teasing Uryu.\n\nUryu finally figures out the truth and confronts Shirahi about it and Shirahi finally comes clean. Despite everything, the guilt had been eating away at her and she didn't want to keep this bottled up from Uryu any longer. That she'd been the childhood friend who could never be honest about her feelings and could only tease Uryu, never being able to face him until it was too late...when the Amagami Sisters had moved into the place she thought she had by his side. She knows she should've been honest, should have told him how she felt about him, and now she's messed everything up.\n\nBut Uryu, being Uryu, is just happy that Shirahi is finally honest with him and wishes he could have understood her feelings...which honestly makes Shirahi feel worse when she's the only one that should feel bad, but that's just the kind of guy Uryu is.\n\nIt's nice of Uryu to show Shirahi that he's still the same old Uryu. He understands now that people pray to the Gods out of their genuine feelings, silly or otherwise, and he wants to nurture those feelings as part of his desire to help others.\n\nSure Shirahi completely rewrote the world and altered history, but it's not the worst version of the world and the Amagami Sisters can understand where she was coming from...so no sense in any recriminations or blame.\n\nTime for one last Amagami Festival in this world! Complete with shrine maiden Shirahi! With Uryu getting in a moment with each Amagami Sister to show Shirahi how close he is to them and how right he feels when he's by their side, and seeing how dazzled he is by their powerpoint shrine dance, she knows that he's obviously in love with all three of them. Which hurts, but she can't deny what is before her eyes, especially with her own feelings for Uryu.\n\nYomiko arrives! And I'm guessing she does remember Uryu and is just hiding it.",
            "score": 4,
            "replies": [
                {
                    "author": "Ocixo",
                    "body": "> I guess even in this timeline the Amagami Sisters can still get jealous.\n\nJust goes to show how fast he'd won their hearts! \n\nI found it ironic that [Uryu was getting interrogated by three angry sisters](https://cdn.imgchest.com/files/7ogcb8mdd8y.png) for not having told them about a girlfriend, but [these same sisters were happy to eavesdrop](https://cdn.imgchest.com/files/7lxcpgqllz7.png) on him and Shirahi.\n\n> With Uryu getting in a moment with each Amagami Sister to show Shirahi how close he is to them\n\nI liked how Uryu had an endearing moment with Shirahi and Yae, only [to pick a fight with Yuna](https://cdn.imgchest.com/files/7mmc9wdjjr7.png). Those latter two truly are my favourite ship in the series.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "shad79",
                            "body": ">but [these same sisters were happy to eavesdrop](https://cdn.imgchest.com/files/7lxcpgqllz7.png) on him and Shirahi.\n\nI liked [the style in which they withdrew](https://cdn.imgchest.com/files/yvdcwb5pg9y.png) from there xD",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "ZaphodBeebblebrox",
                    "body": "Sorry, your comment has been removed.\r\n\r\n-  This belongs in the Source Corner at the top of this thread. In discussion threads for currently airing anime, discussions about source material, spin-offs, mangaka comments and unadapted content must be posted there, and not outside it. This applies specifically to comparisons to the anime or hints about future events, even if such hints are vague. Please note that you still have to tag your spoilers in the source corner.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ArcaneJelly07",
            "body": "I really appreciate how uryu reacted when shirahi confessed that she was responsible for ~~changing the worldline.~~  He reacted with kindness and empathy, even going far as apologizing for his ignorance for shirahi's feelings. \n\nI personally would have been freaked out if I were uryu. Yeah i know she's my childhood friend and all, but sheesh man.. going desperate and turning to world bending wishes just to win me over? Kinda creepy\n\nBut I guess I'm not as kind and understanding as uryu lol. \n\nI actually really liked how much joy uryu felt when he went back to his room. Gives an idea on how much love he has developed for the shrine. \n\nAll in all, the confrontation with shirahi went better as I expected. She could've gone freako yandere psycho mode and deny that she made that wish. But I guess deep inside, shirahi knew that this wasn't the way. After the festival, she knew that the only way forward was to accept defeat, and continue supporting uryu's journey to his dream. \n\nAs for how they're gonna go back to the old world, I guess yomiko san would help out. Maybe exorcising or fixing up the kuragami shrine?\n\nWith the last ep coming up, I'm guessing they're gonna end this season (and yes I'm REALLY hoping this gets a 2nd season) with somehow confirming that uryu is indeed interested with one (or maybe all them heck idk) of the sisters.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MayonakaMadaraka",
            "body": "Just a thought, maybe Shirahi joins the lineup becoming a fourth Amagami sister — none of them have a biological family anyway. The more the merrier, right?",
            "score": 2,
            "replies": []
        },
        {
            "author": "tripleaamin",
            "body": "Uryu is a really good guy. He has every right to blame Shirahi for everything that happened. But rather he empathizes with her. The fact that he does this makes Shirahi feel even guiltier and finally is honest with him.\n\n But it is sweet to know now she understands why he is so fond of the 3 sisters. After all, they were super nice to her, and you could see they could have been close friends.",
            "score": 2,
            "replies": []
        },
        {
            "author": "turbotimo16",
            "body": "Any chance of the anime getting a Season 2?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zxzxzx0088",
            "body": "Shirahi scores so many cute points for me and I thought they're gonna kiss when she's crying. \n\nShirahi is master of teasing. How many times does she wants Uryu to imagine them doing it lol. If they're really going out, Uryu blood level will always rise for sure. Eavesdropping 'sanshimai' really cute especially Yuna. 'Sanshimai' dissing Uryu will never get old for me.\n\nI really really don't want this to end TT. Please announce next season!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nickthenuker",
            "body": "\nTime to clear up some things. \n\nAnd so he's staying the night there. \n\nAh. This is his room. \n\nWhat now? \n\nAh. Studying. \n\nAnd so she ended up sleeping in his room anyways. \n\nOh, Shirahi came from the same timeline as Uryu. So she knows everything. \n\nSo she's the one who got him into this whole predicament. \n\nThey overhead everything? \n\nLol totem pole. \n\nAnd so Shirahi is going to help as a shrine maiden. \n\nAre they going to help out at the festival? \n\nNo, they're just here as visitors. \n\nOof Yuna. \n\nIntroduce them to? \n\nAh. Her.",
            "score": 1,
            "replies": []
        }
    ]
}