{
    "title": "Unnamed Memory Season 2 - Episode 11 discussion",
    "author": "AutoLovepon",
    "subreddit": "anime",
    "rank": 18,
    "score": 30,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 33,
    "url": "https://www.reddit.com/r/anime/comments/1je731p/unnamed_memory_season_2_episode_11_discussion/",
    "id": "1je731p",
    "selftext": "*Unnamed Memory Season 2*, episode 11\n\n\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/unnamed-memory)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/59142/)\n* [AniList](https://anilist.co/anime/178550)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&aid=18713)\n* [Anime-Planet](https://www.anime-planet.com/anime/unnamed-memory-act-2)\n* [Official Website](https://unnamedmemory.com/)\n* **/r/UnnamedMemory**\n\n---\n\n**All discussions**\n\nEpisode|Link\n:-:|:-:\n1|[Link](https://redd.it/1hvurwb)\n2|[Link](https://redd.it/1i19fhc)\n3|[Link](https://redd.it/1i6ly85)\n4|[Link](https://redd.it/1ic4wsq)\n5|[Link](https://redd.it/1ihl55s)\n6|[Link](https://redd.it/1in20x2)\n7|[Link](https://redd.it/1isg44l)\n8|[Link](https://redd.it/1ixyefc)\n9|[Link](https://redd.it/1j3eady)\n10|[Link](https://redd.it/1j8sxg8)\n11|[Link](https://redd.it/1je731p)\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# Source Material Corner\n\nReply to this comment for any source-related discussion, future spoilers (including future characters, events and general hype about future content), comparison of the anime adaptation to the original, or just general talk about the source material. **You are still required to tag all spoilers.** Discussions about the source outside of this comment tree will be removed, and replying with spoilers outside of the source corner will lead to bans.\n\nThe spoiler syntax is:\n`[Spoiler source] >!Spoiler goes here!<`\n\n# **All untagged spoilers and hints in this thread will receive immediate 8-day bans (minimum).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/anime) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Electronic-Cook-5711",
                    "body": "Hi! Episode 23 lore and explanation is in the subreddit: [https://www.reddit.com/r/UnnamedMemory/comments/1jebw58/episode\\_23\\_lore\\_and\\_explanation\\_for\\_animeonly/](https://www.reddit.com/r/UnnamedMemory/comments/1jebw58/episode_23_lore_and_explanation_for_animeonly/)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Electronic-Cook-5711",
                    "body": "In this lore and explanation, we will explore the following:\n\n* Why does Valt not ask for help from Oscar and Tinasha directly?\n* What’s Oscar and Tinasha’s relationship in other disappeared timelines?\n* What happens if Oscar and Tinasha don’t end up together in other timelines?\n* A witch alone can destroy an entire country   \n* The Return of Tinasha’s BFF – Why Lucresia is Different?\n* What is that huge pillar anyway?\n* Lock me in the castle = Married???\n* The reveal of Valt’s true goal",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ModieOfTheEast",
            "body": "Well, I guess we finally have a motivation and while it's something that I thought of as a possibility, I personally feel the show didn't really earn it. So Valt wants to save Myralis by destroying the orbs because they are keeping history on its path by making sure she dies as she is supposed to. I get that idea, but aside from the fact that he has no idea if that truly works (and he makes sure he won't have a second chance), I just feel it wasn't really built up well.\n\nFirst and biggest issue is Oscar imo. Oscar was saved by the orb being used and so far, the orbs have not shown any attempt at killing him. And while there might be some explanation behind that (like how him being cursed was enough for the orbs to keep him around or his mother dying as some form of compensation instead) the question obviously arises, why can't Valt just do whatever it was that kept Oscar safe? Would he have to die and he also doesn't want that to happen? Is that the issue?\n\nSecond problem is that his plan just feels overly complicated. In this timeline, he did so many things just to get Tinasha ready and \"test\" if she was powerful enough, but what about all the other ones? Did he never ask Tinasha and Oscar if it would be a good idea to get rid of these orbs? Even when he was very close to them? I get, witch Tinasha is a bit different in personality, but I just don't see her or Oscar being that against that idea in principle. Especially since the obvious argument could have been that the orbs might destroy their relationship that they built.\n\nMy only other idea is that Valt just got tired in this timeline and wants to make sure there never is one again because he realised even if he doesn't jump back, someone else might (in this case Oscar) and he has to basically see Myralis dying over and over again (since he remembers). So instead of trying to prevent it, he just never wants to see it again. But even with that, his plan in this timeline just feels a bit too overcomplicated.\n\nAbout the fact that Tinasha seemingly really wanted to stop her wedding (which they mentioned in passing last week, but I just thought it was Oscar being overly cautious) I don't even want to talk anymore. They really try to even ruin the one thing that the show had going for it (the Oscar-Tinasha romance) by again leaving out important information about this relationship that we just have to fill in ourselves.",
            "score": 7,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": ">About the fact that Tinasha seemingly really wanted to stop her wedding (which they mentioned in passing last week, but I just thought it was Oscar being overly cautious) I don't even want to talk anymore.\n\nThe weirdest thing is she seemed upset when she assumed they were calling off the engagement during her talk with Oscar at the end.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "stephenthatfoste",
            "body": "I'm still super confused about the show overall cause the location keeps changing so fast(and including other timelines I think?), but if nothing else they explicitly called out abducting and imprisoning their fiancé. Prince Clarke is in shambles right now.\n\nWhen the witch-king is talking with Tinasha in the air it's like someone grabs the camera to straighten the shot out. That was really jarring.",
            "score": 7,
            "replies": [
                {
                    "author": "ModieOfTheEast",
                    "body": "Clearly Oscar just hasn't learned Clark's family technique yet. Too many wars I suppose.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AlexxxandreS",
                    "body": "The cameraman was doing his best... Please...",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Frontier246",
                    "body": ">but if nothing else they explicitly called out abducting and imprisoning their fiancé. Prince Clarke is in shambles right now.\n\nAlso Tinasha accepting it as a viable and acceptable romance tactic lol.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "stephenthatfoste",
                            "body": "At least the girl bringing it up seems like there could be SOMETHING acceptable there. Like if she was involved in some torture called a lesson everyone was forcing her into and a higher authority that is fully aware of the situation \"kidnapping\" her was the only way to reconcile the situation for the people pushing it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlexxxandreS",
            "body": "After countless loops, Valt didn't try once to get her on his side and see if she would agree to help him with changing that girl's fate?\n\nLike bro, at least once try to get Tinasha to help instead of doing everything by yourself, specially having to fight everyone just to get the orb",
            "score": 5,
            "replies": [
                {
                    "author": "ModieOfTheEast",
                    "body": "I can just assume that this is a whole novel on its own where they show you all the things Valt tried and he grew more frustrated with each time (like Okabe) and they just cut it down to less than an episode.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AlexxxandreS",
                            "body": "Yeah there's definitely a lot of cut content in the anime, this could be true for sure...",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Frontier246",
                    "body": "I guess because he thinks his only option is rewriting the timeline and he knows Tinasha will never go along with it no matter the timeline?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AlexxxandreS",
                            "body": "Yeah, makes sense but Oscar did use the Orb, so maybe he could have tried it together with him in one of the timelines, so Oscar would have Tinasha back and he would save the girl...\n\nAnd Tinasha maybe would agree if she lost Oscar and more bad stuff happened on the same timeline, but let's see what's happening next...",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lock3down221",
                    "body": "He probably tried once but likely he failed. He's probably been looping for so long that he just wants an endgame for it. He doesn't even consider a nation full of people to be living beings. For him, they've been dead for centuries.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LeonKevlar",
            "body": "The fact that the King of Magdalsia [is acting like an evil witch as Lucrezia after taking her body is hilarious.](https://i.imgur.com/PWjvmDB.jpeg) Like he could've told his advisors that's what he's doing but I guess he wanted to keep it a secret that he was using Lucrezia's body and put the blame on her for trying to invade Tuldarr. \n\n[And we finally get to see the real Lucrezia back!](https://i.imgur.com/Bwoqc24.jpeg) I love how as soon as she's freed [she's already getting some new gossip](https://i.imgur.com/ohtaZJO.jpeg) about Lavinia and is [already asking Oscar's relationship with Tinasha.](https://i.imgur.com/OZh4fsD.jpeg) Now that's the Lucrezia we know and remember! \n\nI love how [Valt is trying to paint Tinasha as the bad guy here](https://i.imgur.com/daVAulF.jpeg) when he's literally the one responsible for every time people are suffering in this new timeline. I am so fucking done with Valt though. Like what do you mean you just wanted to destroy the Eleterria? You had so many chances to approach Tinasha in previous timelines for her help! Why not do it back then? He could've also done it when he was serving as the Farsas Chief Mage! Ugh.",
            "score": 5,
            "replies": [
                {
                    "author": "ModieOfTheEast",
                    "body": "Hey, no kink shaming here. Some people just want to role play as a witch on Mondays.\n\nI also hate that Valt puts the blame on Tinasha. Aside from the things you mentioned, it's not even something she did in the first place. Yes, it was related to her, because it happened after Oscar saved her, but what was she supposed to do? Turn herself into a witch? It's not like she even knew that was the \"real\" timeline.\n\nAnd aside from all that, it's not even necessary, because he took them hostage already anyway. So he is already blackmailing Tinasha. Why do it in a second way? My only explanation is that he just wants to excuse himself. He is not taking people hostage as these were supposed to die anyway. But please don't think about Myralis.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Frontier246",
                    "body": "Who wouldn't want to be in Lucrezia's body? Okay, I'll see myself out.\n\nIt would be great if Lucrezia could still become gal pals with Tinasha in this timeline. She's already enjoying teasing her and Oscar.\n\n\"How dare you let this entire city and its people survive in this timeline and rob you of a massive amount of trauma that turned you into an ageless witch who didn't get to experience true love until centuries later!\" Although I guess it's kind of interesting that, thanks to Oscar, this is apparently the only timeline where Tinasha isn't the Witch of the Azure Moon and in love with Oscar from the start instead of the other way around. \n\nHonestly Valt's entire motives and methods feel **really** inconsistent at this point.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Frontier246",
            "body": "Valt isn't forthcoming about why he needs both orbs, but he is straightforward about how Oscar has been screwing up the one rare instance of Tinasha being in love with him from the get-go instead of him having to constantly woo her for once. Oscar may fall for other women in other timelines, but Tinasha has only ever loved him in EVERY timeline. And it's in this one where he's dedicated to saving her.\n\nTuldarr vs Magdalsia! With Tinasha on their side, Tuldarr has the distinct advantage, but Magdalsia has \"Lucrezia\" backing them up. Although I love how Tinasha is in all serious, life-and-death, battle mode and then Oscar calls in and she gets all flustered. \n\nTurns out it's not Lucrezia at all but the king of Magdalsia using her body! And while Tinasha has had to go through so much alone and take on the responsibility of Tuldarr without any help, now she has Oscar to shoulder the burden with her so she doesn't have to bear it all alone anymore. That's what being married is all about, right?\n\n\"It's no fun to torment a man\" - That's how you know for sure this is definitely not Lucrezia. \n\nSo Lucrezia's been trapped with Senn in a magic mirror, the Mirror of Oblivion, and now she and Tinasha finally meet! Though I'm kind of curious about Lucrezia's history with Senn now.\n\nI love how Lucrezia is back in her body and she's already into OscarxTinasha again even though she barely knows them in this timeline. Also she seemed really surprised at the prospect of Lavinia having sex, let alone having blood relations with Farsas royalty.\n\nSo all's well that ends well. Lucrezia kills the king who stole her body, Tinasha isn't worried about Oscar cheating on her, the engagement is still on, and Tinasha is finally going to step down from being queen of Tuldarr so Legis can take over and she can finally be free.\n\nExcept Valt still has one last revelation to throw Tinasha's way, a reveal of her past as the Witch of the Azure Moon, and that Tuldarr existing and her status as not being a witch is something that never should have happened. And Valt is willing to eradicate Tuldarr and restore the timeline if it means Tinasha helping him get the orbs and destroy them. Which will somehow save Miralys, I guess!?",
            "score": 4,
            "replies": [
                {
                    "author": "VorAtreides",
                    "body": "I hope Valt and Miralys both die miserably lol. They are going to threaten innocents, they deserve only endless suffering.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Skydrake2",
            "body": "I don't get it. \n\nSo Valt wants to ... destroy both of the time-resetting Orbs while Miralys is still alive, thus presumably stopping the phenomenon of timeline attempting to correct itself (and ultimately causing Miralys death), and to ensure time can never be rewound again? Is that right?\n\nIf that's the case ... why not simply *ask* Tinasha and Oscar for help? I don't see why they wouldn't happily agree to ram Akashia through both of the timefuckery orbs and be done with them? I doubt they would be unhappy to be rid of them? \n\nAlso, why did Valt feel the need to strengthen this Tinasha by having her absorb that dark snake-god again? He doesn't exactly gain anything from her being stronger, does he? \n\nAlso also, did anyone understand what the quarrel between Tinasha and Oscar was even about? I seriously don't understand what they were 'fighting' about only to arrive to the same conclusion as before, that they will get married? \n\nSeriously, this show is such a hot, disjointed mess it's almost impressive. And somehow they have managed to degrade the one thing that has been holding it (loosely) together, that being Tinasha's and Oscar's relationship. Season 1 was seriously better than this - yes, it was also a rushed mess, but somehow things felt like they made more sense, and the relationship between Tinasha and Oscar was both further along and better executed, with better interactions between the two, at this point in the season. \n\nJust ... ugh. It's been a while since I have felt so *disappointed* in a show. Because you can tell it had potential and there's some real meat underneath it all, but it has been put together and executed by a schizo on crack.",
            "score": 5,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "Maybe Valt needs Tinasha strong enough to break the Eleterria? I dunno. \n\nMy understanding is Tinasha was retreating into her duty and how she acted during the \"Dark Ages\" where she battled alone and ruthlessly rather than rely on and accept Oscar as an equal partner, but Oscar made her realize that he can stay by her side. Which I guess was also similar to what they went through in season 1.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ModieOfTheEast",
                    "body": "My only explanation is that Valt didn't know if this Tinasha was able to destroy the orbs since she wasn't a witch so he made her stronger and came up with a whole plan to check if she could destroy them by making her destroy the mirror. \"Not a good plan\" is really generous for this.\n\nBut before you ask, I have no idea why he never asked witch-Tinasha about it. I have technically an idea, but it's just a random guess. Basically, he doesn't think destroying the orbs saves Myralis but destroying them means, no one can ever use them again. Which in turn means that he never has to see her die again as he remembers every time that happened. So when he died last time and Oscar reset the timeline instead of him, his plan now became to destroy the orbs instead of using them further. But tbf, that is a complete guess.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ObvsThrowaway5120",
            "body": "So much for the king of Magdalsia possessing the witch with a super magic mirror. That didn’t last very long at all. Much like that weak ass invasion. \n\nSo Valt is basically doing all this shit for love? I guess so is Tinasha. No one should have really been messing with the timeline this much in the first place though. What a mess.",
            "score": 2,
            "replies": [
                {
                    "author": "Frontier246",
                    "body": "Can we just get Oscar and Tinasha married already? I don't really care about Valt's plot at all.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VorAtreides",
            "body": "Why? Why would you just leave that guy alone? Wtf? He's been the cause of so many issues lol.\n\nDayum, Tinasha sure is vicious. A bit sad Lucrezia is being mind controlled it seems. Disgusting king taking over her body. Hope he gets punished harshly. Their \"not your wife/queen of Tuldarr/want to be wife/whatever\" back and forth does get a bit annoying tbh. Maybe less so if things weren't blatantly skipped. \n\nLucrezia looks smoller in the mirror. Cute. Hope you get fucked, shitty king dude. You are absolute scum. So Lucrezia killed the scum, good for her. That war sure was fast though. \n\nOh my, Tinasha into some kinky kidnapping roleplay 😉  I do wonder, when she was queen long ago, she clearly had no kids, who was the family that took over? What other family? \n\nValt really is a shit. Seriously, why Oscar didn't deal with him when at the start of the episode is ridiculous. You really sure spew a lot of bullshit to justify being a shit. You really don't deserve to save that girl. Especially since she's complacent in this. And she's no sinner, only you are. He is insufferable. He really coulda gone about this a better way I bet.",
            "score": 2,
            "replies": [
                {
                    "author": "Mistral-Fien",
                    "body": "> Oh my, Tinasha into some kinky kidnapping roleplay 😉 I do wonder, when she was queen long ago, she clearly had no kids, who was the family that took over? What other family? \n\nTuldarr wasn't a hereditary monarchy 400 years ago. Magic power was the primary requirement, not bloodline.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "NationalStrategy",
            "body": "Maybe I missed something but why didn't Valt ask for Oscar's and Tinasha's help sooner?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nebresto",
            "body": "[He pinched her cheek again but we didn't get to see?!](https://i.imgur.com/Smd48xP.png)\n\n[](#mashiroglare)\n\n[Ahh fuck.](https://i.imgur.com/lWIkD7N.jpeg) I can't believe you've done this..\n\n[Not even two minutes later.](https://i.imgur.com/X2stgky.jpeg) Ya, well done jinxing it\n\n[This is probably supposed to be some grand climax suspense thingy, but..](https://i.imgur.com/wiFAQgh.png) I'm not feeling it Mr. Krabs\n\n[](#miyamoriunimpressed)",
            "score": 2,
            "replies": []
        },
        {
            "author": "extremegk",
            "body": "Valt motivations or his actions doesnt make any sense in anime story I dont know about ln.All his doing can be simple avoid by talking oscar or tinasha.Is there any reason for oscar or  tinasha to keep the orb being destroyed :D \n\nI am preety sure oscar will agree  if he knows there is safe fay to destroy them.\n\nAlso after all pacing issue only thing keep me in anime was romance part for oscar and tinasha.Lately I feel like romance part just fell of .",
            "score": 1,
            "replies": []
        },
        {
            "author": "djthomp",
            "body": "It's nice that they were able to resolve that situation without having to kill Lucrezia, particularly since it wasn't her piloting her body around at the time anyway. Oscar just freely telling her that he's the grandson of a witch is a bit wild, but I suppose she's probably not going to go tell anyone.\n\nInteresting to learn that this was apparently the one single loop where Tinasha didn't end up a witch compared to possibly thousands of them in which she did. \n\nValt wanting to destroy the orbs of time fuckery may actually be a good idea, as long as it leaves the existing timeline in place and we don't have to start over yet again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kryslogan",
            "body": "Sigh. I still enjoy this anime because of Tinasha and Oscar but, bruh it is a mess.\n\nThe logic of whoever adapted this season eludes me.",
            "score": 1,
            "replies": []
        }
    ]
}