{
    "title": "There’s some technology we encourage, others we discourage, and then there’s the ones that can kill us all, and we put the most effort into those.",
    "author": "yourupinion",
    "subreddit": "Anarchism",
    "rank": 415,
    "score": 0,
    "upvote_ratio": 0.44,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Anarchism/comments/1idr5jo/theres_some_technology_we_encourage_others_we/",
    "id": "1idr5jo",
    "selftext": "https://open.substack.com/pub/kaosovercontrol/p/theres-some-technology-we-encourage?r=36tq0f&utm_medium=ios&utm_source=post-publish\n",
    "comments": [
        {
            "author": "twodaywillbedaisy",
            "body": "Title piqued my interest, but I'm afraid the wikipedia article on the \"Noosphere\" has more substance than this.\n \n>Our small group believes the answer is in building a worldwide public institution, of public opinion. Help us change the world, with what we hope will be the most trusted and transparent institution the world has ever seen.\n \nCould you possibly be more vague about \"the answer\".",
            "score": 9,
            "replies": [
                {
                    "author": "yourupinion",
                    "body": "Do you agree with how I am frame the problem?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "twodaywillbedaisy",
                            "body": "I'm willing to entertain your position, even accept the premise of world history going through stages, but it would help to know what you identify as *the problem*, and how any of the Noosphere stuff relates to anarchism.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "yourupinion",
                                    "body": "Did you check the link?\n\nI’m saying that the problem is humanity holds back the Noophere, which intern then holds back humanity. \n\nI know that knowledge and communication is not a real central part of standard anarchy today, but it should be.\n\nChomsky believes the people are ready for a higher level of democracy, but yet anarchists that generally follow him in every other regard pay no attention to this.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "twodaywillbedaisy",
                                            "body": "You're not giving me any reason to give a shit about some imagined Noosphere. Chomsky is not an anarchist. A higher level of democracy would almost certainly be an obstacle to anarchy. It's pretty obvious you posted here only because you ran out of subreddits to spam this to, so I'll leave it at that.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "yourupinion",
                                                    "body": "It’s a good thing anarchists aren’t worried about getting along with anyone else.\n\nI consider myself to be an anarchist, but the right kind.",
                                                    "score": -5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Square_Radiant",
            "body": "No sources, no related works, barely a structure - I don't really know what the intention was, but I don't think it's a successful piece of writing, I feel like you have a plan of ideas to explore but you haven't actually explored them",
            "score": 5,
            "replies": [
                {
                    "author": "yourupinion",
                    "body": "It’s quite a deep thing to get into, so I’m just starting with the reason why.\n\nI do have it pretty much all worked out, but I have difficulties, putting it in writing. We’re working on a new website, but I have been at this for over 10 years. I don’t recommend the old website.\n\nI’ve been experimenting with AI to help explain, you can have a look at that and I can answer any questions if you want:\n\n\n\nClaude. Simple.\n\n   Understanding KAOS: A Simple Guide to a Global Opinion Database\n\n     What is KAOS?\n\nKAOS (Knowledge As Our Savior) is the simplest thing you can imagine: a place where anyone can share their opinion about anything, and those opinions are saved forever without being changed or deleted.\n\nThink about how you use the internet today. You might:\n- Review a restaurant on Yelp\n- Rate a movie on Rotten Tomatoes\n- Share your thoughts on social media\n- Give feedback about a product on Amazon\n\nThe problem is that each of these platforms controls and changes what people see. They decide which reviews to show first, which to hide, and sometimes even which to delete. They do this to make money, but it means we can’t fully trust what we’re seeing.\n\nKAOS is different. It does one thing only: it collects and stores opinions. No changing them. No hiding them. No deciding which ones are more important. Just collecting and saving them exactly as people share them.\n\n     How Would You Use It?\n\nUsing KAOS would be as simple as using Google. You wouldn’t need to learn anything new. You could:\n\n1. Share an opinion about anything\n2. Search for what others think about any topic\n3. Choose how much personal information to share\n4. Link to updated opinions if you change your mind\n\nThat’s it. Everything else - all the fancy ways to analyze or display the information - would be built by others using this database of opinions.    \n\n     The Identity System\n\nWhen you share an opinion, you can choose how much about yourself to reveal:\n\n- Double Anonymous: Nobody knows who you are, not even KAOS\n- Regular Anonymous: KAOS knows who you are but keeps it private\n- Partial Information: You choose what to share (maybe your city, or age, or profession)\n- Full Identity: You share everything about yourself\n\nThink of it like putting a sign in your yard - some people want everyone to know their opinion, while others prefer to keep their thoughts private. KAOS lets you choose.\n\n     Why Trust Matters\n\nKAOS will be the first worldwide institution that people can fully trust because:\n1. It only does one simple thing\n2. It never changes or deletes anything\n3. It’s completely transparent\n4. It’s owned by the public\n5. It doesn’t try to make money from manipulating opinions\n\nThis trust is crucial because it means people can finally have a reliable source of what others really think.\n\n     How Would People Judge Information?\n\nEach person decides how to weigh different opinions. For example:\n- When looking for a restaurant, you might only care about verified local opinions\n- When learning about conditions in another country, you might value anonymous opinions from people living there\n- When seeking medical advice, you might focus on verified healthcare professionals\n\nThe system doesn’t make these judgments for you - you decide what matters based on context.\n\n     The Power of Delegation\n\nKAOS includes a system where you can:\n- Trust others to vote on your behalf in specific areas\n- Delegate to experts in fields you don’t know well\n- Eventually use AI assistants to help process information\n- Always see who has delegated to whom\n\nThis creates a web of trust that helps handle complex issues while maintaining transparency.\n\n     The Value of Data\n\nEvery opinion shared has value. When companies want to use this data, they would pay for it. This money could:\n- Go back to the people who created the data\n- Potentially provide a form of Universal Basic Income\n- Support the system’s operation\n- Benefit the public who owns the data\n\n     Why Global From Day One?\n\nKAOS needs to launch worldwide because:\n- Limiting it by region would require making judgment calls about boundaries\n- More opinions make the system more valuable\n- Global issues need global perspectives\n- Modern problems don’t stop at borders\n\n     How It Helps Us Grow\n\nKAOS isn’t just about collecting opinions - it’s about helping humanity get better at:\n- Understanding different perspectives\n- Making decisions together\n- Solving complex problems\n- Developing trust in collective wisdom\n\nBy seeing how others think and why they believe what they believe, we naturally develop better understanding of each other.\n\n     What KAOS Doesn’t Do\n\nIt’s important to understand what KAOS isn’t:\n- Not a social media platform\n- Not a recommendation system\n- Not an analysis tool\n- Not a decision-making body\n\nIt’s simply a database of public opinion. Everything else - all the ways to analyze, display, and use the information - would be built by others using this foundation.\n\n     Getting Started\n\nThe biggest challenges are:\n1. Building the basic infrastructure\n2. Getting initial funding\n3. Finding academic partners\n4. Launching globally\n\nBut the concept itself is simple: collect opinions, store them unchanged, make them searchable. Everything else grows from there.\n\n     The Future with KAOS\n\nImagine a world where:\n- You can find honest opinions about anything\n- You understand why people believe what they believe\n- You can contribute your thoughts to global discussions\n- Your data works for you instead of being used against you\n- We solve problems together instead of fighting about them\n\nThis is what KAOS could help create - not through complex technology or artificial intelligence, but through the simple act of collecting and preserving human opinions.\n\n     In Conclusion\n\n\n\nKAOS is:\n- Simple in concept: just collecting opinions\n- Easy to use: like using a search engine\n- Transparent: nothing hidden or manipulated\n- Valuable: data that belongs to the people\n- Transformative: helping humanity think better together\n\nIts power comes not from what it does, but from what it allows others to do with reliable, transparent opinion data.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Square_Radiant",
                            "body": "I feel like I'm reading the pitch deck of a naive business student - why did you post this on this sub at all?\n\nYour biggest weakness here is that you're not considering at all how this system can be exploited/sabotaged/co-opted/misused - there's a lot of conflicting ideas here - but honestly, there's too much work here to actually critique what you wrote - I think you should re-evaluate A LOT of what you've written here and consider the question \"What if it doesn't go as perfectly as I imagine?\" - these buzzwords about transparency, integrity and reliability are meaningless currently",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "yourupinion",
                                    "body": "Tell me how you would exploit this system?\n\nYou live and die by your reputation on the system, if you wanna fuck around, people will remember. \n\nWe do take anonymous opinions, but you just filter that shit out. The only time I would pay any attention to it would be when we’re dealing with something with China or something like that.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Square_Radiant",
                                            "body": ">You live and die by your reputation on the system,\n\nOh my, you're so much further gone than I realised - read books instead of talking to AI about your half baked ideas",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "yourupinion",
                                                    "body": "Did you agree at all to the point I was making in the original post?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Square_Radiant",
                                                            "body": "I thought the title was interesting",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "yourupinion",
                                                                    "body": "Thank you, did you go any deeper than that?",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Psile",
                            "body": "So, it's a block chain.\n\nA distributed database that is rigidly append only and has theoretically absolute anonymity.\n\nYou're thinking of using a block chain, right? That's the lede that's been buried.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "yourupinion",
                                    "body": "No, at least not a standard block chain.\n\nThe original concept had nothing to do with the Blockchain, but recently I was thinking it might be useful to have a Limited Closed Loop, Blockchain system to make sure the database could never be eliminated.\n\nGenerally, though the concept has very little to do with Blockchain",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Psile",
                                            "body": "If you say so. \n\nI have no way to definitively disprove that since everything is so vague. However, embracing the spirit of transparency, I don't believe you. This feels like an attempt to invent a problem that you can use your preferred technologies to solve. Maybe I'm wrong, but I just wanted to put that out there. My thoughts do not rely on this assumption being correcr.\n\nAs others have pointed out, everything here is vague. My personal quibble is that you insist it isn't a social media site but then use social media sites as examples of the kinds of things you can post. Yelp and Rotten Tomatoes are social media to a degree. What you're describing is firstly a publicly available digital space. So a web site. A web site where you post your opinions. \n\nThat's a social media web site. Except it's one where nothing can ever be deleted. You pass over this as though it's an inherent good thing but lets interrogate that for a second because it's the core pitch.\n\nWhat if someone gets doxxed?\n\nWhat if someone posts something genuinely obscene, say footage of child pornography or graphic real life violence?\n\nSee the problem?\n\nThe core idea is broadly undesirable no matter what technology you use to achieve it. While top down censorship is undesirable, such an absolutist approach is rarely viable in the real world.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "yourupinion",
                                                    "body": "It’s vague because it’s big and I don’t wanna hit you with a really big wall of text that just turns everybody away. when I try to explain everything, it could make a small book, we’re working on a new website to try to make it easier.\n\nIt’s just a database of public opinion with no manipulation so it’s easy to be transparent, which helps achieve a higher trust level.\n\n\nYes, it is like a social media site similar to yelp for everything. We will replace the yelp, and all other rating systems, because they manipulate the data for profit and everybody knows that.\n\n\nWe’re only working with text so we don’t have to worry about explicit imagery. \n\nIn regard to any deletion of opinions, we have to recognize that we are creating a publicly owned and operated worldwide institution, all participants will be encouraged to participate in setting any boundaries that may occur.\n\nIt is my hope that we can start with a policy of no deletions, and try to maintain that until we have some decent participation from around the world. Working from a higher level of a diversity will help in regard to the urge to sensor. The far east doesn’t care about what America may want to censor and vice versa perhaps that will equal things out to very little censorship, hopefully no censorship at all.\n\nRemember, the only way you will see seen opinions as if you go looking for them. If you’re getting them through your feed, then you’re getting it through a provider through Facebook or some other existing system. It becomes their problem, not ours.\n\nThe real world is what we’re interested in changing.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Psile",
                                                            "body": "You make a lot of big statements here but won't answer my specific ask. You anticipate replacing several existing sites but don't seem to have the first idea how a no deletion policy would handle content that, bluntly, needs to be deleted. You can't even allow for the possibility of exceptions.\n\nAt best, this is just having a super broad idea for a social media platform that would immediately be overrun with hate speech. With no idea how to actually implement such a technically demanding project.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "yourupinion",
                                                                    "body": "I bet you would’ve risked your life to stop the printing press.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Psile",
                                                                            "body": "Lol, I nailed it the first time didn’t I?",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "yourupinion",
                                                                                    "body": "Yeah, I could see where you were going",
                                                                                    "score": -2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}