{
    "title": "Anyone else seeing these February 5th Protest Posts?",
    "author": "Bill-The-Autismal",
    "subreddit": "Anarchism",
    "rank": 369,
    "score": 207,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 28,
    "url": "https://www.reddit.com/r/Anarchism/comments/1iezavl/anyone_else_seeing_these_february_5th_protest/",
    "id": "1iezavl",
    "selftext": "I keep seeing posts about a national protest on Feb. 5th in subs for various cities around the US. I can’t find a single mention about it from any of the Food Not Bombs or DSA chapters in my state. This feels fake. ",
    "comments": [
        {
            "author": "a-friendly_guy",
            "body": "Check out the subreddit r/50501\n\n\nIt's supposed to be a self-organizing protest that is put together by the people, spreading virally as an idea and simultaneously inculcating new developing leaders who step out their comfort shell to decide necessary details for each of their specific state's protests.\n\n\nSome states seem well organized and some don't. There seems to be some 11th hour confusions since many are asking the same few questions about the time to meet, and now on doubts about its legitimacy or concerns over counter-protesters.\n\n\nI am staying tuned to see how it goes - but I think it's an earnest attempt to get something started on a national scale, despite many glaring holes in its planning",
            "score": 165,
            "replies": [
                {
                    "author": "ChockBox",
                    "body": "A lot of first time organizers are pulling this together.  If you have any protest experience, medical training, or just want to join the crowd, most locations could use support and attendance.\n\nETA:  Seriously, many of these organizers are babes in the woods….  They need help as most do not understand basic security measures and wholeheartedly believe the Police will help keep their actions safe….  \n\nWho knows how many members of the public will show to these events.  Or how many of the opposition, because these actions are largely being planned in the open online and Fash are aware… If you can show up on the ground and help, please do…. These individuals may be comfortable enough to not appreciate how oppressive the State is, but that does not mean we should leave them twisting in the wind….\n\nIt’s going to take many strange bedfellows to oust the fascists….",
                    "score": 124,
                    "replies": []
                }
            ]
        },
        {
            "author": "sudsmcdiddy",
            "body": "Y'all I'm genuinely worried for a lot of these people. I see some of them saying things like, \"It's a peaceful protest, we have a legal right to it!\" Even though they openly acknowledge the US is very quickly going full fascist, yet it's like they don't realize that in a fascist country you operate as if every action will result in brutal repression. Concerningly little regard/understanding for opsec. Anyone have any suggestions how I might help from the periphery in case things go south? The alarmist in me worries that they might be walking into a huge, dangerous trap.",
            "score": 101,
            "replies": [
                {
                    "author": "Bill-The-Autismal",
                    "body": "Yeah I’m not quite following the point of this either. It’s possible that it gains momentum and the messaging comes during/after, but if we’re (presumably) protesting the state crackdowns on 1A rights and anti-discrimination laws, why the hell are so many people thinking they’re going to show up and put flowers in the barrels of the National Guard’s guns or whatever? Do they not realize what happened to virtually every other mass protest in US history? \n\nI know ignorance and optimism are probably the cause, but it sure feels like we’re ignoring some obvious problems on purpose.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Linuxuser13",
                            "body": "I plan on going to my local Feb 5th protest. The people who are promoting it are posting instructions on what to do if law enforcement gets violent and/or starts to arrest people. People who go to these protest are not as naive as you.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "sudsmcdiddy",
                                    "body": "The problem is not everyone is not as \"not naive\" as you. We aren't worried for experienced organizers showing up, we are worried about the inexperienced people, the liberals, the people who don't understand just how brutal these things can get. My state's protest organizers' have said dangerously little on how to mobilize in the face of violent police and violent right wing militias.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Linuxuser13",
                                            "body": "There are a few people who will be naive when they show up and there will be the experience protesters but then there are going to be a lot of people who show that have done their research even if it was from other source then the protesters who organised this thing. Over all those who aren't prepared even just a little are going to be very small. There are some protest going on this weekend and how they go might give an idea how the protest on 2/5 might go for that state/area",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cornflakegrl",
                    "body": "I’m expecting infiltrators cause problems which will justify a crackdown.  I still think protests should happen, but I hope people go in prepared for pepper spray and rubber bullets.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "sudsmcdiddy",
                            "body": "Yeah I'm all for protesting, just people need to be effective and smart about it. And I'm worried that a lot of people going to these protests don't really understand what they're in for.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ann_Amalie",
                    "body": "I regularly have flashbacks of that time during the summer’20 protests where a “formation” (sloppy ass one) of law enforcement marched by a house lining the street where the residents were I think just sitting out front and the cops just fired on them, without warning and without any provocation. Supposedly non lethal rounds, but I’ve seen what those can do and it’s definitely not just a scratch. That event was very informative. Along with many others from that summer of unrest, but that one was on another level. They’ll just shoot residents on their own front porch; they didn’t even need to go to the actual protest to be the victims of state violence.  WTAF.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "spacescaptain",
                    "body": "So we just do nothing? That's the alternative.\n\nEverything we can do to weather the storm or (inshallah) make things better is subject to repression. You have to do something. That's going to involve some people being being brave enough to put themselves in harms way.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sudsmcdiddy",
                            "body": "This is just a rehash of that popular tweet lamenting people who respond to \"I like pancakes\" with \"Oh you hate waffles?!\"\n\nNo, I didn't say do nothing. That's a whole new sentence. I said we should help protect people from walking into a trap. You have to be *clever* about your activism. When a wildfire sweeps your neighborhood, you get a bunch of water cannons to fight it. You don't run directly into the fire while yelling, \"I have to do something to stop this!\"",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sad-Big-3555",
                    "body": "The simple solution is to get a permit. Ask your local Democratic Committee to get a permit for you.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "glasswings363",
            "body": "Edit: my position has shifted.  If you see local experienced folks who think it's safe at your capitol (safe enough) trust them more than me.  I'm happy with Maine, not able to go.\n\n\nOriginal:\n\n\nIt's either enthusiastic newbies like me self-organizing but overlooking lots of fundamentals - I say this because *I* have felt tempted by my own newbie enthusiasm - or a false-flag op trying to create a target-rich environment for the J6ers, etc.\n\nI'm not participating because I'm fortunate enough to have some experience with crazy psy-op shit (Eve Online is just a game but not just a game) and the lax organization is ringing alarm bells. On top of that, the post histories of the moderators sketch me out\n\nBarneyboy comes across as a 4channer - I wouldn't follow their toxicity out of a burning building. Fungi ran the Herman Cain Awards and admitted to enjoying trolling. Thomas is obviously evading a Reddit ban. They self-identify as an organizer and talk the talk but I don't see them doing the things that an experienced leader would do. Such as having a definite plan for how to form up.",
            "score": 55,
            "replies": [
                {
                    "author": "ChockBox",
                    "body": "I legit think it’s a bunch of newbies.  Which I applaud, the more the merrier and everyone has to do things for the first time.  But it is quite clear, most of the subreddit hasn’t been to a protest, let alone organized one.\n\nI had to explain to the DC contingent, multiple times and people kept pushing back, that getting a permit to protest at Congress or anywhere on the National Mall is a major assumption of risk for whoever gets named as the permit holder.\n\nThis is a DC quirk, because everything downtown is Federal, but the person or organization named as the permit holder assumes financial liability for any damages or defacement that may occur.  This event has no backing organization, meaning some poor soul would have to put everything on the line.\n\nThe sheer number of times I’ve had to explain to people it is entirely unreasonable to expect any individual to assume legal liability for an event open to the public and on the Fash radar.  If anything happened, the individual named on the permit could face financial ruin.\n\nPeople were saying, but we need to do everything the “proper” and “legal” way.  My dudes, spontaneous protests are not uncommon in DC, just show up.\n\nAlso, if you get a permit to protest at Congress, Cap Police make sure to tuck you away on part of the grounds where you can’t even see the building.\n\nOrganizing is just herding cats…. But I’m happy to do my part and hope that people show up",
                    "score": 62,
                    "replies": [
                        {
                            "author": "Bill-The-Autismal",
                            "body": "You seem pretty experienced so I imagine there’s not really a counter to anything you’re saying. It’s unfortunate that people are STILL holding onto this mentality of following rules to a tee. \n\nI feel like the only difference between poor planning and a psyop is how much work the piggies have to do. Hopefully this doesn’t end with a bunch of people getting hauled off in squad cars. The organizers near me want it to last into Saturday so I’ll be keeping my distance on the first day.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "ChockBox",
                                    "body": "Oh, convincing this crowd that, particularly at protests, police are not friends…. Is proving futile….\n\nOnce upon a time I didn’t think all cops were bad…. Then my local PD brought the K-9 unit to one of our actions…..  a group of like 10-12 women and queer folk with bubble guns…. yup…. We should have had the dogs sicced on us.\n\nOne day, if they keep at it, they’ll learn why the cops are not our friends, especially in the streets\n\nETA:  Fortunately DC cops are pretty hands off compared to other areas",
                                    "score": 26,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thae86",
                    "body": "O h...this is news to me. Thank you for thr context.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Herefourfunnn",
            "body": "I believe this will be what ignites a fire. I don’t believe there will be anything accomplished by the protesters so to speak. But I do feel it will be a turning point. I believe the response will be immense violence against peaceful protestors. That’s just my humble opinion. \n\nI won’t be going. I won’t protest. I’m going to play the part I need to. Wear my dresses, do my makeup, and appear to be a quiet single mother who’s child’s father passed away, just living in an old farmhouse and slowly renovating. Meanwhile I’m working on preparing my property as a sanctuary. I’m very isolated and I don’t interact with people for the most part, so I stay off their radar. I can’t take people in though until the department of education is completely dismantled and I have an excuse to “homeschool” my special needs child. Until then, I will continue working on my property. Unfortunately, as long as he is in school, he will be regularly asked who lives here. I’m not putting him in that position. But services in the past couple weeks have already changed. It’s no longer a way to help us. It’s already become a way to monitor us",
            "score": 17,
            "replies": []
        },
        {
            "author": "Itsumiamario",
            "body": "I've asked around about this and haven't heard anything back from some of my comrades who are still active in their circles, but I haven't heard anything back from them.\n\nSo, if they are involved it'll be interesting, if not I don't know.\n\nI'm old enough to remember the shit show OWS turned into.\n\nThis time around though I have a feeling like it might actually catch some wind.\n\nI'm definitely trying to get back into it.",
            "score": 9,
            "replies": [
                {
                    "author": "Intanetwaifuu",
                    "body": "I like saying ur name ✨🖤❤️🖤✨",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thae86",
            "body": "I did, I mistakenly thought it was fake too and was rude in another subreddit. \n\n\nIt's real and I'm undecided about going with it atm. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "Linuxuser13",
            "body": "Yes there is on in my town here on the US Mexican border .  I am going to try to make it after work.",
            "score": 3,
            "replies": []
        },
        {
            "author": "WildAmsonia",
            "body": "Really depends on the weather, tbh. \n\nIf it's cold as hell and bad weather in big cities, people just won't go. Hard to say if it's a set up, but I doubt it. \n\nI just don't see it being a big protest at all. People are tired and not as interested anymore. If the economy crashes and people start losing their jobs, I can see protest movements growing. But right now, nah. Would like to be proven wrong, i guess.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/wild_gad - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Critical-Promise-528",
            "body": "Look up 50 Protests 50 States. Most are happening on Feb 5 at the capitol in each state. ",
            "score": 1,
            "replies": [
                {
                    "author": "DaGrimCoder",
                    "body": "Nothing says 'I'm fighting for justice' quite like playing Russian roulette with other people's lives. Blocking freeways like you fools did today!!  But hey, I'm sure those sweet protest pics for your Instagram story are totally worth someones life. Real hero stuff. \n\nKeep playin in the street tho. But just remember you moght be makkn someone have to choose between missing their baby's funeral or running over a bunch of  clueless and increibly selfish children.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Strong-Caring-Mom",
            "body": "I am reading through these posts and it makes me realize how much we need places to gather, share information and experiences, help and enjoy each other. I am humbled by those who go to protest today and would love to join, because Free Speech.  Journalists also have my admiration in this moment. Go Maine protesters! And Go Stop Trumpers!",
            "score": 1,
            "replies": []
        }
    ]
}