{
    "title": "Pink Peacock is back: a queer, yiddish, antizionist free food café & community space — coming soon, to Brooklyn, NY",
    "author": "twodaywillbedaisy",
    "subreddit": "Anarchism",
    "rank": 327,
    "score": 140,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 9,
    "url": "https://pinkpeacock.gay/",
    "id": "1igm9fx",
    "selftext": "",
    "comments": [
        {
            "author": "cumminginsurrection",
            "body": "Why did the space in Glasgow close? If it didn't survive in Glasgow, I personally worry about it surviving in NYC where things are endlessly more expensive and projects like this are more bound to fail. People have been struggling to even keep open a general anarchist or trans space in NYC, it seems like it'd be even harder for an even more niche project like this, especially when the Jewish community (even in NYC) is so internally divided over anti-Zionism.\n\nEven as a trans, queer anarchist with Jewish heritage, I'm sort of left asking \"who is this project for?\" Not trying to be a naysayer at all -- space is critically needed right now, I just think this isn't really addressing that need. And if its going to be a bilingual anti-Zionist space in a place like Brooklyn it seems like Yiddish and English aren't the only languages that should be centered -- it seems like Arabic and Spanish at the very least are pretty critical languages if this space is going to be a space that hopes to be any sort of staging ground for anti-Zionist or anti-fascist resistance.",
            "score": 14,
            "replies": [
                {
                    "author": "DryDrunkImperor",
                    "body": "https://www.reddit.com/r/glasgow/s/l9n82fZ20y\n\n\nHere’s the thread on r/glasgow, looks unpromising.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "KaleidoscopeFew8637",
                    "body": "I’m from Glasgow, I can’t claim to have any special insight but by the time it closed it wasn’t hugely popular here. \n\nThere was a lot of excitement when the project was announced. I went a few times and it was nice enough, but didn’t feel particularly successful as a cafe. Never seemed to be open. \n\nSubsequently there was an awful lot of drama, I think they alienated quite a few people. I don’t know the specifics but if you’re interested the threads on r/Glasgow are worth reading.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "twodaywillbedaisy",
                    "body": "I don't live anywhere near Glasgow or NYC and have no experience running a café or community space, so my understanding of the issues is very limited. But I imagine the project can be for those who get active and involved, and for those who respect that work — being clear about the intentions and expectations can help reduce time- and energy-consuming conflicts later down the line.\n \nPossibly too niche though, I hope they find the right balance.\n \nIn their [closing statement](https://theanarchistlibrary.org/library/pink-peacock-closing-statement) from 2023 they say\n \n>the short answer is burnout. we’ve all been volunteers this whole time, and like everyone we’re struggling under capitalism and kyriarchy. most of us are disabled, and the ongoing pandemic is still hurting our collective physical and mental health. the constant battle to keep ourselves financially afloat didn’t help.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "According_Site_397",
                    "body": "Is Pink Peacock an international franchise??  Did they leave Glasgow for NYC?  What is happening here.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ok-Glove-847",
                            "body": "One of the co-founders in Glasgow was American and from somewhere around NY, iirc - presumably after leaving Glasgow he decided to return to the US and have a second attempt at it there.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HenriettaCactus",
            "body": "Interested in volunteering but don't see any way to sign up for that. Also where is it gonna be located?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Konradleijon",
            "body": "Spence",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Glove-847",
            "body": "There can't be many community cafes that have their own Wikipedia page. [https://en.wikipedia.org/wiki/Pink\\_Peacock](https://en.wikipedia.org/wiki/Pink_Peacock)",
            "score": 1,
            "replies": []
        }
    ]
}