{
    "title": "New to Anarchism. Any advice?",
    "author": "None",
    "subreddit": "Anarchism",
    "rank": 247,
    "score": 16,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 50,
    "url": "https://www.reddit.com/r/Anarchism/comments/1ilwp6u/new_to_anarchism_any_advice/",
    "id": "1ilwp6u",
    "selftext": "Hey everyone! So I think I've always had an affinity for Anarchism (being an edgy teenager and seeing all the corny depictions of it on TV), but as I've grown older, especially with all the events happening in the United States currently, I've begun to analyze Anarchism as a potential practical and legitimate ideology.\n\nHowever, I haven't considered labeling myself as a full Anarchist yet due to only having a surface level understanding of it. Any suggestions on where to start my Anarchist journey, and more importantly, how I can get involved more with the community? Any advice would be highly appreciated!\n\nTL;DR: New to Anarchism. Where should I start?",
    "comments": [
        {
            "author": "KelbyTheWriter",
            "body": "Just don't create a state. I can't tell you how many times I did that back in the day.",
            "score": 24,
            "replies": [
                {
                    "author": "WanderingBraincell",
                    "body": "hate it when I'm just chillin then accidentally make arkansas",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "State BAD. Will keep that in mind!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "OwlHeart108",
            "body": "Have you read Ursula Le Guin's The Dispossessed? It's a great place to start! A beautiful novel, it brings the beauty and challenges of anarchism to life. Highly recommended!",
            "score": 9,
            "replies": [
                {
                    "author": "None",
                    "body": "I haven't read it, but it does sound interesting. Thanks for the recommendation! I'll definitely check it out!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "OwlHeart108",
                            "body": "Enjoy! All of her books are worth reading, really.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sundayservice_reggae",
                    "body": "Currently reading this and loving every bit",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dobrolo",
            "body": "Read anarchist FAQ. It's really long, but worth jt",
            "score": 7,
            "replies": [
                {
                    "author": "None",
                    "body": "Will check it out, thanks!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "dobrolo",
                            "body": "You also have a youtube channel called an anarchist faq.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "3wettertaft",
            "body": "My favourite way to learn about stuff is following subredditd around the topic. There is this one, r/Anarchy101, anarchocommunism, r/anarchy4everyone etc. Especially the first one is one I like a lot.\n\nI'm also currently reading 'Anarchy works' by Peter Gelderloos, which I find to be a good introduction. You can find a lot of anarchistic literature (including that book) for free on anarchistlibrary.org",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "I did notice r/Anarchy101 after I made my post (still getting used to Reddit lmao), as for the book by Gelderloos, I will check it out, thanks!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "3wettertaft",
                            "body": "Ah and also great: The YouTube Channels 'Anark' and 'Andrewism', even though I've only seen little of the second one. My journey with Anarchism is also a rather new one",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I have watched a sliver of Anark, but I will check Andrewism out as well. Thanks!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Scarcity2379",
            "body": "Consider reading The Conquest of Bread by Kropotkin for a pretty solid theory start (and contains the most compelling argument for why nobody has a right to claim sole ownership of the means of production) though obviously no single text is the be all or end all. It's not a particularly tough read, and is available for free on the Anarchist Library.\n\n\nRemember that Anarchism is easily as much (if not far more) an ethic by which one lives as a political system, and applying it to your own relationships (with work, with friends and family, with your community, with money and resources and property, and with your voice in the world) is where one needs to start. If you wait for the revolution/collapse to start working on it, you're wasting your time.\n\n\nThis is a system that exists as a critique of power structures. Even if we succeed at becoming the most adopted ethic by which our community or region functions, that critique is never actually finished. It's work, and it always will be work because one of the big selling points of structures of imbalanced power is that they're significantly less work to live under and provide a means for many to ignore them entirely at the cost of freedoms and there will always be some who, even with good intentions, look to re-implement those imbalances.",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "Appreciate the advice! Yeah, I was semi familiar with Kropotkin, but I think now it's finally time I read his masterwork. Also, I do agree with your general outlook on Anarchism, and I will make sure to keep up the good fight!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "I ain't an anarchist, but watching some documentaries about Makhnovshchina, Kronstadt Rebellion, Korean People's Association in Manchuria (Shinmin Prefecture), CNT-FAI, Zapatistas, and Rojava might give you an idea or two?\n\n\nOr, if you are more into theories, I suggest reading Bookchin's books.",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "Will check some out, thanks!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoExceptions1312",
            "body": "Read Proudhon, Bakunin and Kropotkin first. Emma Goldman is also fun reading but it’s not really going to teach you the underlying ideology in the way the others will. Max Stirner is kinda “anarchy adjacent” but also worth reading. There are others but Proudhon, Bakunin and Kropotkin are the “big three”. After reading that stuff you’ll find yourself constantly annoyed by teenagers in skinny jeans who toss around terms like “anarcho-communist” but have no idea what it actually means. For a really fun dive into the actual mechanics of how anarchism functions in the real world you should do some reading about the Spanish Civil War and how Catalonia was able to implement syndicalism with relative success. That’s why people often misrepresent anarchism as being connected with socialism, communism and antifascism, because those groups were all fighting together alongside the Spanish republicans against Franco’s fascist army and the monarchists. But I digress. Also it’s probably important to learn about the Russian revolution so you can fully grasp the difference between Marxism and anarchism. It’s worth noting that all the big anarchist thinkers of the 19th century disagreed with Marxism and it’s rather unfortunate that they all used the term “communism” to describe their theoretical utopian society, since the Bolsheviks and (later Stalin) would also use that label for their own authoritarian regimes. If you really want to go back and understand the philosophical underpinnings of anarchism, Marxism and the entire mid-19th century ideological revolution you’d need to start with Hegel. His ideas really started everything. Good luck.",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "Alright, thanks! I really appreciate the clear-cut roadmap for me to follow!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "oskif809",
                    "body": "Hegel \"started everything\"? Even Hegel acknowledged that it was the French Revolution--of which he was a fan--that was a major influence on his thinking. Perhaps you've been nose deep in \"theory\" too long to notice this thing called the \"Real World\" that has little to do with the *ignus fatuus* of armchair \"theorists\"?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NoExceptions1312",
                            "body": "Sure, thats valid. I figured I’d limit my reading recommendations to 19th century theory and 20th century wars but you’re probably right about starting at the French Revolution.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "legendary_mushroom",
            "body": "Focus on the stuff that is not exciting. It's much harder and more important. ",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "Could you provide specific examples? I assume you are referring to more direct action type stuff, or mutual-aid groups?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "legendary_mushroom",
                            "body": "Community organizing, for mutual aid and disaster relief and food aid to the food insecure(I personally believe that giving people food that they feel nourished and comforted by is more important than standing on principle of what kind of food is ethical, but to each their own), being involved in local government (people sneer really hard at this and talk shit about liberals but then are totally shocked when the school board, city council, parks and rec department, and district attorneys office are stacked with conservatives, Holocaust deniers, racists, and fascists), and really doing everything possible to form community with one's neighbors, the actual humans that you live around. Listen to people and get involved with things that people are already doing, even if the people doing it aren't anarchists. Even if the thing isn't radical. Rivers and beaches need cleaning, homeless people need to be fed and housed and warmed and listened to, communities need to prepare for disaster, etc etc etc. Volunteer with things even if the system and the participants are not perfect. Later, you will have some clout and you can launch your own thing. But trying to create things from zero without direct relationships to like minded people is just going to make you cynical and exhausted. ",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Okay, awesome, thanks for all the suggestions! Yeah I am already looking into volunteering at my local food pantry, and have looked at some Food Not Bombs chapters around me, and finding like-minded people is actually partially why I came to Reddit, haha.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "legendary_mushroom",
                                            "body": "Food not bombs is all well and good (or it can be. I have seen people serve salad, big chunks of stale bread and barely cooked apples to a population that is known to struggle with dental issues. Food goes uneaten. like at that point ppl are just doing it for clout.). But there are soup kitchens, shelters, cold weather shelters, and other charitable groups that serve food to hungry\n people. ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Okay, I will take that into consideration, thanks!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Charming-Score7015",
            "body": "Τhe best thing you can do at the beggining is reading. Before you start participate in any actions, you need to know what are you fighting for.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "twodaywillbedaisy",
                    "body": "The idea of creating an anarchist state by voting for someone to push anarchist policies is such an incoherent mess that it's hard to believe you actually have much sympathy even. Maybe you could engage with anarchist ideas before suggesting apocalyptic events and sacrifices are necessary.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AnarchaMorrigan",
                                    "body": "/r/Anarchy101",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "amadan_an_iarthair",
            "body": "Music.\nMy own introduction to anarchism didn't come from reading Kropotkin, Chomsky, (both I love) and Bakunin (less said). \nIt came about via music. Started listening to Rage against the Machine and then looked at what the songs were about. Found other bands with same vibe, punk, folk, all protest songs. \nMusic _is_ the best way to communicate ideas to people. Best way to protest in some cases. Wobbles knew this. Irish Republicans knew this. ",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "This. Yeah, I think a lot of my foundational beliefs came from music as well, haha. RATM  is a band I'm very familiar with, and I also listened to a bit of Minor Threat, which I don't know for sure if they preach leftist beliefs, but still fit the general vibe. Are there any other bands you would recommend?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "amadan_an_iarthair",
                            "body": "Levellers, Dropkick Murphies are great on the labour front. Roughneck Riots, Chumbawamba, Pat the Bunny,\nI would go on Bandcamp and look up anarchopunk and it just opens so much up. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Alright, sounds great. Thanks for the suggestions!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "catastrofae",
            "body": "Crimethic is always a great place to start. Resources and education wise. Glad to have you! :)",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "Thanks for the suggestion! I'm glad to be here!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "catastrofae",
                            "body": "\"Days of War, Nights of Love\" is a really fucking good read. No heady academia that isolates people. Many other good books, zines, posters, ect. Make sure to grab a copy of the \"Cookbook\" while you're at it!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "The old \"Cookbook\" or the new \"Cookbook\" related to Food Not Bombs? I remember finding the old one as a kid and thinking it was an actual cookbook, haha.\n\nAs for Days of War, I will definitely check that one out, thanks!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "catastrofae",
                                            "body": "The old one. I actually didn't know FNB had a Cookbook lmao. Love that discovery though! I will have to check it out.\n\nOfc! :)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "triangle-over-square",
            "body": "be your own, read if you want to, dont if you dont, figure out how YOU see it, dont worry about other people, unless you want to. stand for what you think is right, risk what you are willing to risk. never accept dogmatic perspectives, be your own authority, build community if you want to. organize in the real world, not formally/legally, and understand that every other human being is doing what they want to (within their options) do the same thing consciously. oh, be free and dont think that anybody else should 'represent' you",
            "score": 0,
            "replies": [
                {
                    "author": "Desperate_Solid8989",
                    "body": "So just be free minded... very revolutionary",
                    "score": 1,
                    "replies": [
                        {
                            "author": "triangle-over-square",
                            "body": "Yes it would be. Imo the only way of bringing about an anarchist revolution is an individual waking up to the power to live free from the systems that trap us. Failing to do this will not create anachism, just another system of oppression. If there isn't a philosophical framework reinstated and developed within every single anarchist centered around individual power and self governing morality it would just be another bs system. I think",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Desperate_Solid8989",
                                    "body": "So we need a miracle. One free minded person to lead the world with a frame work that hasn't truly been fleshed out. This is more of a religion than idiology. If you want true individual freedom you need power, whether it be sword or mind or spirit. Anything else is just a fairy tale",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "triangle-over-square",
                                            "body": "yes and no. its not a single person, its every single person who gets it (in their own way), following a leader would not create anarchism. its a whole culture of ethical individualism, every person choosing their path, that is, fleshing it out as they go along. figuring out and solving practical problems. \n\n and we all need power to do this. agree. power of thought and will, power of friendships and communities. power to defend and create and destroy. 100% but if this isnt centered in the individuals freedom, what makes it anarchist? \n\nThe framework cannot be an ideology that exists as an authority outside of the individual, like some anarchist church, every individual have to be able to find it, hold it and to know that they are the authority of themselves. anarchism must flower from individual realizations of the power and control inherit in the human being. \n\nand indeed it could well be though of through religious terms, and some communities/individuals might prefer it, but its not necessary, and besides the point. I see this as the most realistic path to real freedom from oppression. creating stable communities of individuals, figuring out how to balance me against you against us. i see it as an inevitable conclusion of radical empiricism, and find great hope in many movements that are seeking to take charge of themselves.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}