{
    "title": "Beyond Guilt & Privilege: Abolishing the White Race",
    "author": "anarcho-slut",
    "subreddit": "Anarchism",
    "rank": 190,
    "score": 29,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 32,
    "url": "/r/abolishwhiteness/comments/1ip61z2/beyond_guilt_privilege_abolishing_the_white_race/",
    "id": "1ip94n5",
    "selftext": "",
    "comments": [
        {
            "author": "oskif809",
            "body": "Don't forget \"whiteness\" has zilch to do with someone's skin or hair color, just as \"masculinity\" has 0.0 to do with shape of someone's genitalia. \n\nDavid Roediger's work on whiteness was a wake up in this area for me and hope others will find it useful too:\n\nhttps://www.davidroediger.org/books/working-toward-whiteness.php",
            "score": 26,
            "replies": [
                {
                    "author": "Lizrd_demon",
                    "body": "Furthermore, communities can \"become white\", as explored in Noel Ignatiev's work.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "larainbowllama",
                            "body": "Yup the concept of “whiteness” continues to change to always have hierarchy and to have a group remain in power.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "anarcho-slut",
                    "body": "Thanks for the recc, I'll check it out!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ratagar",
            "body": "interesting read thus far, some of it reminds me of the talks I've had with and the writing of an acquaintance of mine, a fellow Pagan and Anarchist, I'll keep from going overly into detail and just leave a link to his writing.   \n  \nIn short he (and I, for that matter) have been approaching the idea that the revival of a number of Pre-Christian/Pre-Captialist social constructions (the Gifting Cycle, the Thingr system, Animistic Worldviews, to use examples from my own Heathen/Norse context) have utility, perhaps essentially so, for building a solidly functional White Abolition movement, and a \"post-Whiteness\" culture/worldview for folks of European/Colonist descent.\n\n[https://toutacaillte.org/touta-caillte-a-proposal/](https://toutacaillte.org/touta-caillte-a-proposal/)",
            "score": 8,
            "replies": []
        },
        {
            "author": "PlastIconoclastic",
            "body": "“Beyond the Pale” is a phrase used to exclude  the Irish from “whiteness”. Fuck everything about “white”.",
            "score": 5,
            "replies": [
                {
                    "author": "oskif809",
                    "body": "What about the \"Black Irish\"? ;)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Excittone",
            "body": "Whiteness is not natural, its not universal and its just a societal invention made to justify supremacy over other groups. As long as white people continue to benefit from that privilege, they won't be eager to fully give it up. The best way to destroy the narrow & oppressive definition of whitness that benefits people of European descent is by creating a counter identity that can challenge its assumptions ( also by making sure that the new identity doesn't take the same place as whiteness did )\n\n\nI don't think whitness and its privilege will go on forever. People make the faulty assumption that what is here now will go on forever. It will take time but whitness can and will be dismantled ",
            "score": 2,
            "replies": []
        },
        {
            "author": "GenericPCUser",
            "body": "To add to this for anyone interested in this topic:\n\n*The History of White People* by Nell Irvin Painter\n\n*Dying of Whiteness* by Jonathan Metzl\n\n*White Rage* by Carol Anderson\n\n*Racism Without Racists* by Eduardo Bonilla-Silva\n\nThere's a lot more worth reading, and nobody has to read all or any of them to understand that whiteness is false and only exists to create and perpetuate racist power structures. That said, those are all worth reading if you have the time and energy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Excittone",
            "body": "Ffs, why would you want to enact something that is genocidal. White people can be racist and guess what other races can be as racist as well ( im saying this as a black person btw )",
            "score": -1,
            "replies": [
                {
                    "author": "anarcho-slut",
                    "body": "Please go and actually read the content being added to this sub.\n\nAbolishing whiteness is not about killing people. It's not about genocide. In fact, it's anti-genocide. Whiteness is a contrived identity used to control and conquer people. It has no basis other than supremacy. The black identity originated from dark skinned Africans being enslaved. They didn't call themselves Black before that. Because of enslavement, y'all lost a lot of cultural knowledge and heritage. This is why the Black identity is legitimate and whiteness is not. White people are more likely to be able trace back their ancestry.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Excittone",
                            "body": "Sad to challenge your whole narrative but my ancestors weren't inslaved and we were not colonized. I am someone who can most definitely trace my ancestry for hundreds of years. We definitely knew we were black before white people told us that, we just didn't have the restrictive and European created definition of whitness that Europeans created",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "anarcho-slut",
                                    "body": "Ok, well, what sources can you provide to validate the narrative you're introducing here? \n\nI've read a lot and talked to many people and the narrative I'm presenting is the result of that.\n\nEnslaved Africans of so called north America lost their genealogical knowledge because the enslavers didn't see them as human and threw everyone from all the different tribes together and didn't care about their history. This is very easily verifiable.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Excittone",
                                            "body": "My best source is my lived experience \n\n\nI am talking as someone who was from an African country that was not colonized ( Ethiopia ).",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "anarcho-slut",
                                                    "body": "Ah. I see.\n\nThis thread might be of interest to you\n\nhttps://www.reddit.com/r/Ethiopia/s/zBE1QQaCfW\n\nFor people from the African diaspora who's ancestors came to America through enslavement, Black is their cultural identifier, and I challenge you to present me with a majority of people specifically from North America who have that lineage who would say otherwise. This is because their traditional knowledge was lost through enslavement.\n\nThat said, there's also a lot of differing views on Ethiopians calling themselves Black or not.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Excittone",
                                                            "body": "I can't give evidence about people in North America as my talking points are from my own coutries perspective \n\n\n\nYou are correct about their being differing views about Ethiopians calling themselves black or not and as an Ethiopian, I think it comes down to 2 factors \n\n\n1. Black as a social categorization was invented by Europeans to justify slavery. The social categorization is still around to this day and black people use this categorization as well. Ethiopia, because it was never colonized didn't have this categorization imposed on us. For me as an Ethiopian, the social categorization of \"black\" doesn't make sense because everyone around me is black and thats the way it has always is. I am black ( light brown precisely ) and I am proud of it but for me blackness is a type of skin color, not a social group \n\n\n2. Ethiopians catagorize ourselves mainly on ethnic & religious grounds. Those two are the main social categorizations and since everyone is black, \"blackness\" has no meaning.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "anarcho-slut",
                                                                    "body": ">Black as a social categorization was invented by Europeans to justify slavery\n\nOn this we agree, but it directly contradicts your argument from the first comment you made\n\n>We definitely knew we were black before white people told us that",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Excittone",
                                                                            "body": "I meant that in a way of Ethiopians showing we knew about our skin color and proudly claiming it for ourselves instead of letting Europeans shackle us with their social categorization and their racist perspectives",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "anarcho-slut",
                                                                                    "body": "Ok so y'all knew about your skin color, obviously, you live in it. But did Ethiopians call themselves \"black\" in whatever language they spoke? Because there's definitely more than one language historically spoken in that region.\n\nI fail to see the significance of your claims or why this is important to you.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Excittone",
                                                                                            "body": "This is important to me because im a black person. If I travel to a western country, I will also have the social categorization of black and all that it entails. But im seeing that you consider yourself more educated & enlightened in this matter 😂",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "anarcho-slut",
                                                                                                    "body": "No I'm just trying to learn and your points have been contradictory and confusing. Obviously I'm not Black, that's why I've taken up the work of abolishing whiteness. I thank you for sharing your perspectives. However, your and my view points are just two out of many. I don't think there's an ultimate truth that can be spoken or written.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "UncomfortableFarmer",
            "body": "For me, historian Barbara Fields poured cold water over the entire field of \"whiteness studies\" with her 2001 essay \"Whiteness, Racism, and Identity.\" Basically, focusing on \"whiteness\" is missing the target. What we should be doing is understanding the history of the concept of \"race\" to begin with, and why it was invented in the first place. Hint: in its initial formulation in the United States, there was only one \"race,\" and that race was black-\n\n>Whether as rough-and-ready ideology or as legal definition, racism in America has served, not to classify or categorize people, but to specify who is black and who is not. It is considered chic in some quarters to elide that fact, with the concept *racialize* disguising the elision. *Multi-racial* and its euphemistic synonym, *multicultural*, occupy a place of honor, on the supposition, presumably, that a blight becomes a blessing if widely enough diffused. Whatever their defects as historical analysis, they have become obligatory public gestures. Among breaches of propriety, defining race in “bipolar” terms ranks well ahead of wearing animal fur. Nevertheless, bipolarity and asymmetry are the essential historical constituents of American racial ideology and of the actions that the ideology distills.\n\n>Inseparable from the bipolarity and asymmetry of American racial ideology is the “unmarked, unnamed status,” “seeming normativity,” “structured invisibility,” and “false universality” of those who are designated “not black.” That is the datum the whiteness literature seeks to extinguish or overrule. Rather than explore what the absence of a mark or name means, whiteness scholarship mulishly insists upon inserting the mark and name, officiously making good the failure of people in the past to do it themselves, as Professor Arnesen properly complains. The point, it seems, is not to interpret the past but to change it. By its insistence upon marking and naming and making visible, whiteness scholarship first strews race and races everywhere and then, *mirabile dictu*, discovers them everywhere.\n\n>Race then becomes so ubiquitous as to lose determinate shape\n\nYou can find the essay for free online. Also highly recommend her and her sister's book *Racecraft*. Absolutely changed my perspective on the history of race and racism, and how we should actually go about destroying both of those concepts",
            "score": 0,
            "replies": [
                {
                    "author": "anarcho-slut",
                    "body": "I'll check it out, thanks for the recommendation\n\nFor now I'll say-\n\nWhiteness was already a classification from the late 1700's, the first census recording \"white people\" comes from the first census of the so called USA\n\nhttps://www.archives.gov/research/census/1790\n\nSo I'm not sure how \n\n>whiteness scholarship mulishly insists upon inserting the mark and name, officiously making good the failure of people in the past to do it themselves, as Professor Arnesen properly complains\n\nHolds up to that historical record\n\nAt any rate, the institution of whiteness has become real, whether it started deliberately or not, and as people racialized as white (what are you marking on official documents for your race? (Personally I just say other, or \"descendant of European colonizers\" or 2 or more, depending on what they ask, what's listed, and what it's for)) and the Black identity being a legitimate expression of culture, while the white identity is not, it's on so called white people to abolish and do away with whiteness. IMO",
                    "score": 1,
                    "replies": [
                        {
                            "author": "UncomfortableFarmer",
                            "body": "Fields actually goes back even further than the late 1700s to try to understand how and why *only* people of African descent in the colonies were assigned a \"race\", and nobody else was. Her conclusions are interesting and she is a much better writer than I am, so I'll let you discover her arguments for yourself.\n\nAn easier entry point into the work of Fields sisters might be this [podcast episode](https://thedigradio.com/podcast/revisiting-racecraft-with-barbara-and-karen-fields/) where they speak in more plain language, and not so academic. But I still do recommend reading their book Racecraft to everyone interested in this topic",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -4,
            "replies": [
                {
                    "author": "anarcho-slut",
                    "body": "You can say that. But whiteness is centrally about *being supremacist*. That's the whole reason the white identity exists. There's no separating whiteness *from* supremacy.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "anarcho-slut",
                                    "body": "Tankies... litterally wannabe dictators",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "anarcho-slut",
                                    "body": ">Also j sakai is a fed\n\nSource?\n\nAlso, why would you delete your previous comment, \"Just say white supremacy culture\"?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}