{
    "title": "broughtMine",
    "author": "MyForever_NameNow",
    "subreddit": "ProgrammerHumor",
    "rank": 3,
    "score": 8171,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 288,
    "url": "https://i.redd.it/s7l8y4leffpe1.jpeg",
    "id": "1je1ye1",
    "selftext": "",
    "comments": [
        {
            "author": "chaos_donut",
            "body": "if you get a chromobook you dont really have a job",
            "score": 696,
            "replies": [
                {
                    "author": "C_umputer",
                    "body": "Not a programming job at least",
                    "score": 150,
                    "replies": [
                        {
                            "author": "rw_DD",
                            "body": "Sen devs code in jira",
                            "score": 49,
                            "replies": [
                                {
                                    "author": "sigmoid10",
                                    "body": "It's sad how true this is.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SonOfProbert",
                            "body": "Does anyone know what Sen devs code in? The real ones answer twice.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "gregorytoddsmith",
                                    "body": "Jira",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "gregorytoddsmith",
                                    "body": "Jira",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "Acrobatic_Click_6763",
                                    "body": "Logic gates & transistors",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "rw_DD",
                            "body": "Sen devs code in jira",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "ThisIsMyCouchAccount",
                            "body": "During quarantine my company - like many - couldn't source our usual hardware. However they could get some swanky Chromebooks.\n\nThe trialed them and most people were okay with them.\n\nEven a couple devs. I mean, they were coding in VS Code anyway and the machines themselves were top of the line hardware you could get.\n\nIt was an okay plan B but you're still talking about $1200+ Chromebooks. There were just better options for the price. Eventually.\n\nI think some of the non-devs kept them though.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "C_umputer",
                                    "body": "I would have kept it too, chromebooks are usually crap, but free is free",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ThisIsMyCouchAccount",
                                            "body": "Well, I meant they kept them for their job. The didn't get to take them home.\n\nAnd that's the thing. These were not crap. At lease hardware wise. Being a Chromebook - yes.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "C_umputer",
                                                    "body": "What hardware and build quality are we talking about?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ThisIsMyCouchAccount",
                                                            "body": "I think they were 15\" Samsungs with a quad core and decent amount of RAM.\n\nI wasn't kidding when I said they were at least $1200 a pop. Which is why there weren't really a solution. The performance was okay but for that price is just wasn't worth it long term. \n\nIT was just desperate.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "dgc-8",
                            "body": "can it run a compiler? can it run vim?\n\nSomeone once said that programmers should use shitty machines so they are forced to optimize and the software will run everywhere",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "C_umputer",
                                    "body": "I see your point, and I too have had similar ideas. But we are not really talking about some low level optimizations. Most devs just build something from already available tools so they do need some beefy computers to run those",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Noah-R",
                    "body": "\"Your paycheck didn't come in? You were supposed to be 1099, right?\"",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "First-Tourist6944",
                    "body": "Google gives Chromebooks, I’m using one this instant",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "TheAnniCake",
                    "body": "Aka. you’re the intern",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MrHaxx1",
                    "body": "Why\n\n\nMost people's jobs can be done though a browser",
                    "score": 3,
                    "replies": [
                        {
                            "author": "nabrok",
                            "body": "Chromebooks also run linux apps and handle vscode and docker very well.\n\nThey also do more with less.  A chromebook with not much memory runs a lot better than windows with the same amount.\n\nCombine that with remote ssh extension and you don't even need a particularly powerful chromebook at all.\n\nSSH servers can be mounted to the file system with just a click.\n\nUpdates take seconds.\n\nIf I ever need to run a factory reset it's back the way I had it in minutes, a bit longer to restore linux, but that's mostly time for uploading/downloading the backup.\n\nI can run android apps as well.\n\nSubjective, but I think the UI is elegant.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "TheScullywagon",
                            "body": "And a Chromebook can barely run a browser at this point",
                            "score": 31,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ProdigySim",
                    "body": "Google gave developers a choice of a Macbook or a high-end Chromebook (Pixelbook iirc?) for a while.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "casey-primozic",
                    "body": "And they make you pay for the chromobook",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "hodler1992",
            "body": "Great, Im glad I have a ThinkPad :D its actually really good",
            "score": 772,
            "replies": [
                {
                    "author": "BigBaboonas",
                    "body": "2 jobs ago in 2012 they gave an ** IBM** Thinkpad (last made in 2005) with 4GB ram and Norton malware which meant it would take 10 mins to load a single spreadsheet and just had a black screen for 3 hrs a day while the virus checker ran.\n\nThe company I had just left had given me a similar laptop at one point which they told me to recycle years previously because 'it wasn't even suitable for disaster recovery.'\n\nI upgraded it by doubling the RAM and installing an SSD in the optical bay which loaded files 10,000x faster than the old school HDD.",
                    "score": 82,
                    "replies": []
                },
                {
                    "author": "Dron41k",
                    "body": "I had 4 or 5 thinkpads in 5 years of work. They all had their fan dead after some time. And not just dead, suddenly they were screeching very loudly.\n\nThey were just sitting on my table the whole time, not that I took them to woodcutting or other dusty places.",
                    "score": 150,
                    "replies": [
                        {
                            "author": "adeadrat",
                            "body": "Never had this issue, with any of my ThinkPads over the years.",
                            "score": 104,
                            "replies": [
                                {
                                    "author": "tumahrabaapu",
                                    "body": "ThinkPad is legendary, it works fine and works for a long time",
                                    "score": 52,
                                    "replies": [
                                        {
                                            "author": "mirhagk",
                                            "body": "Yeah whenever anyone is looking for something and doesn't have a ton of money I always suggest a refurbished ThinkPad. Businesses will use it for a few years on lease then replace them, but those things last forever, and $300 goes really far with one with one of them.",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Luke22_36",
                                    "body": "I had it happen with my W520 (not work laptop, personal one). I bought a broken one with a donor fan and swapped it.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Random-Dude-736",
                                    "body": "Me either and I do work in a particulary dusty place when I'm debugging directly on machines.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BadgerMolester",
                            "body": "I mean, can you not just open em and clean the fan out?",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Dron41k",
                                    "body": "It’s corporate property, I’ll just give it back to them and receive a new one. \n\nI tried air blower and vacuum cleaner though, no effect. By the sound of it I think it were faulty bearings every time.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Suavecore_",
                                            "body": "Just throwing this out there: never use a vacuum cleaner on a computer",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "IJustAteABaguette",
                                                    "body": "Why not? It should be fine if the computer is disconnected, no?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "argh523",
                                                            "body": "With a vacuum cleaner, or pressurized air, you can make the fans spin much faster than they ever would in normal operation and damage the part. I always use a toothpick to hold it in place so it doesn't spin",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Suavecore_",
                                                            "body": "I'm not sure if the static will bother it if it's off, but it's a good rule of thumb. It can also damage the fans. Can of air is the best option if you can't/aren't willing to open it up. With electronics, no need to take risks when there are other accessible options",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Dron41k",
                                                    "body": "Never use vc on the pc while cleaning inside because of static electricity. \n\nYou will be fine with closed laptop though. \n\nAlso you should be careful to not spin the fans excessively either with blower or vc.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "M-y-P",
                                                            "body": "Isn't the end of a vacuum cleaner a plastic tube or am I missing what is commonly referred to as a vacuum cleaner?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Dron41k",
                                                                    "body": "It is, generally speaking. What’s about it?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "M-y-P",
                                                                            "body": "Then how does the electric static interfere with the PC components? Everyone is talking about it so I'm sure it does, I just don't get how, the vacuum cleaner itself should be some feet away.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dron41k",
                                                                                    "body": "When you cleaning with vc, dust flowing through the plastic tube and charges it. If you touch electronics inside a pc with it, it can discharge and kill that electronics. \n\nThe same reason you need an antistatic bracelet to be sure you don’t kill something while assembling a pc.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "M-y-P",
                                                                                            "body": "You are so right, I don't know why I was thinking \"plastic is an insulator so nothing can happen\", when I know that it can hold charge. Thanks for the clarification!",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Dron41k",
                                                                                    "body": "You can try it yourself with cheap circuit like in disposable calculator and piezo element from a lighter. Use piezo on a naked circuit and see if the calc still works.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "M-y-P",
                                                                                            "body": "I explained in the other reply, but now I get it. I actually remembered how you can charge a plastic ruler and attract paper with it, I was just fixed in the idea that plastic is an insulator so everything should be fine.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Dron41k",
                                                                                                    "body": "Yeah. The general rule is “blow, don’t suck” :) But be careful to not blow into fans, they become generators if you spin them and if you spin them enough, you can fry your mobo or at least fan circuit.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "Dron41k",
                                                                                                    "body": "I updated the latest comment, look at it if you didn’t. Blowing also can be dangerous.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ih-shah-may-ehl",
                                    "body": "By the time the fan craps out, it's old enough that it's been crippled by the latest combination of antivirus, real-time behavioral monitoring, and things like spectre remediation. I'm on my 5th thinkpad over 17 years. T61 (Iirc), T430, T470, T14 gen1, T14 gen5. There may or may not have been 495 in there but I think that wasn't my regular office laptop. That was probably for acceptance testing or something else.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "aykcak",
                                    "body": "The screeching noise that happens suddenly without anything obvious to cause it is usually the motor dying, not something you can clean up.\n\nScreeching noise that gradually increases day by day is usually dirt",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ruadhan2300",
                            "body": "Mine is slowly dying. half the keyboard doesn't work anymore, I have a USB keyboard plugged into it instead..\n\nIt's also taken to not waking up when told to, forcing a reset before it'll turn on.\n\nMight be time for a new one :P",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Dron41k",
                                    "body": "o7",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "argh523",
                                    "body": "You can somtimes fin cheap replacement parts for common models",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jimitr",
                            "body": "You’re the exception not the rule. My thinkpad from 2015’s fan is caked with dust but the machine still runs.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "SomeScreamingReptile",
                            "body": "Oh god I just had to replace mine for the same issue, I’ve heard single unit servers that make less noise",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "bonomel1",
                            "body": "Hahaha yeah it's always the fan. My new Thinkpad has started doing the 100% fan speed, 100% of the time thing after only a few months of use. Giving it 5 or 6 months before it starts BSOD-ing and crashing randomly a few times a day, before becomes e-waste.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "IkeAtLarge",
                            "body": "Mine just started doing this D:<\n\nTo be fair I’ve had it for almost three years, and I got it used. I love these things.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ArmchairFilosopher",
                            "body": "My new one spins its fans faster when I put it to sleep, and never turns them off...",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Dron41k",
                                    "body": "Strange. Maybe set windows performance to balanced?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Awfulmasterhat",
                            "body": "Same happened to my laptop but they were able to fix the fan, might have it another 3 years!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dron41k",
                                    "body": "They may fix it later, reset and give someone else. Idk if they always gave me a new one, but it looked brand new though.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "aventus_aretino99",
                            "body": "It's sounds like you bent the frame",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dron41k",
                                    "body": "All of them? They were good as new, the only time they were not on my table are when I moved them from office to my home. (I wfh)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "aventus_aretino99",
                                            "body": "Here is the thing you might not notice but repetive stresses can cause being over time such as a slightly smaller bag than the laptop. Or the wall you lean on on the subway could have an slight incline. You can do these thing for one or two times you won't even notice. The reason I am saying this is because of the fans are making sounds before they break means that either are misaligned which can happen during manufacturing or they get bent there is no other reason this can happen",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "phugyeah",
                            "body": "I am now on my second thinkpad since 7 years and the first I got was used from an ex-colleague",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "thepasttenseofdraw",
                            "body": "Meanwhile I've had 3 over 10 years and they all still run like tops.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Kingblackbanana",
                            "body": "At least it has a fan, unlike a Macbook, where it just reduces the computing power.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ebina-Chan",
                    "body": "Then your company becomes a huge fan of ultrawide screens and forces it on everyone but the thinkpad doesn't support 60hz on this resolution.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "passenger_now",
                            "body": "That's hardly a ThinkPad feature.  They usually have very solid bandwidth on their USB/Thunderbolt ports.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "MrHaxx1",
                            "body": "My T14 runs ultrawide at 99 Hz",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SoCalChrisW",
                    "body": "I'm on my third ThinkPad at my current employer, so this meme checks out.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Western-King-6386",
                    "body": "I'm impressed with how sturdy they are. No case and I feel like I could slam this thing and it'd be fine.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Squeezitgirdle",
                    "body": "Same. And I work from home, 28 years would be pretty nice.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WraithCadmus",
                    "body": "Have you replaced the splash screen with the ThonkPad?\n\n[https://www.reddit.com/r/linuxmemes/comments/cvitao/by\\_request\\_the\\_thonkpad\\_splash\\_screen\\_for\\_uefi/](https://www.reddit.com/r/linuxmemes/comments/cvitao/by_request_the_thonkpad_splash_screen_for_uefi/)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DemoDimi",
            "body": "What about HP?",
            "score": 189,
            "replies": [
                {
                    "author": "the_mythx",
                    "body": "They either forget they hired you indefinitely or you have 2 warnings before they fire you",
                    "score": 346,
                    "replies": [
                        {
                            "author": "paulodelgado",
                            "body": "Not your first rodeo huh.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "Winter-Pineapple1162",
                            "body": "In fact, they forgot they hired me",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "SendTittyPicsQuick",
                            "body": "They found out I was hired indefinitely when they thought they were about to renegotiate on my renewal. Most fun I have had at work so far.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Noffin",
                    "body": "Your job is safe, as long as you're willing to put your camera on in the meetings.",
                    "score": 132,
                    "replies": [
                        {
                            "author": "Carnby315",
                            "body": "This is so accurate lol.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Deboniako",
                                    "body": "Can confirm",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "DemoDimi",
                                            "body": "can confirm",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "deantoadblatt1",
                            "body": "Goddamn, my boss just let our team know that his higher ups want cameras on in meetings",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Noffin",
                                    "body": "We are putting cameras on in internal meetings now \"as a part of our company strategy\".",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "deantoadblatt1",
                                            "body": "Fortunately my immediate boss doesn’t care if cameras are off within our own team, but just wanted us to be aware if we’re on a call with other teams.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Zolana",
                            "body": "Scarily accurate",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "red286",
                    "body": "Pavilion or EliteBook?\n\nPavilion -- This company is actually just a scam.  Your job likely involves cold-calling people to sell them timeshares.\n\nEliteBook -- See ThinkPad, but you're probably in a designer role, not a programmer.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Jedisponge",
                    "body": "Incompetence",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Vinccool96",
                    "body": "It means you work for the government",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 173,
            "replies": [
                {
                    "author": "Anitadear",
                    "body": "Endurance defines ThinkPad users.",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "robertarobertson",
                    "body": "Stack Overflow would be proud.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Only_One_Kenobi",
                    "body": "Even if you try to get fired, you're stuck there",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "brandi_Iove",
            "body": "fuck…it’s a dell",
            "score": 143,
            "replies": [
                {
                    "author": "RichCorinthian",
                    "body": "Last Dell was me working at a small consulting company…that quickly got acquired by Cognizant. Worked on an enormous project for a big 4 accounting firm. When the project drew to a close, we had 30 days to land ourselves on a new project or we would be automatically terminated. \n\nThis meant filling out an internal resume and doing job interviews. For a job I already had. \n\nAt this same time Cognizant was doing an initiative to try to figure out why retention was so low. \n\nFuck Cognizant, is what I’m getting at. This was the 2nd consultant gig where I joined a small agency that got bought and ruined. \n\nI still have the laptop though. It’s property of the client, I made 3 good-faith attempts to return it, now it sits in a box.",
                    "score": 120,
                    "replies": [
                        {
                            "author": "Makeitquick666",
                            "body": "hope you’re working somewhere better now",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "RichCorinthian",
                                    "body": "Thanks! I am. I did just shy of 10 years at a product company, then 12 years in consulting, now back to product. \n\nNo more consulting for me. To paraphrase Tolstoy, each client is insane in their own way.",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "Makeitquick666",
                                            "body": "you’ve worked for almost as long as I’ve lived lmao. At least.\n\nbut yeah I’m fairly sure what they pulled on you is illegal where I live. Where I live once you’re gotten in, many companies would actually keep you even though all you do is sleep because it’s too expensive to lay you off because the fees that they’d have to pay unless you’re a cleaner or some shit, doesn’t sound like you were/are",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "1200____1200",
                            "body": "Brutal\n\nI had a friend tell me about their company (call centre) that had over 50% annual turnover\n\nThe CEO decided that the problems were that current employees didn't rate the company high enough on \"best places to work\" surveys, and Recruiting wasn't doing a good enough job hiring the right people \n\nNo thought that maybe offering the lowest wages and benefits while treating staff like cattle opens your workforce up to competition",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "blizzacane85",
                    "body": "![gif](giphy|Akry6V17RGH60)",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Powerful-Internal953",
                    "body": "Hello.... It's me...\n\nI was wondering if after all these years you'd like to meet\nTo go over everything...\n\nThey say that time's supposed to heal ya, but I ain't done much healing...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MandessTV",
            "body": "They gave me a Lenovo. I feel happy now.",
            "score": 74,
            "replies": [
                {
                    "author": "MyForever_NameNow",
                    "body": "Thinkpad.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "MandessTV",
                            "body": "It is a Lenovo Thinkpad :D. Also, I've been working here for 9 years already and I do play to retire in the company too. The tweet is so on point xD",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "iiReeZoN",
            "body": "MacBook here… accurate",
            "score": 57,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ILGIOVlNEITALIANO",
                            "body": "Since you’re retiring do you mind sharing your company name? I don’t really complain about mine but I wouldn’t mind joining other “good and healthy” companies",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hearthebell",
                    "body": "My new job is giving me Mac, what gives?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "iiReeZoN",
                            "body": "Meaning it’s a small business typically a start up",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Maskdask",
            "body": "I got a Framework",
            "score": 47,
            "replies": [
                {
                    "author": "Tablesalt2001",
                    "body": "your job is a startup with grand plans. Your boss will sell his company to a larger company when he can get a few million for it.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "paulodelgado",
                    "body": "Um. You hiring?",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Romeo3t",
                    "body": "God I'm so jealous",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reasonable-Crew-2418",
            "body": "I'm the IT guy at our organization. I purchased Lenovo laptops for everyone, and some of the employees have been there for 35 years. 😉",
            "score": 49,
            "replies": [
                {
                    "author": "saschaleib",
                    "body": "I’m now 15 years into a job with Lenovo laptops. I hope I can retire before I hit that 28-years mark…",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "IDontEnjoyCoffee",
                    "body": "I'm in a massive corporate company where most of the devs are 5+ years with my manager on 10+ years, and we're all on ThinkPads 😂 every other company in my area they have to make the guys that stays for 3 years seniors because they've been there the longest.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Only_One_Kenobi",
            "body": "HP: your management don't have a clue and you best get your CV ready",
            "score": 33,
            "replies": [
                {
                    "author": "BellybuttonWorld",
                    "body": "Yup",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Broad_Minute_1082",
            "body": "HP - we're aggressively boring and have more bureaucracy than you'll ever understand.\n\nSource: I have made a career out of that bureaucracy. I basically spend all day telling Team A to Submit Ticket#xzy for access into [System].\n\nThe people at my org are so bad at reading, I have a six figure job JUST reading documents for them and telling them how to do things.",
            "score": 21,
            "replies": [
                {
                    "author": "Intense_Pretzel",
                    "body": "Literally accurate",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "justin107d",
                    "body": "Not in coding yet, but know I don't want to be at my current company.  I could write jira tickets for literally every piece of software I come in touch with but nothing would happen.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "buckypimpin",
            "body": "Macbook, dead straight",
            "score": 17,
            "replies": []
        },
        {
            "author": "NeatYogurt9973",
            "body": "Except if it's an L series tho",
            "score": 30,
            "replies": [
                {
                    "author": "Soonly_Taing",
                    "body": "OOOF BIG RED FLAG (with the E series as well)",
                    "score": 14,
                    "replies": [
                        {
                            "author": "NeatYogurt9973",
                            "body": "I am kinda disappointed that now these two just use the brand name for free reputation meanwhile the actually good ones are 2x the price. I really wanted a ThinkPad T series but had to stop at an Acer Aspire given I probably won't be carrying it around much. The single piece for keyboard+touchpad+palmrest design blows but it is what it is.\n\nI also considered stashing an old used laptop motherboard in a pizza box then taking out the eDP display from my old one.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Reasonable-Crew-2418",
                    "body": "What's wrong with the L and E series? We bought these for all of our employees and everyone's very happy! They get a brand new one every six months or so. /s",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "je386",
            "body": "Wait.. thats accurate. Got 2 Thinkpads in 8 years and in about 20 years I am old enough to retire.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Zuendl11",
            "body": "Dell laptop here: I'm 4 warnings in",
            "score": 9,
            "replies": []
        },
        {
            "author": "ISmokeyTheBear",
            "body": "Yeah but why are my thinkpads always hot",
            "score": 7,
            "replies": [
                {
                    "author": "lledargo",
                    "body": "Attraction is subjective, but I agree. Thinkpads are sexy af.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Internal-Bluejay-810",
            "body": "Can I just get a job, please?\n\n![gif](giphy|l2R032V7qRAF8J6qA)",
            "score": 8,
            "replies": []
        },
        {
            "author": "Selafin_Dulamond",
            "body": "Shit I have a Dell that sucks like hell. I hate It.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ValueBlitz",
            "body": "After I got fired, I chucked my only computer into the ocean. Now it's\n\nA Dell. Rolling in the deep.\n\nI know, stupid jokes, haha... All I Ask. Go Easy on me.",
            "score": 19,
            "replies": [
                {
                    "author": "savage_engineer",
                    "body": "go home unc you're sleep deprived",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfCupcake",
            "body": "Thinkpad here. \n\nLosing my job in 2 weeks because the company wanted to cut costs. \n\nYou lied to me.\n\n(It is a solid laptop though, tbf)",
            "score": 3,
            "replies": []
        },
        {
            "author": "riplikash",
            "body": "...this is surprisingly accurate to my experiences.",
            "score": 3,
            "replies": []
        },
        {
            "author": "rplusg",
            "body": "Not sure about dell but it's spot on with MacBook",
            "score": 7,
            "replies": []
        },
        {
            "author": "gr_hds",
            "body": "Company gave me dell, I literally don't know how I would ever get fired. I was given a Mac to work with iOS, I've been switching projects inside the company based on absence of funding ever since.",
            "score": 3,
            "replies": [
                {
                    "author": "freudsdingdong",
                    "body": "Is there a chance we're working for the same company lol. Literally same.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dependent_Chard_498",
            "body": "What if I got started with a Thinkpad, then when they realised I was disappearing for extended breaks waiting for local compilation or tests to run, they gave me a MacBook pro",
            "score": 3,
            "replies": [
                {
                    "author": "ih-shah-may-ehl",
                    "body": "Wouldn't it be easier to give you a remote desktop on a beefy server?  \nEdit it'd also immediately improve business continuity in terms of your laptop crapping out, being stolen, etc.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Dependent_Chard_498",
                            "body": "Sir. You make too much sense.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ColoRadBro69",
            "body": "Microsoft gave me a Thinkpad for my 18 months there. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "CrazyCommenter",
            "body": "What about an Asus gaming laptop? (no, I'm not working in game dev)",
            "score": 5,
            "replies": [
                {
                    "author": "SpaceNigiri",
                    "body": "Your boss is probably a kid",
                    "score": 14,
                    "replies": [
                        {
                            "author": "ThisIsMyCouchAccount",
                            "body": "We had a couple guys that had gaming laptops. They where WFH before quarantine and needed really beefy machines. It was just the easiest option to get them the power they needed.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SpaceNigiri",
                                    "body": "That's true, when you require a lot of GPU power the easiest way is gaming laptop.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ThisIsMyCouchAccount",
                                            "body": "It wasn't even the GPU.\n\nIt's been a few years - but at the time it was the easiest way to get the best CPU and the most RAM.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "ThisIsMyCouchAccount",
                                            "body": "It wasn't even the GPU.\n\nIt's been a few years - but at the time it was the easiest way to get the best CPU and the most RAM.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RadiantPumpkin",
                    "body": "Your it department is run by your boss’s nepobaby son",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Kukaac",
                    "body": "You are self employed.\n\n(Asus owner here.)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gammacor",
            "body": "What if it's a Samsung notebook from Costco?",
            "score": 2,
            "replies": [
                {
                    "author": "kowaiser",
                    "body": "Then you are less of an employee and more of an intern with a fancy title",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Gammacor",
                            "body": "Hell of a paycheck for an intern, then.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "savage_engineer",
                                    "body": "r/humblebrag",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Reasonable-Crew-2418",
                    "body": "![gif](giphy|3oeSAz6FqXCKuNFX6o)",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "_grey_wall",
            "body": "What if it's an Acer?  Or Asus ?",
            "score": 2,
            "replies": []
        },
        {
            "author": "HitmanxNatuRe",
            "body": "Wait your supposed to get a laptop?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Impossible-Ad6326",
            "body": "I've got a ThinkPad and a MacBook, what could that mean?",
            "score": 2,
            "replies": [
                {
                    "author": "Vibe_PV",
                    "body": "The next funding round won't come in 28 years",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "sundaesoop",
                    "body": "Oh I’m not alone",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rw_DD",
            "body": "My company gave me a Lenovo and a Dell.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jimakiad",
            "body": "Dell here, but I've gotten a bunch of warnings (>3)... got the QA people fired instead?",
            "score": 2,
            "replies": [
                {
                    "author": "HanzoMain63",
                    "body": "What do you even get warnings for at work? I got a dell laptop too lul",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "com-plec-city",
            "body": "They gave a Lenovo with a powerful graphics card because I cried “we can’t do any of those AI things without a proper graphics card!!!!” even though I work with databases and the job has nothing to do with AI. Now I can play CS2 at 600fps.",
            "score": 2,
            "replies": []
        },
        {
            "author": "windanim",
            "body": "Well, folks, I regret to inform you that the funding did not come in, and my job was, in fact, not safe. I’ll see you all on the job boards 🫡",
            "score": 2,
            "replies": []
        },
        {
            "author": "kelt_spb",
            "body": "Had all 3 simultaneously at one job. Does not protect me from company goes insolvent 2 times in 5 months.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KazuDesu98",
            "body": "I’ve spent longer at the places that gave me dells than Lenovos",
            "score": 2,
            "replies": []
        },
        {
            "author": "LinqLover",
            "body": "I could choose between exactly these brands! Apparently I threw my future away ...",
            "score": 2,
            "replies": []
        },
        {
            "author": "HistoricalLadder7191",
            "body": "Dell it is....",
            "score": 1,
            "replies": []
        },
        {
            "author": "KingamerSchool",
            "body": "What about a green \"You Can Think Pad\"?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HonestCod7896",
            "body": "My employer used to use IBM/Lenovo.  We're now using Dell.  I've been here nearly 25 years.  I think the annual layoffs started a little bit before we switched to Dell.........",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gaminguide3000",
            "body": "Repost",
            "score": 1,
            "replies": []
        },
        {
            "author": "sassiest01",
            "body": "I work at a startup with a personal 4 year old laptop...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Benjamin_6848",
            "body": "What is with HP, Asus and Acer?",
            "score": 1,
            "replies": [
                {
                    "author": "harumamburoo",
                    "body": "Hp is on the same level as Dell. Asus or Acer means you’re a student working at a startup on your personal “gaming” laptop",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "scn625",
            "body": "Started out with a Lenovo, ended up with a Mac\n\nSign of the times lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "H34DSH07",
            "body": "Had all 3 during my career. Surprisingly accurate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "coggsa",
            "body": "What if they replace your gaming laptop with a 2nd hand Dell? That's good, right? Right??!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dhaninugraha",
            "body": "My work gave me a used MacBook Air M1 with 8GB of RAM.\n\nI returned it and chose to daily my own 16\" M1 Max and T420 (which runs Debian 12 & xfce).\n\nSometimes I’d bring my iPad and keyboard, and just work on `code-server` that runs in a VM in the office lab.\n\nI bought my own display too, as they’re too cheap to even give me something used. I got a 2K 27\" Lenovo which is pretty swank compared to what the rest of the floor has — even the Dell P-series that got issued to some managers holds no candle to my gorgeous display.\n\nI come into the office twice a week, each day no more than 6 hours.\n\nThe only somewhat sternly-worded 1:1 I’ve ever gotten was because someone didn’t like how they made abrasive banters and I responded in kind. But never had any official write-ups whatsoever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "moth_hamzah",
            "body": "thinkpads are expensive but basically bricks. cant kill them and they just keep goin on",
            "score": 1,
            "replies": []
        },
        {
            "author": "puffinix",
            "body": "And if they give you about fifty different options what does that mean. \n\nAnd if the option I choose was a redundant power connection, 62 ip addresses, and 4u of space (it was under the BYOD subsection) - what dioes that mean for me?",
            "score": 1,
            "replies": []
        },
        {
            "author": "repthe732",
            "body": "What does it say if my job flips between Dells and Lenovos?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThicCranberry784",
            "body": "ok but for real Dell laptops are hot garbage don't stay there",
            "score": 1,
            "replies": []
        },
        {
            "author": "woodyus",
            "body": "I have a Dell and a MacBook. This means the company expects me to be doing at least 2 people's jobs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrFodds",
            "body": "What does it mean if they let you choose which one you want?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BirdlessFlight",
            "body": "Me, on the same Dell for almost 5 years and like 17 warnings: \"Is this another US thing?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "yuddaisuke",
            "body": "Funny thing is, I've had a ThinkPad at my FANG company since I believe 2016 and yeah, I'm still here and it's 2025. Just when I think I'm gonna leave this company for good, they send me a new offer for a different team and are the first to hire me again. \n\nDunno if I should be happy or sad. Probably should get out with a better role before upper management toxicity makes its way to out team",
            "score": 1,
            "replies": []
        },
        {
            "author": "BP8270",
            "body": "19 years to go!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ice1Hcode",
            "body": "Can confirm, i work at a company known for long tenures. Got the ThinkPad lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "fico86",
            "body": "They replaced my Thinkpad with a Dell. What does that mean?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Taurmin",
            "body": "What if they give you a HP Z book...",
            "score": 1,
            "replies": []
        },
        {
            "author": "eeee_thats_four_es",
            "body": "What if they don't give you anything and require bringing your own device",
            "score": 1,
            "replies": [
                {
                    "author": "HanzoMain63",
                    "body": "Broke startup",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "timkatt10",
            "body": "My company uses dell.   I'm on my third laptop.  Does each new laptop reset the number of warnings I will get?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FruitIceCream2000",
            "body": "What about surface?",
            "score": 1,
            "replies": []
        },
        {
            "author": "erockdanger",
            "body": "I have an irrational fear of think pads. the shape, those little red dots. I don't know what it is. \n\nimma put this therapy to work and see if I can find out why. \n\nBear with me... \n\n...boredom, stress, clothing stripped of personality, wtf is that red button for... \n\n\nok, got it. When I used to ride the train from Brooklyn to Manhattan there would often be people, especially in  Manhattan who would pop these think pads out. \n\nThey never looked happy, they all had the corporate drone attire of the time. Whatever they were working on seems to stress them out. \n\nSince I never saw these laptops in another context so I only associate them them with those people I saw on the train and the desire to never be like that myself",
            "score": 1,
            "replies": []
        },
        {
            "author": "myka-likes-it",
            "body": "Lenovo ThinkPad gang checking in.  \n\n\nAverage employee hangs around for 15 years or so. Just had someone retire after 40 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ruadhan2300",
            "body": "Accurate across the board.\n\nJob 1 - We had desktops, but they were Dells. Boss was a hardass who didn't actually understand us, so it was very much an unfriendly working environment.\n\nJob 2 - Small startup company, and on day 1 we went out and bought me a brand new macbook pro to work with. Company didn't last five months.\n\nJob 3 - Lenovo laptop - I probably would still have been there, but my job got farmed out to a team in Romania\n\nJob 4 - Lenovo again. I work with people who have been in this job for 20+ years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bloodandsunshine",
            "body": "I had to google the company and model of my laptop",
            "score": 1,
            "replies": []
        },
        {
            "author": "atomic_redneck",
            "body": "I got an IBM ThinkPad, and I spent 27 years before I retired.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Simming_bear",
            "body": "What if they dont give you any?💀💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "KMjolnir",
            "body": "My job issues me a ThinkPad right before everyone switched to Dells. I still have my ThinkPad. Hmm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "don_biglia",
            "body": "I got two Lenovo's. What does that mean?",
            "score": 1,
            "replies": []
        },
        {
            "author": "kuroseiryu",
            "body": "I took as a huge red flag when they gave me a MacBook and started looking for another job immediately.\n\n3 months later, I know that it was a good call.\n\nNow, I have an HP computer... What does that mean??",
            "score": 1,
            "replies": [
                {
                    "author": "n8LovesSD",
                    "body": "Your organization thinks office space is a movie to emulate.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "drivingagermanwhip",
            "body": "i have a thinkpad and am the only person in my team who's been there less than a decade so this checks out",
            "score": 1,
            "replies": []
        },
        {
            "author": "KaiDaLuck",
            "body": "this... is surprisingly accurate lol. I got a dell laptop on my previous job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Denaton_",
            "body": "What if I didn't get a laptop but a full-blown gaming PC?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prof_LaGuerre",
            "body": "I had to bring my own and install a VMware client to it. Fortunately I still had my Dell from when I was laid off at the previous job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGlave",
            "body": "Whats the reasoning?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AKJ90",
            "body": "I could pick, so whats that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SolidHopeful",
            "body": "No warnings.\n\n4 month gig went four years\n\nStill have the Dell ![gif](emote|free_emotes_pack|facepalm)![gif](emote|free_emotes_pack|facepalm)![gif](emote|free_emotes_pack|facepalm)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Knightfires",
            "body": "Until you get fired with a Lenovo laptop. Works great by the way for home stuff. Great value",
            "score": 1,
            "replies": []
        },
        {
            "author": "sundaesoop",
            "body": "Wait… I have a thinkpad and a MacBook.. now I’m even more confused",
            "score": 1,
            "replies": []
        },
        {
            "author": "Abhithind",
            "body": "What if my workplace gives out Dell and ThinkPads interchangeably",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hoxitron",
            "body": "Lenovo has gone to shit now. I think HP is the new thinkpad now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JohnnyDrama21",
            "body": "Me and my ThinkPad have been here for 9 years, thank you very much",
            "score": 1,
            "replies": []
        },
        {
            "author": "dante3590",
            "body": "What about people who got surface",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dracodyck",
            "body": "Thinkpad here, yeah most of my colleagues have been there for the last 20 years",
            "score": 1,
            "replies": []
        },
        {
            "author": "DestopLine555",
            "body": "What does a Lenovo Legion mean then?",
            "score": 1,
            "replies": []
        },
        {
            "author": "EtchAGetch",
            "body": "Lenovo Thinkpad.  Been here almost 25 years...\n\nThis hit close to home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wertbon1789",
            "body": "That's... Pretty accurate, actually. I know some people here actually work here since the 90s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lledargo",
            "body": "If your employer has you bring your own device: you're job is safe until the ransomware attack.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_Cromer",
            "body": "Dell Precision. Damnit",
            "score": 1,
            "replies": []
        },
        {
            "author": "zulu02",
            "body": "Got an HP, need to start my new job next month 😩",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quaschimodo",
            "body": "Dell, but nevermind the company. the hardware is just shit. half the time the dock doesn't recognize my monitors, doesn't wake from sleep properly or does some other shenanigans. Never had any problems with my private desktop which uses the same peripherals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GreenWoodDragon",
            "body": "I now own the macbook I was assigned at my last company. They bankrupted, after Series C fund applications failed, so I was able to buy it at a knockdown price.",
            "score": 1,
            "replies": []
        },
        {
            "author": "serious-catzor",
            "body": "Used Thinkpad? What do I get?",
            "score": 1,
            "replies": []
        },
        {
            "author": "O0100010001001010",
            "body": "Facts",
            "score": 1,
            "replies": []
        },
        {
            "author": "wggn",
            "body": "I started with a Thinkpad and now have a MacBook pro, where did that put me",
            "score": 1,
            "replies": []
        },
        {
            "author": "False_Influence_9090",
            "body": "Damn I actually did work at a company, we all used MacBooks, and the next round of funding didn’t come in..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yimmelo",
            "body": "I had a dell when I first started but It bricked itself during a bios update. I got a lenovo replacement and will spend the next 33 years dutifully serving my employer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bakoro",
            "body": "Okay, legit though. \n   \nI hate my Thinkpad, but I might actually spend another decade at this company.  \nThey've been giving me for-real raises. If that keeps up, me and them are solid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blurkid",
            "body": "Is it also true in france ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Not__Trash",
            "body": "4 years into my ThinkPad, sounds about right",
            "score": 1,
            "replies": []
        },
        {
            "author": "punninglinguist",
            "body": "Just landed a new job and everyone at the interviews had ThinkPads. Score.",
            "score": 1,
            "replies": []
        },
        {
            "author": "arrow__in__the__knee",
            "body": "Gaming Laptop : Leave, now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lamuks",
            "body": "I just got a new thinkpad to upgrade to from the old one. Is that bonus points?",
            "score": 1,
            "replies": []
        },
        {
            "author": "time_san",
            "body": "I got a PC, so that means I'll be there until it goes bankrupt or I'm going to die first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StonePrism",
            "body": "I got a Dell, a MacBook, and a Mac Studio, (all with different purposes lol) what the fuck does that mean for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ledfwil1",
            "body": "And if you get an old Surface?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rex1one",
            "body": "In my experience, a Dell Laptop meant that they had money left over at the end of the year that they had to spend to make sure they got the same budget next year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YakDaddy96",
            "body": "What if they let you choose what laptop you get?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShockinglyApparent",
            "body": "I made the mistake of asking to switch from the Thinkpad to a Mac. I did not survive not getting funding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BandicootCumberbund",
            "body": "lol got a Thinkpad at my last salaried role and they RIFed me after only 11 months.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HugeMcLargeBig",
            "body": "I have been employed by an insurance company for 35 years now. We use Lenovo ThinkPads. IBM Thinkpads before that. So this is quite accurate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bar50cal",
            "body": "Im confused, my job took my old 8Gb Mac Pro and replaced it with a 64Gb DDR5, intel i9, RTX A2000 GPU Dell Precison laptop.\n\nDid I get a upgrade or was I personally downgrade?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SignificantTheory263",
            "body": "What if they make you bring your own device",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiny-Plum2713",
            "body": "I've never worked for a company where I couldn't choose the laptop I wanted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiny-Plum2713",
            "body": "I've never worked for a company where I couldn't choose the laptop I wanted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheCreamyBeige",
            "body": "Lmao MacBook and i work for a startup so this tracks",
            "score": 1,
            "replies": []
        },
        {
            "author": "vitope94",
            "body": "Started with an average ThinkPad, soon moving to a ThinkPad Workstation, then potentially a MacBook for cross platform development reasons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaGuus",
            "body": "Only desktops for us",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Badger_7581",
            "body": "What if they don't give me any of those and I instead bring my own lenovo?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Simple-Reply-1998",
            "body": "what about HP 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClassikW",
            "body": "Mine says \"OIT LOANER\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "iCopyright2017",
            "body": "I was given a disassembled framework. I put Linux on it. What about me?",
            "score": 1,
            "replies": []
        },
        {
            "author": "KMark0000",
            "body": "I have got an HP. Now what?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Western-King-6386",
            "body": "Can anyone elaborate on the reasoning here?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ultralee0",
            "body": "Or you could be me:\n\nGets Thinkpad --> Gets laid off in about 6mo because of the budget",
            "score": 1,
            "replies": []
        },
        {
            "author": "kittycity1",
            "body": "Ong this has all been 100% true for me. But only had a Lenovo for a hot minute in college.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kittycity1",
            "body": "Wow this has all been 100% true for me. But only had a Lenovo for a hot minute in college.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DevLimburg",
            "body": "Lenovo here 17years and counting !",
            "score": 1,
            "replies": []
        },
        {
            "author": "Not-the-best-name",
            "body": "Omg. Literally my last 3 jobs and last 3 laptops and 100% accurate. At 3 warnings now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeutronOnReddit",
            "body": "I have a mac and now I am scared",
            "score": 1,
            "replies": []
        },
        {
            "author": "Evgenii42",
            "body": "They asked me if I want company to buy me a MacBook, and said no thank you, I have my own. So I think I broke the job simulation system and it's now in undetermined state.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheNeutralNihilist",
            "body": "Work gave me a new P52 some 6 years ago. We are still buds to this day. It has been dropped, sprayed with water, spilled coffee, repeatedly gone from -10C freezer right into +25C humid weather (so condensation), still trying to dig out pet coke from under the keyboard and it also has bits of yellow spray paint on it because someone was painting beside me while I was working. \n\n\nI had my first issue a few weeks ago. The enter key was on a hair trigger and would press if you just grazed it. Nothing under the key but banged on the button a few times and it's good to go again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Enough-Scientist1904",
            "body": "Thinkpad still going strong",
            "score": 1,
            "replies": []
        },
        {
            "author": "MGateLabs",
            "body": "I’ve been on three thinkpads, and two dells for about 14 years at the same job, different owners",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dillenger69",
            "body": "I had a think pad at my last job. I was there 10 years. I'd still be there if they hadn't started losing money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moomoobeef",
            "body": "I still use the Dell laptop my dad got from his job in 2008, it's a Dell Latitude D630 and even the battery still holds a charge",
            "score": 1,
            "replies": []
        },
        {
            "author": "triculious",
            "body": "Got the Thinkpad replaced by a Dell, am I in trouble?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Just-LonelyBunn",
            "body": "Got a Lenovo, got laid off after a year and a half.\n\nGot a surface, got laid off after 9 months.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysteoa",
            "body": "What about if they give you Dell, then ThinkPad, then again Dell?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotOfTheTimeLords",
            "body": "They asked me if I wanted a dell or a mac. I got a dell. ​​",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nceight",
            "body": "I got thinkpad so I'm good?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainWillThrasher",
            "body": "HP but they just ordered me a Lenovo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "timsredditusername",
            "body": "We use ThinkPads. LinkedIn just informed me that one of my colleagues reached 29 years at the company last week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "knucklehead_89",
            "body": "We use dell but we don’t cheap out on the lower end models. When you have some defense contracts in the company, you don’t have as many options",
            "score": 1,
            "replies": []
        },
        {
            "author": "RogersMrB",
            "body": "Worked for MSP. Gave us MacBooks. Setup Thinkpads for all our clients.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StitchRS",
            "body": "Thinkpad here. Just started 5 months ago. Looking forward to the rest of my life",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cross_Whales",
            "body": "I asked for a ThinkPad they gave me Asus ![gif](emote|free_emotes_pack|facepalm)![gif](emote|free_emotes_pack|facepalm)",
            "score": 1,
            "replies": []
        },
        {
            "author": "W1llW4ster",
            "body": "What if they give you a chromebook?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thadoy",
            "body": "Hm, we can freely choose our hardware. \n\nBut I took a Dell. XD",
            "score": 0,
            "replies": []
        }
    ]
}