{
    "title": "Why people are so rude?",
    "author": "chornobaivska",
    "subreddit": "blender",
    "rank": 11,
    "score": 325,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 128,
    "url": "https://www.reddit.com/r/blender/comments/1je4bu4/why_people_are_so_rude/",
    "id": "1je4bu4",
    "selftext": "Recently, my boyfriend helped me post my first 3D model and ask a question on this subreddit, and I received a lot of rude comments before my post was eventually deleted.\n\nPeople couldn't believe it was my first model. Of course, if you consider the default cube and its render, it wasn't technically my first model. However, this was indeed my first completed model.\n\nI took a course on creating 3D characters and spent six months ripping my ass off every day and sometimes nights to perfect it.\n\nI put my soul into this model. However, when I decided to share it with you, I was met with a wave of angry comments.\n\nI'm in the process of transitioning my career from tattooing to becoming a 3D artist. In a way, I'm flattered that some think this isn't my first model. It suggests I'm on the right path.\n\nThank you for your harsh comments ✌️",
    "comments": [
        {
            "author": "slindner1985",
            "body": "I can't see the picture but the post is still there so I read the comments. I assume this is a very good looking human model and render but under the wording it appears to be from a new blender user. I've seen people get roasted before like this. Generally what it is is someone who has a bunch of other related experience then starts using blender, picks it up quick and utilize their other tools and experience along with blender then they post here saying it's their \"first model\" without mentioning their experience. I'll admit the roast was pretty harsh but at the same time I think it is important to be honest with the community so as to shed the correct light on the experience required to make such things. Blender is one of those applications that can easily frustrate a user due to its complexity. In this example that is reflecting as a negative emotion being directed towards whatever triggered them in your post. I say just be real be honest share your specific experience and highlight those aspects to show how you got to this point in your journey. Use that to speed others along in theirs. \n\nIf this is truly your first shared model with no experience but it took 1000 hours say that and go into your work flow. If you borrowed assets even shaders say that. Don't just play it off with the words first model and end it there. There are alot of personal agendas here too like influencers, ai crap sometimes, stolen work all of that sort of contributes to the knee jerk reaction you saw there. Just keep it real and all should be good. \n\nI want to see this model now though not sure how i can see it.",
            "score": 284,
            "replies": [
                {
                    "author": "Spaaacce",
                    "body": "This already exists as a community rule. People should really read them before posting...\n\nhttps://preview.redd.it/rlqsx2b71ipe1.jpeg?width=1080&format=pjpg&auto=webp&s=87efed2e3776914e074f932a40bf4b0a500ddb7a",
                    "score": 166,
                    "replies": [
                        {
                            "author": "MrHattington",
                            "body": "Where did you find this? I’m looking through the Rules and the Making a Good Post guide where it says “Please read the rules and the guide before posting”, and I can’t find this section anywhere.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Spaaacce",
                                    "body": "https://www.reddit.com/r/blender/wiki/rules_and_guidelines/community_rules/",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "MrHattington",
                                            "body": "Awesome, thanks. I wish the mods would link this in the Making a Good Post guide or the rules in the sidebar, because I would never have thought to look in the wiki for more rules (and I’m guessing that goes for a lot of people too)",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "author": "Spaaacce",
                                                    "body": "No worries 👍 I agree it should be easier to find. Or just outright typed in the sidebar would be better!",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "lucpet",
                                                    "body": "Completely agree with this, making people guess where things are hidden, is just idiotic",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "slindner1985",
                            "body": "Funny I was thinking about this earlier because my first post was actually blocked with the wording \"first\" way long ago before the earth began",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "TheWorkshopWarrior",
                            "body": "Either I'm a bloody idiot or this rule is new.  I'm quite glad they added it.  🥲",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "MrHattington",
                                    "body": "I think it’s been around for a little while, but it’s hidden in the community rules in the wiki. I couldn’t find it for myself until someone else linked to it: https://www.reddit.com/r/blender/wiki/rules_and_guidelines/community_rules/",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SlowMope",
                            "body": "That's a lame rule. I can see why it was made, but I think it's an obvious mistake as we get people in this situation, where the board is wayyy too excited to hate on a beginner just because they don't immediately suck.  \n\nDo people humble brag? Yes. Is that a problem in the art world? No. No it's not, especially when the alternative is shitting on people who start out decent because they put in the effort. What a great way to kill discussion and shun new users who could add some much needed content to this board. \n\nMost people in real life, especially at an art school, want you to explain that you are a beginner so they can adjust their language to help you learn. This board has issues. \n\nIt's always: \"they can't be a beginner! because *I* am not a beginner and I'm not as good, they must be lying or humble bragging!\" \n\nAnd never: \"wow I wonder what their background is? I should ask so I can learn the way they did,\"\n\n\nIt's like high school art class in here, not a discussion board. It's weak.",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "mokujin42",
                                    "body": "Nothing stopping you from posting it just don't say it's your first post, makes no difference to the poster really",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "SlowMope",
                                            "body": "It totally does. It indicates their level of knowledge and confidence. It's short hand for asking for less nuanced help, without having to have a whole conversation to explain that they don't know the program well and that they don't understand certain terms. It also indicates that they know their work isn't perfect, and are looking for opinions. \n\nPeople shouldn't have to justify their background to not be mocked. \n\nI learned how to sculpt in z-brush in a one week class. I am completely lost in blender despite being able to sculpt okay, I am a beginner and I would not understand any discussion about it without people getting on my level and making crayon drawings. But I COULD make a humanoid sculpt that looks nice. \n\nArtistic talents don't make people any more knowledgeable about a program, and if you look at op's model it's not anything special or particularly talented. It would have received a c in my sculpting class.\n\nThinking people are humble bragging is entirely on you.  Not the people looking for feedback.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "ImperceptibleShade",
                                                    "body": "It doesn't take \"a whole conversation\" to say \"I want feedback.\" and/or \"I want less nuanced help.\"",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Any-Company7711",
                            "body": "boom\n\nyou saw it here folks",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GrainofDustInSunBeam",
                    "body": "Click her user name. its on other sub. It looks good. But you can see its a beginner.  \nBit of a harsh knee jerk reaction like you said.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "slindner1985",
                            "body": "I see it now. It wasn't there before. That is impressive but not overly impressive. I mean it's good but I don't think it deserves the reaction that it got so I'm gonna side with op on this one. The other roasts i saw were clearly better and from more established artists that were passing it off as new work. This however doesn't so I dunno. Reddit man.\nSometimes as an artist though negative attention is better than no attention.",
                            "score": 24,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GovernmentInformal17",
            "body": "It is responsive. This sub is filled with bait, karma farmers and positive attention farmers. Everyday there's like 87 posts like \"Hi im 14 nanoseconds old and this is my first render!! ***\\*proceeds to put a Blur Studios animation screenshot\\*\"***\n\nIt is not a justification but given the context it's understandable. It's just that there are always pretentious people trying to boost their ego and it's a ***very*** common thing here.",
            "score": 60,
            "replies": []
        },
        {
            "author": "Inevitable-Owl3218",
            "body": "What happened is ppl saw you saying it was your first model and saw how good it came out and called Bullshit cuz it's a typically \"self hype\" kinda post that ppl have come across waaaay too much. \n\nThere have been trends where ppl who've had prior experience being in the 3D industry or just sculptors or artists of any kind who transitioned into 3D, post their good looking models and, well Technically... Yes it is your \"First\" 3D model but is not the first model/art piece you've made.\n\nThe actual beginner models are sloppy, crappy or typical beginner models, so when your post doesn't meet the norms, it's like you are flexing on beginners.\n\nDon't take it to heart, personally Id just post and ask for critique or ask the masses to point out obvious flaws or anything that stands out, after all that's all that matters.....\n\nEdit: Saw the model in question, you have dual weilding cyberpunk themed female character with robotic enhancements , that's hard modeling, organic/human mesh, hair, material study, cloth from Marvelous Designer....all things that don't get covered in \"BEGINNING\" stages of 3D.",
            "score": 84,
            "replies": []
        },
        {
            "author": "Shadymoogle",
            "body": "I think you've fallen victim to an environment you had no idea could be hostile. And to be clear, from my passing experience, this subreddit is not toxic.\n\nHowever, your post attracted mockery because you didn't include the work you had put in up to that point. It's as if you went to an art class with the Mona Lisa and started bragging that it's your first time doodling.\n\nObviously not your intention but just how it could come across. With that said I am sorry your post attracted so much negative attention and rudeness. Your model must have been really impressive to attract such ire.",
            "score": 160,
            "replies": [
                {
                    "author": "---Ark",
                    "body": "I think major reason for the toxicity was the vague wording in the posts title. Most were simply pissed off because they thought the post existed to boost the ego of OP. I, myself, was also pretty puzzled by the post. I'd see a render of the default cube as my first render ever and not a close to perfect humanoid representation 😅",
                    "score": 45,
                    "replies": []
                },
                {
                    "author": "Agreeable_Tip_7995",
                    "body": "Your second paragraph is exactly why this happened",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "NuClearSum",
            "body": "You've spent 6 months making models and doing tasks for this course, and then you are saying that it was your first model? It's just not true, and you know it. Maybe it is your first full render done from scratch using the full pipeline, but it's definitely not the first model ever. Some things just can't be done properly without practice or the constant supervision of a skilled mentor",
            "score": 104,
            "replies": [
                {
                    "author": "ShawnPaul86",
                    "body": "This is likely the most accurate comment about the post getting hate. Tbh the character isn't really great. Worst part is she won't get legit feedback because of the way she set up the post as her \"first\" model, rather than just asking for a critique.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "GabrielMoro1",
                    "body": "Even if they were this gifted, saying it was their first model was most probably to get some reactions. People work hard to achieve great results, it’s kinda lame to post it like this",
                    "score": 20,
                    "replies": [
                        {
                            "author": "LocalSharkAngry",
                            "body": "People should be proud of the work they do. So what if they're just posting for reactions. Positive attention is not a bad thing. We literally need that as social animals. \n\nIt is the most normal thing in the world to be proud of something and want to show it off to people. What's lame is deciding to shit on someone else's good time because you feel jealous. Their win is not your loss my guy.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "GabrielMoro1",
                                    "body": "Lol their win isn’t based on truth. And their intentions by posting an incredible model saying it was their “first” is just lame. They would’ve gotten praise anyway without this.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GenericMichaelName",
                    "body": "from what i understand they spent that time taking a course to make this one model, not that they were making lots of models for months.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "chornobaivska",
                    "body": "Yes, I worked on this character from the very beginning of the course for six months. Every week, I submitted my homework for review by my mentor and created this character completely from scratch. And I am proud of my work, I know it’s already good, but I want to improve further.\n\nI don’t understand why there’s such a reaction specifically to how I titled my post. I scrolled through this Blender page (I'm new here), looked at how people share their work and write their captions, and I did the same. Yes, the title grabs attention, but why not? Is that not allowed somewhere? And yes it's my first model in Blender and why can't it be?  What’s so bad about it?\n\nI just wanted to share my work and get an answer to my question. That’s all.",
                    "score": -32,
                    "replies": [
                        {
                            "author": "Zenophilic",
                            "body": "I think what’s bad about it is it’s deceptive. Sure, you worked on the same model for 6 months, but as you said you iteratively refined it based on feedback from your teacher for the course. \n\nSo really the very first model you submitted for feedback I would consider your “first” model. You technically made multiple models/iterations over a long span of time. Your post was just the finished product. \n\nI think this is why it’s best to refrain from titles like “my first” as it can be misleading as to what that actually means.",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "Spaaacce",
                            "body": "Yes, it's not allowed. It's specifically not allowed in the [community rules](https://www.reddit.com/r/blender/wiki/rules_and_guidelines/community_rules/).\n\nhttps://preview.redd.it/6l2uj40q2ipe1.jpeg?width=1080&format=pjpg&auto=webp&s=c8ef0b779717a540e9ebdc4be4b8df1db2ff99b2",
                            "score": 33,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "analogicparadox",
            "body": "It's a mix of things, one of which being that some people lie or use intentionally misleading titles (posting their first *blender* project when they have 7 years of experience, posting their first project that is literally all pre-made assets and animation, and so on)\n\nAnother big thing is that people here are often hobbyists, and they don't factor the idea that someone might begin with a paid course. And honestly, some of them talk big shit and give terrible advice because they learned exclusively through mediocre youtube tutorials and have no professional experience, but they still act like experts.",
            "score": 9,
            "replies": []
        },
        {
            "author": "iDestroyedYoMama",
            "body": "There is a major meme that’s been in this community for a long time about incredible artwork that is someone’s “first try”. People mock it because they know how hard it is to get good at and get angry when some does well right out of the gate. A lot of those posts you can tell the person is lying, this isn’t their first project, and they have been doing it for a lot longer than a couple weeks. So if something is genuine and is really good people easily dismiss it because of past poster lying. Don’t take it personally.",
            "score": 16,
            "replies": []
        },
        {
            "author": "MaybeAdrian",
            "body": "I think that it usually happens because there has been a lot of people saying that it's their first render or whatever and then you see the post and it's something that looks like made by a professional studio.\n\nAnd then in the comments they say that it's their first X in blender but that they have professional experience in other software for decades.\n\nOf course that's not your fault, it's just the reason of why some people could react like that.\n\nWhat I do is just ignore those post and those of \"I'm X years old\"",
            "score": 25,
            "replies": []
        },
        {
            "author": "TINY-jstr",
            "body": "It definitely comes across as rude and disrespectful, but believe it or not, it does come from a good place. It has been a staple in this subreddit that people are being called out for lying about their \"first model\" in order to not discourage beginner users.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Efficient_Builder_55",
            "body": "Lot's of beginners don't get much attention at all here (not even comments, support, constructive criticism) yet some users with not that special artworks get thousands of upvotes, comments etc. So it makes me think definitely something fishy is going on. At least that's my opinion.",
            "score": 18,
            "replies": []
        },
        {
            "author": "GrainofDustInSunBeam",
            "body": "Don't say its your first model, its either good or not, And you are either here to find out why or to promote yourself. If the second then saying its your first comes off like braging and fishing for complements.  \n  \nLots of actual beginners dont get the attention they need to level up because someone else tries to feel special. and its just tiresome.  \nAnother guy tried to get actual feedback and all this sub did was give him praise that his works looks great. It didn't. in his own words. all he wanted was reasons why.",
            "score": 30,
            "replies": [
                {
                    "author": "LocalSharkAngry",
                    "body": "If it's their first model there's nothing wrong with saying so. And if its a good first model then its a good first model. Wanting to feel seen for work you're proud of is not a bad thing. That's normal.\n\nAlso none of that is OPs fault tho? The reason that guy didn't get attention is because people in this community decided not to engage with his post. Don't blame a new poster for the behavior of the entire sub.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "GrainofDustInSunBeam",
                            "body": "he got positive attention not critique he wanted, and a feedback. because the sub went into support mode. \n\n\nI'm not blaming new poster for sub actions lol\n\n\n\nI also explained why it is a bad thing to say it's my first model post. it is also in this sub rules for a reason. because there are people trying to pass off as newbies while having education experience etc there was literally thousands of post with the \"my first\" tittle. it almost never was their \"first\". it's click baity title and users of this community were so tiered of it they made it a rule. Additionaly it was dishonest and disheartening for people trying to get into blender. \n\n\nthis discussion was done thousands of times.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RICH_homie_Doug",
            "body": "You need to say how long you worked on it, to others they assume you just picked up the program a couple weeks ago, so to them theyve been struggling learning and getting better. I understand it would be demoralizing thinking you did this within the first month of learning the program. Theres also a long staying joke in this subreddit about this ive seen posts “my three year old picked up blender a week ago this is his first post” and it a professional level model, obviously theyre doing it to be contradictory and gain more interactions on their post. Also its art and subjective so always take what people say not to heart",
            "score": 9,
            "replies": []
        },
        {
            "author": "Successful_Sink_1936",
            "body": "I was one of the people who commented and I'd like to apologize for my sarcastic remarks, I honestly thought you were lying or trolling because many people in the past have posted on here saying the same thing I did not expect this would be any different and I am very sorry for that. Good luck with your 3d artist career!",
            "score": 35,
            "replies": [
                {
                    "author": "chornobaivska",
                    "body": "Thank you :)\n\nIt was just funny and a bit sad at the same time. My boyfriend was like \"Post your work here! People are sharing theirs, so you should too\" and I was like \"okay...\"\n\nThen in the morning, I saw that my post got banned and there was so much hate. I was like \"Yeah, I’m not posting on Reddit again\" :))",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Dont-be-baby-",
                            "body": "“Yeah, I’m not posting on Reddit again” -quote from someone who posted on Reddit again.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Riddles_",
                                    "body": "what’s the point in continuing to be rude here?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Successful_Sink_1936",
                            "body": "Sorry for contributing to the bad experience",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Oculicious42",
            "body": "baah now i want to see the model",
            "score": 13,
            "replies": [
                {
                    "author": "Successful_Sink_1936",
                    "body": "[My first 3D model and render! The facial skin lost details due to focus. Any tips on how to fix this? : r/blender](https://www.reddit.com/r/blender/comments/1jdclbv/my_first_3d_model_and_render_the_facial_skin_lost/) this is the link but you can only see the comments",
                    "score": 4,
                    "replies": [
                        {
                            "author": "sleepyburrger",
                            "body": "She posted her render again, a couple minutes ago",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PirateJohn75",
            "body": "I hear ya.  I see that a lot on here, too.  Some people just get really bold when they're only interacting with a screen and forget that they're talking to actual people.",
            "score": 32,
            "replies": [
                {
                    "author": "Diremirebee",
                    "body": "Honestly. Like, why the hostility? What’s the point? Sure it could be a bot - or it could be someone who genuinely did put a lot of time and effort into working on this one thing. Which *does* happen. Hanging onto arbitrary specifications of what is someone’s “first” model just to further spread misery is kind of loser behaviour. \n\nSame with posts with ages - is it a karma farmer, or is it an actual 14 year old who’s proud of their work and wants a bit of validation from the community? You have no way of actually knowing. And yeah, some kid isn’t gonna know the sensitivities of a specific subreddits chronically online population. I barely got any support for my art from my parents as a teen, and I know that if I reached out online to share my work and was met with a bunch of assholes throwing unfunny, sassy comments then I would have been absolutely shattered. Are you *really* going to be the person that makes a kid feel bad just cause you think they MIGHT not be real? Seriously?\n\nPeople really need to figure out what’s actually worth being angry about",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Hot-Initiative-7349",
                    "body": "preach, pirate john",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Kind_Resource_296",
                    "body": "True",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FredFredrickson",
            "body": "If it wasn't your first model, but your first *completed* model, why didn't you say that?\n\nPeople don't like it when you bullshit them, and yards the reasons you got for a topic title that was clearly not true.",
            "score": 13,
            "replies": []
        },
        {
            "author": "rwp80",
            "body": "my guess is people were rude to you because you type with a self-aggrandizing, entitled tone.\n\n>when I decided to share it with *you*, I was met with a wave of angry comments\n\nwith me? i have never heard of you or the post you're talking about, so no you didn't share it with *me*.  \nsee how you're putting everyone in the same bucket? see how you're trying to play some kind of blame game?\n\n>I'm flattered that some think this isn't my first model. Thank you for your harsh comments ✌️\n\n...and you give yourself a not-so-subtle backhanded compliment.\n\ni can 100% understand choosing to post artwork here, that's perfectly normal for this subreddit.\n\nbut what was the point of this follow-up post? the way your post reads feels like it was all geared to land on the compliments you gave yourself at the end.",
            "score": 10,
            "replies": []
        },
        {
            "author": "GenericMichaelName",
            "body": "everyone starts their 3d artist journey somewhere. and not everyone who starts learning blender is a total art noob. but for some reason on this sub a lot of people think that you have to be if you're going to post your first model. \n\ndisclosing previous experience isn't a bad thing and can help avoid some of the nasty shit though. if you chose to stick around this sub you'll get the hang of the posting etiquette which will help keep some of the hate at bay. \n\nthere's a lot of assholes and jealous people here. but there are also lots of cool people who are excited to support your work and your 3d art journey. don't give up on us! we want to see you succeed!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Anvildude",
            "body": "I think it's a difference in what YOU consider your first model, and what people were *expecting* when you said 'first model'.\n\nIf you've been taking courses, then you've been making models.  You may not have been rendering them out, but you've been making them, tweaking them, looking at them and changing them and maybe starting over.\n\nWhen I hear 'first model', I think \"I just downloaded Blender/any 3D software for the first time, have no idea what I'm doing, and this is a screenshot of what I managed to figure out in my first session(s) before saving and closing the program after 1-5 days of playing around with it\".  In other words, 'donut from tutorial', or janky humanoid, or poorly topologized sci-fi gun.  MY 'first model', I consider, was a re-sculpt of a silver waraxe from Oblivion that I scrunched/cut the edge into a pick shape, because I didn't know how to texture things and wanted to keep the default look aside from the shape.  I might have done an extruded sword from a tutorial before that, but I don't think I ever actually saved that one, and I definitely didn't actually use it for anything.  I never even rendered anything out until I started taking animation classes.",
            "score": 10,
            "replies": []
        },
        {
            "author": "ilgbsomuch",
            "body": "At the end of the day you don't need reddit's approval, i get it sucks but why care honestly. Negativity will always be louder than positivity and it will always be the first thing people act on rather than positivity. If you are looking to work professionally as a 3D Artist, your work and expertise will be relevant despite what reddit says. Just keep it up and don't let some people demotivate you or ruin your day. 👍 From what i've seen on your profile your stuff looks really good",
            "score": 6,
            "replies": []
        },
        {
            "author": "Anvildude",
            "body": "I think it's a difference in what YOU consider your first model, and what people were *expecting* when you said 'first model'.\n\nIf you've been taking courses, then you've been making models.  You may not have been rendering them out, but you've been making them, tweaking them, looking at them and changing them and maybe starting over.\n\nWhen I hear 'first model', I think \"I just downloaded Blender/any 3D software for the first time, have no idea what I'm doing, and this is a screenshot of what I managed to figure out in my first session(s) before saving and closing the program after 1-5 days of playing around with it\".  In other words, 'donut from tutorial', or janky humanoid, or poorly topologized sci-fi gun.  MY 'first model', I consider, was a re-sculpt of a silver waraxe from Oblivion that I scrunched/cut the edge into a pick shape, because I didn't know how to texture things and wanted to keep the default look aside from the shape.  I might have done an extruded sword from a tutorial before that, but I don't think I ever actually saved that one, and I definitely didn't actually use it for anything.  I never even rendered anything out until I started taking animation classes.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Lanky-Document7997",
            "body": "nah i agree with the roast",
            "score": 6,
            "replies": []
        },
        {
            "author": "Agreeable_Tip_7995",
            "body": "Lots of honest answers here. But if you’re genuine, who cares keep posting",
            "score": 2,
            "replies": []
        },
        {
            "author": "dakotanorth8",
            "body": "Saw the model. If you’re this good then damn. But I can see how people wouldn’t believe it. You’re absolutely an outlier savant in terms of a “novice” experience",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fast_Leadership7069",
            "body": "It's a complex issue here. On one hand you have people pretending to be beginners karma farming. On the other hand you have a lot of insecure people who will accuse you of not being a beginner because they weren't as good as you when they began. \n\nDon't let this sub get to you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Yori_TheOne",
            "body": "I have found this subreddit to be very nasty at times. I posted my first proper model in here too and was told it was crap, made wrong, etc. When I told them that my model wasn't the typical model seen a 100 times a few apologized, others doubled down and kept making offending comments.\n\nI made a shotgun BTW. An Ithaca 37. It does not have a side shell ejection port like most shotguns do and that was all the comments could comment about. \n\nI honestly wish there was a subreddit where newbies could submit without name calling and slurs. Where you can ask questions without feeling like you have an IQ of 5. \n\nUnfortunately, humans suck. \n\nI try not to let the nasty comments get to me. I try to listen to actual polite responses and good feedback and kill the a-holes with kindness whenever possible. However, it is draining and I honestly don't think I will post any model here again. Which sucks as from April to the end of June I get the opportunity to work full time on modelling where I plan to create a log or wood cabin fully decorated + do some minor animation and recording. I honestly would like to share that, but I doubt I will be doing it here.\n\nEDIT: \nThe nasty comments were from another 3D sub (3D modelling), but that only makes it worse that people are like that on multiple subs. My post didn't have any traction on this sub, so I was spared the mean comments.",
            "score": 7,
            "replies": [
                {
                    "author": "Shadymoogle",
                    "body": "You received those comments in the 3D modelling subreddit not this one.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Yori_TheOne",
                            "body": "Whoops my mistake! It seems I got absolutely no replies from the sub. \n\nThanks for catching that.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "meesh-makes",
                    "body": "I have a sub reddit where noobies can ask anything without toxicity. \n\nbut Im no admin so idk how to work my own page :( \n\nbut you are invited  :D\n\n\\- once I posted a NSFW image of a model i spent some time on, ( i thought i was good )    \n\\- I t was the last human model I ever sculpted  :)   \n\\- Because of the 97k views and 400+ nasty comments\n\nif you find that reddit.... lmk",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "EarlGreyOfPorcelain",
            "body": "Other comments have answered you, and maybe the reaction was a bit harsh.\n\nBut you're telling me you did an entire course on creating characters and this is your first render? No other renders, scenes, engine tests were created during your entire time on this course?",
            "score": 3,
            "replies": []
        },
        {
            "author": "DifficultyAble5864",
            "body": "Persistence pays off In the end. Keep up the great work.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kinetic-graphics",
            "body": "I remember seeing the image and thought, pff no way that's your first model. But after reading your description, and your dedication to diving right into character design, it makes sense.\n\nThere are a lot of people that post high quality work and claim it's their first model as a form of karma farming, and this subreddit has grown annoyed at those kinds of posts. That is most likely where the hostility comes from.\n\nAlso nice job. I can't model characters to save my life.",
            "score": 3,
            "replies": []
        },
        {
            "author": "YoSupWeirdos",
            "body": "you happened to be the statistical anomaly out of the sea of people lying about their background to make themselves feel better. it's unlucky.\n\nwe have people here everyday posting movies level scenes as their \"first blender project\" but keep quiet about their 20 year experience in zbrush.\n\nas an artist yourself, you already have an idea about aesthetics and use even the new tools you learn to achieve this. The expectation is that learning the technicalities is the easy part and learning to make it look good is the hard part, so to come in and make good looking stuff makes one look like an expert trying to act as a newbie. \n\nIt's just how it is, not everyone has to start with 0 at skill.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Aggravating_Web8099",
            "body": "It was not your first model, the issue is that you are unintentionally making it look like a brag. This was the first tutorial you fully worked through. Quite a difference. This is also not r/complaint, what purpose does this post serve?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lucitown",
            "body": "That's why I think twice before posting anything in subs where the language is English",
            "score": 4,
            "replies": []
        },
        {
            "author": "TinnkyWinky",
            "body": "Look within yourself before you begin pointing fingers at others, sometimes there is a reason why people reacted that way to you.\n\n\nYou really didn't make anything else prior to that? Just started day 1 with the human? Based on the lack of context on that post, I hope you can see how people can think you're lying to get praise, that's why they were rude. It's like if someone posted a beautiful full leg piece and said that was the first tattoo they ever did.\n\n\nIf you made a great design, prepare to explain your process prior to posting it as your first piece. Otherwise, it will just come off as attention-seeking. I hope you can take this as a learning experience instead of just being angry at others for not being nice to you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dukogpom",
            "body": "Heya, sorry that your experience with the sub has been bad so far. I agree that sometimes people may not understand it right, and that a work that you can consider truly finished may take a lot of time. Hell, my \"first finished work\" took me months because I just kept deleting everything else on early stages. You're doing pretty well and the model is nice, keep going!",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Joker_Ledger",
            "body": "Sorry you have to go through that. It just reddit being reddit so it best to just promptly ignore those unconstructive comments. That the first thing you learn after sometime spend on reddit, idiots exist and it best to ignore them. If you want more constructive environment post your work on blender's own artist forum, polycount, or more 3D focus places like blender discord.",
            "score": 2,
            "replies": []
        },
        {
            "author": "J_m_L",
            "body": "A lot of people post here saying \"First render\" when they've been working in other 3D software for years. They're really meaning \"My first render with Blender\". \n\nIt's a bit of confusion going on there. People can be salty on reddit and you have to take it with a grain of salt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Anxious-Bug-5834",
            "body": "It was not your first model and you claimed it to be your first model and it was a good model so people called bullshit. Next time just post and ask for advice.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mj7532",
            "body": "Here's the thing.\n\n\"Yes, I worked on this character from the very beginning of the course for six months. Every week, I submitted my homework for review by my mentor and created this character completely from scratch. And I am proud of my work, I know it’s already good, but I want to improve further.\"\n\nYes, it's your first character, no if's, and's or but's. However, it's not your first 3D model. There is such a huge difference between the two, not just semantically. And that is, I would assume, what people get riled up about. It isn't your first model, it's your first character.\n\nIterations is a part of it. If you start with a cube and then iterate on that cube through feedback and then that cube turns out to be a person in the end, your first model was a cube. But that cube together with the final result is your first character. Huge difference.\n\nAnd don't get me started on the \"I'm 14 and....\" posts. But those are an ENTIRELY different beast.",
            "score": 2,
            "replies": []
        },
        {
            "author": "spacemanspliff-42",
            "body": "Reddit is a cesspool much like the rest of social media. All the nice, helpful (And actually knowledgeable, like redditors will trash things they know nothing about) Blender users are in Discord servers.",
            "score": 0,
            "replies": [
                {
                    "author": "PirateJohn75",
                    "body": "Do you happen to have an invite link to a good Blender Discord server?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "spacemanspliff-42",
                            "body": "A surprising number of bigger YouTubers have their own servers, they each have their own focus, I've found links sometimes on their pages. For instance, if you want help with Geo Nodes, Erindale's server is very helpful.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Malaphasis",
            "body": "move on",
            "score": 3,
            "replies": []
        },
        {
            "author": "based_birdo",
            "body": "No offense. But if you cant handle comments from internet strangers, dont post art to the internet.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DrKarda",
            "body": "The internet sucks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GunnarVenn",
            "body": "Jealousy makes you nasty. Haters gonna hate.",
            "score": 2,
            "replies": [
                {
                    "author": "3dforlife",
                    "body": "It's not jealousy. It's about being honest.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "mighty_bandersnatch",
            "body": "Oh that is interesting.  I initially was surprised by your title because people are very gentle and constructive on this sub.  But yes the one thing that sets people off is someone posting a first model that looks really polished, because they assume it's not really the first try.\n\n\nI would say: you know you were telling the truth, so the fact that they couldn't believe it was your first model is a huge compliment.\n\n\nGood luck, and I hope you make the career jump!",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheHam-man",
            "body": "God, people are so full of themselves. I don’t know why the “ this is my first…” is so crap to them because even if it’s a high-quality model, why can’t we just agree that it’s a good model for their first time? \n\nAlso, I don’t understand why there’s a rule against it, so what this is your first model and you’re already very good at it, just be happy for the person and pick up your own skills if you can’t match theirs, I don’t sit around in my own room feeling bad for myself because I saw how good someone else’s",
            "score": 1,
            "replies": []
        },
        {
            "author": "luddens_desir",
            "body": "Some people had to try and fail a lot before getting anywhere near any degree of success. Your character looks like something that someone that is already technically skilled at 3D modeling made, meaning you used normal maps on some of the cloth it looks like, and the hair looks decently realistic. \n\nDetails like that stand out and it becomes hard to believe that this is a first model.\n\nThe real test to see if you're full of shit is if we got to see the tris. :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "MouseK",
            "body": "Cqdar",
            "score": 1,
            "replies": []
        },
        {
            "author": "Massiveyields",
            "body": "People are pretentious as fuck in art. Usually the one with no success in their field are the biggest dbags. Never met a successful person that was rude.",
            "score": 1,
            "replies": []
        },
        {
            "author": "khaledhaddad197",
            "body": "Ppl r jealous, keep the hard work",
            "score": 2,
            "replies": []
        },
        {
            "author": "EP3D",
            "body": "A lot of people are just plain insecure. It’s difficult to not compare yourself to others as that’s just what we are taught to do when art is whittled down to paying bills. Especially on Reddit, o have found people to be genuinely discouraging towards others who want to develop 3D into their profession. \n\nThey are the type of people that when faced with difficulties they default to standing on others. I wouldn’t worry too much about their opinions anyway. Keep going!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ke2uke",
            "body": "What you are not taking into consideration is how many people you are turning away from 3D. This is my first model, but you are not mentioning how much learning and time you put into it. Everyone else including myself are making something that just resembles a blob, why do we bother to try if others are creating such things like you on their first attempt?",
            "score": 0,
            "replies": [
                {
                    "author": "LocalSharkAngry",
                    "body": "We bother to try because it's something we want to get good at? The only person you should be comparing yourself to is your past self. If you are feeling jealous or demotivated because someone else is better than you that's on you not the poster. \n\nAs someone who's trying to get into blender it is much more discouraging to know that people in this community are so shitty to other people just because they THINK someone is lying. Some people just got it like that man idk. \n\nAll of the people commenting are trying to make OP take responsibility for their own emotional reactions, but that's not how real life works. You're not justified in being shitty to another human being just because you don't like how they titled a post. \n\nIf you feel salty because it took you months to do what someone else did in a week that's something you need to work on outside of the reddit comment section.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "ParaisoGamer",
            "body": "Honestly, here on this subreddit, I've seen a lot of people helping out, and being very kind. Usually everyone wants to help. But recently, Recently, I've been seeing entire comment sections being rude and sarcastic towards other people, especially beginners or those with different artistic styles, specially against NSFW artists, so if you're going to go in that direction, be careful when posting here.\n\nSo, I recommend that you use this subreddit to post your progress or work that you're very proud of, and not for feedback, since there aren't just hostility issues. Most of the time, i don't think it's the best way to improve and develop your skills.  \nFor development, there are several types of professionals and YouTube channels on the internet that post the best information and tutorials for free for you to consume. I know dozens of very good 3D channels, which took a while to appear, but they are great and have the best content. If you keep learning, with time you won't need randoms on a forum to tell you the flaws in your work, you will be able to identify them yourself. They can help of course, but they won't be your main concern.\n\nI recommend \"**Beyond Blender**\". He explains step-by-step in a professional and calm way, great to listen to with music and the projects are complete and very professional results. More simple than that is him to coming to your house and model it for you, very well explained.\n\nhttps://preview.redd.it/xpushd2zqhpe1.png?width=1716&format=png&auto=webp&s=90a542c1f42918fa5172b82ff737ec77610cee2a",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dragon_OS",
            "body": "Redditors can be flat out dicks sometimes, even if you do nothing wrong. Hope your endeavors go well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infantry_Crab",
            "body": "I took a look at your previous post and some of the comments really are unacceptable. \n\nHowever I think some of the comments may have been people who looked at your post and thought it was so good that it had to be a joke and were trying to match that energy. \n\nI think if you scroll through the subreddit that you'll see a few posts like that. to the effect of I'm 2 years old and I can't move my arms yet but I made this incredibly advanced model what do you think. \n\nSide note what course did you take I might want to check it out",
            "score": 1,
            "replies": []
        },
        {
            "author": "Broad_Cardiologist60",
            "body": "Reddit is wrong group for that kind of stuff. There is millions of stupid people commenting on everything they see, so, just dont go here, find some forums about.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LucyEleanor",
            "body": "🎵WELCOME to the internet...🎵",
            "score": 1,
            "replies": []
        },
        {
            "author": "coolbluekick",
            "body": "Eh this place has some good people but the majority of them are elitist assholes people who eat lead paint chips who think any anime model is porn",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "replies": [
                {
                    "author": "Alexandrx_",
                    "body": "Doesn’t mean it’s okay",
                    "score": 5,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Alexandrx_",
                                    "body": "With what?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Alexandrx_",
                                                    "body": "Well it’s a fact, this platform is Reddit. I disagree with what OP has had to experience in the fact the people are usually too quick to comment negative remarks before reading the entire post for enough context to comment. Hence my comment, doesn’t make it okay - not much one can do tho",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "Alexandrx_",
                                                                    "body": "You asked me if I agree and I responded, not sure what’s so hard to comprehend fella",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "CrumplePants",
                                                                    "body": "Are u ok?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cozzypup",
            "body": "Nearly everyone that posts to reddit sadly will learn that there are a lot of pieces of shit who hate to see someone succeeding or happy, or will attack you simply for wanting help or sharing your work because they see it as an opportunity to bully someone less skilled than them (or take their insecurity about their own skill level and failures out onto you). Anyone who evades these kinds of commenters is very lucky. I'm sorry this happened to you and I'm sure your work was awesome.\n\nedit: after seeing the post on your account, wow. I didn't know this sub was full of so many pathetic assholes. Kinda shocking, but I only joined a couple months ago. You just never know what you're getting into. Even if you weren't specific about your skill level, there's literally no reason for that response from people lol, just immediately attacking you with no questions asked.",
            "score": -1,
            "replies": [
                {
                    "author": "Known-Exam-9820",
                    "body": "Or people just don’t like lies, even little white lies. Especially little white lies that are specifically in the rules of the sub",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "palindromedev",
            "body": "Wear it like a badge of honour OP, it was so good it made people jealous 😄 \n\nWhat made you leave tattooing?\nInteresting career transition.",
            "score": -1,
            "replies": []
        },
        {
            "author": "TonninStiflat",
            "body": "There's plenty of amateurs and beginners here, who I suspect feel threatened by someone who isn't strugling with how to flip normals.\n\nIt is what it is, Blender has low barrier for entry, which is why you also get toxic people in these communities.",
            "score": -4,
            "replies": [
                {
                    "author": "notgotapropername",
                    "body": "I think these posts with vague titles can be intimidating or hurtful to beginners in the sense that they see the work of someone who is apparently at a similar level of experience to them, but is somehow outperforming them 10x. That can be really disheartening. On the other hand, if they know that this person has X years experience in graphic design, and is a professional in the film industry (for example), they might understand why they're not producing work as advanced as this person.\n\nI think it's good to be transparent about the resources you've used, and the experience you've got, not just to avoid driving new people away from this community, but also to provide resources for those people.\n\nThat being said, it's no excuse for toxicity either. That can certainly drive people away, too...",
                    "score": 6,
                    "replies": [
                        {
                            "author": "TonninStiflat",
                            "body": "So what? Are we here to gatekeep someone because \"they are good\" and it might hurt someone elses feelings? I mean come on, it's a free software and that comes with all sorts of users. A beginner Blender user could be a 12-year-old, or could be someone transitioning from 2D illustrator work or from CAD world to 3D modeling. A beginner is a beginner is a beginner, some just are better than others for whatever reason.\n\nI don't see how some beginner being intimidated or feeling hurt over some other beginner being better at... being a beginner has any bearing to anything. Certainly not grounds for being toxic.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "notgotapropername",
                                    "body": "I'm not saying we should gatekeep, I'm saying maybe we should be more transparent.\n\nIt's fine to have experience, it's fine to be good at stuff, and it's fine to post your work, of course. All I'm saying is that being transparent about the resources we use and our prior experience can be helpful to foster a healthy community. Not because beginners won't be hurt, but because that transparency can provide resources for beginners, and that absolutely has a bearing on how blender grows in the future.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ProtectionNo514",
            "body": "because is easier than be nice",
            "score": 0,
            "replies": []
        },
        {
            "author": "Teton12355",
            "body": "New to Reddit perchance? I’ve gotten ripped a new one on this sub before",
            "score": 0,
            "replies": []
        },
        {
            "author": "monet3dx",
            "body": "Don't take reddit seriously. If someone has been learning and stuck in tutorial hell for over a year without working on their project and seeing another person actually applying stuff they learn from tutorials feels jealous skd maybe lash out.\n\nReddit by itself is a toxic place and the blender community is not free from that. People are people. Like PewDiePie, a retired YouTuber, getting into drawing and doing well got so much hate because others felt invalidated.\n\nThey ignored Felix's experience with photo editing and graphic design. Some of that translates over to drawing. He was not someone who was not artistically inclined. He's rich and could focus on improving art without major stressors, so results were fast compared to other beginners. \n\nHere you say you were a tatoo artist. Meaning you already had some artistic background, you just learned a new tool and medium to express it.\n\nI say, don't take reddit too seriously.",
            "score": 0,
            "replies": []
        },
        {
            "author": "mohammadhadi_rb",
            "body": "Welcome to social media",
            "score": -6,
            "replies": []
        },
        {
            "author": "Thewelshdane",
            "body": "They don't like it much on this sub I have noticed. They prefer it when you post a model that looks like it was made of wax and left in the desert for a week. They don't care if you gave yourself a bad neck going back and forth, tweaking and spending literal hours perfecting something if you're a beginner, just prefer that you spend a few hours here and there, take a look at it and go.... _Yip Bob, that'll do!_",
            "score": -1,
            "replies": []
        },
        {
            "author": "palindromedev",
            "body": "Wear it like a badge of honour OP, it was so good it made people jealous 😄 \n\nWhat made you leave tattooing?\nInteresting career transition.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Standard_lssue",
            "body": "Sadly thats just how reddit is. Its why this site is so awful (The downvotes prove it lmfao)",
            "score": -3,
            "replies": []
        },
        {
            "author": "meesh-makes",
            "body": "AHHHH shove it! \n\njk jk jk.. \n\nyes people are rude. and there is not point to it\n\nif people could just learn to learn.. while not getting so mad they dont know something. accepting they can change and grow. this would help!\n\npeople tend to project when they get frustrated. they project their insecurities by lashing onto others that may be doing something they cannot do. or something they found to be hard in the past, they might mock another or put someone down. \n\nonce you learn that your actions are 100% of what people see and know you by. you start to humble yourself.\n\nnot everyone can be this way. it takes hardship and discipline to become less volatile in life.\n\nI tell people. if we could all be a bit more like \"Spock\", pretending we live on \"Planet Vulcan\". this world would be much further along from it.\n\nor John Wayne!  \n\nWe could use some more John Wayne's on this rock.\n\n\\-Chivalrous-",
            "score": -4,
            "replies": []
        },
        {
            "author": "ImportantDoubt6434",
            "body": "Trolls gonna troll\n\n\nModel looks badass I’d be happy to promote it if you’re selling assets.",
            "score": -4,
            "replies": []
        },
        {
            "author": "nopalitzin",
            "body": "People insecurity. Since blender is free it has a lot of people that are afraid of people doing better than them, so they just gatekeep. Pretty common in most fandoms.",
            "score": -4,
            "replies": []
        }
    ]
}