{
    "title": "the WORST crypto ad created yet",
    "author": "BlockchainSocialist",
    "subreddit": "CryptoCurrency",
    "rank": 6,
    "score": 49,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.youtube.com/watch?v=hkJugmz1PwA",
    "id": "1jehgx1",
    "selftext": "",
    "comments": [
        {
            "author": "RandoDude124",
            "body": "Oh this ad is from Solana???\n\n#Yeah; that checks out",
            "score": 21,
            "replies": []
        },
        {
            "author": "Humans_r_evil",
            "body": "the last time a crypto came out with a super shitty ad, they turned out to be a rugpull.",
            "score": 10,
            "replies": []
        },
        {
            "author": "sportspadawan13",
            "body": "So many defending this nonsense ad, no wonder mainstream still sees it as cringey bro tech, cause it kind of is.\n\nUnreal how cringe this was, like something an 8th grader dreamed up. Even added hard rock at the end lol. Jfc.",
            "score": 9,
            "replies": []
        },
        {
            "author": "HSuke",
            "body": "This video is absolutely disgusting to me, and I'm a moderate.\n\nIt's a strawman argument. People aren't like that in real life. It's an insult to humanity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rogpar23",
            "body": "Sucking up to Donalds pipeline, yuk..",
            "score": 1,
            "replies": []
        },
        {
            "author": "DareBrennigan",
            "body": "I mean I’m really burned out on leftist gobbledygook too, but this is mega cringe. Bad look",
            "score": -9,
            "replies": [
                {
                    "author": "Tr000g",
                    "body": "Well you have to agree that this anti-woke trolling is also tiring.\n\nWhy can’t we just be a little bit more.. moderate. Just chill.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "unibaul",
                    "body": "Eh, that's just corporations catering to all customers. Inclusion is good for sales. Targeted exclusion, well that's obvious, its a bad look. That's why this rhetoric is cringe to say leftist agenda. There is no leftist agenda en masse. It's just catering for mass gains.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SaneLad",
            "body": "The only thing more cringe are the people stamping a Swastika on it.",
            "score": -25,
            "replies": [
                {
                    "author": "mikegoblin",
                    "body": "To me it watched like a hate video (nazi adjascent)",
                    "score": 17,
                    "replies": [
                        {
                            "author": "steasybreakeasy",
                            "body": "https://i.redd.it/w59crzw2ejpe1.gif",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "Change21",
                                    "body": "Are you aware of how nazism and/of fascism works?\n\nWhat it appeals to? How it sells itself as common sense? How it dehumanizes? How it uses hypocrisy and condescension and manipulation?\n\nNot everyone I don t like is hitler but there is a measurable swell of nazism/fascism in America right now.\n\nNazism seemed sensible and appealing to millions of Germans until it crashed down.\n\nIt used compelling slogans and clever media.\n\nIt effectively vilified moderate and liberal voices and leaders.\n\nIt ignored laws or overcame them sudden and shocking expansion of executive power.\n\nIf nazi/fascists had a marketing team and a pr team in 2025 it just might look and sound like that video.\n\nAre you getting it yet?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "thinkingaloud412",
                                            "body": "Unfortunately, there's no denying it, tho. Everyone the left opposes, they call a nazi at some point. There's just no way every single person that disagrees with the left is actually a nazi..",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SeriousGains",
            "body": "“If you don’t believe in 20 genders you are indeed a Nazi.” - this community",
            "score": -15,
            "replies": [
                {
                    "author": "sportspadawan13",
                    "body": "1. Man\n\n2. Woman\n\n3. Non-binary\n\n\nSeems like everyone was looking for 3, not 20. I'm sure your personal life was insanely affected by the word non-binary. Can't imagine the pain that inflicted upon you",
                    "score": 5,
                    "replies": [
                        {
                            "author": "kiyabc",
                            "body": "Sorry to pop your bubble but Only two genders",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "REDDlT_OWNER",
                            "body": "Can’t imagine the pain it inflicts on you knowing that every single “non binary” person is still either a man (male) or a woman (female)\n\nStupid ad, though",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "Change21",
                                    "body": "Nature is a plurality machine.\n\nIt creates novelty every second of the day for billions of years.\n\nMeek little human brains try and tame that near infinite plurality and make things binary and comprehensible. But that’s because of their cognitive limitations not nature’s limitations.\n\nNature doesn’t give a shit what we think. It will continue to produce novel combinations of traits.\n\nThere are many people with mixed genitals, like millions of them. Then there’s millions more with more typical genitals but different brain structures and associations and preferences.\n\nThere always has been. There always will be. \n\nWhether people find that scary or incomprehensible won’t stop nature from producing those combinations.\n\nNo two people have identical genitals, sexual preferences, associations or experiences.\n\nCan you handle that?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ShowUpInDreams25",
                                            "body": "Nah these are the ppl that only read headlines and text one sentence at a time. They cannot handle paragraphs anymore sadly.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sportspadawan13",
                                    "body": "The goal of non-binary is to encompass the people that don't feel like they belong to either consistently. I have a non-binary friend who just does it. Do I understand it? No, I don't get it, I can admit, I can't even understand being bi. But it isn't for me to tell someone how they feel. If they wanna be a man with painted nails and heels yet still bang ladies that are ok with it who GAF? \n\nI understand your point, I'm just saying that some people flow. There's a reason there's a lot of open trans in SE Asia and it's cause many of the languages are genderless so pronouns don't exist and they can just get away with whatever they want. Nobody asks cause that's a weird ass question",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Another_Bisilfishil",
            "body": "Leftys are really showing how anti fascist they are by putting swastikas on everything huh",
            "score": -14,
            "replies": [
                {
                    "author": "Change21",
                    "body": "When it comes to Nazism and fascism there is no moderate position.\n\nYou are either assertively anti-Nazi or……\n\nGet it?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "skarrrrrrr",
            "body": "I don't care what leftists think about any crypto",
            "score": -23,
            "replies": [
                {
                    "author": "JollyPicklePants1969",
                    "body": "The therapist in that video is the nonexistent leftist bogeyman that republicans like to imagine is a threat to everything and everyone.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "skarrrrrrr",
                            "body": "non existant ? lol ... please dude",
                            "score": -15,
                            "replies": []
                        },
                        {
                            "author": "trufin2038",
                            "body": "They are a threat though. Taxes, war, inflation. Leftists are a virulent pest, and we hope bitcoin will undermine the central banks that subsidize their evil.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "Change21",
                                    "body": "This comment was the sound of propaganda reverberating in an echo chamber.\n\nIt’s also the sound of someone who confidently doesn’t know what they’re talking about.\n\nThe essence of ignorance is certainty. The essence of wisdom is doubt.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sulfurmustard",
                    "body": "You're gonna be real surprised when you find out crypto is an anarchist ideal",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}