{
    "title": "Ethan’s IG story",
    "author": "PossibilityJolly3909",
    "subreddit": "h3h3productions",
    "rank": 17,
    "score": 147,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 7,
    "url": "https://i.redd.it/acwnahvb9jpe1.jpeg",
    "id": "1jej9tv",
    "selftext": "",
    "comments": [
        {
            "author": "JohnDeft",
            "body": "its ok guys, hasan said he is not a drama slop streamer.",
            "score": 48,
            "replies": []
        },
        {
            "author": "milk-doritos",
            "body": "clock his tea ethan",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotSoAwfulName",
            "body": "Said this one another post but worth saying again, this is precisely what Hasan does, he will platform and promote these accounts that spread unhinged shit, and then when shit hits the fan he will act like it has nothing to do with him. Also, this is one of the classic stages of Hasans little system, he's doing the label the other person obsessed when they respond to him, this is the N stage of the system. It's sort of hilarious in a sickening sort of way that Hasan employees the same tactics against people that he has done against people like Destiny, LonerBox and whoever he doesn't like to such an extent that people have created a system to track precisely what he is doing at a given time.\n\nhttps://www.reddit.com/r/h3h3productions/s/Uy0qARaekU",
            "score": 1,
            "replies": []
        },
        {
            "author": "piratevirus1",
            "body": "In the other post someone said that even though Fidel Killed all those gay and disabled people, he did make Cuba prosperous... Tankies are beyond saving.",
            "score": 21,
            "replies": []
        },
        {
            "author": "carefree_manatee",
            "body": "Why we gotta run defense for the execution of a child  tho 🤨 \n\nAlso leave AB alone you absolute freaks!!! Edit: I thought this was also the one with Matt Lieb thirsting for AB’s attention but my point will always stand.",
            "score": 1,
            "replies": []
        },
        {
            "author": "splurg1",
            "body": "come on brother can't gaslight us now. the fuck?  the instagram posts started because of Frogan's freakposting not Hasan.",
            "score": 1,
            "replies": []
        }
    ]
}