{
    "title": "Pentagon ‘DEI’ purge leads to removal of web page on Iwo Jima flag-raiser",
    "author": "RoachedCoach",
    "subreddit": "politics",
    "rank": 14,
    "score": 1504,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 70,
    "url": "https://www.washingtonpost.com/investigations/2025/03/17/pentagon-dei-native-american-iwo-jima/",
    "id": "1je4wv6",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChrisleyBenoit",
            "body": "Gather 'round me people\nThere's a story I would tell\n'Bout a brave young Indian\nYou should remember well\n\n\nFrom the land of the Pima Indian\nA proud and noble band\nWho farmed the Phoenix Valley\nIn Arizona land\n\n\nDown the ditches a thousand years\nThe waters grew Ira's peoples' crops\n'Til the white man stole their water rights\nAnd the sparkling water stopped\n\n\nNow, Ira's folks were hungry\nAnd their land grew crops of weeds\nWhen war came, Ira volunteered\nAnd forgot the white man's greed",
            "score": 1,
            "replies": [
                {
                    "author": "TooMuchPretzels",
                    "body": "If they cancel Johnny Cash for being too DEI I swear to god",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ChrisleyBenoit",
                            "body": "Even worse. They claim him as one of their own. He was as far from a modern day Republican as you can be.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Sabretooth1100",
                                    "body": "I smile every time I listen to God’s Gonna Cut You Down",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "captcha_trampstamp",
                                    "body": "He was apparently very much against racism and had a lot of sympathy for the black community. Made me a little bit more of a fan when I found that out.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Competitive-Cow-4522",
                                            "body": "Cash was pretty damn progressive. He was also good friends with President & Mrs. Carter.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "1RehnquistyBoi",
                            "body": "If Johnny Cash was alive, he’d be out for blood for this fucking stunt.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Sabretooth1100",
                                    "body": "May we all carry off a little darkness on our backs.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Spinal_93",
                                            "body": "‘Til things are brighter I’ll be a man in black",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tony-toon15",
                    "body": "One of my favorite songs. Crazy to see this shit happening. That man gave everything and died in torment. Fuck this administration man.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NeedsToShutUp",
                    "body": "Ira Hayes returned a hero  \nCelebrated through the land  \nHe was wined and speeched and honored  \nEverybody shook his hand  \nBut he was just a Pima Indian  \nNo water, no home, no chance  \nAt home nobody cared what Ira'd done  \nAnd when did the Indians dance",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fairoaks2",
            "body": "This is absolute madness. Either the person responsible for this is a bigoted dick or AI will destroy us.",
            "score": 1,
            "replies": [
                {
                    "author": "taz_78",
                    "body": "¿Por que no los dos?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Rich_Charity_3160",
                    "body": "Hegseth is the responsible party. He gave the DoD and military branches 3 business days to bring millions of content assets into compliance with an overly broad executive order and provided virtually no resources. There was only one civilian contractor assigned to the Marines, who employed a global keyword search that tagged all flagged objects and pages for archive.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Competitive-Cow-4522",
                            "body": "That’s craziness! And the Marines have a LOT of people that would get tagged this way 🤬",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "kittenconfidential",
                            "body": "was this done before or after his 9am jack and coke breakfast",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deep_Seas_QA",
                    "body": "Both",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Generation_ABXY",
                    "body": "I mean, it seems *directed* by bigoted dicks, but I see so much of this being an automated sweep--if it contains certain \"banned\" words, dump it.\n\nBefore you know it, you've successfully erased everything from DEI war heroes to those damned homosexual airplanes. The best part is, there's no need to worry about actually fixing it unless someone notices!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RoachedCoach",
            "body": "A page on the Defense Department’s website celebrated Pfc. Ira Hayes, a Pima Indian who was one of the six Marines photographed hoisting a U.S. flag at Iwo Jima in 1945.",
            "score": 1,
            "replies": [
                {
                    "author": "Cute-Ad2879",
                    "body": "Watch them pull a \"this was a staged recreation of the actual flag raising for a photo op and the native american marine was the worlds first dei spin\" ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Geek_Ken",
                            "body": "Tangent. [Flags of our Fathers](https://www.imdb.com/title/tt0418689/) is a pretty good movie about it, including how some struggled with the national attention and propaganda efforts stateside.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Cute-Ad2879",
                                    "body": "Yeah I've seen it. Good movie. Letters from Iwo Jima the sister movie to that one is also good.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Geek_Ken",
                                            "body": "Yup yup. Letters is great and love the perspective of Iwo Jima from the Japanese perspective.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sicinprincipio",
                                    "body": "Ironically, the film also touches on how some of the Marines was misidentified, only for Doc Bradley and Rene Gagnon, to also be recognized as having been misidentified.\n\nIn a bigger twist of irony, Ira Hayes, was the only originally identified surviving flag raiser is having his info scrubbed because of attacks on DEI.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SquiffyRae",
                    "body": "Hayes famously died an alcohol-related death after years of struggling with the fame that came with that photo. He should be a classic example of how veterans are often glorified while no one gives them the actual support they need to survive post-war\n\nRemoving this webpage is spitting on Ira Hayes' memory as much as the lack of support he received in life was spitting on him at the time",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MDUBK",
                    "body": "Ira Hayes was obviously deployed in the Pacific and fought on Iwo Jima only because of radical leftists in the 1940’s who wanted unqualified minorities to get credit that that should’ve gone to white guys \n\n- your government, ladies & gentlemen",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Altruistic-Sir-3661",
                    "body": "Some people might remember Trump a draft dodger, saying that avoiding STDs was “personal Vietnam”. It is rarely remembered the Vietnam was a famously lost war for the US.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MiddleAgedSponger",
            "body": "WTF is a DEI purge? It's just straight up racist purge of anything non white. America sucks so bad.",
            "score": 1,
            "replies": [
                {
                    "author": "sane_sober61",
                    "body": "Think about it - it's racism on its very face. Diversity, Equality and Inclusion are three unassailable concepts - but MAGAS have been saying all along, that they do not want these things, which is saying the same thing as, \"we want white supremacy\".  Yet the press plays into their trope and calls the anti-DEI anything except what it is - flat out racism.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SkolVision",
                            "body": "I had a coworker recently disclose to me he sent his kids to a private Catholic school to, quote, \"avoid all this DEI crap\" and I did about a quadruple take at the incredible disclosure there of 1. The guy is a virulent racist 2. What that says about this private Catholic school that its \"anti diversity\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "lakeghost",
                                    "body": "I’ve got Catholic family and been to many a mass: DEI is Catholicism. All are welcome. They’re very diverse churches. All are equitable under God. Etc, etc. I have no idea how you could make a anti-DEI Catholic school. That sounds like they have their own Antipope.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "StopVapeRockNroll",
                            "body": "> \"we want white supremacy\"\n\nWhat white supremacy is in this country: \n\nLies, a lot of it.\n\nGive up democracy for made up reasons.\n\nPrivatize everything and have your tax dollars to do it.\n\nDeregulate everything. Things that makes our food safe to ear, air safe to breathe, preventing accidents/deaths on the job, etc., etc.\n\nWords, commitments, treaties, allies, means absolutely nothing anymore.\n\nMore lies...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lostinthestarscape",
                    "body": "Lol yeah like what are we to believe here, Ira Hayes took a military position from a white person who really wanted to fight in the Pacific but couldn't because of temporal shifted Affirmative Action? \n\n\nThe one small upside to all of this is the people in my life who kept telling me they weren't racist and MAGA being a bigoted ideology was a Mainstream Media Spin and I have TDS can now be comfortable told to go suck an egg. Except thanks to the other moronic things their dear leader has done, they can't even do that now.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "roastbeeftacohat",
                    "body": "they started off complaining about hiring practices, but now they have the power and are attempting ban non white non males from any position of importance; even going back into history.\n\n\nthis has always been about white supremacy, it was never about merit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ki3fdab33f",
            "body": "Call him drunken Ira Hayes\n\nHe won't answer anymore\n\nNot the whiskey drinkin' Indian\n\nOr the marine that went to war",
            "score": 1,
            "replies": [
                {
                    "author": "neutrino71",
                    "body": "Always upvote for the Man in Black ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kevendo",
            "body": "They are purging language. They are purging history.\n\nNo hyperbole: America is now ruled by an authoritarian regime.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weekly_Protection_57",
            "body": "Trying to erase people of color from history so they can pretend later on that we've never contributed anything.",
            "score": 1,
            "replies": [
                {
                    "author": "NeanaOption",
                    "body": ">so they can pretend later on that we've never contributed anything.\n\nAnd then use the claim they never contributed to anything as proof that they are inferior. It's like a giant ouroboros of Nazi bullshit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Xiaoshuita",
            "body": "Gotta love an AI or script just running Ctrl+F on terms and names they think are DEI.",
            "score": 1,
            "replies": [
                {
                    "author": "HenryDorsettCase47",
                    "body": "Surely worth the billions of dollars it cost to develop 🤦‍♂️",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "roastbeeftacohat",
                    "body": "the MoH winner that was scrubbed from the website first had the address changed to DEI recipient before it was deleted. this isn't AI, this is humans trying to disgrace the honored dead.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NeanaOption",
            "body": "Stop calling it a DEI purge, it's called whitewashing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ugh-screen-name",
            "body": "White rich men only.  The rest are not in the club.",
            "score": 1,
            "replies": []
        },
        {
            "author": "False_Ad_5372",
            "body": "I hate racists",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnteaterPositive6939",
            "body": "Trump and Musk are erasing all of us, well, unless you are a rich white man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rickee_martin",
            "body": "I will never forget you Ira. As much as this government is fucking up and erasing people like you from history. I will not forget. SEMPER FI MARINE.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nwgdad",
            "body": "> Until recently, a page on the Defense Department’s website celebrated Pfc. Ira Hayes, **a Pima Indian** who was one of the six Marines photographed hoisting a U.S. flag on Iwo Jima in 1945, as an emblem of the “contributions and sacrifices Native Americans have made to the United States, not just in the military, but in all walks of life.”\n\nI can just hear the MAGATs now: \"We can't honor no damn immigrants.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "NOGOODGASHOLE",
            "body": "The irony of this all being done by a guy who avoided military service during war time must escape some folks",
            "score": 1,
            "replies": []
        },
        {
            "author": "draftdodgerdon8647",
            "body": "They did the same thing to the Navajo Code Talkers from WWII. Without them, the war in the pacific would have been even worse. \nahéheeʼ nitsaago",
            "score": 1,
            "replies": []
        },
        {
            "author": "Young-Pizza-Lord",
            "body": "Such a disgraceful act, this is not what they risked everything for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rnr_",
            "body": "OK conservatives, lets hear your defense on this one. Seriously, how could purging this image have any beneficial impact on this country? What problem is this solving?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mostuselessredditor",
            "body": "Fuck you Washington Post. Get fucked",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible_Rabbits",
            "body": "This is what happens when you release idiots with AI into the workforce.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "This submission source is likely to have a soft paywall. If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\". [More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CAM6913",
            "body": "The white nationalist are purging history. America is a authoritarian oligarch dictatorship lead by a Syphilis ridden madman hell bent on revenge and destroying democracy ,America and anyone that opposes him and his regime while his billionaire administration enrich themselves and the maggot cult cheers until it hits them directly then they blame the radical left",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ben_Pharten",
            "body": "Nazis suck ass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProperBlue",
            "body": "This timeline is so fucking stupid",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lott4984",
            "body": "They are trying to Nazify the US military, they will be either kicking out non whites or segregating them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unyielding_rock",
            "body": "The country that this picture once stood for is long gone. You can post a picture of a Hitler rally at this point and that would be closer to the current state of America.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rnr_",
            "body": "OK conservatives, lets hear your defense on this one. Seriously, how could purging this image have any beneficial impact on this country? What problem is this solving?",
            "score": 1,
            "replies": []
        },
        {
            "author": "colorme1965",
            "body": "Trump’s DEI:\n\nIf he ain’t a redneck, racist, and traitor to the United States - that fought against the Union; then no statues, online mentions, or military bases with your name.",
            "score": 1,
            "replies": []
        },
        {
            "author": "commanderclif",
            "body": "Fucking embarrassing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "threehundredthousand",
            "body": "The biggest beneficiaries of DEI are military veterans, especially for federal jobs. This is what the military overwhelmingly voted for. 10x worse if you're anything but a white male veteran. Trump thanks you for your service (votes).",
            "score": 1,
            "replies": []
        },
        {
            "author": "sphinxcreek",
            "body": "Stop calling it a DEI purge.  There was no such thing back then.  They are simply erasing the accomplishments of minorities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marsar0619",
            "body": "Ah yes, the known wokester Clint Eastwood even made a movie about this story. We are lost",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommunicationFit3467",
            "body": "Saint Cage made Windtalkers so we'll never forget.",
            "score": 1,
            "replies": []
        }
    ]
}