{
    "title": "Canadian airline cancels flights to Tennessee",
    "author": "SimplyTennessee",
    "subreddit": "politics",
    "rank": 8,
    "score": 1966,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 187,
    "url": "https://www.wkrn.com/news/local-news/nashville/canadian-airline-cancels-flights-to-tennessee/amp/",
    "id": "1je9d0t",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "tekguy1982",
            "body": "Good, it’s the only way Americans will learn is to feel the pain.",
            "score": 1,
            "replies": [
                {
                    "author": "Apprehensive-Cat330",
                    "body": "While I appreciate the gesture from Canada, I seriously doubt that most Tennesseans will even notice.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ladystaggers",
                            "body": "They're gonna notice a losses in the billions in bourbon and whiskey sales though since it's been pulled from Canadian shelves.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Synaptic-asteroid",
                                    "body": "Eventually maybe. They already fired a bunch of people here in Tennessee and no one else cares. It sucks for their families but no one else has noticed, their neighbors don't care, the news doesn't care.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Apprehensive-Cat330",
                                            "body": "Sadly, you're correct.  Local news is more concerned with college sports and the weather.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "samsquamchy",
                                                    "body": "Americans don’t give two fucks about eachother",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "pfiffocracy",
                                                    "body": "College sports and weather are a lot more entertaining than watching leftist foam at the mouth.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Beautiful_Sherbet708",
                                                            "body": "Thanks, Vlad, we love bread and circuses!",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Duotrigordle61",
                                                            "body": "Leftist = people with human decency.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ditto_B",
                                                            "body": ">more entertaining\n\nThat's not a good metric for what should be on the news",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "733t_sec",
                                                            "body": "What?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Chill_Panda",
                                            "body": "Prices have gone up, they don’t care. Eggs are unaffordable, they don’t care, private businesses are being seized, they don’t care. People are being taken away and held in detention centres, they don’t care. The press is being suppressed, they don’t care. \n\nLook to the people who don’t care, look to the people cheering it on. Be prepared to go to war against these people. It is coming.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BlondeBorednBaked",
                                                    "body": "All they care about is Trump being president. He’s their crack. They’ll throw away their families, jobs, friends, money, reputation, morality, democracy, lives, etc. for another hit of that Trump crack.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "126270",
                                                    "body": "Which they are you referring to?  \n\nYour vague statements have happened over and over in the usa for decades….",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Chill_Panda",
                                                            "body": "Ahh yes it’s just another normal day in normal America…",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "herecomesthewomp",
                                            "body": "Yah I think we are seeing yet another issue with our demand for immediate gratification.  We’re still months away from people feeling the pain from this month’s actions from this administration.  Unless you lost your job or some how directly affected, it’s going to be business as usual for a while still.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "G-T-L-3",
                                            "body": "But the business owners will notice.  They're the one's who cozy up to trump and get their leaders elected.  I think they'll notice.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CrotalusHorridus",
                                    "body": "Kentucky bourbon was already at an inflection point. We expected a crash or 'correction' this year anyway.\n\nshould have been more clear -\n\nBourbon is already headed for a decline. The addition of tariffs and country-wide boycotts will absolutely destroy the industry.\n\nThe good ole boys working at distilleries in Loretto, Frankfort, Bardstown and Clermont are going to get exactly what they voted for.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Capt_Dunsel67",
                                            "body": "If they are red hats, I doubt they understand the larger world economy. (otherwise they wouldn't be red hats) But trumpy will blame someone else and they will follow suit. Must of been that law that Obama past back in 2012....",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "dgbaker93",
                                                    "body": "Honestly it's worse than not understanding. They just don't care or think the US is one big punching bag that is being taken advantage of.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Angryboda",
                                            "body": "Look at those goalposts move!\n“Losing money is actually winning now!”",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "TotallyDissedHomie",
                                                    "body": "“No pain, no gain” is the new talking point, kinda the opposite of lowering costs to consumers on day 1.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "CrotalusHorridus",
                                                    "body": "What I meant by that, and should have been more clear -\n\nBourbon is already headed for a decline. The addition of tariffs and country-wide boycotts will absolutely destroy the industry. \n\nThe good ole boys working at distilleries in Loretto, Frankfort, Bardstown and Clermont are going to get exactly what they voted for.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "allgonetoshit",
                                                            "body": "Headed for a correction or decline is not the same as losing your biggest foreign buyers, hell you guys lost your biggest single buying entity in the LCBO alone.  And, whatever correction was coming is still coming. It will turn a 5-10% correction into a 20-25% loss of markets in addition to the 5-10% correction. But, wait, there's more, Europe is ramping up a boycott. Hey, but, wait a minute, you're now going after the UK, Australia, NZ, what's that, more boycotts incoming?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "CanadianODST2",
                                                                    "body": "I feel y’all are not understanding what’s being said. \n\nThey’re saying that this is going to hurt a lot of people badly because the projection before the tariffs and boycotts is going to be on top of what’s already expected to be pain.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "artinthebeats",
                                                                            "body": "We are currently a rabid country, can you fault us for having some reading comprehension issues as of late?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "rdyoung",
                                                                                    "body": "Yes I can fault us for reading comprehension issues because that is why we are in this mess. People see a comment somewhere or hear they orange menace say they heard something and they take it as gospel. We haven't taught people how to think for themselves in decades.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "artinthebeats",
                                                                            "body": "We are currently a rabid country, can you fault us for having some reading comprehension issues as of late?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RabidGuineaPig007",
                                            "body": "What it has done in Canada is highlight that distilleries are locally making Bourbon-style whiskey, and they win all the gold medals international competitions. So....once people try that, they are not going back to that industrial solvent you have to kill with Coke.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "rsta223",
                                                    "body": "> and they win all the gold medals international competitions. So....once people try that, they are not going back to that industrial solvent you have to kill with Coke.\n\nThis is just false. Many US bourbons and whiskeys are absolutely top shelf and win many international competitions. It's just factually not true to claim that it's all \"industrial solvent\".\n\nThat having been said, despite several Kentucky distilleries making excellent bourbon and rye, I'm sticking to Canadian, Scotch, Irish, and blue state produced products until we actually do something about the orangutan in chief. Good whiskey isn't as important as my values, and besides, Canada, blue states, and Europe (and Japan) make some excellent whisk(e)y anyways.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "12-34",
                                                    "body": "What Canadian distilleries sell whiskey at least 51% corn and aged in new, charred, white oak barrels?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Hay_Fever_at_3_AM",
                                                            "body": "I don't know much about Canadian whiskeys, but [this thread](https://www.reddit.com/r/whiskey/comments/1hybmkr/canadian_whiskey_51_corn_aged_in_new_charred_oak/) has several (I just punched your message into Google verbatim), and briefly looking into the first mentioned seems to confirm that one fits the bill so...",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RabidGuineaPig007",
                                    "body": "So a chronic shithole is now more of a shithole?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "toaster1234567",
                                    "body": "Not really. The owners of these companies do not care. The whisky that they have made and maybe won’t sell now in Canada will age and become more valuable and they will sell at a higher price. So laying folks off now is a good thing for them and their investors. They don’t care.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AcanthocephalaFine48",
                                    "body": "I think we have enough alcoholics in the US. We should really take it all off the shelves. It’s poison at the end of the day.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MrChainsaw27",
                                            "body": "We tried that once already.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "RabidGuineaPig007",
                                                    "body": "but before prohibition, alcohol was out of control in the US.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AbueloOdin",
                                            "body": "First off, how dare you, sir! The absolute gall. The. Absolute. Gall.\n\n\nSecond, I mean... Yeah.... You are right. It is poison. We probably shouldn't sell poison for people to drink.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "126270",
                                    "body": "Ermmmm,  \n\nMost liquor has been bought and controlled by huge multinational corporations for decades  \n\nYou say “Tennessee to lose billions” because one province in canada pulled some huge multinational corporate fire water off some shelves - - can you point to any verifiable data supporting your claim?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "picardstastygrapes",
                                            "body": "Largest single buyer of alcohol pulled it off the shelves actually. And also, many other provinces did the same thing. Even if they put them back on the shelves I doubt they'd do anything but collect dust. Canadians are really angry.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SimplyTennessee",
                            "body": "Im in the \"every little bit will help\" camp.  See also \" we all have a part to play\".",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "quite_a_gEnt",
                                    "body": "It takes years to cultivate good relations, but can take seconds to destroy them. America is a junkie that is hooked on right wing propaganda, and the world is sick of our shit.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ConspiracyPhD",
                            "body": "Half of all international visitors to Nashville are from Canada.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Mysterious_Reply_490",
                            "body": "Lots of rodeo type stuff that crosses over with Canada and TN/TX. Deep red areas that rely on that tourism and cross boarder activities will probably feel this pain. Fingers crossed!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TylerDurden1985",
                            "body": "If there's one thing conservatives have in common it's a lack of empathy.  They don't care unless it personally affects them.  Then they only care so much as it impacts them directly, and the moment it doesn't, they don't care again.\n\n  \nOnly way US will learn is if Canada cuts off potash and all other exports to the US.  Our country is so reliant on global trade to sustain the massive population and they are blissfully ignorant of this as Trump goes around throwing a tantrum and isolating us from the world.\n\n  \nA massive food shortage will wake people up.  No one would be safe.  \n\n  \nAnything short of that seems to only be targeting very isolated pockets that are going to personally feel it, but none of their neighbors or peers will care.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "wwaxwork",
                            "body": "They'll notice the decreased tourist dollars.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "jgr615",
                            "body": "Nashville gets lots of Canadian tourists.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Telvin3d",
                            "body": "Their hotels will",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "HackMeRaps",
                            "body": "I don't know about that...Pretty much for the last 10 years it seems like Nashville is the go to spot for many girls trips and bachelorette parties, etc. I know SO many people that would travel their for this or things like Bonnaroo!   Definitely lots of tourists there.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MeIIowJeIIo",
                            "body": "Nashville and maybe Memphis will soon notice a downturn in general tourism. But you’re right, most Tennesseans probably won’t even notice.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ibluminatus",
                            "body": "Canada provides a ton of tourism and trade for the US. Its going to take a few months but it'll absolutely be felt more and more.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Particular_Treat1262",
                            "body": "This is just the beginning, a little warning for all airlines both American and Canadian. Not alot of Americans may fly to Canad, but transfers may now take an extra hour or two. Less airports to do flights from may also strain American airports.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Goldilocks2023",
                            "body": "They won’t , \nBut their economy will !!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Arzalis",
                            "body": "Nashville (where this flight was connecting to) definitely will. It's a major tourist city.\n\nAs someone who lived there for half a decade: It's a very blue area in a sea of red that constantly gets fucked over by its own state government.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Jet2work",
                            "body": "unless they are in Canada right now.....:-)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Jet2work",
                            "body": "unless they are in Canada right now.....:-)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Latter-Bluejay-8317",
                            "body": "Yeah. the funniest part is how mad the  Canadians are, they’re willing to collapse their own economy just to mess with the US. Meanwhile most Americans don’t care one way or another",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Otherwise-Contest7",
                    "body": "Can we please start reframing this to ~~Americans~~ MAGA? 80 million of us have been feeling fear, sadness, shame, etc for 10 years already. We're not defying our allies and we've already been listening to our allies' concerns/anger.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LeadingScience8929",
                    "body": "As an American, I get this sentiment.  But you’re misguided if you think most of us are not feeling the pain and embarrassment already.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Responsible-Room-645",
                            "body": "I do feel sorry for normal people in the states.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "saybruh",
                                    "body": "This is the only way to beat trumpism. They don’t engage in good faith. You can’t argue or reason with them. The only way they’ll break out of this is by feeling the affects themselves. I say this as a lifelong resident of Louisiana.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "allgonetoshit",
                            "body": "As a Canadian, I get that, but all I hear is how powerless you are when there is something super simple you can all do:\n\n1- Start planning for the midterms now.\n\n2- Identify all Democratic Congress members and Senators that are not interested in  standing up to Trump and begin the effort of opposing them in the primaries NOW. That includes finding great candidates and voting in the primaries and the election. (We're all tired of Americans bitching about having to choose between two bad options when they did not vote in the primaries).\n\n3- VOTE, vote, vote, vote.\n\n4- Flip the senate and house with new elected officials that WILL do something.\n\n5- Name an effective Speaker that can become president.\n\n6- Impeach and convict the President and VP.\n\n7- The newly named President, former speaker of the House, now needs to absolutely expand the supreme court of day one.\n\n8- Go after all the Russian assets and traitors and do it within a year, no half measures that go nowhere.\n\n9- Elect a new president that isn't a fascist two years later.\n\n  \nIf you can't do 1 through 4, you're not even trying.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cesarxp2",
                                    "body": "Ok. I will do that.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "MomsAgainstMarijuana",
                                    "body": "Ideally 1-4 can be achieved. When you get to impeachment I don’t think it’s going to be in the cards even if next year is a blue wave election, the math to get to 2/3rds majorities willing to impeach and convict is extremely unlikely. That said, no reason not to try. And depending on how bad shit gets by November 2026 who even knows.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "evantom34",
                                    "body": "> That includes finding great candidates and voting in the primaries and the election\n\nThis is easier said than done. But I agree, if you're not voting at every step of the way- you really can't complain. This is also a significant time to actually mobilize and act.\n\nResearch candidates, mobilize, protest, campaign for, organize- these are the things that we can do to actually build some momentum. Crying into the void on Reddit hardly does anything.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "terminator_chic",
                                    "body": "Those all sound nice, but as a normal citizen, I can only do one of those things and it doesn't help at all. I can identify great people, but this isn't a test on finding your shapes. I can't flip the Senate or the House. I can't even flip anything local as I'm only one person. \n\n\nAnd honestly, none of this even matters now. Midterms are too far away. They're breaking the law right now. We are well beyond thinking our votes count our even that our opinions matter. Judges are telling them to stop and they won't listen. How is my vote in two years going to matter, especially when I live in the South? It's not. It's a way to make us feel pacified so we sit down and shut up. It's not enough anymore. Sorry, instructions from the world's friendliest country don't help here. We've gone from bullies to supervillains. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "allgonetoshit",
                                            "body": "You have basically given up already then. You can do more. You can get involved with your local Democratic party, you can help mobilize people.\n\nAnd, the midterms are not so far away, the Democrats are already behind on election efforts. You guys are already \"behind the 8 ball\".\n\nThat's the thing though, it's what we all expect from Democrats now. After the midterms, you will all give us the same sob story about not having been able to do anything. You will have done nothing, you will have tried nothing, and you will still somehow try to blame someone else and will yet again ask the international community for sympathy.\n\nThis is it, this is the moment if you decide to reclaim your country, and it looks like you have already decided not to.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "terminator_chic",
                                                    "body": "It's not that I've given up, it's that I've given up on a broken system working properly. I'm saying that we're too far gone for that to be enough and we need to look at more aggressive options. We need something better. At this point we need to work outside of the system. ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "G-T-L-3",
                                            "body": "So you're one of the millions that didn't vote",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "superbelt",
                                    "body": "A lot of us are doing that.  Unfortunately you have to factor in gerrymandering in the House and the Affirmative Action for Red States that is the Senate.  The way we apportion our representatives is arcane and demoralizing.\n\nWhile it is possible to get majorities in both chambers, it's going to be tough, and it will be *impossible* to get the majorities needed to actually impeach and remove Trump and Vance.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mitrie",
                                    "body": "Good list. Only one I really disagree with is #5 (and by proxy half of #7). We don't need a Speaker of the House who wants to become president. We need a speaker of the house who respects and defends the powers of Article I of the constitution. We need someone who will assert Congress's role, and someone who has presidential ambitions isn't that person. Congress has been in the habit of deferring power to the executive for decades now (obviously massively accelerated in the past 2 months), and that has to stop.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "samishgirl",
                                    "body": "This. This so much. Let’s get our shit together.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Synaptic-asteroid",
                            "body": "Most people are entirely clueless any of this is happening. They're just going about their daily life in ignorance. Of  those that are, it's split between horror and joy. Don't pretend like \"most\" of us are reasonable. That's clearly a lie.  People are excited about this and love seeing America be \"tough\", it's gross but that's where we are.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LeadingScience8929",
                                    "body": "No they don’t.  I’m surrounded by MAGA fanatics and none of them are keen about the trade war with Canada.  That’s very different from saying most of us are sane….that argument is lost by default.  But most don’t see the long term benefit of alienating our neighbors.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DonJuanDeMichael1970",
                            "body": " Americans deserve more. Much, much more.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "anderhole",
                                    "body": "As an American, I reluctantly agree. It sucks, most of us have nothing to do with this. We're embarrassed about it, but we absolutely need to see the affects of trying to bully the rest of the world come crashing down.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "LeadingScience8929",
                                    "body": "Wait….more pain or more from their leaders?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Affectionate_Buy_830",
                                            "body": "Both?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LeadingScience8929",
                                                    "body": "I don’t know a single American that wanted this.  I also don’t know anyone that supports it.  Yes, some of them voted for the tangerine twat but all of them would have said Canada, UK, and Europe are our closest friends.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Kincherk",
                                                            "body": "Exactly. If you can stomach it, visit the Conservative sub and search for 51st state. A lot of WTH is he doing. We didn't vote for this.  \n\nLots of people think he's playing some game of 12 dimensional chess but he's really just fucked in the head.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "saybruh",
                                                            "body": "You can’t disconnect policies you don’t agree with from who you voted for. If you voted for Trump you own everything he does.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "LeadingScience8929",
                                                                    "body": "Sure you can.  We do it all of the time.  I loved most of Obama’s policies….why do I have to own the drone strikes?  I pay taxes and would prefer most of that supported social programs….am I part of the military industrial complex because a portion of that goes to defense spending?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "xorfivesix",
                                                                            "body": "Obama didn't campaign on drone strikes, Trump was floating the tariff shit and everything else. If Trump's policies are surprising to you it's because you weren't paying attention.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LeadingScience8929",
                                                                                    "body": "To the best of my knowledge Trump never campaigned on specifically on Canadian tariffs (that came a few weeks after winning the election)….most assumed the tariffs were aimed at china.   Frankly, no one even considered asking if he’d target Canada.\n\nHe also didn’t campaign on annexing Canada, Greenland, or Panama…that crazy bullshit came after he won.  \n\nAgain, I’ve never voted for him nor do I support him…but it is believable that a lot of his voters don’t see this coming.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "xorfivesix",
                                                                                            "body": "Trump specifically said he planned to scrap taxes and pay  for them with tariffs and firing government employees. I don't see how people thought Canada would be excepted from tariffs that are meant to pay down $30 trillion of debt or whatever....\n\nAs far as I can tell there's no actual action on invading Canada or Greenland, which would require some kind of military buildup and congressional approval.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "saybruh",
                                                                            "body": "No you can’t. I voted for Obama twice. He wasn’t perfect but I own the bad he did along with the good.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LeadingScience8929",
                                                                                    "body": "I call BS. Everyone compartmentalizes the good and bad policies of an administration simply because there are no perfect leaders or politicians.   Do they acknowledge the bad is the point….thats the test.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "saybruh",
                                                                                            "body": "You vote for harm reduction. There is no perfect candidate with perfect policies. It’s our civic duty. As Americans we only have so much power but that doesn’t mean we get to check out. If you voted for Trump you had a responsibility to your fellow citizens to understand his policies. Ignorance isn’t an excuse.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "pr06lefs",
                                                            "body": "Ignorance is no excuse.  People have a responsibility as voters and as citizens.  The flame of democracy has to be maintained, and as a country we have failed.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "LeadingScience8929",
                                                                    "body": "We haven’t failed.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "pr06lefs",
                                                                            "body": "Yes we have.  Look who we elected.  A man who literally said \"In four years you don't have to vote again, we'll have it fixed so good you're not gonna have to vote\".",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LeadingScience8929",
                                                                                    "body": "Maybe I should have said “yet”.  We haven’t failed yet.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "derpmax2",
                                                                            "body": "From the outside it certainly looks like you are. Self inflicted economic destruction. 🤷‍♂️",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "DonJuanDeMichael1970",
                                                                            "body": " Oh yea you have. You live in a failed republic. A man in the White House has no concept of the limits of executive power. And you all let him do what he may. That is failure.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LeadingScience8929",
                                                                                    "body": "No, this is abuse. Failure happens if there is no correction.  Look, I fully expect the world to turn their backs on us and force us to clean up our own mess.  I accept and support that.  But we haven’t failed….yet… and certainly not because someone had a conversation with 2 assholes in a bar….unless they went home with them.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Affectionate_Buy_830",
                                                            "body": "I got in an argument with 2 that do at a brewery on Sunday.  They are not only for it they think it is hilarious.  One of them said over and over, \"Just let it happen.\"",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "LeadingScience8929",
                                                                    "body": "Never said there aren’t ignorant assholes out there.  And I’d probably feel different if Canada was trying to annex my state.  I just wish I could show you how most of us really feel about it….without doing something that is illegal.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Affectionate_Buy_830",
                                                                            "body": "I wish I could believe that most people in the USA were reasonable people, but I can't.  I live here and talk to them.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Affectionate_Buy_830",
                                                                            "body": "I wish I could believe that most people in the USA were reasonable people, but I can't.  I live here and talk to them.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Erica_Loves_Palicos",
                    "body": "Said as if most Americans voted for this. The majority did not. This won't stop the fascists, and the boot lickers will just whine and say Canada is woke.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PoopittyPoop20",
                    "body": "I’ve voted against Trump three times now, campaigned against MAGA, etc. What am I learning exactly? I understand the need to respond in kind to tariffs, but the growing rhetoric coming from Canada and Europe holding all Americans responsible for Trump is very disappointing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lgnsqr",
            "body": "It's not worth coming to the U.S. when you have a chance of being thrown in a cell by ICE and held for days and then deported for no reason.",
            "score": 1,
            "replies": [
                {
                    "author": "Whend6796",
                    "body": "Deported to a notoriously rough Salvadoran prison without any due process or even notification to your family.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mleam",
                    "body": "As a person who lives in NY state. It's getting to the point I don't want to travel outside of my state.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AmandalorianWiddall",
                            "body": "As a person who lives in Texas, I’m starting to be scared I won’t be able to leave my state soon. And I hate it here.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "smitherenesar",
                            "body": "what, you don't want to visit pennsyltucky?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ladystaggers",
            "body": "\"Do you really want to miss seeing the smoky mountains? Do you really want to miss seeing Graceland?\"\n\n\nYes and yes.",
            "score": 1,
            "replies": [
                {
                    "author": "PlatformVarious8941",
                    "body": "We have mountains at home.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ladystaggers",
                            "body": "Exactly. I'll be visiting family in Alberta in the summer and I can't wait to see the mountains again.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JetlinerDiner",
                            "body": "\\*cries in the Netherlands",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PlatformVarious8941",
                                    "body": "It’s okay, you have windmills and tulips.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "purplesnowcone",
                                            "body": "And weed and mushrooms and hookers!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PlatformVarious8941",
                                                    "body": "I think you forgot Black Jack.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "organicdelivery",
                                                    "body": "And a train to the Alps\n\nThe Scottish highlands are the same range as the Appalachians so there’s that.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "schad501",
                                    "body": "Try a wine tour of Mendoza in Argentina. Beautiful vineyards and the Andes are right there. Breathtaking. The wine's OK, too.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "smitherenesar",
                            "body": "Canada has mountains? Why surely they're not as grand as our smokeys! /s",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CrotalusHorridus",
                    "body": "Smoky Mountains are fine. \n\nGatlinburg/Sevierville/PF are shitholes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ladystaggers",
                            "body": "As a Canadian you couldn't pay me enough money to step inside the USA right now. Elvis could come back to life and do a show and I still won't go near your country. I also haven't bought a single US product since the \"annexation\" talk and I'm definitely not alone. Elbows up!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CrotalusHorridus",
                                    "body": "Hey I don’t blame you.  I hope you realize not all of us are like this. \n\n\nWe’re here mostly because the oligarchy has seized the government.  \n\nBoycotting is one the most effective things you can do to change this. \n\nI’ve cut back to bare necessities on spending myself. And definitely won’t vacation in red states.\n\nMoney is the one thing they understand, and dwindling corporate profits will cause corporations to put significant pressure on them",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ladystaggers",
                                            "body": "I appreciate you. We've got our fingers crossed for you.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "djuggler",
                                    "body": "As an American stuck in Tennessee, I wish I could be up there sitting beside you, in a pub, having a pint, while this whole thing blows over.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Arrasor",
                                            "body": "More like blow up.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "djuggler",
                                                    "body": "Not dissimilar to The Winchester incident",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "movealongnowpeople",
                                    "body": "Elvis is wildly overrated and made his living stealing songs from others. Even if he *did* come back to life, it's a safe pass.\n\n\nNow, if Big Mama Thornton came back...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "preddevils6",
                            "body": "Smokies are incredible. One of the most biodiverse locations in the world. Gatlinburg and pigeon forge are shit though",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Clovis_Winslow",
                            "body": "North Carolina side is better",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "maxhibbitts",
                    "body": "Don't forget the grueling traffic of Gatlinburg",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Whend6796",
                    "body": "Smoky Mountains were beautiful, but it’s ruined by Pigeon Forge. It’s deeply embarrassing what Tennessee did to that once beautiful town.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MervynChippington",
                            "body": "It’s deep fried Vegas without any valuable intellectual property to cash in on. The entire area is fucking classless, and the only cool thing in the entire region in the mountains and forest. \n\nShould’ve been left as undeveloped land",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SilverSister22",
                    "body": "I’ve been to Graceland before. Has it changed? I don’t think they have redecorated. Everything probably looks the same. \n\nI will be happy if I **never** step foot in Tennessee again.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bigangrynaked",
                    "body": "I mean Dollywood is pretty legit",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wembley",
                            "body": "Best theme park food and a really chill vibe. Lines aren’t long either.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SilverSister22",
                    "body": "I’ve been to Graceland before. Has it changed? I don’t think they have redecorated. Everything probably looks the same. \n\nI will be happy if I **never** step foot in Tennessee again.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "harrietlegs",
                    "body": "Graceland, SURE\nBut the Smoky Mountains?? Nahh.. thats a must see",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JMDeutsch",
            "body": "There are 50 states, but fuck Tennessee in particular😂",
            "score": 1,
            "replies": [
                {
                    "author": "Maybellinegirl",
                    "body": "But why? What did that state ever done to you? I dont get why is Canada doing this!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Own_Candidate9553",
                            "body": "Are you serious? Have you not heard Trump talking about making Canada the 51st state? About the tariffs on steel and aluminum that came out of nowhere? About foreign travelers on valid tourist visas being detained by ICE and then deported?\n\nCanadians are doing what we would do in their place - boycotting US goods and cancelling travel to the US. You can't blame them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KJS123",
                                    "body": "Sure, plus a whole hell of a lot more you've not written, but why Tennessee in particular? Why not Florida or Texas?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ILiterallyCannotRead",
                            "body": "Voting for a rapist is one of the reasons.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sprywheel1872",
            "body": ">Ezell said they’re concerned about the cancelations, but confident they will overcome this because of Tennessee’s great assets.\n\n>“Do you really want to miss seeing the Smoky Mountains,” said Ezell. “Do you really want to miss getting to go to Graceland?”\n\nClueless. We'll pass on your \"great\" assets like the Smoky Mountains or Graceland. There are other more impressive mountains to see that aren't in the USA and let's be honest, Graceland is of zero interest to anyone born after 1970. Canadians are visiting Europe, travelling in Canada and generally avoiding all travel to the USA from now on.",
            "score": 1,
            "replies": [
                {
                    "author": "Vitau",
                    "body": "> Graceland\n\nhad to google that, yep, I am regretting this",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "slothcough",
            "body": "Not profitable given there is now zero demand for that route.",
            "score": 1,
            "replies": [
                {
                    "author": "Valderan_CA",
                    "body": "Yup... Flair can't afford to fly empty planes... that route was not going to be a full plane this summer with current sentiment.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ClassOptimal7655",
            "body": "Makes sense.  There's nothing in Tennessee worth seeing.  Especially as Canadians are being detained at the USA border for no reason.",
            "score": 1,
            "replies": [
                {
                    "author": "adam_c",
                    "body": "Not only that but people being rounded up and deported to el savador based on how they look",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Born_Violinist1742",
                    "body": "As a Tennessean, I agree. I have been all around Tennessee and can say it's not that exciting.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Clovis_Winslow",
                    "body": "Hello from Tennessee.\n\nThere’s plenty worth seeing here. We’re an absolutely beautiful state with amazing culture and the best parties in the south. \n\nBut I whole-heartedly support the boycotts because our electorate has the intellectual capacity of a moon pie. We had it coming.\n\nBut don’t go talking shit about a place you’ve never seen. It’s incredible here.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bluetenthousand",
                            "body": "Meh there’s lots of incredible places on Earth most of which I don’t have time to see. So crossing Tennessee off the list doesn’t mean I miss out on anything. It just means I can have the time and money to visit some other cool place.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Clovis_Winslow",
                                    "body": "I do not disagree. But Tennessee is wonderful. I love it here, despite being totally onboard with the boycotts and opposing the everloving shit out of Musk and his sidekick Trump.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "illydreamer",
                                            "body": "Just asked if TN is one of the best states to live and if the data is correct in the 50 states series https://youtu.be/mz61NcyXQJE?si=wTQGl493ivi7Mdn1",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sleepytakua",
                            "body": "what \"culture\" are we missing out on exactly?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PocketSpaghettios",
                                    "body": "Smoky Mountains National Park\n\nMemphis barbeque\n\nNashville is famous for its music scene \n\nDollywood is a kick-ass theme park\n\nI have only visited Tennessee but those are the things that come to mind immediately for me",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "TwunnySeven",
                                    "body": "how about the country music capital of the world?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SwimsInATrashCan",
                                            "body": "Country music sucks dude.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kkeut",
                                                    "body": "there's a growing local Drum And Bass scene too, lots of hardcore punks and metal kids.... lots more than country there",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hay_Fever_at_3_AM",
            "body": "Would you rather miss out on Graceland, or risk being detained in a concrete cell in inhumane conditions in Arizona or sent to a prison in El Salvador?",
            "score": 1,
            "replies": []
        },
        {
            "author": "gretschslide1",
            "body": "I was scheduled for a golf trip in April but it's cancelled we always spend a few days in Tennessee but not this year. I was going to try and do the bluegrass country music tour there but maybe in four years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yzerman88",
            "body": "“Ezell said they’re concerned about the cancelations, but confident they will overcome this because of Tennessee’s great assets.\n\n“Do you really want to miss seeing the Smoky Mountains,” said Ezell. “Do you really want to miss getting to go to Graceland?”\n\n\n☠️ who’s gonna tell him?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dingox01",
            "body": "Our golf group cancelled our June golf trip to NY state.  A shame because it had been a tradition for 5 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hisuinooka",
            "body": "more winning!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clovis_Winslow",
            "body": "We get a *ton* of Canadian tourists here in Nashville. \n\nI’ve never heard of Flair Airlines and doubt it will make much difference. But I support the boycotts. \n\nY’all really should stay home, as much as we appreciate you and enjoy your Canadian politeness and hockey knowledge.  Only way to hit us is in the pocketbook.\n\nNashville is popping now that spring is arriving so unfortunately no one appears to be getting the memo.",
            "score": 1,
            "replies": [
                {
                    "author": "Telvin3d",
                    "body": "Flair is one of our discount airlines. So about the equivalent of Southwest pulling out of a route, while some of the larger players stick around. Means the sorts of airlines that *need* a full plane to make their margins don’t think it’s viable anymore",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Own_Candidate9553",
                            "body": "Bigger airlines can probably shuffle planes and schedules around to deal with a drop in demand, and even fly some planes at lower capacity if needed, like you said. This is like the canary in the coal mine, expect to see more airlines drop or reduce routes in the future.\n\nNot even out of national solidarity, although they should, just because you lose money on fuel, staff and airport fees for any flight that's not close to 100% full.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CMDR_KingErvin",
            "body": "Tell me again how drumpf is helping anyone here? His pointless trade war is already ruining entire industries and now we can forget any tourism dollars coming from Canada and probably many other countries. Make it make sense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RuffTuff",
            "body": ">Ezell said they’re concerned about the cancelations, but confident they will overcome this because of Tennessee’s great assets. \n\nBless your heart Ezzel, but NO.\n\n> “Do you really want to miss seeing the Smoky Mountains,” said Ezell.\n\nDid you not hear me Ezzel - yes. Keep your mountains I don't wanna see Nazi mountains.\n\n\n>  “Do you really want to miss getting to go to Graceland?”\n\nFuck you Ezzel - yes. I wasn't born in the 70s, keep your Graceland, I am not contributing to Nazis.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RuffTuff",
            "body": "> During a Monday meeting of the Tennessee House Finance, Ways and Means Committee, Department of Tourist Development Commissioner Mark Ezell said it’s a loss of about 18,000 seats. “We see travelers quickly react to political news and then we see that great marketing overcomes that traveler settlement,” said Ezell.\n\nAssuming those are yearly figures, I am surprised that 18K people flew between canada and TN. \n\nSecondly, political news is that US government thinks of Canada as someone they can bully, push around and annex. Canadians are legitimately pissed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooRevelations979",
            "body": "The Oakridge Boys are getting a little long in the tooth.",
            "score": 1,
            "replies": [
                {
                    "author": "DaySoc98jr",
                    "body": "The main one died last year.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "smitherenesar",
            "body": ">“We see travelers quickly react to political news and then we see that great marketing overcomes that traveler settlement,” said Ezell.  \n  \n  We'll overcome being shitty by marketing!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cookie_Fun",
            "body": "Good.  I hope our drunk Canadian bachelorette sisters spend their hard earned money stumbling over Toronto or Vancouver or Cancun instead of Broadway.  Party on ladies, just not in this fascist hell.",
            "score": 1,
            "replies": []
        },
        {
            "author": "po8ossssss",
            "body": "lol what happened to the comments ",
            "score": 1,
            "replies": []
        },
        {
            "author": "LoveCleanKitten",
            "body": "The family and I were going to go to Nashville in April. Canceled the trip back in January after everything started happening. My wife was born in India but was adopted at birth and has been here since she was one. But we're not taking any chances. It's a damn shame because she's always wanted to go to Nashville, but the safety and security of our family comes first.",
            "score": 1,
            "replies": [
                {
                    "author": "RuffTuff",
                    "body": "As an American I say.. yeah good decison.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "suspiciousserb",
            "body": "Good. Now Westjet needs to drastically reduce or cancel flights as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Previous-Car1534",
            "body": "We need to ALL be boycotting red states! They are responsible for this!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Telvin3d",
            "body": "Holy hell, what got the comment section nuked?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcanthocephalaFine48",
            "body": "Can they stop all the travel vans from Canada that “camp” around the Florida keys as well. That would make me happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "reithena",
            "body": "Is this TN Ezell with the copium related to the OPM Ezell?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NegotiationTall4300",
            "body": "Oh man. How will they….. idk….now?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Melphor",
            "body": "I live in Tennessee. Canadians aren’t being punished here.",
            "score": 1,
            "replies": [
                {
                    "author": "Songstone",
                    "body": "Yeah... Being threatened by the president from home is more than enough. Your country is no longer safe to travel to.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}