{
    "title": "Monthly Rant/Politics Thread: Do not post political threads outside of this Mega thread",
    "author": "AutoModerator",
    "subreddit": "Millennials",
    "rank": 0,
    "score": 13,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 74,
    "url": "https://www.reddit.com/r/Millennials/comments/1j7mqlp/monthly_rantpolitics_thread_do_not_post_political/",
    "id": "1j7mqlp",
    "selftext": "Outside of these mega-threads, we generally do not allow political posts on the main subreddit because they have often declined into unhinged discussions and mud slinging. We do allow general discussions of politics in this thread so long as you remain civil and don't attack someone just for having a different opinion. The moment we see things start to derail, we will step in.\n\nGot something upsetting or overwhelming that you just need to shout out to the world? Want to have a political debate over current events? You can post those thoughts here. There are many real problems that plague the Millennial generation and we want to allow a space for it here while still keeping the angry and divisive posts quarantined to a more concentrated thread rather than taking up the entire front page.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "If this post is breaking the rules of the subreddit, please report it instead of commenting. For more Millennial content, join [our Discord server](https://discord.com/invite/ErJz3ktyGk).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Millennials) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReadLocke2ndTreatise",
            "body": "* clears throat * Fuck Trump, fuck MAGA, and fuck everyone who voted for it.",
            "score": 53,
            "replies": [
                {
                    "author": "odin2330",
                    "body": "![gif](giphy|3osBL8wMQYQPYh0Jgs|downsized)",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "HPW3_222",
                    "body": "So brave. Stunning, even.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "spartanburt",
                    "body": "This right here is half the joy of a 2nd Trump term 😀 ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LexEight",
                            "body": "You realize that taking joy in someone else losing or being in pain is fucking twisted right? \n\nAnd that all the \"love yourself no matter what\" advice isn't for YOU if you think like this? \n\nThe internet has ruined almost everyone\nBut seriously you need to refind your humanity, if you were ever allowed to have any",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CyberShi2077",
                                    "body": "I think what they're angling at is that there's more to life than Politics and far too many have become radicalised one way or another in political belief that they are self inflicting hurt by continuing to allow it to drag them in a downward spiral.\n\n\nModern Politics and Politicians are some of the weakest and worst since pre World War 2\n\n\nThey are incredibly detached, self absorbed and understand so very little about the public they represent that they're allowing the wolf to don sheeps clothing right in front of them and are so ineffectual and poor that the flock for the majority simply ignores their warnings.\n\n\nRight now, the state of Western Politics is in a place where it needs heavy reform and there's nobody currently in politics with the conviction or strength of character to do that.\n\n\nAll far too greedy and self interested, while pointing at the guy who is greedy and self interested telling you he's bad.\n\n\nBy far the best thing anyone can do is detox themselves from it. Keep informed but not involved.\n\n\nYou can do far more for your immediate world and circle than you ever could swearing and cursing at people because they had the political version of Sophie's Choice put before them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rydan",
                    "body": "So your mom?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ReadLocke2ndTreatise",
                            "body": "My mom isn't a US citizen or resident, so she couldn't have voted for Trump.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Far_Chocolate9743",
            "body": "So...are we actually going to make it through this? Not to be all dramatic, but it kinda seems like nobody is going to stop them. \n\nAll those books/movies/shows that are based on the fall of society and super post apocalyptic are always a little light on details as to how things got that bad.\n\nI imagine it was like this. Just a bunch of selective memories ignoring all the red flags, questionable decisions and blatant corruption.\n\nMy friend says it's giving 'Hunger Games'.\n\nAnd I have the strange need to stock up on...everything.",
            "score": 14,
            "replies": [
                {
                    "author": "Odd_Jelly_1390",
                    "body": "The way I see it, for me it's either victory or death. And my friends, my family, my community and millions of others die. \n\nThere are no other options at this point.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "OzarkMule",
                            "body": "The way I see it, for you it's in no way actually a life or death situation for you and yours or you wouldn't be shit posting about sonic the hedgehog porn.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Odd_Jelly_1390",
                                    "body": "If you look at the facts it is life or death. That statement is a deflection. I am angry that I can't do more.\n\nBtw if you think people aren't humorous during trying times then you aren't paying attention.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "OzarkMule",
                                            "body": "Are you comparing cracking a joke during a bombing to you looking at cartoons while doing nothing? They're not the same. If you actually thought it was life or death you would do *something*. \n\nCan you imagine the horrors of a family traveling through a foreign country, including parts controlled by brutal drug cartels, just to get to a country that doesn't want them merely to have a *chance* at improving themselves to YOUR quality of life? THAT'S a decision born of life or death circumstances, not whatever entitled tragedy you've convinced yourself of.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Odd_Jelly_1390",
                                                    "body": "I don't talk about what I am doing on reddit. \n\nAnyway their AI already tagged me and put me on a list. This administration has made it clear that they are going to go down their list of enemies and remove them all. JD vance endorsed a book by a neo nazi advocating specifically for that.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Visible_Minimum",
                    "body": "Gotta go out and do something. It’s literally up to us. Join the 50501 movement or look up protests near you. I’ve been going weekly and the crowds have been getting bigger each time.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "rydan",
                            "body": "Can you guys drop the 1 from the end of your name?  It makes no sense if you are out protesting twice per week yet claim it is just 1 day.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mediocre_Island828",
                    "body": "Life will change but it'll keep going. Even in countries that literally collapse there are still people going to work.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "HPW3_222",
                    "body": "![gif](giphy|SqflD5OvHoWILB7qWm)",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "atmasabr",
                    "body": "You're about four years too late.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "captain_ender",
            "body": "So uhh why was that GenZ rant post deleted?",
            "score": 5,
            "replies": []
        },
        {
            "author": "WitchyWarriorWoman",
            "body": "I'm just curious if anyone has cut off family members for differing political opinions? \n\nI haven't spoken with my parents for a few weeks, as I just can't talk to them when they are supporting this faschionista regime. But it feels like I'm punishing all of us, because I'm crying at least once a week and feel like I'm mourning my parents who are still alive. \n\nBut they are so ignorant and supportive of MAGA, Trump, and Elon. I don't feel like I should continue talking to them, as if everything is OK. I'd feel better if they renounced what was happening, but I'm not sure they ever will. Or at least they would say they are to connect again, while still supporting what is happening silent. \n\nAm I being too harsh?",
            "score": 4,
            "replies": [
                {
                    "author": "Wafflehouseofpain",
                    "body": "I’ve stopped talking to several people over it. I can’t forgive them.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Marinius8",
                    "body": "Naw. Cut em out. \nYou're not required to fuckin like people.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Byzantine_Merchant",
                    "body": "You don’t want to hear this but…\n\nNo. I’m a functioning adult and shit like this is why the Dems lost to Trump twice and needed a literal act of god to (barely) beat him once.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Marinius8",
                            "body": "God doesn't exist, and it's true that democrats let this happen. \nVoters. \nDemocratic voters let this happen. \nWho gives a shit if Kamala isn't fucking perfect? \nNow we have Trump. \n\nYou don't polish your car when the house is fucking burning. \nYou put the fire out.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Byzantine_Merchant",
                                    "body": "Chalk up 2020 to whatever makes ya feel better then. Basically the only narrow win over Trump involves the most insane set of circumstances that generally won’t happen. Outside of that, Dems have 2018 where they were expected to sweep until late and got split balloted instead. \n\nSo I wouldn’t blame the voters at this point. It’s the party’s job to get their base out, win swing voters, and pick up new voters. They haven’t done a good job at that in ages. The Republican Party understands this concept. Democratic Party is completely hapless and lost in outer space right now.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "spartanburt",
                                    "body": "It's a figure of speech.  Even insurance companies refer to \"acts of god\".",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Marinius8",
                                            "body": "He did say literal. 🤷",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "spartanburt",
                                                    "body": "Huh.  Millennials overuse that word so much I guess I must've become numb to it.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kdawg94",
            "body": "https://preview.redd.it/c1k5f7w5x4oe1.jpeg?width=1582&format=pjpg&auto=webp&s=9e417ee63559fa12da2abf260a68fd3afd326529\n\nLand of the Free: Only 14 members of congress signed the letter calling for the release of Mahmoud Khalil. Why didn't more vocal politicians like AOC sign this? I'm getting really fucking tired of performative politics. Democrats aren't walking the walk and it's disappointing as hell.",
            "score": 3,
            "replies": [
                {
                    "author": "OzarkMule",
                    "body": "Why would you care? There's nothing more performative than signing an ineffectual letter that will only be read by our side, just for people like you to bitch about it anyway. \n\nDo you realize that A LOT of newer Trump supporters, ie genz men, hate YOU more than any particular minority? I bet you won't accept that fact no matter how many of them say it to you.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "atmasabr",
                    "body": "Because AOC didn't sign it.\n\n\nI dont know what she sniffed out, I could imagine she has a problem with him being pro-Hamas but knowing her it's probably something even worse. She's far more selective than people give her credit for.\n\n\nWhat *I* sniffed out is that Mr. Khalil is a crook. Anyone who made it easier for the tent encampments and building takeovers to keep going should in fact be punished to the fullest extent of the law.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kdawg94",
                            "body": "Out of everyone in question right now — you think Khalil is the crook? Please tell me you're not MAGA.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "atmasabr",
                                    "body": "Correct. I'm basically Liz Cheney.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kdawg94",
                                            "body": "In that case, I'm extremely curious what the MAGA talking points are regarding Khalil being a crook. What have you got Liz?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "atmasabr",
                                                    "body": "I cannot stomach MAGA so you'll have to do your own research. I think my reply got mistranslated.\n\n\n\nIf you read the New York Post's opinions and letters you will tend to get a twofer: the establishment/neo con/social conservative mindset, and MAGA.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mediocre_Island828",
                    "body": "AOC reminds me a lot of early career Obama who talked an extremely good game, seemed to understand issues the left cared about, but wouldn't take a hard stance on things in a way that most of his supporters (including me at the time) would just handwave away and make excuses for because surely someone who said all those other great things would have a good reason for voting \"present\" on something. \n\nI don't think she's the worst, I at least appreciate the performance when no one else even bothers to do it, but at the end of the day she has a really cushy job and she's not going to do anything to risk it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Mediocre_Island828",
                                    "body": "\"we're not without principles, we're just incompetent!\" can be the slogan for the midterms lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "_nc_sketchy",
            "body": "🚨🚨🚨 Call the congressional hotline, tell your senator to VOTE AGAINST THE SPENDING BILL 🚨🚨🚨\n\nIf nothing else do it because Schumer is a spineless coward and you hate him.\n\nhttps://www.senate.gov/general/contacting.htm\n\n(202) 224-3121",
            "score": 3,
            "replies": []
        },
        {
            "author": "Graywulff",
            "body": "DARK GOTHIC MAGA: How Tech Billionaires Plan to Destroy America - YouTube\n\nhttps://en.wikipedia.org/wiki/Curtis_Yarvin\n\nhttps://en.wikipedia.org/wiki/Dark_Enlightenment\n\nIt’s only the beginning of project 2025 and ends with the buttery-fly project. This was the secret part of project 2025 and it’s really scary.\n\nIt is also not “fake news” there will be no news, no academia, they’re “the cathedral” which ironically yarvin describes as “Orwellian” despite his writing and dark enlightenment being Orwellian in practice concept and actuality.\n\nI’m beyond worried, as soon as the Vichy surrender-crats caved to maga which Chuck Chuck Schumer giving more power to trump, who is ignoring court orders, disappearing people, etc.\n\nThe word does need to get out to as many people as possible. Spent 12 hours a day on blue sky trying to figure it out when the federal employees union said “efficiency is a cover, they intend to destroy the country and establish a Neo feudalism/neo monarchy, etc”.\n\nTrump will ignore the court order to reinstate the employees, destroyed agencies, can confiscate endowments from universities.\n\nResearchers, weapons designers, etc are leaving.\n\n\nhttps://www.youtube.com/watch?v=5RpPTRcz1no",
            "score": 3,
            "replies": []
        },
        {
            "author": "PunishedBravy",
            "body": "I am the sum total of decisions I’ve made and those made for me, and sometimes I like talking about them, cause they sure as hell were more impactful to me than talking about what VHS tapes i’d run back into the house for in the case of a fire. Mostly because my family was too poor for to be buying shit like that. And there are WAY more interesting things from our past to talk about",
            "score": 3,
            "replies": [
                {
                    "author": "LexEight",
                    "body": "I refused to \"disaster plan\" a highly unlikely disaster\n\nI prefer to be settled and stable and able to trust in my response in the moment, I don't get that much but I defintely prefer it\nLosing the ability to trust ones self and not being surrounded by great people is genuinely terrifying",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apprehensive_Fig7588",
            "body": "So, how's your retirement saving looking this month?",
            "score": 2,
            "replies": [
                {
                    "author": "spartanburt",
                    "body": "You shouldn't look at it month to month, you'll just drive yourself crazy.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Delicious-Day-3614",
            "body": "I got a post auto removed because I used the word \"politics\". No commentary or anything. Frankly this is an absolute garbage sub if an entire generation cannot discuss the politics of that generation amongst themselves.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wafflehouseofpain",
            "body": "The ban on political discussion is ridiculous and shouldn’t exist.",
            "score": 3,
            "replies": [
                {
                    "author": "Byzantine_Merchant",
                    "body": "*points to other millennial sub*\n\n- Clearly it should\n\n- You have a megathread to talk about it in.\n\n- You have a whole other millennial sub.\n\n- You have many other subs. \n\n- Live with it. :)",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Wafflehouseofpain",
                            "body": "No, the rule is still unreasonable and applied way, way too broadly. It’s almost impossible to talk about current events here because of how restrictive the rules of this sub are. I’ll talk about that all i’d like, thanks.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Byzantine_Merchant",
                                    "body": "So use the other sub or many other subs dedicated to that. Seems easier than complaining about the one sub where that’s not thing. Thanks.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Wafflehouseofpain",
                                            "body": "Answer is still no, I’m a participant of this sub and will talk about where this sub is in the wrong. You’re free to ignore me if you don’t like what I’m saying.\n\nOur lives are political and not being able to talk about them in the sub dedicated to our generation is stupid.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Byzantine_Merchant",
                                                    "body": "I will. I’m just helping you man. But if you wanna yell into the void about how the subs not fair then go for it.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Wafflehouseofpain",
                                                            "body": "You’re not helping anyone or anything, you made a snarky ass reply to my comment because I said something you didn’t like.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Byzantine_Merchant",
                                                                    "body": "I’m absolutely helping you. There’s a whole other millennial sub dedicated to politics with the same name even. Instead you wanna stamp your feet than take the help. Some people can’t be helped.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Wafflehouseofpain",
                                                                            "body": "A better sub existing doesn’t mean this one is immune from criticism for having terrible rules. It seems like the only people who like the current rules are the people who *like* the current administration and would rather not see anyone point out how it’s terrible.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Byzantine_Merchant",
                                                                                    "body": "You’re proving my point so thanks. Buddy I work in bipartisan politics and campaigned against Trump in 2024. The types of people who like the rule generally just don’t want to deal with Reddit’s infamously bad and mentally ill political takes. The types of people who want the rules changed generally have nothing going on in their lives and can’t stand the idea of a sub being apolitical. Let’s say it does change the rule, they’ll celebrate for a bit then be onto the next sub that’s apolitical. This type of reddit discussion has no impact on elections or policy. It’s a massive circlejerk. \n\nSo yeah, go mods.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Wafflehouseofpain",
                                                                                            "body": "We live in very political times. This is the largest sub for the largest generation here. There’s zero reason it should ban us from talking with each other about things that affect our lives. \n\nNothing in life is apolitical. It affects every aspect of almost everyone’s lives.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Byzantine_Merchant",
                                                                                                    "body": "This basically circles back to you having no shortage of ways to reach millennials on Reddit if it’s about that from other subs to the megathread here. It’s not about that though you just don’t like the one sub saying no spamming about it.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Wafflehouseofpain",
                                                                                                            "body": "The megathread here gets almost no traffic, and that’s the point of it. To sequester any real discussion to a place nobody will see it. \n\nThis sub has a large audience of people in our generation, but prevents them from talking about anything beyond the absolute surface level on the sub.",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Byzantine_Merchant",
                                                                                                                    "body": "> The megathread here gets almost no traffic.\n\nSkill issue.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Wafflehouseofpain",
                                                                                                                            "body": "That makes absolutely no sense in this context.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Byzantine_Merchant",
                                                                                                                                    "body": "> That makes absolutely no sense in this context. \n\n1/10 Intelligence build reply.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Wafflehouseofpain",
                                                                                                                                            "body": "I’m not really sure why you find it important to try and mock people who care about politics and want to talk about it here. Do you get a kind of sense of superiority for making fun of people who are worried about their lives?",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Byzantine_Merchant",
                                                                                                                                                    "body": "I don’t mock serious people that talk about it. You complaining about one sub relegating you to a megathread on a website pretty much swarmed with political content is the definition of unserious and loser behavior. So yeah absolutely gonna have a blast mocking that lmfao.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Wafflehouseofpain",
                                                                                                                                                            "body": "Yeah, fuck me for wanting the sub for our generation to allow us to talk about things important to our current lives. We should just discuss which Nickelodeon character we liked the most as kids. \n\nI can’t imagine getting pleasure out of being a dick to other people for fun, but do you. You seem like you really care enough about politics to campaign against anyone like you claim to.",
                                                                                                                                                            "score": 2,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Byzantine_Merchant",
                                                                                                                                                                    "body": "And we’re back to 1/10 intelligence build replies. Good job dude.",
                                                                                                                                                                    "score": 0,
                                                                                                                                                                    "replies": []
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Byzantine_Merchant",
            "body": "Normally the party out of power seems adjusted, organized, and energized when they lose a major elections. Instead Dems are acting like they think they get the #1 pick in the 2028 presidential draft if they tank this cycle. It’s really weird.",
            "score": 1,
            "replies": [
                {
                    "author": "spartanburt",
                    "body": "Operative word :  \"seems\" lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Krog427",
            "body": "Unpopular opinions: Anyone who wants a job in government has no business in it.   \n\nPolitical offices should be single term, by lottery, refusal of position means we draw another name. \n\nAll bills proposed by legislators shall be less than 12 pages and fully self funding.   \n\nThe federal deficit cannot exceed 3%. \n\nLawyers are agents of the courts, the judiciary and are banned from legislative service for conflict of interest.   \n\nPeace officers are agents of the executive and are banned from legislative services for conflict of interest.   \n\nOne generation is gonna have to take the pain up front for all the ones coming after.    \n\nIt’s gonna be our problem, folks.",
            "score": 1,
            "replies": [
                {
                    "author": "genital_lesions",
                    "body": "These opinions are unpopular because they're dumb. Good job.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}