{
    "title": "I miss being cringe",
    "author": "astudentiguess",
    "subreddit": "Millennials",
    "rank": 11,
    "score": 119,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 39,
    "url": "https://www.reddit.com/r/Millennials/comments/1jecbhq/i_miss_being_cringe/",
    "id": "1jecbhq",
    "selftext": "I just looked through my saved Snapchats from 2015-2018 and I was cringe, but I was free. Trashy nightclub selfies. Smoking from a bong and giggling with friends in the dorm cafeteria. \n\nNow I'm married, my friends are all getting married, everyone has serious jobs and responsibilities. No one posts on social media anymore, which is fine, but I miss old social media. Now no one wants to be perceived and you can't see your friends' posts without scrolling through ads, influencers, and AI slop. I haven't been to the club in a long time and the last time I went it was post pandemic and the vibes were off. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "If this post is breaking the rules of the subreddit, please report it instead of commenting. For more Millennial content, join [our Discord server](https://discord.com/invite/ErJz3ktyGk).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Millennials) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appropriate-Food1757",
            "body": "I miss doing all that shit with zero video evidence of it online anywhere",
            "score": 176,
            "replies": [
                {
                    "author": "Lucky_Development359",
                    "body": "THIS *was* the way.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "naomisunrider14",
                    "body": "The life I’ve lived. And no one knows about it lol.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Appropriate-Food1757",
                            "body": "Cheers, to being an employable degenerate",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EveryBase427",
                    "body": "Sex in public is definatly more of a covert op these days locating where its a camera blind spot. Used to just check for people.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "PowerfulCrustacean",
                            "body": "Some night clubs back in the day were just pseudo-orgies by midnight.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "EveryBase427",
                                    "body": "No drugs but I do love having sex out in the moonlight or in the rain. Usually, these days we use the kid's trampoline in the back but we like to go out where it's more risky sometimes. A park or stream. It's very liberating just make sure they're are no peeping Toms or Cameras LOL",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Initiative-Cautious",
                    "body": "If there was video evidence of all the stupid shit me and my friends  did on our bikes as teenagers, I would probably be in jail still.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Appropriate-Food1757",
                            "body": "We used to steal mass amounts of wood from construction sites to build crazy death ramps. Nobody cared.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Initiative-Cautious",
                                    "body": "Yes!!! We used to build death trap forts in the woods and steal our parents beer and go drink and look at porn mags in our fort. God I really do miss being a teenager",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Appropriate-Food1757",
                                            "body": "Oh my god yeah I forgot the forts in the woods. Same!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Diligent-Ratio-4654",
            "body": "Social media definitely sucks now. MySpace and early Facebook was so fun! I think ads and it being a whole business really killed it. I’m still cringe and have fun though 😂",
            "score": 42,
            "replies": [
                {
                    "author": "astudentiguess",
                    "body": "Agree! Good for you for still being cringe. My life really slowed down since the pandemic and hasn't ever returned to the same energy and cringe levels. Still fun, but different",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sick_of-it-all",
                            "body": "Don’t let your dreams be dreams. Be the cringe you wish to see in the world. I know you can do it. I’m rooting for you. ",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "niss-uu",
            "body": "You can still be cringe without social media.",
            "score": 14,
            "replies": []
        },
        {
            "author": "PiiNkkRanger",
            "body": "I have a video of me and two friends, drunk in a hot tub, screaming Ohio is for lovers at the top of our lungs.\n\nAnother video from that night, me drunk on a futon balancing a fidget spinner on my nose saying \"put me on YouTube\"",
            "score": 9,
            "replies": [
                {
                    "author": "astudentiguess",
                    "body": "Peak millennial lol",
                    "score": 8,
                    "replies": [
                        {
                            "author": "PiiNkkRanger",
                            "body": "Absolutely lmao",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "darkandtwisty26",
            "body": "I like to believe I maintain the old social media on my IG stories a couple times a week. Definitely not like the good ol days though.",
            "score": 3,
            "replies": []
        },
        {
            "author": "reevoknows",
            "body": "I was half joking with my wife the other day how we should get the band back together for 1 night and just pretend we’re in our early 20s again. Someone offer up their house for pre drinking then go to a club and enjoy all the stares from people in the club wondering why these old heads are here, half of which probably aren’t even legal age lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "sixhexe",
            "body": "40. And still very involved in the club scene. Not in a \"I'm going to go slam tequila and pick up girls and get wasted kind of way\". But as photography, promotion, just generally chilling and dancing. There's tons of people my age who still go out ( If not older ), and a solid community of open mics, bands, musicians, and artists to make friends with.\n\nYou aren't wrong though, the wrong venue, event, organizer, it's going to target a young crowd. Looking to steal milk crates, hook up, sell drugs, and start fights. Or just sit around at a table scrolling a phone. I avoid places like that.\n\nAll my \"Get Married\" school friends are still somewhat in touch. Paths just change. I've made new circles of friends in different interests to have fun again. As an adult, dedicated community events, or meetup groups, sports leagues, the gym, etc. are the best way to go. Individual hangouts with school friends are just really hard to coordinate otherwise. Usually just see each other once every couple of years somewhere or another.",
            "score": 3,
            "replies": [
                {
                    "author": "astudentiguess",
                    "body": "Maybe it's the city I'm from and the crowds I hang with, but almost no one I know goes out anymore. So many people I know associate the club with shallowness and trashy drug vibes, which is a bummer because I love music and dancing and community. I might have to branch out and reach out to my old club friends",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "2am_alter_ego",
            "body": "It's time to bring some cringe back into your life. \nAnd it can remain private too, doesn't even need to be posted on your socials.",
            "score": 2,
            "replies": []
        },
        {
            "author": "InsertNameHere9",
            "body": "I missed out on ALL this. Downside of having like no friends throughout college and afterwards. Lol",
            "score": 2,
            "replies": [
                {
                    "author": "astudentiguess",
                    "body": "I missed out on the college experience too! I had one friend and I already knew him from high school. None of my roommates were friends with me. It was super lonely, but in hindsight, I'm realizing that I still had some good times, even if they weren't the typical college experience. Many of mine came after college, in that brief period before the pandemic. And then it all came to permanent halt.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "wait_ichangedmymind",
            "body": "#”I WAS CRINGE, BUT I WAS FREE”\n\nT-shirt level material right there",
            "score": 1,
            "replies": []
        },
        {
            "author": "53180083211",
            "body": "Ha ha good one. In my days we were just as awkward, but free as ever. What if I told you that the entire strip where we used to rage in my early 20s has now closed down. Not even the pub is open anymore. Depressing AF and I guess that's the thing with time. Life is temporary, so let's not dwell on the past for too long, because you cannot go forward if you keep on looking back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Competitive-Self-374",
            "body": "Still be cringe, just don’t leave evidence. Keep your IRL and online powers separate- don’t cross the streams.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thatskarobot",
            "body": "Slicked back hair. Glass House. White Ferrari. Live for New Year's Eve. Sloppy steaks at Truffoni's.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KingOfTheCouch13",
            "body": "Don’t worry. Have kids and they’ll make you feel plenty cringe.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Worst-Eh-Sure",
            "body": "I'm 40 years old and I've never given a fuck. I'm just out here saying crazy shit acting weird as fuck and I'm having a blast. \n\nI cuss a bunch, middle school sense of humor, but I have a fast car, decent income and a 15 year old I get to embarrass. A few weeks ago I picked her up with the windows down and I'm BLASTING Mozart like it's cool. \n\nI say, go be your weird cringe self. Fuck it, have fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EveryBase427",
            "body": "Cancel culture has ruined a lot of fun for us with so much info out there. I still fit in a little bad behavior thou. I'm sure there's a parking garage video of my wife and I being naughty in public bedrooms are just too boring... anyhow not having a FB profile has gotten me missed jobs thou. Apparently it's not team friendly to not have one LOL",
            "score": 1,
            "replies": []
        },
        {
            "author": "murdermerough",
            "body": "I'm still a little cringe. I'll turn a box of pineapple upside down cake upside down sometimes when I go to the grocery store. Just one tho don't want to make someone job harder. \n\nI love gen alpha slang, and mis-using it. I am the most beta sigma skibidi ohio rizz big back! My son hates it but I love it.\n\nI still play Ocean Ave by Yellowcard every once in a while and remember the first time I smoked out of an apple and drew a mustache on my finger. Lmao sooo cringe. \n\nI am excited about millenials being middle aged and older. We've always been grandparents-core. I think it's time we embraced it.",
            "score": -1,
            "replies": [
                {
                    "author": "astudentiguess",
                    "body": "I love this! You're right, being cringe and middle aged goes well together lol.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "murdermerough",
                            "body": "Lol guess other millenials don't 😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}