{
    "title": "Are you interested in obtaining the quality contributor tag? We're changing the way we hand those out!",
    "author": "parsnippity",
    "subreddit": "legaladvice",
    "rank": 0,
    "score": 21,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.reddit.com/r/legaladvice/comments/1iy18t4/are_you_interested_in_obtaining_the_quality/",
    "id": "1iy18t4",
    "selftext": "Hey! If you're interested in being tagged as a quality contributor and having the little star appear next to your name here, read on. \n\nUntil today the process was that we'd notice you and then contact you. We've found that that's not a very effective way to do it, because we miss a lot. It's a very active subreddit!\n\nFrom today on, we're doing self-nomination. If you meet the minimum requirements below, please send us a modmail if you're interested and we'll get back to you ASAP. \n\nQualifications are as follows:\n\n-Active for at least 3 months.\n \n-Minimum of 100 top level comments.\n\n-You can't be a jerk. \n\n-You can't delete posts when you're wrong. We need to see both the good and the bad. \n\nIf you meet the qualifications and you're interested, please send us a modmail. \n\nPlease remember that the quality contributor badge does not mean a person is always right. It means that you can generally be trusted to give solid information. \n\nWe appreciate you!",
    "comments": [
        {
            "author": "ForcedBroccoli",
            "body": ">You can't be a jerk.\n\nI feel attacked.",
            "score": 16,
            "replies": [
                {
                    "author": "parsnippity",
                    "body": "You should, I put that there just for you specifically.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "ForcedBroccoli",
                            "body": "😭",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheLordB",
            "body": "What about if you aren't sure if you are a quality contributor or just a person who wants to be right on the internet?\n\nI already have a bad enough addiction to reddit that I don't want to encourage it. :-/.\n\n(semi joking, but kinda not because I decided I shouldn't apply)",
            "score": 4,
            "replies": []
        },
        {
            "author": "hellrazzer24",
            "body": "Any special tags for licensed attorneys?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sugar_Weasel_",
            "body": "How would someone know whether they have a minimum of 100 top level comments?",
            "score": 3,
            "replies": [
                {
                    "author": "parsnippity",
                    "body": "They can look back through their commenting history. Generally though, if someone is pretty active enough here for a few months they'd know without having to check.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Sugar_Weasel_",
                            "body": "You want people to manually count to 100? Or is there some automated way of checking the number?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "parsnippity",
                                    "body": "Toolbox appears to have that feature. I can see that you've left 74 comments here, and looking a little more closely about 50 are top level.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Sugar_Weasel_",
                                            "body": "Oh, cool. Thanks",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "parsnippity",
                                    "body": "It's possible someone's built a tool for that; I really have no idea. If you're not sure you've commented 100 times you'll have to count to 100.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Sugar_Weasel_",
                                            "body": "But you said they have to be top-level comments, so you can’t just scroll through your comment history and look at how many times you’ve commented on the sub, but you have to click on each of your comments and then check if they’re the top comment. Presumably not every comment a person has made in the sub is going to be the top comment, so they’ll potentially have to go through and check hundreds of their comments to find 100 top comments. That just seems like a lot of work to ask somebody to do do for a tag.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jester29",
            "body": "> -You can't delete posts when you're wrong. We need to see both the good and the bad.\n\nFair enough...",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "legaladvice-ModTeam",
                    "body": "*Your post may have been removed for the following reason(s):*\n\nPlease create a new post. \n\n\n\n*Please [read our subreddit rules](https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules).  If after doing so, you believe this was in error, or you’ve edited your post to comply with the rules, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdvice).* **Do not make a second post or comment.**\n\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GreySoulx",
            "body": "Not as active as I used to be, and I admit I got in trouble a time or two... not sure who I rubbed wrong, but my bad....\n\nYears back you did a fund raiser where you were essentially selling stars, I donated my $100 to legal aid or whatever... what ever happened to that?",
            "score": 1,
            "replies": [
                {
                    "author": "parsnippity",
                    "body": "We've done fundraisers before, but we have never sold stars. At all.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GreySoulx",
                            "body": "I'll have to go WAAAAAY back, but it was a fund raiser and the gist was \"anyone who donates over X amount will get a star\" maybe 5-6 years ago?\n\nEdit: anyone know a way to search comment history by sub? I had an old push/pull site that worked but linkrot killed it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "parsnippity",
                                    "body": "I found it. It was custom flair: https://www.reddit.com/r/legaladvice/comments/6meahe/announcement_legal_services_corporation_charity/dk0w4l8/",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GreySoulx",
                                            "body": "That was it, sorry for my confusion! I even made the Pound Sand logo :P \n\nHopefully no hard feelings around, have a great one parsnippity!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "legaladvice-ModTeam",
                    "body": "*Your post may have been removed for the following reason(s):*\n\nPlease post in the subreddit as a new post. \n\n\n\n*Please [read our subreddit rules](https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules).  If after doing so, you believe this was in error, or you’ve edited your post to comply with the rules, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdvice).* **Do not make a second post or comment.**\n\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Additional-City5619",
            "body": "Cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "Disastrous-Job87",
            "body": "I like it,I'm on board",
            "score": 1,
            "replies": []
        }
    ]
}