{
    "title": "Car Dealership Ignored my Bank until the Loan Expired",
    "author": "spookyhabzar",
    "subreddit": "legaladvice",
    "rank": 10,
    "score": 259,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 35,
    "url": "https://www.reddit.com/r/legaladvice/comments/1jdx17d/car_dealership_ignored_my_bank_until_the_loan/",
    "id": "1jdx17d",
    "selftext": "[Location: MS, USA] I purchased a used car from a large local dealership about 6 weeks ago. I had pre-approved financing at a great rate with my bank for a max balance much higher than I intended to spend. I made it clear from the beginning that I had no interest in dealership financing. I found a vehicle I liked, finished the paperwork given to me at the dealership, coordinated the bank paperwork with the dealership. I thought all was done because I drove away with the vehicle the same day. \n\nAbout two weeks later I go to set up autopay only to discover that my loan is still in the application phase. After speaking with my bank they let me know the dealership has not submitted the required paperwork for fund disbursement and for the loan to finalize. I immediately contact the dealership and get the run around. I texted the salesman and got the same non answers. This continued every few days until today when I finally got someone from my bank to call the dealership and this resulted with only 2/3 of the required forms being submitted. The finance manager refused to speak to us further as “he already sent it” and he is apparently the only person able to access those forms. At midnight tonight this loan is void. My bank told me if he doesn’t get the final form in that I’ll need to get reapproved for financing but the rates are higher now. High enough it will price me out of what I can comfortably spend right now. I have neither the time nor the will to shop around for auto loans right now either. My bank said the dealership will just have to take the car back if I don’t want to finance again. \n\nThis just doesn’t make any sense to me. Is this a scam? I will ultimately end up losing thousands of dollars due to the dealership’s negligence. I’m also assuming they will not just take the vehicle back without issue. For what it’s worth, I work with contracts for a living and there is nothing whatsoever that would cover this type of situation in any of the documents from the dealership. To be clear, this loan is only falling through due to the dealership not submitting documents to my bank. \n\nHow can I protect myself in this situation?\n",
    "comments": [
        {
            "author": "wickedfreshgold",
            "body": "I highly recommend getting a lawyer, the sale contract most likely has a provision for if it’s an F&I issue like that & the dealership will have e&o insurance for that exact thing.",
            "score": 356,
            "replies": [
                {
                    "author": "spookyhabzar",
                    "body": "Thank you. I suspected as much. My bank let me know their call recorded the dealership’s finance manager essentially refusing to engage with them and hanging up before she could tell him what documents were needed. This is definitely a frustrating situation.",
                    "score": 220,
                    "replies": [
                        {
                            "author": "My-dog-is-awesome",
                            "body": "OP - Did you not provide your bank a copy of the purchase agreement? Sometimes the dealership will send it over; other times the customer will simply email it over. That is all your bank needs to process your loan (unless there's something else specific to your state that I'm not aware of). What else is your bank waiting on?",
                            "score": 77,
                            "replies": [
                                {
                                    "author": "spookyhabzar",
                                    "body": "The dealership has not provided them with the title application. Bank needed that in addition to the purchase agreement and the disbursement form. When I tried to get it myself yesterday to avoid all this, dealership gave me the run around.",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "It_is_me_Mike",
                                            "body": "Bet they don’t have the title. This happened on the coast a couple years ago to several people. Get a lawyer.",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "UnapologeticRants",
                                            "body": "Former car sales manager here. What bank are you using that requires a title application for approval? This should have been as simple as purchase order with black book values submitted to your bank, and they should have cut you a check. \n\nSounds like maybe you were using CUDL or the dealership has a direct partnership with said bank. \n\nEither way, I’ve seen banks honor rates after things like this happened. Not sure if this was truly negligent by the dealer, or if your bank is nitpicking unnecessary documents. \n\nPerhaps I will reread and see if I’m missing something. If this is in “funding” status with the bank. The dealership stands to gain nothing by not processing the proper paperwork.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheArcanaOfGames",
                            "body": "Someone is about to lose their job, that's for sure.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wickedfreshgold",
                    "body": "Because each state has different laws and each company has different contracts you wouldn’t get a complete answer on your options without speaking to an actual professional and letting them review the contract. In my state there’s a 72 hour rule for this kind of sale. Not to mention, sometimes just the presence of a lawyer is enough to get stuff settled out of court",
                    "score": 39,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 111,
            "replies": [
                {
                    "author": "spookyhabzar",
                    "body": "That is what I was suspecting. I had pressure from them every step of the way to let them try to beat my bank’s rate for financing until I finally told them I will walk away immediately the next time they mention it.",
                    "score": 69,
                    "replies": []
                }
            ]
        },
        {
            "author": "Negative-Technician7",
            "body": "They get a kickback from the finance companies they use. Especially the car manufacturer ones. Might not be cash, but an upgrade in their listing's  (i.e., bumped up on qualities of purchases of off lease cars).\nYou're not going to get the answer you want from them. Take the car back, say goodbye, and start over. \nSorry",
            "score": 47,
            "replies": [
                {
                    "author": "CreatedUsername1",
                    "body": "Have you the first sentence of the post ?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Negative-Technician7",
                            "body": "He thought he purchased the car. They did all the paperwork, but the financing. Still haven't done the financing. Technically,  he doesn't own the car.\n  I hope he's told his insurance carrier what's going on. He gets into an accident, or it gets  stolden he's looking at another level of paperwork hell, as the insurance can deny him coverage.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "The_Once-ler_186",
                                    "body": "Do you work in car sales? I tend to find the advice of those in the industry very much not objective.\n\nThis is on the car dealership. They have to insure for first 30 days, no?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Negative-Technician7",
                                            "body": "No, I don't work in the industry.\nAs to insurance, it depends on what state you're in.  I've purchased in 4 different states (private and commercial vehicles), and it was a little different in each. \nIf I'm wrong, show me. I'm willing to learn and admit my error.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "The_Once-ler_186",
                                                    "body": "I made my statement based on the ‘out of luck’ sentiment of your post. I have the same amount of evidence as you sir haha",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Superhairyjerry1",
            "body": "This can be very state specific. Aside from contacting the lawyer contact your DMV or state licensing department. In WA we have set people who investigate dealer complaints and help assist people when needed in completing the transfer.\n\nDealers are required to do certain things within certain time frames and failure to do so can result in closure/fines/frequent audits/ect.  \n\nWhen people have issues with a dealer, such as this, I will often recommend they threaten the dealer with filing a complaint.  9/10. The dealer fixes the problem the next day.  Most dealers, I've dealt with, don't follow the rules because of various factors.  Having a state inspector or audits can easily ruin their business or profit by making them have to actually do their job.  Yes, even the big dealers.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Mysterious-Hat-5662",
            "body": "Go above the finance manager.",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "legaladvice-ModTeam",
                    "body": "*Your post may have been removed for the following reason(s):*\n\n**Bad or Illegal Advice**\n\nYour post has been removed for offering poor advice. It is either generally bad or ill advised advice, an incorrect statement or conclusion of law, inapplicable for the jurisdiction under discussion, misunderstands the fundamental legal question, or is advice to commit an unlawful act.  Please review the following rules before commenting further:\n\n* [General Rule 8](https://www.reddit.com/r/legaladvice/wiki/index#wiki_8.__illegal_advice_is_never_allowed.2C_for_any_reason.2C_in_any_circumstance.)\n\n* [Commenting Rules 1](https://www.reddit.com/r/legaladvice/wiki/index#wiki_1.__comments_should_contain_a_legal_answer_or_a_strongly_related_non-legal_answer.) and [3](https://www.reddit.com/r/legaladvice/wiki/index#wiki_3.__explanations_of_the_law_in_jurisdictions_other_than_the_one_described_in_the_op_are_off-topic.)\n\n* [Reddit Violent Content Rule](https://www.reddithelp.com/en/categories/rules-reporting/account-and-community-restrictions/do-not-post-violent-content)\n\n\n\n*Please [read our subreddit rules](https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules).  If after doing so, you believe this was in error, or you’ve edited your post to comply with the rules, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdvice).* **Do not make a second post or comment.**\n\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "solutha1",
            "body": "This stuff happens all the time. It’s weird that the bank was talking to the finance manger. They should have been talking to the accounting office unless this is a small used car lot. Because the deal fell through they will want you to return the car. If this is their fault you may be able to just pay the dealership instead of the bank. They will argue you can’t do that but in most states it can be done and they have to honor your purchase agreement. I would consult a lawyer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "M13LO",
            "body": "Go talk to the general manager of the dealership and tell them the loan will be void at midnight and if that happens you’ll be contacting the Mississippi Motor Vehicle Commission (if they sell new cars) or the Department of Revenue (if they sell used cars). \n\nIf the deal does fall through I would talk to a lawyer about suing for the difference in rates. I would not tell them this though as they may not engage with you anymore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PurpleToad1976",
            "body": "So right now, you have a car with no loan on it. I'm sure there is some way the dealership could make it hit your credit, but driving till the car is repossessed is always an option.",
            "score": -1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "legaladvice-ModTeam",
                    "body": "*Your post may have been removed for the following reason(s):*\n\n**Speculative, Anecdotal, Simplistic, Off Topic, or Generally Unhelpful**\n\nYour comment has been removed because it is one or more of the following: speculative, anecdotal, simplistic, generally unhelpful, and/or off-topic.  Please review the following rules before commenting further: \n\n* [Commenting Rules 1](https://www.reddit.com/r/legaladvice/wiki/index#wiki_1.__comments_should_contain_a_legal_answer_or_a_strongly_related_non-legal_answer.), [2](https://www.reddit.com/r/legaladvice/wiki/index#wiki_2.__personal_anecdotes_are_off-topic.), [3](https://www.reddit.com/r/legaladvice/wiki/index#wiki_3.__explanations_of_the_law_in_jurisdictions_other_than_the_one_described_in_the_op_are_off-topic.), [4](https://www.reddit.com/r/legaladvice/wiki/index#wiki_4.__opinions_on_the_law_or_the_application_of_it_are_off-topic.), [6](https://www.reddit.com/r/legaladvice/wiki/index#wiki_6.__expressions_of_sympathy_without_corresponding_legal_help_is_off-topic.), [8](https://www.reddit.com/r/legaladvice/wiki/index#wiki_8.__comments_should_be_reasonably_detailed_and_explanatory.__.22i.27m_a_lawyer_so_listen_to_me.22_isn.27t_an_appropriate_answer.__credential_fights_are_not_appropriate_here.), and [9](https://www.reddit.com/r/legaladvice/wiki/index#wiki_9.__requests_for_updates_are_off-topic.).\n\n\n\n*Please [read our subreddit rules](https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules).  If after doing so, you believe this was in error, or you’ve edited your post to comply with the rules, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdvice).* **Do not make a second post or comment.**\n\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -20,
            "replies": [
                {
                    "author": "spookyhabzar",
                    "body": "Unfortunately it’s not fantasy. To clear things up: the car loan was signed and ready to go with my bank pending the seller submitting appropriate documents to them to prove an actual vehicle was being purchased. This isn’t a case where financing fell through because of my credit. Loan stated seller had so many days to submit documents to them and the seller didn’t. This the loan was cancelled. \n\nI meant the rates for me are higher now with a brand new application (I guess that’s the proper way to phrase it). Had to take out a personal loan for an emergency home repair that insurance wouldn’t cover fully. Credit has dropped. \n\nI also cannot explain why a dealership would allow me to drive off in a vehicle for six weeks and to this day have not said a word about not being paid. That’s why I’m here because I don’t know what to do.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "memefaliure",
                    "body": "Its probably a credit union. Good standing members get better rates, my credit card is 8.2% and my motorcycle loan from last year is 3.5%.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "legaladvice-ModTeam",
                    "body": "*Your post may have been removed for the following reason(s):*\n\n**Personal Attack or Otherwise In Poor Taste**\n\nYour comment has been removed because it contains a personal attack or is otherwise a tasteless comment.  Please review the following rules and focus on answering legal questions instead of insulting others.\n\n* [Commenting Rules 5](https://www.reddit.com/r/legaladvice/wiki/index#wiki_5.__comments_serving_only_to_berate_others_are_off-topic.) and [7](https://www.reddit.com/r/legaladvice/wiki/index#wiki_7.__disagreements_are_fine.2C_but_disagreement_should_be_done_respectfully_and_with_detail.__simply_stating_.22you.27re_wrong.22_is_not_appropriate.__similarly.2C_do_not_respond_poorly_if_challenged_respectfully.)\n\n\n\n*Please [read our subreddit rules](https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules).  If after doing so, you believe this was in error, or you’ve edited your post to comply with the rules, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdvice).* **Do not make a second post or comment.**\n\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -11,
            "replies": [
                {
                    "author": "legaladvice-ModTeam",
                    "body": "*Your post may have been removed for the following reason(s):*\n\n**Speculative, Anecdotal, Simplistic, Off Topic, or Generally Unhelpful**\n\nYour comment has been removed because it is one or more of the following: speculative, anecdotal, simplistic, generally unhelpful, and/or off-topic.  Please review the following rules before commenting further: \n\n* [Commenting Rules 1](https://www.reddit.com/r/legaladvice/wiki/index#wiki_1.__comments_should_contain_a_legal_answer_or_a_strongly_related_non-legal_answer.), [2](https://www.reddit.com/r/legaladvice/wiki/index#wiki_2.__personal_anecdotes_are_off-topic.), [3](https://www.reddit.com/r/legaladvice/wiki/index#wiki_3.__explanations_of_the_law_in_jurisdictions_other_than_the_one_described_in_the_op_are_off-topic.), [4](https://www.reddit.com/r/legaladvice/wiki/index#wiki_4.__opinions_on_the_law_or_the_application_of_it_are_off-topic.), [6](https://www.reddit.com/r/legaladvice/wiki/index#wiki_6.__expressions_of_sympathy_without_corresponding_legal_help_is_off-topic.), [8](https://www.reddit.com/r/legaladvice/wiki/index#wiki_8.__comments_should_be_reasonably_detailed_and_explanatory.__.22i.27m_a_lawyer_so_listen_to_me.22_isn.27t_an_appropriate_answer.__credential_fights_are_not_appropriate_here.), and [9](https://www.reddit.com/r/legaladvice/wiki/index#wiki_9.__requests_for_updates_are_off-topic.).\n\n\n\n*Please [read our subreddit rules](https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules).  If after doing so, you believe this was in error, or you’ve edited your post to comply with the rules, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdvice).* **Do not make a second post or comment.**\n\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}