{
    "title": "Charges dismissed, now what to do about being shot for no reason, outstanding bond owed?",
    "author": "Relevant-Ad-7430",
    "subreddit": "legaladvice",
    "rank": 7,
    "score": 41,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/legaladvice/comments/1je9k9q/charges_dismissed_now_what_to_do_about_being_shot/",
    "id": "1je9k9q",
    "selftext": "Last year, my fiance, \"Brad\", was shot by a neighbor while they were watching a game and drinking beer together at the neighbor's apartment. According to my fiance and a witness, the incident started over a minor disagreement that quickly escalated to an unarmed Brad being held in the apartment by the neighbor blocking the door with a bat in his hand to the neighbor shooting him. Brad lost consciousness just as help arrived, and woke up shackled to a hospital bed with an officer sitting guard. He was confused but figured that they'd sort it out in court. He was a victim, so why the shackle, etc.?\n\n Long story short, the neighbor lied to the police and said he shot Brad because he kicked his door in and threatened him with a bat. The neighbor was arrested, but quickly released on bond. His only charge was possession of a firearm by a convicted felon. My fiance could only guess that it was being handled like a domestic dispute and that they were both charged pending a determination in court of who was the aggressor. In the meantime, I had to pay a percentage of a $50,000 bond that devastated my finances. We were also evicted because the neighbor had been living in the complex for a lot longer than we had, and he told the landlord the same lie he told the police. The eviction was dismissed because when they were supposed to bring in evidence that Brad broke in, the landlord didn't show up. We realized why a few weeks later, when our lease came up for renewal and they exercised their right to not renew it without giving a reason. \n\nToday, Brad's charges were dismissed! We're thrilled, but what about the fact that this man shot him without a good reason? I see him as a threat to the public, and feel certain that it will happen again! We were very hurt and angry about having to move. Also, a few months later, we found out that blood clots had formed in Brad's legs after the injury. He was incarcerated afterward, and unable to move around, and the doctor says this is a direct result of not getting enough exercise in the days and weeks after being shot, but my fiance had no aftercare or discharge instructions in jail and was not allowed outside or anything. He never thought about needing to move around. I just feel he was wronged, and it's set us back a lot. Is there any recourse? I know the bond agent is still out money that they put up for him to get out, but doesn't the court have to return that money to the bondsman, so what happens with the balance I owe?\n\nUse location: Baton Rouge",
    "comments": [
        {
            "author": "reddituser1211",
            "body": "You don’t handle “threat to the public.”  You don’t because, as you say, you have strong feelings about this. You’re not the right arbiter of justice. \n\nIf you have tangible loss, sue. If you don’t this is done.  Costs related to your fiancé’s arrest aren’t losses you’ll win here.",
            "score": 62,
            "replies": [
                {
                    "author": "Relevant-Ad-7430",
                    "body": "It just seems very unfair that he lied about Brad breaking in, so they charged him with second-degree battery for hitting the man with a bat, which he didn't. It's a fact that he was shot, but no charges were brought against him? I do understand and accept what you are saying about me not being the \"right arbiter of justice,\" but does that mean there should be none? Brad did nothing wrong, yet his life has been disrupted, along with mine. It just feels unfair, especially the way he was treated like a criminal instead of a victim. I appreciate your reply, and wish you all the best.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "thesybiancontroller",
                            "body": "NAL Felon in possession of a firearm and no charges? Run that up the flag pole, chief of police, ADA, your senator. I thought police like felony arrests?",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Steve_Streza",
            "body": "You can file a police report about the incident from your perspective. The police and district attorney can decide if that qualifies Neighbor as a threat to the public.\n\nIf you are concerned about Neighbor assaulting again, you can file with your local court for a restraining order against Neighbor. They may grant a temporary order until Neighbor can be notified officially and a hearing can be set. If a judge rules in your favor, you'll be issued a long-term protective order.\n\nIf you want to pursue damages, you will have to sue Neighbor in a civil court. Louisiana's small claims court limits at $5,000 and I would wager that your expenses are higher than that. So you'd probably want to speak to an actual lawyer in Louisiana about this who can advise you further.\n\nLandlord is likely under no obligation to extend a new lease if they don't want to, regardless of if the reason they don't want to is because someone lied to them.\n\nRegarding the bond, call the court that dismissed Brad's charges and get a written confirmation that the bail has been refunded to the bond agent. What happens after that is probably spelled out in your bond contract.",
            "score": 15,
            "replies": [
                {
                    "author": "Relevant-Ad-7430",
                    "body": "Thank you so much!! I'm just glad that someone finally acknowledges that this is not the way he should have been treated. I know it sounds crazy that he'd get shot \"for no reason,\" but that's why I'm concerned about the guy walking around free - he's a bad alcoholic who apparently can count violence amongst the bad behaviors alcohol elicits from him.   \n  \nThey both signed restraining orders when they were still incarcerated, but I may need to check if we need to follow up, so thank you for bringing it to my attention that it may be temporary. You are correct that my expenses have been more than that! I quit keeping track of that number.   \n  \nI doubt the man has any money to sue him for and honestly, I just want him to know that he can't go around making false accusations without consequence, and to understand what the impact on us has been! If we can recover some of that, great! I realize it's a long shot.   \n  \nAs for the bond, I'll do that and hope for the best. You made me feel a lot better about the whole thing. Thanks again.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Steve_Streza",
                            "body": "I definitely empathize with the situation you find yourself in, it sounds rough to be in your shoes with your partner through jail and medical like that. As this is a legal subreddit we tend to focus just on the facts that matter to your legal options and less the circumstances, because part of the point of law is to try to remove emotion from decision making. The downside to that is acknowledging the part of law that gives Neighbor protections too, and it's just not enough for you or us to say that Neighbor is a threat, it has to come from a prosecutor in order for anything to happen.\n\n>They both signed restraining orders when they were still incarcerated, but I may need to check if we need to follow up, so thank you for bringing it to my attention that it may be temporary. \n\nIn Louisiana it sounds like the legal term for a temporary restraining order \"temporary restraining order\" for a temporary one and \"long-term protective order\" for a more permanent one.\n\n>I doubt the man has any money to sue him for\n\nIf Neighbor holds a steady job with a paycheck, and you sue and obtain a judgement from a court, you can use that judgement to garnish a portion of his wages. If he has any property, you could also put a lien against it if he tries to sell. And as the other commenter mentioned, he may have insurance which you can claim for damages.\n\nBest of luck to you.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "eugenedebsghost",
                            "body": "He may have had renters insurance that could cover injury on the property.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Relevant-Ad-7430",
                                    "body": "Ah, yes! Never thought of that! Thanks!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "thesybiancontroller",
                                            "body": "On that note the apartment let a convicted felon rent may be some liability there may depend on the priors",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}