{
    "title": "The only benchmark that matters after you build a new pc, a FitGirl install",
    "author": "kloudykat",
    "subreddit": "Piracy",
    "rank": 6,
    "score": 569,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 36,
    "url": "https://i.imgur.com/se98h8e.png",
    "id": "1jduxam",
    "selftext": "",
    "comments": [
        {
            "author": "MicrowavedTheBaby",
            "body": "Maybe I'm just getting old but those numbers seem ridiculously high, y'all can afford PCs like that??  What do you even need that much power for",
            "score": 116,
            "replies": [
                {
                    "author": "Frank_Punk",
                    "body": "Scrolling reddit and playing Balatro.",
                    "score": 164,
                    "replies": [
                        {
                            "author": "Ashamed-Ad4508",
                            "body": "I thought it was solitaire 🤪",
                            "score": -55,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wild_Swimmingpool",
                    "body": "Screenshot you can see the GPU is listing as RTX 50...something. I wouldn't be shocked if this is a 9800x3d / 5090 build. You either have no money issues or you cause one buying that kinda rig. You're looking at $2500 for just the GPU and CPU. EDIT: Assuming you get both at MSRP which is very very unlikely for a 50 series GPU.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Toonomicon",
                    "body": "Tbf the 9800x3d (and 7800x3d) is a phenomenal deal of a chip, especially if you get a microcenter bundle. The price to performance is basically unmatched in gaming scenarios.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Imaginary_Time1724",
                    "body": "youtube",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "SofiaOfEverRealm",
                    "body": "Triple A game devs: Challenge Accepted",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "odane2",
                    "body": "you're getting old and never saw a high end cpu before until now?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "TheIncarnated",
                    "body": "As someone who works in IT with cloud and on-prem infrastructure, it's great to have a gaming pc moonlight as a homelab. It excuses the cost but it also provides me with what I need",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ConfusionSecure487",
                    "body": "Extracting games",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BUDA20",
            "body": "I usually set the CPU to power save with 80% max CPU, and the process to idle, it doesn't affect the seeped that much, and is cool and unintrusive as possible, come back to Balanced 100% afterwards",
            "score": 14,
            "replies": []
        },
        {
            "author": "tehlolman1337",
            "body": "the kids arent alright :(",
            "score": 29,
            "replies": []
        },
        {
            "author": "Still_Steve1978",
            "body": "Haha imagine Linus tech tips using this as one of their metrics. Love it. Who actually runs blender anyway 😂",
            "score": 10,
            "replies": []
        },
        {
            "author": "kloudykat",
            "body": "Time Spy?  Cinebench?  What's that?  \n\nFitGirl is the only benchmark I trust.",
            "score": 33,
            "replies": [
                {
                    "author": "Vellc",
                    "body": "wdym? You should aim for 40 degrees full load",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "A4K0SAN",
            "body": "my cpu goes to like 91c",
            "score": 4,
            "replies": []
        },
        {
            "author": "StickStroker",
            "body": "5.3ghz sustained all core? Are you undervolting at all?",
            "score": 7,
            "replies": []
        },
        {
            "author": "guinomim",
            "body": "Never heard of that, im beginner. Today i took like 3-4 minutes to install spiderman miles morales, is this good?",
            "score": 7,
            "replies": [
                {
                    "author": "kloudykat",
                    "body": "whenever reviewers test video cards the use benchmarking software to give you an abstract number on the performance of the card.\n\nthis also goes for the CPU, RAM, the entire PC, and so on.\n\n[3DMark is ubiquitous benchmarking software](https://benchmarks.ul.com/3dmark), as is [Cinebench](https://www.maxon.net/en/downloads/cinebench-2024-downloads) but there are many others out there.\n\nI don't have Spiderman Miles Morales, but if I do get it, I will time my install and let you know how long it took ok?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "guinomim",
                            "body": "I know what a benchmark is, just never heard of this exquisite benchmark",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Reddity65",
                                    "body": "FitGirl repacks are very very compressed versions of games, so they need lots and lots of CPU power to extract and install them.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Upbeat_Fox4240",
            "body": "Lower processor affinity, your cpu will love it",
            "score": 1,
            "replies": []
        },
        {
            "author": "KangarooRemarkable21",
            "body": "Bro what's your gpu?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdultGronk",
            "body": "If you've got a build like that, I'm sure you must have a good internet connection too, so why waste your time installing from Fitgirl every time, it's for people with bad internet, that's why the games are highly compressed, just download pre-installed games from Steamrip, Gog Games, etc.",
            "score": -5,
            "replies": [
                {
                    "author": "Fantastic_Parsley986",
                    "body": "prob because fitgirl is more trustworthy and some stuff isnt available on gog-games",
                    "score": 11,
                    "replies": [
                        {
                            "author": "AdultGronk",
                            "body": "Isn't trust subjective ?\n\nAlso here's all the DDL sites - https://fmhy.pages.dev/gamingpiracyguide#download-games",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Fantastic_Parsley986",
                                    "body": "yeah, it is subjective, but fitgirl, despite being just a repacker, has been on it for quite a while. also, we dont really know how the starred websites are evaluated, so i personally dont trust ALL of them. by experience my only triad are fitgirl, gog-games and cs-rin",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Minute-Line7955",
                                            "body": "if you already know cs.rin, then you never need to use fitgirl or gog-games lmao. gog-games is just a clone site that takes games from GOGFAN, a member at cs.rin. whereas fitgirl always repackages games taken from scene.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Fantastic_Parsley986",
                                                    "body": "It's not a matter of need, it's just more convenient. Same reason I buy some stuff from steam at times",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Frequent-Trifle-4093",
            "body": "Sh!tGirl",
            "score": -6,
            "replies": [
                {
                    "author": "JustSylend",
                    "body": "why mad",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Frequent-Trifle-4093",
                            "body": "they have sh!tty setups, it's not 2012 anymore, there are far better alternatives",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "JustSylend",
                                    "body": "like? what others are as trust worthy and \"better\"? why are you censoring \"shitty\"?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Frequent-Trifle-4093",
                                            "body": "dodi is a better alternative, and their setup is much faster than fitgirl's and In a game I played, the word 'shitty' was banned, so I started censoring it while typing, and it became a habit.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "RamenRams",
                                                    "body": "Dodi has too many fake “download” buttons that actually install malware on your pc, unlike FitGirl which has been safe for a long time",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Frequent-Trifle-4093",
                                                            "body": "uBlock Origin blocks the things you mentioned. In 2025, anyone who still doesn't use an ad blocker is an idiot and is doomed to get their pc infected with viruses.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}