{
    "title": "Never knew how hard it was to delete subscription accounts",
    "author": "Tribble_Slayer",
    "subreddit": "Piracy",
    "rank": 4,
    "score": 122,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Piracy/comments/1je6h0w/never_knew_how_hard_it_was_to_delete_subscription/",
    "id": "1je6h0w",
    "selftext": "Over the past couple of years I cancelled all of my subscriptions, have setup a 54tb NAS, a Jellyfin server, and all the bells and whistles that go along with that for locally hosted streaming. Currently in the process of switching all of my online accounts to a new email provider with aliases while permanently deleting a ton of old accounts I’ll never use again.\n\nI never realized how much they make it a pain in the ass to permanently delete some accounts; not just cancelling the subscription but removing your account entirely. I just wasted 40 minutes of my life with Paramount+ support deleting my old Paramount+ account because they don’t offer any option for users to permanently delete their accounts themselves. I have now dealt with multiple other companies who did this already and 9/10 times subscription services make it confusing and hard as hell to do this or to where you have to do a whole conversation with their support before deleting your data.\n\nAs Gabe from Steam said “Piracy is a service issue.” and I absolutely feel that today. Much love to you all, thanks for all the fish!",
    "comments": [
        {
            "author": "taimur1128",
            "body": "Man.. 54tb ! And I'm all happy with 3 or 4tb between SSD and some HDD I have laying around. \n\nGood luck with your path.",
            "score": 29,
            "replies": [
                {
                    "author": "Tribble_Slayer",
                    "body": "Still have room for one more 18tb HDD in the NAS! I’ve still got 10tb free (it’s in RAID 5) still so probably won’t need a 4th 18tb drive for a long time.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "VintageLV",
            "body": "Some states have laws requiring access to request your account be deleted, or *forgotten*. Where are you located?",
            "score": 22,
            "replies": [
                {
                    "author": "Tribble_Slayer",
                    "body": "TX\n\nEdit: knowing Texas, this is highly unlikely to exist for us.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "VintageLV",
                            "body": "Actually, the Texas Data Privacy and Security Act (TDPSA) allows for you to request your information be removed. You can use YourDigitalRights.org, also.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Tribble_Slayer",
                                    "body": "I gotcha, but even if theyre forced to allow users to request deletion, it unfortunately doesn’t mean that they’ll make it any easier for users to go through the process.\n\nI am thankful that none of my piracy type services make these things that difficult!",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Yamza_",
            "body": "Got any recommendations on HDDs?",
            "score": 4,
            "replies": [
                {
                    "author": "Tribble_Slayer",
                    "body": "Not specifically (don’t even remember what mine are) but they were manufacturer recertified off of [ServerPartDeals](https://serverpartdeals.com)\n\nThe main thing especially if you’re running a NAS is digging deep to figure out what kind of technology you need in the HDD to make sure it can work in RAID or with your NAS. Took me a while to figure out exactly what kind of drive specifically I needed for mine to get the most out of it.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "FblthpTheFound",
                            "body": "Ooo saving that site for later. I also have a free bay on my NAS and am just waiting to see how long i can hold off dropping more money into it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thetrollolol",
            "body": "What's your Nas setup? And by bells and whistles what do you mean? I'm looking to get jellyfin setup myself",
            "score": 2,
            "replies": [
                {
                    "author": "FblthpTheFound",
                    "body": "This website really helped me get mine started. https://drfrankenstein.co.uk/\n\nIt basically helps you set it up so the NAS will search for torrents, download them, and manage your media library all automatically. I don't have it set up 100% of the way myself for full automation but its still pretty helpful",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eldergrise",
            "body": "I'm glad that the EU has laws to prevent companies from not letting you easily delete accounts...",
            "score": 1,
            "replies": []
        },
        {
            "author": "evia89",
            "body": "Whats the point of 54 tb? We just watch once, seed a week then delete",
            "score": 1,
            "replies": []
        }
    ]
}