{
    "title": "\"I can do this all day\"",
    "author": "_Lucifer7699_",
    "subreddit": "wholesomememes",
    "rank": 332,
    "score": 4986,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 65,
    "url": "https://i.redd.it/l2zu8h223gfd1.png",
    "id": "1eexbw7",
    "selftext": "",
    "comments": [
        {
            "author": "Emotional_Fee3637",
            "body": "I didn’t hear no bell",
            "score": 208,
            "replies": [
                {
                    "author": "Gjappy",
                    "body": "Dingding 🔔",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nankasura",
            "body": "That Captain America scene where Thanos slams him to the ground, everyone around him getting their shit kicked in, but he stands up and tightens his shield around his arm. No words said. \n\nThat's what hope is to me.",
            "score": 205,
            "replies": [
                {
                    "author": "jcilomliwfgadtm",
                    "body": "A professor told me this once: hope is like the thin stand of silk that holds a cocoon to a branch during a storm.  Looks delicate but strong beyond imagination.",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "spaceprotocol",
                    "body": "This is one of my favorite scenes in any movie. I genuinely tear up everytime I see it.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "amican",
                    "body": "A favorite comic book moment, Wolverine to Ms. Marvel: \"The only thing worth calling a superpower is the ability to keep getting back up. Everything else is just special effects.\"",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConfidentValue6387",
            "body": "I think that’s more likely ”grit” or ”perseverance”. But those are also really, really good personality traits… or states of mind, depending on context.",
            "score": 75,
            "replies": [
                {
                    "author": "ogodilovejudyalvarez",
                    "body": "They confused determination with hope but, yes, it's still a nice sentiment",
                    "score": 40,
                    "replies": [
                        {
                            "author": "Ubiquitous_Mr_H",
                            "body": "I don’t think they confused anything. They’re not saying being hopeful includes these things. They’re saying hope, as a concept, doesn’t give in. It keeps fighting.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "Fen5601",
                                    "body": "I think it's hope cause at that point, Cap KNEW he was out gunned, Thanos and his crew had just blown up the Avengers Compound, reinforcements had not arrived yet, but he had go get up and keep going. He HAD, too. So he stood up, tightened his broken shield, and was ready to die on his fest against a villain that had beaten him, Thor and Tony nearly to a pulp.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gregorydgraham",
                            "body": "💯",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Acceptable_Bottle",
                    "body": "I think the poster is trying to argue that grit and perseverance are essential components of hope. Hope is meaningless if it can easily be washed away in struggle",
                    "score": 12,
                    "replies": [
                        {
                            "author": "QJ-Rickshaw",
                            "body": "Basically, if you never had hope, why would you ever persevere?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ConfidentValue6387",
                            "body": "Could be! Gets you thinking. You can always think on how different mindsets are alike and how they differ.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LarxII",
                    "body": "I don't know, I'm a pretty gritty individual. But I turn it against myself sometimes by being so damn stubborn to make it easier on myself. All things in balance I guess.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "flamekaaizerxxx",
            "body": "Hope is when Captain America, all alone, bruised and battered, walked up to an intergalactic army led by a mad titan.",
            "score": 68,
            "replies": []
        },
        {
            "author": "Henkotron",
            "body": "I just finished watching Arcane again. And I instantly thought of Vi",
            "score": 21,
            "replies": [
                {
                    "author": "TheBirminghamBear",
                    "body": "I didn't even watch it recently and thought the same thing haha.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Asuna-nun",
            "body": "I love this",
            "score": 10,
            "replies": []
        },
        {
            "author": "X_Ender_X",
            "body": "read it in his voice. Bravo!",
            "score": 9,
            "replies": [
                {
                    "author": "_Lucifer7699_",
                    "body": "As I was reading this, my brain was simultaneously picturing up Steve Rodgers in that alley.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sicsurfer",
            "body": "Fuck ya! I needed that, thanks",
            "score": 8,
            "replies": []
        },
        {
            "author": "SilverWolfIMHP76",
            "body": "I play dungeons and dragons. I just got inspired for my next character.",
            "score": 8,
            "replies": [
                {
                    "author": "Legitimate_Estate_20",
                    "body": "Zealot Barbarian Halfling named Hope, just scrappy as hell, would be a fun character.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Levanthalas",
            "body": "No reason it can't be both. \n\nIt can be the light of a single star, piercing the dark, to remind you there's more out there than whatever you're dealing with. Unbreakable, unstoppable, but untouchable. It doesn't change your situation. You can't touch it, or even feel it, just...see it. Sometimes not even that, when the clouds come, you just have to know it's there. \n\nIt can be the sound of trumpets and horns heralding reinforcements, the thunder of battle as your unlooked for allies ride to the rescue. Loud, brash, impossible to ignore, sweeping aside everything that stands between you and something better. \n\nIt can be a breeze. Quiet. Invisible, barely felt, but it brushes aside the miasma that's been following you, letting you breathe again. Only for it to come back worse than before as the wind shifts. \n\nIt can be a moment of silence, so easily shattered when the yelling starts again. \n\nIt can be all those, and more. \n\nHope doesn't get you back up.\nIt isn't even why you get back up.\nIt just shows you that you can.",
            "score": 7,
            "replies": [
                {
                    "author": "SirBananaOrngeCumber",
                    "body": "This is the most beautiful thing I have ever read. Thank you for sharing it 🥰",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Levanthalas",
                            "body": "Thank you, that's very kind.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Country_Gal_87",
            "body": "Good lord I felt this ^^^^",
            "score": 6,
            "replies": []
        },
        {
            "author": "designerjeremiah",
            "body": "I get it.  Hope isn't always something to carry you through the dark.  Sometimes you have to carry it, force yourself to hope, keep hoping when everything in you wants to give up, curl up in a ball, and die.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Mysterious_Ningen",
            "body": "yea that's nagito hahah\n\nbut seriously tho i've been hurt so bad by my ocd thoughts and i've wanted to die.. but me having hope and just trying to be okay took effort but i've healed a bit.. so yeah.  having hope is nice",
            "score": 5,
            "replies": []
        },
        {
            "author": "Mk7613",
            "body": "Yep",
            "score": 3,
            "replies": []
        },
        {
            "author": "mojio33",
            "body": "It sounds more like motivation than hope imo",
            "score": 3,
            "replies": []
        },
        {
            "author": "gregorydgraham",
            "body": "Nah mate, that’s determination",
            "score": 3,
            "replies": []
        },
        {
            "author": "BuilderSubstantial47",
            "body": "Oh, this made my evening. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "jagadoor",
            "body": "While thats a picture I agree with I also want to leave a warning behind. Sometimes its not good to rise to the challenge over and over again even if your body is telling you no. Giving up hope is not always a bad thing because hope can be a prison aswell.",
            "score": 2,
            "replies": [
                {
                    "author": "_Lucifer7699_",
                    "body": "Agreed.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unkown_Error572",
            "body": "i didnt know i needed to read this today, thanks random person on the internet",
            "score": 2,
            "replies": []
        },
        {
            "author": "Additional_Effort_33",
            "body": "And when hope is hurt, sister grace shows up with the lawn mower",
            "score": 2,
            "replies": [
                {
                    "author": "amiitoocool",
                    "body": "Nah i think she'd use a shythe",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Additional_Effort_33",
                            "body": "Whatever works, she'll have it with, guaranteed.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "amiitoocool",
                                    "body": "Fax",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thendershot",
            "body": "I’d highly recommend reading the small except from one of Theodore Roosevelt’s speeches titled “Man in the Arena”. This encapsulates this idea incredibly well!",
            "score": 1,
            "replies": []
        },
        {
            "author": "split_0069",
            "body": "Ahh... Hope is a trilla...",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "This reminded me of my favorite section in a book full of lessons",
            "score": 1,
            "replies": []
        },
        {
            "author": "Additional_Effort_33",
            "body": "Hope and grace are like trying seperate magnets.  You might get lucky somtimes but, you endup feeling afool and setting the whole shit show down before anyone sees",
            "score": 1,
            "replies": []
        },
        {
            "author": "NecessaryUnited9505",
            "body": "hope is that one lone person in your head dirty and bleeding but makes you confident somehow",
            "score": 1,
            "replies": []
        },
        {
            "author": "lelouch_0_",
            "body": "Just to be clear, we are not talking about charmcaster, right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "balalaikagam3s",
            "body": "Nah, that some’s more like grit, determination or perseverance but, y’know, to each their own.",
            "score": 0,
            "replies": []
        },
        {
            "author": "NoistMipples",
            "body": "Why does hope have a gender? Who is hope? Why is she so popular",
            "score": 0,
            "replies": [
                {
                    "author": "Reddit_Amethyst",
                    "body": "i Hope you well understand that Hope is a given female name",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -10,
            "replies": [
                {
                    "author": "PeridotChampion",
                    "body": "Didn't have to make it political, but okay \n\nAlso, not everyone on here lives in America",
                    "score": 4,
                    "replies": [
                        {
                            "author": "BitchyBeachyWitch",
                            "body": "Oh, that's the crowd I'm with?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DigitalAmy0426",
                                    "body": "The point is you as a person having hope, not a political figure.\n\nI'm voting for her and I still think the comment should be DV. Time and place.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "BitchyBeachyWitch",
                                            "body": "Wow, ok?",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ImpIsDum",
                    "body": "Sir this is a Wendys",
                    "score": 4,
                    "replies": [
                        {
                            "author": "BitchyBeachyWitch",
                            "body": "Bitch, please 🙅‍♀️",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ImpIsDum",
                    "body": "Sir this is a Wendys",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "ImpIsDum",
                                    "body": "PK Fire",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}