{
    "title": "Jon Bon Jovi ",
    "author": "None",
    "subreddit": "wholesomememes",
    "rank": 327,
    "score": 2802,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 43,
    "url": "https://i.redd.it/z8wl2gj8nwfd1.jpeg",
    "id": "1egvv7q",
    "selftext": "",
    "comments": [
        {
            "author": "DerBlarch",
            "body": "Jon Bon is a legend. His [restaurant](https://jbjsoulkitchen.org) has been \"pay what you can\" since it opened, and he is a true philanthropist. He's one of the few celebs that I look up to.",
            "score": 282,
            "replies": [
                {
                    "author": "Sorry-Awareness-1444",
                    "body": "Glad to hear this! There ain’t too many of them who are like this.",
                    "score": 53,
                    "replies": []
                },
                {
                    "author": "Unusual_Car215",
                    "body": "I hope Dee Snider is on your list!",
                    "score": 15,
                    "replies": [
                        {
                            "author": "DerBlarch",
                            "body": "He is on the list since the 90s of the last century. \nThanks to Vanessa Warwick and Headbanger's Ball!",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Unusual_Car215",
                                    "body": "Nice! Happy to hear it :)",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "milano8",
            "body": "Lets celebrate that he's a decent person, and that there are other many, many, MANY decent people like him who volunteer in homeless shelters, animal shelters, and charity organizations all across the world for little or no payment in money or religious promises.\n\nIMO they are all Rock Stars.",
            "score": 68,
            "replies": [
                {
                    "author": "anotherthing612",
                    "body": "Absolutely. But the reason this stands out is that it's rare to see someone who has so much money, power and fame do the actual work as opposed to writing checks. So we make (positive) assumptions about his character.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "milano8",
                            "body": "True, and i'll give him credit because he's not doing this for popularity - he's actually invested and this picture doesn't look posed or photoshopped. \n\nThere are other stars who do the same thing for the photo-op though. That's why my original comment was to treat others, like JBJ, with credit and praise equally.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "anotherthing612",
                                    "body": "Well-said",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shaolinchipmonk",
            "body": "There's a reason he's New Jersey royalty",
            "score": 55,
            "replies": []
        },
        {
            "author": "ghoststegosaur",
            "body": "I once mispronounced his name. And it never gets out of my head..\nJon Jon Bovi.",
            "score": 48,
            "replies": [
                {
                    "author": "Hopeful_Judge_10",
                    "body": "Mr. Bovine Joni",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "inunanimous",
                    "body": "JoJo Bovi Adventure",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kithsander",
            "body": "Had a chance to sit down with someone who had been at a prominent, major metropolitan area radio station dj for over thirty years. We talked a lot about the music industry, music genres, people’s tastes and how things have changed. He made a point of dropping only two names. He said Melloncamp is absolutely the biggest douchebag diva you’ll ever come across in life if you lived a thousand years but Bon Jovi was the kindest most down to earth person you’d ever cross paths with. That last part was really driven home too.",
            "score": 42,
            "replies": []
        },
        {
            "author": "Definitelyahummus",
            "body": "🐐",
            "score": 29,
            "replies": []
        },
        {
            "author": "VanillaB34n",
            "body": "Even if you don’t know who he is, you’ve likely heard his music at least once. He’s a real icon",
            "score": 13,
            "replies": []
        },
        {
            "author": "Yobber1",
            "body": "He’s living on a prayer.",
            "score": 27,
            "replies": []
        },
        {
            "author": "Irresponsable_Frog",
            "body": "Just imagine being someone who wants no publicity for giving back or a photo op? Someone who truly loves to give back. A man modest enough not to speak about what he does because the people he helps know, and that’s all he needs. That’s this man. Never been a fan of him, and I grew up during his era music. But I respect the hell out of someone who doesn’t just say you should do something. I’ll be a fan of his for this alone.",
            "score": 8,
            "replies": []
        },
        {
            "author": "testraz",
            "body": "jon bon jovi is a fucking icon",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "Don’t like his music, but he seems like a solid dude. Need more people like him.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Neat-Engineering-513",
            "body": "🎶Once upon a time\nNot so long ago\n\nTommy used to work on the docks\nUnions been on strike\nHe's down on his luck... it's tough, so tough\nGina works the diner all day\nWorking for her man, she brings home her pay\nFor love - for love\n\n🎶She says we've got to hold on to what we've got\nCause it doesn't make a difference\nIf we make it or not\nWe've got each other and that's a lot\nFor love - well give it a shot\n\nWhooah, we're half way there\nLivin on a prayer\nTake my hand and we'll make it - I swear\nLivin on a prayer\n\nTommy's got his six string in hock\nNow he's holding in what he used\nTo make it talk - so tough, it's tough\nGina dreams of running away\nWhen she cries in the night\nTommy whispers baby it's okay, someday\n\nWe've got to hold on to what we've got\nCause it doesn't make a difference\nIf we make it or not\nWe've got each other and that's a lot\nFor love - well give it a shot\n\nWhooah, we're half way there\nLivin on a prayer\nTake my hand and we'll make it - I swear\nLivin on a prayer\n\nWe've got to hold on ready or not\nYou live for the fight when it's all that you've got\n\nWhooah, we're half way there\nLivin on a prayer\nTake my hand and we'll make it - I swear\nLivin on a prayer🎶\n\n\n- Jon Bon Jovi / Desmond Child / Richard Sambora",
            "score": 6,
            "replies": []
        },
        {
            "author": "LaserGadgets",
            "body": "I know who he is, I love him, and now even a bit more <3",
            "score": 5,
            "replies": []
        },
        {
            "author": "rachelvs1",
            "body": "LEGEND nuff said  👏🏻",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "Big heart.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ColdOutlandishness36",
            "body": "Some people talk the talk. Only a few walk the walk.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Beezelbub_is_me",
            "body": "The hero we need but don’t deserve",
            "score": 3,
            "replies": []
        },
        {
            "author": "solarblack",
            "body": "some people are epic by default, even before they make music!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThatSmartIdiot",
            "body": "I once thought kevin bacon (from the gotg christmas special) was jon bon jovi for a second tbf",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "Me too 😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anotherthing612",
            "body": "Me, too. I admit Im not into his genre of music. But he always seemed like a classy, kind guy based on multiple interviews. And knew nothing about this place. Respect.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Last-Percentage5062",
            "body": "One of the only good celebrities, imo.",
            "score": 1,
            "replies": [
                {
                    "author": "ExhibitionistBrit",
                    "body": "Plenty of good celebrities it's just celebrities tend to make the news on their worst days.\n\nWe all have awful days where we wish we could undo our behaviour.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RexImmortall",
            "body": "Hell yeah ; and the great thing is he's not tryn to showoff like most celebs do ; guy is just doing his duty and giving back to society.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mcgibbleduck",
            "body": "He’s gonna live while he’s alive, he’ll sleep when he’s dead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Matthew 6:1-4\n\n\"“Be careful not to practice your righteousness in front of others to be seen by them. If you do, you will have no reward from your Father in heaven.\n\n2 “So when you give to the needy, do not announce it with trumpets, as the hypocrites do in the synagogues and on the streets, to be honored by others. Truly I tell you, they have received their reward in full. 3 But when you give to the needy, do not let your left hand know what your right hand is doing, 4 so that your giving may be in secret. Then your Father, who sees what is done in secret, will reward you.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Decent_Ad440",
            "body": "The best way to convince people to help others is not to just donate money.  \nBut to be there, work in person and also help people to help themselfs",
            "score": 1,
            "replies": []
        },
        {
            "author": "anewcynic",
            "body": "JBJ is just a good soul.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Le internet: \"Wowow he works in soup kitchen\"\n\nBon Jovi \"It's my life\" 🎶🎼\n\nI'll show myself out",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darth-Squider",
            "body": "Community hours? :)",
            "score": -9,
            "replies": []
        }
    ]
}