{
    "title": "A father being wholesome",
    "author": "Derrick_King",
    "subreddit": "wholesomememes",
    "rank": 302,
    "score": 17042,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 227,
    "url": "https://i.redd.it/uvyd5wdf46id1.jpeg",
    "id": "1eq5l3d",
    "selftext": "",
    "comments": [
        {
            "author": "RandomBlueJay01",
            "body": "Gonna remember this if I have kids. Fuck the way something like that would have helped me as a kid but my parents were the type to cause me to feel like a disappointment .",
            "score": 2166,
            "replies": [
                {
                    "author": "chemicalnachos",
                    "body": "I consider myself a great Dad. Do you know how much time and effort I've spent with positive reenforcement with them over the years? I can't count. It takes a lot of work to not only help them not listen to the world's negativity about them but it's even more important to help shape their own self image and make them realize that their inner voice should be full of love and grace. We are all too hard on ourselves and I've seen the damage it causes full grown adults.",
                    "score": 203,
                    "replies": [
                        {
                            "author": "RandomBlueJay01",
                            "body": "I've only realised as an adult how much damage a bad childhood did , my family keeps pushing me to have kids (I'm almost 23 and my mom had her first kid at 21 and i think my dad was my age) but I keep saying I don't want to have any soon cus I know I'm not ready. I know if I did now I'd be a shit dad . I refuse to repeat the pattern. Plus I wanna adopt cus I have bad genetics (plus I might not be fertile) . Idk how old your kid/kids are but I'm sure some day they'll appreciate the effort you're putting in. So many people don't do that.",
                            "score": 128,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheAnniCake",
                    "body": "Same dude. My parents even told me „Don’t beat yourself up about your grades. We’ve stopped having expectations for you, so you can’t disappoint us anymore“\n\nIt was meant well but really badly phrased",
                    "score": 392,
                    "replies": [
                        {
                            "author": "immersemeinnature",
                            "body": "Oh gosh. As a Mom, that's so crushing to hear. I'm so sorry.",
                            "score": 117,
                            "replies": [
                                {
                                    "author": "TheAnniCake",
                                    "body": "I also wasn’t the perfect daughter either. Turned out that lots of my problems were due to undiagnosed ADHD. I‘m in therapy though to work through all of this",
                                    "score": 93,
                                    "replies": [
                                        {
                                            "author": "immersemeinnature",
                                            "body": "But still... Big hugs to you. I'm happy to hear you're working through it. 🩷",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "theburnoutcpa",
                                            "body": "Same situation here, diagnosed at 31 - currently in therapy so I don't take my dad's head off.",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "Jumbo_Jetta",
                                            "body": "I'm seeing adhd in every thread lately.  just like in my damn head.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Worried_Train6036",
                                            "body": "my brothers the same just found out he has adhd might have autism to my parents treat him like he's sick with a disease so i'm never gonna get tested since im already the least favorite",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "caulipower2010",
                            "body": "thats actually crazy",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "BedlamAscends",
                            "body": "Stuff like this scares me... In moments of frustration or even just fatigue it's so easy to say something glib to your kids.  It's a passing moment for you but can be a core memory for them.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "house343",
                            "body": "There's no good phrasing for how they actually felt.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Boukish",
                                    "body": "telephone deer include degree shame unite bright drunk marry nail\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "wandering_goblin_",
                            "body": "Holy shiz that's something you should actually talk to someone about man, even if it's just friends or a partner.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TheAnniCake",
                                    "body": "I‘m already in therapy, no worries my friend",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "lol1231yahoocom",
                                            "body": "Weirdly they were onto something with the no expectations bit. Stop expecting that everyone will be able to conform to the same rules and practices.  The way school and many jobs work does not set certain people up for success, does it?  It’s like some of us are the proverbial round pegs being forced into a square hole and berated when we just can’t do it.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "TheAnniCake",
                                                    "body": "Absolutely! I was diagnosed with ADHD about a year ago. No wonder why I only hardly survived in school. The system is not made for the individual student.\n\nThe huge problem is also that we don’t have enough teachers to even battle this. In the US they’re way too badly paid and here in Germany most don’t wanna deal with problematic kids or they don’t wanna do Elementary schools because of the pay.\n\nWe really need a huge reform in education made by people that really know what they’re talking about, not by those who think they know what’s right.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Mundane_Tomatoes",
                                                            "body": "We didn’t get A Bs and Cs back then, we got graded by “Rarely, consistently, usually” etc. I always got Rarely’s in organization, working well with others, not being a distraction in class. I would catch so much hell for it as a child. At 28 I’m finally diagnosed with ADHD. \n\nOne day my teacher called my mom to come into class and organize my binder and papers. Most humiliating thing ever. All because they couldn’t stop and think Gee maybe he has ADHD or something going on?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "lol1231yahoocom",
                                                                    "body": "My oldest son has ADD and, unfortunately, he has this thing about admitting it, talking about it or, god forbid, getting any help. From the time he was little-really little- he would always say “I have a better way”. It was cute then but now it just breaks my heart that on top of having a problem he also has this issue that I’m not even sure there’s a label for. He was not served well in any school he attended because he could get c’s and get through but this life thing where you have to make appointments and take care of bills and change your oil. Not so much.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "wandering_goblin_",
                                            "body": "Good take care man.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mooseontherum",
                            "body": "If I got a 96 on a test my dad would ask where the other 4 marks were.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "acceptable_hunter",
                            "body": "I'm so sorry... We love you though and are proud of you!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "They are a little confused but they have the spirit",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Krimreaper1",
                            "body": "Sounds like reverse psychology.  Did your grades improve after that?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "TheAnniCake",
                                    "body": "Not at all.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SlashCo80",
                    "body": "Yep, my parents would've just yelled at me and called me lazy.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "avengedrkr",
                            "body": "Mum used to give the \"As long as you try your best, I'll always be proud of you, no matter what happens\" before the exam. And when my sister got an A in maths and said that she didn't want to do the resit so she could focus on her upcoming exams, mum hit back with the:  \n\"If you don't study, you'll fail your mocks and then you'll fail your GCSEs, you won't get into 6th form, or uni, and you'll end up working in macdonalds all your life or be on the street. Is that what you want?\". \n\nSo yeah, no stress, mum. I'll attribute that lil tantrum to my sister's stress related sleep-teeth-grinding throughout Uni and work",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Kthulhu42",
                    "body": "I passed a year at school and was happy, because I had these godawful headaches and memory issues with no known cause. School was really hard for me.\n\nMy parents asked me why I would even be proud because I only passed, I didn't get an endorsement or anything.\n\nIt messed me up. Like why bother fighting with my health and grades if it's not even worth being proud of?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "undeadusername13",
                            "body": "But you are right! Be proud of yourself! Screw your parents’ bad attitudes and backwards thinking.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "RandomBlueJay01",
                            "body": "I had undiagnosed autism and diagnosed but untreated (my mom didn't beleive me) adhd among other things. I feel this. I was happy to pass. I was smart ish I think but my brain couldn't handle school. In college I realised my adhd was so bad I could barely read without text to speech. Doing better now that I know myself a bit better but still school fuckin sucked and my family wasn't helping.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "belovetoday",
                    "body": "Yeah mine were disappointed by \"A-\" s. I think I might have weeped in relief if they had even let up for Bs being okay, nevermind this gorgeous action here. Would have made life so much lighter. \n\nWhy we putting so much pressure on our kids? We get enough of that outside of childhood.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ostodon",
                    "body": "Same. B’s weren’t good enough, and for forbid I got a C - hell broke loose. I don’t think my mom could have named two things she liked about me. Great dad here.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "lIlIllIIlllIIIlllIII",
                    "body": "My mom said I need to try harder when I got bad grades. I told her I did my best and she said “your best isn’t good enough”. That quote still sticks with me to this day. I will be a better parent.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "lostmyjobthrowawayyy",
                    "body": "Yeah I never got all As, mostly As and usually one or two Bs and for some reason I have vivid memories of my parents scolding me for it.\n\nI’ll never understand why my childhood was both so “privileged” but also so damaging.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "dazechong",
                    "body": "I will never forget bringing home 98% grade on something and I was super proud, and my mom's reaction was \"Why isn't it 100? Don't be so proud of yourself.\"\n\nI want to go back and hug that little girl and tell her that it's okay to be proud of yourself and your accomplishments.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "RandomBlueJay01",
                            "body": "I feel that. I played 3 instruments and competed playing music for adults. I was a gifted kid in school and dealt with serious bullying because I was autistic and didn't know. My parents never even tried to praise me for dealing with all the pressure. As an adult I'm having to baby myself and remind myself I am allowed to be happy with imperfect especially if I'm still learning. I mean fuck I'm still only 22. I remind myself I can make mistakes. It's so hard but I think I'm starting to get better. Can't fix my past but I'm trying to stop the patterns and my mom's voice in my head making me feel like I'm not enough.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "dazechong",
                                    "body": "Well, I'm not your parents, but I'm super proud of you. You're definitely better than good enough. Look at all the stuff you've accomplished! Let's go for ice cream.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rashkamere",
                    "body": "Should be more \"+'s\" on best daughter ever.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Fierramos69",
                    "body": "I say this by experience, not explicitly saying straight As are required but act like it’s the default expectation isn’t necessarily good either… I was in a family of successful people; some by their intelligence, some by their social skills, some trough sheer monstrous efforts, but everyone succeeded and like, as the top/second of the class and such. I grew up in that and well I wasn’t someone with enough motivation to work my ass off nor someone intelligent enough to succeed without it, so I just failed. I failed at something that my family considered a default success. Like you can’t fail to drink water, you can’t fail to be the top of your class at all time. Well I wasn’t at all, and it was the first of far too many events that lead to me losing contact with my family, friends, education, everything. And don’t get me wrong I’m to blame. But just acting as if success is a standard as simple as putting clothes to go to school, well it’s way too hard.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RandomBlueJay01",
                            "body": "Sometimes putting on clean clothes is a success in itself for some people. Hope you're doing alright now at least.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Fierramos69",
                                    "body": "Better, in a way. working a shit job with a shit pay but getting trough every day. I’m out of depression and getting out of debt soon(debt just from paying rent), but the thing is, if I followed my family’s example I would be one year away from a 100k+ salary and a successful life, but I’m now alone, friendless, and really not successful. So even tho my mental health is fine I think even on my deathbed in many years I’ll be upset of the way the events unfolded. But meh it’s on me for almost all of it so 🤷‍♂️ moral of the story if you grow up in a wealthy family that you don’t deserve, don’t fuck up, even if they have high expectations.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "slowly-rotting-dying",
                    "body": "right??? i always felt like my only real purpose was to be smart, and then i failed out of high school. never got any encouragement, just a lot of shit for not living up to the image of the golden overachiever my parents expected me to be.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "My mom refused to listen to the doctors when they told her I needed further testing for a learning disability and possible ASD. She was offended and pissed. She sat me down with a US history textbook while she knit and had me read out loud to her and if I stuttered she’d stab me with the knitting needle. “Are you stupid?” She’d ask. “No” I’d sob. “Then stop acting like it and read it right.” And the cycle would continue because I physically could not read it right.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SocialMediaDystopian",
            "body": "\"Fighting with the boys: A\"🤣\nTop freakin job Dad.\nAmazing😁\n\nI also have ASD. Also fought with the boys. Also love dogs. My dad was an arsehole though. And not your garden variety- won't smudge anyone's mind with the story. This was so genuinely heart-warming though.\n\nWarm and fuzzies now. Lovely🌱",
            "score": 791,
            "replies": [
                {
                    "author": "GrunkleTeats",
                    "body": "Would you mind telling me what ASD means? I feel like that's the kind of acronym that Google would have a hard time differentiating.",
                    "score": 114,
                    "replies": [
                        {
                            "author": "MeteorSwarmGallifrey",
                            "body": "It's Autism Spectrum Disorder. Normally people just say autism, but ASD makes is clear It's a spectrum as it affects different people in various ways.",
                            "score": 172,
                            "replies": [
                                {
                                    "author": "GrunkleTeats",
                                    "body": "Ohhh, ok thanks. Aww, what a sweet post.",
                                    "score": 51,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SocialMediaDystopian",
                            "body": "Autism Spectrum Disorder ( sometimes referred to as Autism Spectrum Difference or Autism Spectrum Condition- ASC- in autistic communities/circles. Usually just autism though)\n\nGoogle would have given you the right result. But I don't mind being asked - in fact it's nice:)\n\nThen I get to give the formal and informal (outside and inside) perspective.\n\nBut yeah- Autism Spectrum Disorder is what it stands for.",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "SocialMediaDystopian",
                                            "body": "Oh..Absolutely my bad.\nEmbarrasing. Thanks for the (very graciously delivered) slap upside the head😬👍",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Did you... try?",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "ghostlistener",
                                    "body": "I assume not, but sometimes it's more fun to ask a person than ask google.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Weird to chime in on a question just to say \"I don't know,\" but okay.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TitaniaT-Rex",
                    "body": "That’s my favorite! My daughter would receive top marks in fighting with her brother for sure.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "lol1231yahoocom",
                    "body": "Love “won’t smudge anyone’s mind”.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "SocialMediaDystopian",
                            "body": "😊",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dapper_nerd87",
            "body": "I love the implication of the A,A+ means she could indeed improve her fighting with the boys 🤣 this is sweet though.",
            "score": 301,
            "replies": [
                {
                    "author": "theoht_",
                    "body": "i feel like the variety of grades helps make it seem more meaningful while still keeping it all A’s.\n\nlike, if it’s all the same grade, it feels like the dad just chucked an A* in every category with no meaning.\n\nbut the way it is, it feels like the dad put thought into what grades are deserved (yet still kept them high).",
                    "score": 84,
                    "replies": [
                        {
                            "author": "SocialMediaDystopian",
                            "body": "I think you may have missed the point there. He's listing all the things she's \"a solid A\" at- because she already got enough feedback on the rest. 🥴\n\nAnd really....was he gonna give her a \"B\" or a \"C\" for loving dogs or drawing robots? Lol\n\nIt's a love note. A \"cheerleading\" note.\n\n(Laughing now because I'm autistic myself and I'm explaining how....not literal this was meant to be?\n\nNot a dig - in any way. Just a \"life is weird\" moment for me. Sorry. Sidetrack😜)",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "amras123",
                                    "body": "I would throw a B in there, but for something funny or inconsequential to a child. If I were the child, I would have been suspicious of all the A's, haha.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "theoht_",
                                    "body": "i think you entirely missed my point. i was just saying the variety gives proper meaning to the card, making the daughter happier",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AlkalineSublime",
                    "body": "That’s what I was thinking. I would see this and think, “so I’m pretty funny, but not A+ funny?!”",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "SocialMediaDystopian",
                    "body": "I know right? Lol. Amazing😁",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WendigoCrossing",
                    "body": "Gotta leave some room for improvement xD",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "doesitreallymattaa",
            "body": "If she got straight Ds, I hope there's some tutoring or something to go with the dad report card, to help her get them grades up",
            "score": 447,
            "replies": [
                {
                    "author": "Floor_Soft",
                    "body": "Yea I mean has this guy been reading the news and seeing how each generation is getting worse and worse academically? Supporting your kid also means making sure they hit development milestones in their education.",
                    "score": 67,
                    "replies": [
                        {
                            "author": "Chance_Fox_2296",
                            "body": "Yeah I'm sure he knows that. Holy shit, every single time a post like this appears there are people demanding an entire hour by hour replay of the family interactions that day just to make sure it's okay to smile for 10 seconds at the post and move on.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "aah_real_monster",
                            "body": "Yeah but for kids/people who are neurodivergent milestones are different across the board. A kid who gets all Ds to me sounds like the school may not be well equipped enough to support this child. \n\nLike everything there are many layers to this and no clear info on 504 or IEP we can't know what's going on.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Dull_Woodpecker_2405",
                            "body": "That just doesn't sound right. Do we have any evidence on generations getting worse and worse academically that isn't anecdotal?\n\nNot sure about the US, but I'm pretty certain in continental europe each new generation is better educated than the one before.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Pas__",
                                    "body": "one datapoint is the Flynn effect \"reversed\" \n\n\nOECD PISA averages are down in all subjects\n\nhttps://internationalednews.com/2023/12/13/scores-plummet-around-the-world-scanning-the-headlines-on-the-release-of-the-2022-pisa-results/ --- but interestingly the US scores are pretty stable \n\nhttps://nepc.colorado.edu/blog/who-benefits-when-student-pisa-scores-decline\n\n\n\nsee also\n\nhttps://en.wikipedia.org/wiki/Flynn_effect#Proposed_explanations",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "Dinorawrrrrrrrrr",
                                    "body": "In the US, standardized test scores for the previous year were the lowest they’ve ever been since the test was implemented. Standardized tests are exams every 3rd-8th grader takes on the subjects English, math, science, and social studies.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Bhaaldukar",
                                    "body": "It's really just gen alpha due to covid.  It'll be fine.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "gereffi",
                                            "body": "You can find lots of discourse on Twitter about kids these days being worse and worse in school (even aside from the covid problems). In reality it’s just like crime. We hear about violent crime constantly and it seems like society is about to hurst at the seams, but in reality violent crime is way way down compared to previous decades. Social media and the 24 hour news cycle just make people think that things are terrible even when they’re improving.",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "doesitreallymattaa",
                            "body": "And I'm all for the report card he gave her, to encourage her, but straight Ds? I don't know how her condition impacts learning, but I'm guessing others with it, can get better grades than that, so hopefully there's some real work going into helping her improve",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I'm on the spectrum but I tend to be on the more High achieving side, the overachiever stereotype. However I do have a brother who's also on the spectrum who is a lot like the daughter it seems. The reason it's so important to support with something like this report card is because a lot of people on the spectrum have trouble seeing values of things in metaphors, like the inherent value of people. They base stuff off of what can be quantified, which at a young age tends to be grades. Also the issue could less be her not understanding the materials but more so having a different way of solving problems, it could be having trouble focusing or playing nice with kids depending on the age. Here's an example:\n\nI had a problem on a test that went like this, 453 + 679. Now we were supposed to line them up and then do carrying but the way I solved it was \n\n400 + 600 = 1000\n\n50 + 70 = 120\n\n9 + 3 = 12\n\n1000 + 120 + 12 = 1132\n\nI got no credit because I didn't use the teachers method. I also had trouble understanding how to play with the kids which at a very young age can make you lose credit. It's not that I'm not intelligent, I am by no means a genius but I'm currently predicted salutatorian and taking AP calc BC as a sophomore so I think I'm above average. It's just that elementary school is really geared against people on the spectrum with its reliance on root memoization, how to \"play nice\", it's constant ease (people on the spectrum and especially those who also have ADHD struggle in classes that are easy because they seem too boring), and oftentimes they have not developed how to mask and coping strategies.\n\nAnyways essay over now, I'm just saying that it might just be elementary School being very unaccommodating and not her lack of understanding. Of course it could be but I just wanted to bring up other options",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "AmusedPencil274",
                                            "body": "The exact same thing happened to me though I was undiagnosed at the time (I have autism, ADD & BPD) \n\nI wasn't getting ANYTHING the math teacher taught me so my dad taught me the way HE learned in school and the teacher kept marking it as wrong, until my dad came into school in his work gear, demanded to see the headteacher (principal) and asked him what was so wrong about the way I was solving the issue? \n\nBy the time dad left the school I was allowed to continue doing my work the way dad had taught me",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "ghostlistener",
                                                    "body": "That's a good dad!",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "AmusedPencil274",
                                                            "body": "Thank you! He did what he could to make sure my brother and I and our mum were looked after",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "doesitreallymattaa",
                                                    "body": "Were you getting marked wrong bc of your answers, or how you arrived at your answers? Bc those are 2 different things.\n\nIf the teacher marked correct answers as wrong, bc they didn't like your process, that's on the teacher. But that's likely irrelevant to this girl, bc all her grades were bad & that didn't happen at the end. She was getting Ds all semester.\n\nYou & her both seem to have supportive dads, which is great, but your dad did what I'm hoping her's will do/is doing as well. Giving additional support that helps in the classroom, in additional to the emotional support he's giving her",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "doesitreallymattaa",
                                            "body": "And that's my point. If your experience was only getting bad grades, and that's the best she can hope for, cool. But it doesn't seem like that's the case. And I'm just hoping that in addition to the emotional support he gives her (which is important for everybody even if you don't have a condition), I hope there's support that can help to improve her grades",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ASupportingTea",
                                    "body": "With ASD (Autism Spectrum Disorder) it really can vary wildly with how it impacts learning. So it might be that D is genuinely quite good for them, if their Autism is a bit more severe. But it also may be for example, that their understanding of the meaning of exam questions or what is being said in class is different to the intent because the language is more vague than the teacher realises. That's personally something I've seen and experienced a lot where a question can have multiple different interpretations on what is being asked because of the assumed understood subtext. But when you strip out the subtext it can mean literally more than one thing and the kid ends up answering the wrong question effectively.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "doesitreallymattaa",
                                            "body": "That makes sense, but if Ds are good, then maybe the additional support the dad can get, is to help her set expectations, so she understands that.\n\nMy point is that I hope there's additional support, in whatever form that takes, bc she was clearly bothered by her actual report card.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SnuggleMuffin42",
                                    "body": ">  I don't know how her condition impacts learning\n\nShe has autism. It's good enough that she goes to a public school at all (in the past people with this syndrome would just be cast away from society). You are judging a person with a disability without any perspective about the challenges they face.\n\nJust look at the responses you got and in this thread in general. Many of them have endless paragraphs and circular explanations nobody would read, but they still write it and never learn that nobody on the internet got time for it. Imagine this but every hour of the day on all of your social interactions, and understand just how much of a challenge she faces that you never did.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "doesitreallymattaa",
                                            "body": "Who gives AF about any difference in struggle she has vs what I had to deal with. She got STRAIGHT Ds. That didn't happen at the end of the semester. That had been going on ALL semester. \n\nI'm just saying that I hope the kid gets whatever help they need to improve their grades, bc she could've missed the semester, and her grades wouldn't have been much worse.\n\nIf she has the capacity to learn, and since she's in school AND she appeared to be disappointed by the report card, I'm guessing she does, there's nothing wrong with wondering if she's getting additional support/resources. We should ALL want that, in addition to the report card he gave her.\n\nSo while I can understand that her condition might be affecting her grades, there are tons of kids going to school hungry, homeless, abused, neglected, bullied, etc & some of those kids have undiagnosed conditions that might affect their ability to learn, on top of those other things, but they still get better grades than her. \n\nThe other replies, gave insight. Yours is a pity party. And if you're not aware, that won't help her improve.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mukamole",
                    "body": "As a non-american, how come straight Ds are considered poor? In Sweden, E is the lowest passing grade, and if someone has a couple or even many Es, that’s regarded as okay. Could it have something to do with the requirements? For reference, getting an A in virtually any class in Sweden requires a load of effort.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "JimmyQ82",
                            "body": "In Australia (and I assume US also) C is the minimum passing grade, D is a fail, E is big fail basically a DNF.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Pas__",
                                    "body": "what is DNF? :o",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "JimmyQ82",
                                            "body": "‘Did not finish’ \n\nIt’s racing terminology.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Pas__",
                                                    "body": "ah thanks! I suspected it's some kind of \"did not show up\", but wasn't able to that  with the \"F\" :)",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Cockmaster800",
                            "body": "A D is a failing grade in American public schools, C’s are passing here. Getting an A isn’t terribly difficult in American public schools but of course it depends on how strong the average student is in that school. I know of public schools in wealthy highly-educated districts (like Cupertino, California) where getting straight A’s is quite difficult and requires a lot of commitment and effort, but other schools it may be significantly easier.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "wailingwonder",
                                    "body": "I've never heard of any school where D was failing. It's bad, yeah, but it's the lowest passing grade. F is failing. You know. Cuz F.",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "Cockmaster800",
                                            "body": "I see, maybe I’m just speaking for California then. I’ve definitely never seen D as a passing grade, at any level of school I’ve been in, but I spent my entire education in California public schools (kindergarten through undergrad)",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Same for me. At least in the Bay Area, D was a failing grade.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "selphiefairy",
                                                    "body": "It just depends. It took me a while before I found the out honors grading scale is more strict than normal.\n\nAlso I think in a lot of other countries a C is 50% or something.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Objective_Poetry2829",
                                            "body": "Same. I guess it’s different across the country too. I live in NYS, we have ABCDF. But maybe it differs across my state too lol",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Vanishingf0x",
                                            "body": "In my highschool D was definitely failing but still not as bad as an F. In college getting C was not good and for getting into grad school B- was minimum for many classes. College tends to be graded different than high school though.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "QueenMaeve___",
                                            "body": "In mine D's meant you didn't do anything in your class",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "StreetofChimes",
                                    "body": "Maybe don't say \"American\" public schools when saying stuff that is clearly regional. In most places in US, D is a passing grade, it is a shitty grade, but passing.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No-Tour1000",
                            "body": "I guess it depends on the country. I'm in the UK and a D is regarded as fairly poor",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "jameslucian",
                            "body": "You’re right, it’s not as bad as an F (our lowest grade), but D’s still are not good and is not considered a passing grade. I’m not familiar with the Swedish grading scale, but in the US, a D would be a grade anywhere between 60-69% in the class. This will not be good enough to get into colleges unless the student is able to turn it around in the last couple years of high school and get higher grades. If the student continues to get D’s, then things get more difficult if the plan is to attend higher education.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Keita_Blackfire",
                            "body": "I mean straight Ds in Sweden are still considered poor, E is literally doing the bare minimum. In a family where education is important, straight Ds would be disappointing for the student, even if the parents are supportive.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "scolipeeeeed",
                            "body": "https://en.m.wikipedia.org/wiki/Academic_grading_in_the_United_States\n\nThere are tables on this Wikipedia page that show which letter grade corresponds to which range of scores. It can depend on the school, but this sounds about right.\n\nIdk why, but C is generally considered the “passing grade”",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Iamdarb",
                            "body": "In the state of Georgia, when I was in highschool in 2006, for my school district it was:\n\n90-100 A\n\n80-89 B\n\n75-79 C\n\n70-74 D\n\n69 and below F\n\nI've had one of my employees who go to my old hs tell me it's now 60-69 D, but for them that isn't failing. I think it's been reduced so more children pass.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NotStreamerNinja",
                            "body": "Most grading scales I’ve seen go something like this. \n\n90-100% - A\n\n80-89% - B\n\n70-79% - C\n\n60-69% - D\n\n0-59% - F\n\nMost American schools don’t have an “E” grade. “C” is considered a passing grade for most classes, and anything lower than a “B” is not considered a particularly good grade. If you have a “D” in all your classes you’re doing pretty poorly and probably need tutoring.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "celoplyr",
                    "body": "Do you have any idea how hard it is to get a good tutor if you have a learning disability, especially one with as many variations as ASD?\n\nI’m a tutor. I had a kid come, meet with me, and just cry angry tears. We had to stop, refocus and basically talk about how brains work, rather than doing our lesson. Do you know how many teachers are burned out? Being yelled at by parents? Being yelled at by administrators? Being told that they have to keep up with a good 50 IEPs of all different shapes and sizes? \n\nI charge a lot of money and I’m super selective on my students, and most parents can’t afford the quality education that their kids need, and the tax payers aren’t willing to fund or support.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "doesitreallymattaa",
                            "body": "What does any of that have to do with my original comment? Based on the info provided, she got ALL Ds. That's not a surprise, which means anyone who monitors her progress knew what her grades were, well before the school report card came out.\n\nSo she needs a level of help that's hard to find. Ok. Since it's hard to find, should dad just give up, and resign himself to his daughter never learning? Tooparaphrase, my original comment is asking/hoping that dad will do SOMETHING other than give her his report card, bc she clearly needs more than that. \n\nI think it's great what he did & if it encourages her, fantastic. But she clearly needs additional help. So if you wanna talk about how tough it'll be for her to find help, cool, I'm not interested in that convo, but go off. If you wanna discuss potential solutions, I'm down for that",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "itsr1co",
                    "body": "Nah, post about it on Twitter, and make sure her name is visible so creeps get more information about your (Likely) underage daughter, assuming it's even a real story in the first place.",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nesyaj0",
            "body": "Everyone is saying how sweet and wholesome this is, but no one is questioning where this man and his daughter are mailing robots to?\n\nWhat are you two doing to those robots?",
            "score": 86,
            "replies": [
                {
                    "author": "ramobara",
                    "body": ">Drawing and making robots\n\nNonetheless, you get an A for effort.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "PlasticMegazord",
                    "body": "I'm very curious about these mail robots.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Lorn_Muunk",
                            "body": "idk it sounds like it could be a [felony](https://i.imgflip.com/900yi4.jpg)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nahuman",
                    "body": "To be fair, it’s also possible that she’s making armor for the robots. Which seems like a cool way to volunteer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Snoringdragon",
            "body": "I had identical twin boys who refused to learn to read. Not couldn't read, refused to *learn* to read. Held strong until a grade 6 reading program finally broke the resolve and found out how to get them started. They are now a Peace Officer and a Red Seal Electrician. Not everybody is a rocket scientist. She finds her passion, and she will thrive. School is so hard on different learners, I hope she makes the best of it and does her real learning on her own. It's okay. A lot of us learn stuff in different ways, we don't all have to be by the book learners!",
            "score": 144,
            "replies": [
                {
                    "author": "theredwoman95",
                    "body": ">I had identical twin boys who refused to learn to read. Not couldn't read, refused to learn to read.\n\nAs someone who was the same as a kid (cracked when I was 7/8), you must have the patience of a saint. Ironically I'm doing a PhD now and reading is practically half my job, so hopefully this kid manages to figure it out too.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Snoringdragon",
                                    "body": "And they were identical twins- my patience snapped before 18 months. It was a LOT of hands-in-the-air and aaaargh and they also wouldn't talk directly to us until 4. I was raising Children of the Corn. I couldn't tell them apart (hey, they were always in motion!) until they spoke. It was a very weird raising. They now have 2 daughters each and karma has cleared the slate. Bwaahaahaa!",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "avocadorancher",
                    "body": "How did they progress to grade 6 without being able to read?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Snoringdragon",
                                    "body": "PS. Alberta, Canada, before someone asks...;)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fridasmonobrow",
            "body": "I remember one time I got like 10 great grades and three bad ones and my parents let me know very explicitly that they were disappointed and didn’t think there was anything worth celebrating 🥲",
            "score": 12,
            "replies": []
        },
        {
            "author": "None",
            "body": "It's hard for me to believe that dads like this are real. \\*tw: abuse mention\\*   \nFor context, I brought home a report card with a C on it in the 7th grade. This led to my dad taking away every single thing in my room (music, books, crafts, etc), leaving me only with my bed, my dresser, my desk, and an empty bookshelf. For months, I was only allowed to clean, do homework, or study. He wouldn't even let me go to the library, go on family outings, watch tv or movies with them, or read for leisure (probably the worst part of all for me as reading was a huge form of escape from my abusive dad.) As a result of this, I read my school textbooks from cover to cover just to have something to do. This punishment only ended after he went 'too far' one of the times he was beating me and gave me a black eye. A teacher noticed and pulled me aside to ask about what happened, and I finally broke down. Lived with my mom for a few months before ultimately going back to living at his house.   \nAnyway, I hope that those with dads like this (or people who are dads like this) find $20 on the ground and never experience back pain. I also hope my dad rots in hell.",
            "score": 9,
            "replies": [
                {
                    "author": "Gh0stl3it",
                    "body": "~~Why would you ever go back to your dad's house?!~~ Why would they ever send you back to your dad's house?!",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Custody battle did not go well in my favor. I would hope it’s obvious that it wasn’t up to me.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Gh0stl3it",
                                    "body": "Crap, I should've phrased my original comment better..my bad. Sorry it happened the way it did, I hope you were able to get out there sooner rather than later. 🤗",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "I got out right at 18 and never looked back. Hopefully will never have to speak to that man again. Things are much better for me now, though I genuinely wish I had a father like this one!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Gh0stl3it",
                                                    "body": "Glad things are better. And honestly, same.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "caithmancer",
            "body": "This! This is how you treat a child when they're not doing well in school You don't vilify them, but encourage them to do better with love and kindness.\n\nA child should never feel that his parents won't love them for doing wrong in some aspects of life, but they should feel encouraged by the people they love the most",
            "score": 56,
            "replies": [
                {
                    "author": "Wonderful_Flan_5892",
                    "body": "There’s no encouragement here though. Sure, any parent should show their love and support, even when things go wrong. But it’s also a parents responsibility to ensure their children get a proper education and not just allow them to continue to fail because they “love dogs”.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "caithmancer",
                            "body": "I understand your point and share 100% your opinion; but I do believe this is encouragement from the father: He's showing his daughter that, no matter what, he's going to be there for her, and that failure is not something to lose your head on.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "Vsx",
                            "body": "Good parents don't randomly find out their kid failed every class. This guy is checked out and performing for social media. ",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "caithmancer",
                                    "body": "I read this so, so, so bad and answered without a second thought, my bad.\n\nYeah, I guess that could be the case, but I kinda like to think positive of people",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "doozy-kitten",
                                    "body": "This could literally be a single semester. Maybe something caused her to struggle more than usual this time around - considering her guilt. Why be so quick to be cynical lol",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Penny-Pinscher",
                                            "body": "You shouldn’t go an entire semester without knowing your kids grades",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "c2h5oh_yes",
            "body": "I'm gonna get downvoted to hell, but here goes.... I find this questionable as a teacher. Hear me out.\n\nIf this kid truly has diagnosed ASD, she will likely have an IEP. That means she would had to have met few or NONE of her learning goals WITH accommodations. Teachers would likely have had to document all the interventions they tried before giving a failing grade.\n\nShe really got ALL D's? In every subject? Every teacher?  Either her school is exceptionally shitty, breaking the law, or private. Maybe all three.\n\nNot saying this isn't real, I just find it very unlikely.",
            "score": 12,
            "replies": []
        },
        {
            "author": "theoht_",
            "body": "does that say ‘drawing and mailing robots’ because that is absolutely awesome",
            "score": 3,
            "replies": []
        },
        {
            "author": "Roy4Pris",
            "body": "This is cute, but also he just kinda doxxed his daughter by using her full name. And because it’s gone viral, this will definitely get back to her community and school mates. Maybe she will be cool with that, but maybe she won’t.",
            "score": 11,
            "replies": [
                {
                    "author": "fwubglubbel",
                    "body": "Yep. There is no reason to share this with the world except self-congratulation.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zealousideal_Dot_280",
            "body": "LOVES MAKING ROBOTS!? She gets a A+++++ infinity from me. Robots are cool as heck!",
            "score": 6,
            "replies": []
        },
        {
            "author": "1Pac2Pac3Pac5",
            "body": "This is great but I don't think many schools will accept this as a formal transcript",
            "score": 7,
            "replies": []
        },
        {
            "author": "rabidgoblins",
            "body": "My parents did something similar for my sister once! We were taking classes to learn touch typing and she was constantly criticised for not reaching the targer typing speed. On the exam, she rushed to reach the target speed and in doing so sacrificed accuracy, and they failed her because she made too many typos. When I got my certificate in the mail and she got a letter saying she failed, my parents instead made her a certificate as well.\n\nYou're a good dad. Your daughter surely knows she is loved!",
            "score": 3,
            "replies": []
        },
        {
            "author": "DouceintheHouse",
            "body": "Think I'll do this for my son before summer's end. He's a good kid and has helped me out so much.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "Amazing daughter. She’s a beautiful person. Hopefully the school that she goes to treats her with patience and respect.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Brainfunctions",
            "body": "Congrats to the dad involved... I'm an aspie and all my stepfather did was to try and get me put in an institution.  My childhood would have been so much better with a dad like this",
            "score": 9,
            "replies": []
        },
        {
            "author": "TimePlankton3171",
            "body": "♥️🥲🥲",
            "score": 7,
            "replies": []
        },
        {
            "author": "Penguin_Arse",
            "body": "I thought it said A- on best daughter ever and laughed so hard",
            "score": 2,
            "replies": []
        },
        {
            "author": "Murky_Bid_8868",
            "body": "That's a Dad being a dad.  👍👍👍",
            "score": 2,
            "replies": []
        },
        {
            "author": "BandicootObjective32",
            "body": "But but how does she get \"loves dogs\" up to A+???",
            "score": 2,
            "replies": []
        },
        {
            "author": "AffectionatWall",
            "body": "Seeing this makes me appreciate my own dad even more",
            "score": 2,
            "replies": []
        },
        {
            "author": "jmtl01",
            "body": "Wait there is an alternative that is not a beating and threats of a worse beating?",
            "score": 2,
            "replies": []
        },
        {
            "author": "peacefulsolider",
            "body": "an A in funny? dang thats really good! i wish i could do that but i get C+'s",
            "score": 2,
            "replies": [
                {
                    "author": "Mean_Camera_9806",
                    "body": "I got B- last time round 😁",
                    "score": 1,
                    "replies": [
                        {
                            "author": "peacefulsolider",
                            "body": "Thats lit! what did you get for number 3??",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mean_Camera_9806",
                                    "body": "I didn’t even qualify for the test",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Dang I didn’t know parents can like…not scream at you for grades",
            "score": 2,
            "replies": []
        },
        {
            "author": "zRage4",
            "body": "Report card for Dad:\n\n1. Great Dad       A+\n2. Handwriting   F",
            "score": 2,
            "replies": []
        },
        {
            "author": "Old_Swordfish7995",
            "body": "I grew up with three other siblings, and we never even talked about grades. My parents would regularly ask each of us kids how they could support us, and we’d tell them if we needed extra help or tutoring or some recommended book or whatever. The low/no pressure was very good for our mental health. Over our twelve years, my brother and I each were suspended twice for fighting, but our dad just asked us if our cause was just and if we needed to make amends. I’m ok but my dad was a much better dad than me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "wheels_daddy",
            "body": "lol i was beat as a child and im honestly better off because of it (not abusively, disciplinary)",
            "score": 2,
            "replies": []
        },
        {
            "author": "DarkZero008",
            "body": "I suggest censoring the name, sir. <3",
            "score": 7,
            "replies": []
        },
        {
            "author": "SnooBeans9101",
            "body": "Adorable! Make sure she knows you're in her corner! 😄",
            "score": 4,
            "replies": []
        },
        {
            "author": "sara_or_stevie",
            "body": "This is the sweetest thing. I am such a daddy’s girl and it always makes me happy when dads and daughters are close like this. ❤️",
            "score": 4,
            "replies": []
        },
        {
            "author": "Riverside-96",
            "body": "Now that's how you Dad.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_Delay7320",
            "body": "Lol this is the participation trophy of participation trophies",
            "score": 3,
            "replies": []
        },
        {
            "author": "qtjedigrl",
            "body": "Loved by Reddit............ A",
            "score": 2,
            "replies": []
        },
        {
            "author": "spiritofporn",
            "body": "My older brother has genius level intellect. He's a incredibly successful doctor of medicine and teaches at the top university in the country.\n\nHis average score in high school was 95%. Mine was 70%. My parents loved me and still do, but they didn't handle it well back then. They were always visibly disappointed when I came home with my grades.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Conscious_Island_696",
            "body": "Who and where the hell is this kid mailing all these robots to?",
            "score": 1,
            "replies": []
        },
        {
            "author": "More_Farm_7442",
            "body": "Awww  I feel so badly for his daughter having gotten all D's.   I don't know how she manages to get up and go to school every day thinking she's failed everyone.  Poor girl.   I'm impressed by dad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Krimreaper1",
            "body": "Mailing Robots?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ready_Coat_8606",
            "body": "Asian parents be like, why did you not get an A+ for funny?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SamanthaJaneyCake",
            "body": "If I’d had that sort of parenting I probably wouldn’t have driven myself to so many burnouts in pursuit of unachievable perfection in my work and in myself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DazzlingMonkey1234",
            "body": "Nah bro my parents expect me to get all As when I’m straight dumb",
            "score": 1,
            "replies": []
        },
        {
            "author": "nickelbackmakesmehot",
            "body": "Dad is A-sian, not B-sian",
            "score": 1,
            "replies": []
        },
        {
            "author": "oops-you-messed-up",
            "body": "i have ASD and god fuck i wish that was my parents. they just say i'm lazy and need to try harder",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flarpppp",
            "body": "THIS DIDNT MAKE ME CRY AT ALL I NEVER CRY YOU'RE THE ONE CRYING",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capable_Tale_7463",
            "body": "A very loving father.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotAlpharious-Honest",
            "body": "The ultimate participation trophy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mean_Camera_9806",
            "body": "Grades are so stupid\nTests mean near nothing  \nYou can be academically great at something then do shit at it because of the pressure that’s put onto this stuff",
            "score": 1,
            "replies": []
        },
        {
            "author": "surfinforthrills",
            "body": "This is really sweet.  Now go to the school and get an IEP for your lovely daughter.  She needs some support!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Czar_Zarr",
            "body": "I wish my dad was at least half as supportive as this guy. Usually, I was just his personal punching bag when he was mad (which was all the time).",
            "score": 1,
            "replies": []
        },
        {
            "author": "jcdoe",
            "body": "That’s rough.  I teach special ed and the autism kids always take doing badly as personal failure.  It’s always hard to see them struggle.  I wish more parents cared about the feelings of the ASD children and did shit like this",
            "score": 1,
            "replies": []
        },
        {
            "author": "AB-AA-Mobile",
            "body": "Why would you encourage fighting???",
            "score": 0,
            "replies": [
                {
                    "author": "Mayki8513",
                    "body": "only with the boys, and fighting is excellent exercise and why wouldn't you want her to know how to fight?",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "trainer32768",
            "body": "The “report card” is fine. She needs to turn in her homework.  It doesn’t do any good in the bottom of the backpack",
            "score": 1,
            "replies": []
        },
        {
            "author": "seowithumang",
            "body": "It’s beautiful to witness the bond between a father and child. These little gestures mean so much in shaping their lives.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prince-Angel-Wing",
            "body": "This would've made me fail even more if this was what my parents did. Sorry. :/",
            "score": 1,
            "replies": []
        },
        {
            "author": "guyshearmeout",
            "body": "This made my day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Happy-Setting202",
            "body": "She may have ASD but she sounds like a real W to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Much_Grand_8558",
            "body": "Wow, I only got a C- in Best Daughter Ever",
            "score": 1,
            "replies": []
        },
        {
            "author": "PradhaanOfUP_FR",
            "body": "🥹🥹🥹",
            "score": 1,
            "replies": []
        },
        {
            "author": "Natural-Break-2734",
            "body": "I read love drugs lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "doomrider7",
            "body": "This guy knows how to dad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pluviophilism",
            "body": "This is adorable but I lost it at \"Fighting with the boys - A\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Seaweed2687",
            "body": "Someone should tell her the truth, that grades don’t mean anything after you leave school",
            "score": -3,
            "replies": [
                {
                    "author": "Penny-Pinscher",
                    "body": "As long as you actually graduate",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "hectorheliofan",
                    "body": "Idk why you’re getting downvoted, this is true, most employers will never ask for your grades, graduating is enough",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CJPF_91",
            "body": "School is all just about remembering what they thought you to the point to take a test. Some major one might need to stick to but others like complicated math , history, science. Less so",
            "score": -2,
            "replies": []
        },
        {
            "author": "Routine_Video3530",
            "body": "Your daughters a dumbass cause you can’t properly raise her teach her instead of giving her this participation trophy 🤦‍♂️",
            "score": -8,
            "replies": [
                {
                    "author": "xwing_1701",
                    "body": "Good job, Champ.  Amazing grammar.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Routine_Video3530",
                            "body": "On a Reddit post… touch grass lil bro 🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Just-a-random-Aspie",
                    "body": "Grammar and punctuation: F!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -20,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -11,
            "replies": [
                {
                    "author": "Just-a-random-Aspie",
                    "body": "Better than whoever taught you social skills",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}