{
    "title": "Saw this on a run a while back",
    "author": "Kazko25",
    "subreddit": "wholesomememes",
    "rank": 236,
    "score": 90,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 5,
    "url": "https://i.redd.it/zhalyopcvlmd1.jpeg",
    "id": "1f81jgg",
    "selftext": "",
    "comments": [
        {
            "author": "RequirementGeneral67",
            "body": "OK if the TMNT are hiring this begs many questions.\n\n1. Did one of the original 4 die or are they just recruiting extra help because the 4 of them are having trouble keeping up with the level of crime these days?\n\n2. Assuming they want to keep the groups name the same the applicants would need to be a) Teenagers and b) Mutatated Turtles* - I suspect that the applicant pool may be quite small. If they are also going to insist on the successful candidate either being named after an Italian renecence  painter or being willing to change their name if successful they may be out of luck.\n\n3. Hiring, rather than recruiting, seems to imply that it's a job rather a calling. Will the successful applicant be on the clock? Is there overtime, health benefits, a pension. Are they aware of and complaint with local laws that relate to the hiring of teenagers? Who confirms that they are?\n\n* I would assume full ninja training can be provided.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Wonderful_Idea880",
            "body": "I’m so sorry but I read “kindness c*nts” and it cracked me up",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gojifan1984",
            "body": "Ask what the benefits are",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheCalmPirateRoberts",
            "body": "When I was little i would secretly send notes through the grates whenever we went downtown. And change for pizza of course.",
            "score": 2,
            "replies": []
        }
    ]
}