{
    "title": "Edited to be made wholesome.",
    "author": "TradishSpirit",
    "subreddit": "wholesomememes",
    "rank": 32,
    "score": 939,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 56,
    "url": "https://i.redd.it/cpnpm6onttfe1.jpeg",
    "id": "1icgvnx",
    "selftext": "",
    "comments": [
        {
            "author": "HavenWinters",
            "body": "I don't know what the original was but this seems really nice 🙂",
            "score": 175,
            "replies": [
                {
                    "author": "DustSea5994",
                    "body": "One of those harassment what-if scenarios by a artist who's big on modesty and does the pro-woman thing, addressing social issues and whatnot.\n\nIn the original he's saying \"Wear decent clothes.\"\n\nShe's saying \"Have decent thoughts.\"\n\nThere are many examples where the female is with different people and she's discussing mild topics all the while being dressed in some of the most awful attire I've seen in decades. Like \"raided donated clothing piles and sewed anything onto anything\" style.",
                    "score": 141,
                    "replies": [
                        {
                            "author": "HavenWinters",
                            "body": "Thank you.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "Nigwyn",
                            "body": "Probably not the sub for it... but sounds like the original  comic misses the mark.\n\nIf its an office with a dresscode, the man is following it but the woman is not. Typical business or school dresscodes for women involve covering tatoos and not showing midrift and cleavage. For men its covering tatoos and wearing a suit and tie. Neither gender wants to dress that way, but it's a workplace not a social gathering.\n\nIf its just a man judging a random woman in public then yeah, thats clearly wrong. But the fact he is in a suit makes it seem like its a workplace thing.",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "Interrogatingthecat",
                                    "body": "There are more tactful ways to say that than \"wear decent clothing\" though",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "Nigwyn",
                                            "body": "Well, it is a comic designed specifically to attract negative attention, so they went with that. \n\n\"Please wear appropriate clothing for work\" would be the normal thing to say but it doesnt sound as misogynistic.",
                                            "score": 45,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cheeseydolphinz",
                                            "body": "Yeah such as \"follow the fucking rules\"",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "MangoSubject3410",
                                            "body": "You realize the 'man' didn't say that. The female artist did! As I explained in another post, this woman’s comics are just typical middle-aged single woman gripes. Completely anti-men, anti-children, and anti-family. ‘You are fine the way you are, no need to improve yourself’ sort of affirmation for women who are slipping, mentally and physically. Nothing funny about any of it.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Interrogatingthecat",
                                                    "body": "I really couldn't care much less.\n\nAlso, not wanting kids/to settle down for a family is fine. Who gives a crap\n\nAlso I don't think they're trying to be funny anyway",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "MangoSubject3410",
                                                            "body": "I don't care if you care or not. I was pointing out that the attitude comes from the artist, not a real man.",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AlexisdoOeste",
                                                    "body": "It irritates me that you even needed to explain this, but you totally did! Yet, it’s just getting downvoted…",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MangoSubject3410",
                                                            "body": "Bitter women always be bittering! 🤷‍♂️",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AlexisdoOeste",
                                                                    "body": "I am unable to understand what you’re trying to say. I seem to get the notion that you’ve misunderstood the point that I am making, but can’t be certain.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[deleted]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AlexisdoOeste",
                                                                                    "body": "Yeah… I’m agreeing with u/MangoSubject3410. Their understanding of said meme and subsequent parody is resounding and I find it equally refreshing that they explained themself clear language. \n\nI was unable to understand you because I MangoSubject and I understood each other perfectly.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ScrubIrrelevance",
                                    "body": "Men don't always wear suits at work. Suit is still on when they leave work at the end of the day. The original comic does not miss the mark because it doesn't show where the situation is taking place. You added that assumption.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "smartygirl",
                                    "body": "> the fact he is in a suit makes it seem like its a workplace thing.\n\nThe fact that she is in casual wear makes it seem like it's *not* a workplace thing.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "MangoSubject3410",
                                            "body": "The fact that the artist didn't make the location clear makes it seem like she is not very good at what she does. Or, wants to create conflict just for the heck of it.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Clueless_Wanderer21",
                                    "body": "Not necessarily an office thing, i think.\n\nN even of office, maybe people want to shift that, like people wearing what they are comfortable with while working n supporting.\n\nCuz if no one wants to anyway, may as well make our own choices as a society n make it for people (n not everyone sad for each other's sake)",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "DustSea5994",
                                    "body": "Evidently I touched someone in their no-no spot with my comment regarding the woman's lack of quality tattoos. Send me to hell.",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DustSea5994",
            "body": "For those curious, the art is by Lainey Molnar who is one of those folk who make art addressing/solving real life ailments especially for the female side of things.\n\n[Here's an example I found.](https://www.boredpanda.com/comics-women-contemporary-life-social-issues-lainey-molnar-part-8/)",
            "score": 40,
            "replies": [
                {
                    "author": "WatcherOfStarryAbyss",
                    "body": "Most of those are decent but a few really miss the mark. \n\nEx: \"we don't expect a dog to change breeds, why should we expect exercise to make a fat person thin?\" - comparing a change in genetics to a well-documented phenomenon.\n\nEx: \"why do we call it 'single motherhood' and not 'absentee fatherhood\" - overlooking that 'single motherhood' only conveys relationship status, not whether the father is absentee. - also oversimplifying a notoriously complex issue.\n\nShe's got an interesting art style. I could swear I've seen it somewhere before, but maybe I'm remembering something of hers that I saw and didn't know was hers.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "HereButNeverPresent",
                            "body": "Her #6 comic was playing into racial stereotypes. 😭\n\nAlso yeah, the drawings look like they were ripped from an Adobe Flash dress-up-barbie game I played in the 2000s.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "DustSea5994",
                            "body": "I'm not in favor with artists like this for the above reasons and just not really being \"clever\". I like to be humored, not be lectured. I get what she's addressing but animation isn't really the medium that comes to mind when spreading such messages.\n\nYou're indeed right to raise suspicion on the art style. It's very similar to what I used to see on WikiHow. My second comparison would've been maybe a social media application to generate custom avatars to represent oneself.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "-nonoelmo-",
            "body": "What is the original?",
            "score": 5,
            "replies": []
        },
        {
            "author": "matchalover497",
            "body": "Wholesome office culture unlocked",
            "score": 13,
            "replies": []
        },
        {
            "author": "RottenMorningWood",
            "body": "Ok hate to point this out but in the 2nd image her cleavage disappeared",
            "score": 3,
            "replies": []
        },
        {
            "author": "Alt123456790",
            "body": "Origami?",
            "score": 6,
            "replies": [
                {
                    "author": "Artistic-Badger8737",
                    "body": "Ahh a fellow from r/bonehurtingjuice",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "pentacontagon",
            "body": "What’s the original?",
            "score": 2,
            "replies": []
        },
        {
            "author": "-Voxael-",
            "body": "Donald Trump Jr doesn’t deserve to be a meme",
            "score": 4,
            "replies": []
        },
        {
            "author": "scuba_mf_steve",
            "body": "Good one!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Think-Difficulty7596",
            "body": "That's nice",
            "score": 3,
            "replies": []
        },
        {
            "author": "Secure_Whole77",
            "body": "de chiant sa commande",
            "score": 1,
            "replies": []
        },
        {
            "author": "MangoSubject3410",
            "body": "This is way better than the original. This woman’s comics are just typical middle-aged single woman gripes. Completely anti-men, anti-children, and anti-family. ‘You are fine the way you are, no need to improve yourself’ sort of affirmation for women who are slipping, mentally and physically. Nothing funny about any of it. But the artwork is pretty good.",
            "score": -2,
            "replies": [
                {
                    "author": "DustSea5994",
                    "body": "Another user raised suspicion about the art style and it hit me just moments ago: WikiHow illustrations. It's very similar, don't you think? Some claim tracing over stock photos and others are keen on believing the artwork is outsourced to Filipino artists for cheap.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "garyclarke0",
            "body": "This was better than the original.",
            "score": 0,
            "replies": []
        },
        {
            "author": "gnomon_knows",
            "body": "I feel bad saying this because I know her work, but with the edit that honestly is an unusual choice of corporate work attire.",
            "score": 1,
            "replies": []
        },
        {
            "author": "penarhw",
            "body": "The gestures are too cordial, must be more than meets the eyes",
            "score": 1,
            "replies": []
        }
    ]
}