{
    "title": "Ideed, friend...indeed indeed!",
    "author": "TheScarletShadowYT",
    "subreddit": "wholesomememes",
    "rank": 11,
    "score": 13938,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 111,
    "url": "https://i.redd.it/f7si0pgtfike1.gif",
    "id": "1iutfki",
    "selftext": "",
    "comments": [
        {
            "author": "No_Log8932",
            "body": "This happened for me earlier today when I helped coach some kids on their flip turns and starts for competitive swimming. I’m not the best at my event on my team, so I usually think I always have something to learn rather than reach, but it was super fun sharing the surprising depth of my knowledge and skill. It’s really such a great feeling.",
            "score": 389,
            "replies": [
                {
                    "author": "Alive-Organism",
                    "body": "Thats great man!",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "penarhw",
                    "body": "In the end, you felt so accomplished",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "GoldenLilyUwU",
                    "body": "You never know how high you’ve climbed until you see others striving to be as good as you",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Prince-Angel-Wing",
            "body": "When does that happen?",
            "score": 164,
            "replies": [
                {
                    "author": "Thesleepingjay",
                    "body": "After hard work and making a choice.",
                    "score": 111,
                    "replies": [
                        {
                            "author": "Freereedbead",
                            "body": "Instructions unclear\n\nI made a choice and now I'm hard",
                            "score": 62,
                            "replies": [
                                {
                                    "author": "Thesleepingjay",
                                    "body": "That works too. Get Goated 💪",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "FlamingBlaz3",
                                    "body": "Working hard or hard at work",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Prince-Angel-Wing",
                            "body": "Two things I do often, and yet it still doesn't go right.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Thesleepingjay",
                                    "body": "It never needs to be \"right\".",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Prince-Angel-Wing",
                                            "body": "It most certainly does, otherwise it's pointless.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Thesleepingjay",
                                                    "body": "Journey before Destination, friend.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Prince-Angel-Wing",
                                                            "body": "That journey would land me in jail if it's not right.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Thesleepingjay",
                                                                    "body": "There is more than one path available. The choice I spoke of is to choose to move past pessimistic black and white thinking like that.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Prince-Angel-Wing",
                                                                            "body": "Unless you like me going to jail, you good to think like that. :/",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Thesleepingjay",
                                                                                    "body": "What u goin to jail for",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Prince-Angel-Wing",
                                                                                            "body": "Third degree murder. (That's if I do it wrong):/",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Thesleepingjay",
                                                                                                    "body": "Why does stopping negative self talk and identifying you good qualities end in you accidentally killing someone?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                            "body": "Because of mental disability that makes that all the harder to do, and it's also that disability that makes it a damn near miracle I still do even have a job.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Thesleepingjay",
                                                                                                                    "body": "Me too, but how does that lead to accidental murder? How do you KNOW that will happen?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                            "body": "Because my workplace already told me I'd be held criminally responsible if a person were to die from my line of work.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                    "body": "So then, how do you know that stopping negative self talk and identifying your positive qualities will cause you to ignore possible mistakes and not improve?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                            "body": "It's one of the other honestly, and mistakes are involuntary and often. Nothing I can really do except acknowledge the mistakes I continue to make, and continue on when I don't make mistakes (at least not the fatal ones). 🤷",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                    "body": "So why not beat yourself up about it, acknowledge it, and work to improve?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                            "body": "Because like I said, *involuntary*, there's not anything I can really do.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                    "body": "Nothing? You're sure? No checklists? No practice? No career change? Just inevitable murder? No options?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                            "body": "I've had over eight different jobs within 9 to 10 years. Besides, the responsibility is the only thing that's keeping me being thorough (even though it's slower than everyone else). Practice tends to have an opposite effect on me (as I usually pick up concepts quite quickly.)",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                                    "body": "Me too, too all of those things. Why does that mean you can't stop using negative self talk and acknowledging your strengths? (These are rhetorical questions, you're supposed to realize that they aren't mutually exclusive. You can acknowledge that your disability, which seems to be ADHD but I could be wrong, makes your life difficult and also acknowledge that you have value and deserve to talk to yourself nicely.)",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                                            "body": "I often found talking nicely to myself makes me extremely upset and not happy. Why? I can't believe the words I'm saying. I'm usually finding myself talking about what is happening than what could happen.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                                                    "body": "This is very common, and it happened to me. The answer that I found, is to first stop negative self-talk, then identify strength, then start positive self talk. Being nice to yourself is unfamiliar for most people and very uncomfortable, this is okay. Discomfort is where growth happens, but you don't have to jump in all at once.",
                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                                                            "body": "It's far beyond \"uncomfortable.\" It's basically a \"fingernails on a chalkboard,\" \"I want to throat punch this person\" bad.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                                                                    "body": "Yep, and it gets easier the more you do it.",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                                                                            "body": "Years of trying has proven the opposite.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                                                                                    "body": "So what, you're just uniquely broken?",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                                                                                            "body": "Yes, as is with everyone.",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                                                                                                    "body": "So if other uniquely broken people are able to learn to not hate themselves, when why are you different?",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                                                                                                            "body": "Some people are better at ignoring their cracks.",
                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                                                                                                                    "body": "Cracks don't mean you are useless. Look up Kintsugi.",
                                                                                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                                                                                                                            "body": "I never said I was useless. I'm useless for myself. Others tell me I'm useful, which I can agree, but for myself, it's useless.",
                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                    "author": "Thesleepingjay",
                                                                                                                                                                                                                                                                                    "body": "Why? How do you know that?",
                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                            "author": "Prince-Angel-Wing",
                                                                                                                                                                                                                                                                                            "body": "Because I know I can't improve on it, as we've already been discussing.",
                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dynamic_gecko",
                    "body": "I dont know about when. I can tell you how. Slowly and step by step",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Prince-Angel-Wing",
                            "body": "One of those things my brain hates: slowly",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dynamic_gecko",
                                    "body": "I'm sorry man. I hate it as much as you do, if not more. \n\nBut maybe the silver lining is, there will be gradual intermediate rewards. You will first open yourself to the idea of thinking this way. Then maybe momentarily you will be able to believe it. Then maybe it will be a couple of hours. Then a day. Then maybe a week. I dont think it will ever be a constant state because we're humans and life is a roller coaster. But it will get easier and easier to believe it. Length of the journey depends on the person.\n\nI know it's not really great news. Maybe because I'm also on the journey, and it is tumultuous. I just hope one day there will be more sun than there is rain. It wasnt for nothing so far though. I'm glad I came so far, even though I still have a lot left. Good luck my friend.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Prince-Angel-Wing",
                                            "body": "It's been nothing but rain for years in my mind and gradual rewards literally don't give me any benefit.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "dynamic_gecko",
                                                    "body": "In my experience, unfortunately, \"slow and steady\" is the only way it can truly benefit you. Changing how you think and feel is a very very gradual process. It's worth it but not easy. It doesnt happen in a day. I wish it would.\n\nUpside is, you dont have to worry about changing everything in one day. You focus on changing one small thing today. And when you take that step, even though it doesnt feel like it, you win that day. And the next day, you think about one more small thing. And so on. Eventually, it adds up.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Prince-Angel-Wing",
                                                            "body": "Mental disability says no, which is literally why gradual rewards don't work.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "dynamic_gecko",
                                                                    "body": "I dont know you man. Not everything works on everyone. But just because it hasnt worked on you so far, doesnt mean it doesnt work period. Or that it wont work. Stop saying \"literally\" as if you're quoting scientific data. Go get professional help then, instead of \"uhm no\"ing people on reddit.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Prince-Angel-Wing",
                                                                            "body": "I have, and this is what they told me. Things that work for others don't work for me (and I hated the professionals on that)",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "dynamic_gecko",
                                                                                    "body": "Then why did you ask \"When does that happen?\"?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Prince-Angel-Wing",
                                                                                            "body": "Because it can happen without much of my involvement possibly. Seen it happen with plenty of others.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "dynamic_gecko",
                                                                                                    "body": "So, you have more belief that it can ***somehow*** happen by itself than you believe that YOU can somehow make it happen.\n\nI understand the defeated feeling. Mental disability sure sucks. But I dont know how waiting for some divine intervention is really gonna do anything. But I'm not in a position to tell you what to do. Like I said, I dont know you. And it's not impossible I guess. You do you. Good luck.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vorname_Name",
            "body": "God gave me anxiety and depression, because i would be unstoppable otherwise! Muhahaha!",
            "score": 96,
            "replies": []
        },
        {
            "author": "AlanocturnaGamePass",
            "body": "Where is this from?",
            "score": 52,
            "replies": [
                {
                    "author": "MediumFriendly",
                    "body": "Berserk",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Brawght",
                    "body": "[Fan animation of Berserk](https://www.youtube.com/watch?v=par0rwkCCB0)",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "Zardif",
                    "body": "https://www.youtube.com/watch?v=EYi7mBHhUGo",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tobio88",
            "body": "![gif](giphy|bjtM9GdxbqL5e)",
            "score": 31,
            "replies": []
        },
        {
            "author": "DryMouthKitty",
            "body": "![gif](giphy|bKNRMuPMY0hmdFpoO7|downsized)",
            "score": 57,
            "replies": []
        },
        {
            "author": "tipsyCellist",
            "body": "got a compliment from a stranger a couple days ago, and felt this so hard omgosh",
            "score": 13,
            "replies": []
        },
        {
            "author": "v1rus2000",
            "body": "which anime is this from plz tell thanks",
            "score": 11,
            "replies": [
                {
                    "author": "MediumFriendly",
                    "body": "Berserk",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "_BacktotheFuturama_",
            "body": "Sounds like someone is manic depressive.\n\n\nWe should make jackets",
            "score": 14,
            "replies": []
        },
        {
            "author": "Kanotashi",
            "body": "Waiting for someone to tell us where this scene is from",
            "score": 4,
            "replies": [
                {
                    "author": "TheScarletShadowYT",
                    "body": "Berserk",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Then again go back to self deprecation.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Joe-McDuck",
            "body": "Before I look at comments, I want to say… I BETTER NOT SEE ANYONE DEPRECIATING THEMSELVES",
            "score": 5,
            "replies": []
        },
        {
            "author": "Darkbunny999",
            "body": "Me: I’m actually useless. Why can’t I do anything right?\nAlso Me: I just threw a single piece of garbage into a trash can across the room. I am the pinnacle of humanity and cannot be surpassed",
            "score": 5,
            "replies": []
        },
        {
            "author": "NeedAHexGirl",
            "body": "🔥🔥🔥",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kovn-",
            "body": "sauce = berserk",
            "score": 3,
            "replies": []
        },
        {
            "author": "Occasionally_Human1",
            "body": "Is this a fan made clip or from an adaptation?",
            "score": 2,
            "replies": [
                {
                    "author": "Echorolls",
                    "body": "fanmade clip. The only watchable official adaptation of berserk is from 1997",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Trevorblackwell420",
                            "body": "Is there any chance the person who made this clip animated the entire series and made it available to watch? I know the answer is no but my heart wants what it wants.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Occasionally_Human1",
                            "body": "Thank you",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Subiugetur",
            "body": "u/savevideo",
            "score": 2,
            "replies": [
                {
                    "author": "SaveVideo",
                    "body": "###[View link](https://rapidsave.com/info?url=/r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrboat-man",
            "body": "That’s either good or Manic Depression…",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "TheScarletShadowYT",
                    "body": "Indeed you are",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "coolguy64p",
            "body": "This doesn't seem wholesome more like self glazing",
            "score": 3,
            "replies": [
                {
                    "author": "Thesleepingjay",
                    "body": "It's only glazing if it's not backed by evidence.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Smartbutt420",
            "body": "When does it wear out. \n\nWhen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "melodiccarnival",
            "body": "wheres my gf 🥲🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontcheckSR",
            "body": "I'm all self deprecation until some mf tries agreeing with me lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "shitposter69-1",
            "body": "That sounds nice, what's that like?",
            "score": 1,
            "replies": []
        },
        {
            "author": "shrubstep54",
            "body": "When's my turn with da 🐐",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Still waiting for that goated stage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Burn1ng_Spaceman",
            "body": "God I'm so cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "poppinsplit909",
            "body": "u/savevideo",
            "score": 1,
            "replies": [
                {
                    "author": "SaveVideo",
                    "body": "###[View link](https://rapidsave.com/info?url=/r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MowkMeister",
            "body": "if this ever happens, its over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loalder",
            "body": "Me if my graduation thesis pre review passes on, waiting for the response by today",
            "score": 1,
            "replies": []
        },
        {
            "author": "HushLifeMusic",
            "body": "I love this gif, guts is the goat",
            "score": 1,
            "replies": []
        },
        {
            "author": "Next-Veterinarian185",
            "body": "yours wears off?",
            "score": 1,
            "replies": []
        },
        {
            "author": "alphaMrWave",
            "body": "u/SaveVideoBot",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rounding_flat_earth",
            "body": "u/savevideo",
            "score": 1,
            "replies": [
                {
                    "author": "SaveVideo",
                    "body": "###[View link](https://rapidsave.com/info?url=/r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chrometrigger",
            "body": "Unironically I've stopped saying ironic self deprivation and started doing the opposite when I mess up now I'm saying stuff like \"I'm the best that's ever done it and even I can't do it?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Magladroth31",
            "body": "Suggestions for bgm that would go hard with this gif?",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Yehoria-",
            "body": "REAL",
            "score": 1,
            "replies": []
        },
        {
            "author": "watchoutalice",
            "body": "u/savevideo",
            "score": 1,
            "replies": [
                {
                    "author": "SaveVideo",
                    "body": "###[View link](https://rapidsave.com/info?url=/r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wholesomememes/comments/1iutfki/ideed_friendindeed_indeed/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KrimsunV",
            "body": "It'll happen when I'm worthy",
            "score": 1,
            "replies": []
        },
        {
            "author": "flemay222",
            "body": "I love berserk!!",
            "score": 1,
            "replies": []
        }
    ]
}