{
    "title": "[SPG-TDM] Enemy Fetches (Debut Stream)",
    "author": "mweepinc",
    "subreddit": "magicTCG",
    "rank": 12,
    "score": 922,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 108,
    "url": "https://i.redd.it/sx9ayroxehpe1.png",
    "id": "1jeaay4",
    "selftext": "",
    "comments": [
        {
            "author": "AvatarSozin",
            "body": "That’s a hell of a special guest lineup",
            "score": 334,
            "replies": [
                {
                    "author": "lonewolf210",
                    "body": "I didn't watch the stream. Since these are \"borderless special guests\" does that mean the fetches will only be in collector boosters",
                    "score": 43,
                    "replies": [
                        {
                            "author": "Schlemmiboi",
                            "body": "Non-foil SPG can be found in play boosters.",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "bacon_sammer",
                                    "body": "For further reference, in Aetherdrift the nonfoil SPG cards were seeded in 1.5% of Play Boosters taking up a Common slot. Math works out to be a little less than 1/67, or every two boxes. Rate was bumped up to 4.2% in Collector Boosters (one slot).",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "diimitra",
                                            "body": "Holy f...   \nI thought for a second about trying my luck with a box but the idea of not getting a single special guests, i'd be too mad, i'll pass :(",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "jethawkings",
                            "body": "Special Guests are always Borderless",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ThatGuyFromTheM0vie",
                            "body": "Non-foils can appear in Play Boosters",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mweepinc",
            "body": "Also in \"[Dragonscale Foil](https://i.imgur.com/dJHYwgU.png)\"",
            "score": 84,
            "replies": [
                {
                    "author": "tree_warlock",
                    "body": "These are gorgeous and gonna be fucking expensive.",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "OneLeggedPigeon",
                    "body": "Great. Need 4 marsh flats and 4 verdant. RIP. My wallet",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "j8sadm632b",
                    "body": "These are so much better than the nonfoil ones",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AliasB0T",
            "body": "Hey, it's the ones in the colors that actually make sense in a wedge set this time!",
            "score": 222,
            "replies": [
                {
                    "author": "Rbespinosa13",
                    "body": "“Hey guys, let’s have this standard’s lands have allied fetches and allied fetchable lands. Surely this will lead to the three color decks we want to see played and not some monstrosity called moist Jund”",
                    "score": 105,
                    "replies": [
                        {
                            "author": "Breaking-Away",
                            "body": "These won't be standard legal, which is why they made them SPG. Good call IMO.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "Rbespinosa13",
                                    "body": "It’s a joke about the original Tarkir block. They wanted the allied fetches in modern so put them into Tarkir, but that led to massive issues in standard because you had allied fetches and allied lands that could be fetched for.",
                                    "score": 64,
                                    "replies": [
                                        {
                                            "author": "Breaking-Away",
                                            "body": "Ah, ok. My bad!",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Slipperyandcreampied",
                                            "body": "Hey, if you don't mind, could you explain this further? It's not entirely clear to me what kind of problems occurred and how these circumstances caused them.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "randomdragoon",
                                                    "body": "KTK block had a lot of strong 3-color wedge cards. But the fetches were ally-colored.\n\nBFZ (the next block) added fetchable dual lands. But these were also ally-colors.\n\nThis meant if you wanted to play your powerful 3 color cards and make a land base that would support that, you got a 4th color \"for free\". For example if you wanted to play Jeskai (W/U/R) and you wanted a fetchland that was able to fetch all three of those colors ... you'd run the U/B fetchland alongside a W/U dual and a B/R dual. You got access to black for free in your deck.\n\nSo 4 color soup is what people did, and Standard was dominated by it.",
                                                    "score": 36,
                                                    "replies": [
                                                        {
                                                            "author": "cwx149",
                                                            "body": "Ah yes wet Mardu and darth jeskai",
                                                            "score": 25,
                                                            "replies": [
                                                                {
                                                                    "author": "Kanin_usagi",
                                                                    "body": "And don’t forget Four Color Dragon. Which four colors? All of them, there were competitive dragon decks in each of the four color combinations",
                                                                    "score": 12,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "aznsk8s87",
                                                                    "body": "Don't forget Abzan Blue and 5c Rally!",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "cheburashechka",
                                                    "body": "Fetches and fetchable, conditionally untapped duals got rid of a lot of the typical drawbacks to running multiple colors, and led to a standard dominated by 4 color decks, basically just putting all the best cards in. Needing all those fetches and duals brought deck prices up a LOT- some costing around $1k at the time (Jace, Vryn's Prodigy was also a big contributor to that cost). One of (if not \\*the\\*) most expensive standard formats ever.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "aznsk8s87",
                                                            "body": "Yeah it was a little rough, especially once [[reflector mage]] was printed. 5c Rally was straight up bonkers.\n\nI ended up playing Atarka Red during BFZ and then Grixis Dragons during OGW. I bought my set of fetches cheap, but couldn't afford the rest of the rally deck lol.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MTGCardFetcher",
                                                                    "body": "[reflector mage](https://cards.scryfall.io/normal/front/9/4/9473fe01-83f6-4432-ab01-f7953d2ca904.jpg?1562924934) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=reflector%20mage) [(SF)](https://scryfall.com/card/ogw/157/reflector-mage?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/9473fe01-83f6-4432-ab01-f7953d2ca904?utm_source=mtgcardfetcher&format=text)\n\n___\n\n^^^[FAQ](https://www.reddit.com/r/MTGCardFetcher/comments/3xtmbp/)",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "shingofan",
                                                    "body": "IIRC, that Standard season was dominated by four color \"good stuff\" decks with all that mana fixing, which had the knock-on effect of inflating the cost of entry into the format.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "punninglinguist",
                                                            "body": "Yep, every deck was basically 8 fetch lands, some rare duals, and like 25 mythics.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Formymoney",
                                                    "body": "So fetches were in Khan's and standard was mostly wedge decks, but when bfz rolled around and we got the \"tango\" lands with basic land types. The difference between 3 and 4 color mana bases were basically non-existent so why not add a fourth color? Suddenly we had \"dark jeskai\", \"moist Jund\", and the like. Every deck was basically four color goodstuff and nothing was the same.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Euphoric_Vegetable55",
                                                            "body": "This is a bit, right?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "cwx149",
                                                                    "body": "No it was really called wet/moist Mardu and dark jeskai \n\nhttps://www.coolstuffinc.com/a/kyleboggemes-08102021-moist-mardu-in-modern \n\nThis is from 2021 which was already like 7 years after Khans",
                                                                    "score": 4,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Formymoney",
                                                                    "body": "Why would it be?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Khetoo",
                                                                            "body": "This shit was absurdly slow too so if  the Jeskai beatdown didn't beat you down, the amount of value on Sorin, Siege Rhino, and Cruphix would just grind the game down to a battle of attrition that everyone lost. Including the Abzan player.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "shingofan",
                                                                    "body": "You're going to have to explain yourself.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Rbespinosa13",
                                                    "body": "You have these lands here which can go and get a land with a specific land type (island plains) from your deck. At the time in standard there were also dual lands that were land types so the lands that fetch can go and grab those. The issue is Tarkir is a “wedge” set, meaning it’s based on three color pair “wedges”. Basically, look at the back of a magic card and you’ll see the color pie. Each color has two allied colors (next to it) and two enemy colors (far from it). A wedge has two enemy color pairs and one allied color (so jeskai is UW which is an allied color pair, and UR/RW which are enemy pairs). This caused issues in that standard because Tarkir was designed around these wedges, but the fetch lands supported allied color pairs. Combine this with the allied color lands that can be fetched and it caused a situation where four colors was actually easier to do than three colors",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MCXL",
                                    "body": "Sealed legal though!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "narfidy",
                            "body": "Ah yes, 4 color Jace. My least favorite format ever",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "6-mana-6-6-trampler",
                            "body": "Dark Temur\n\nTreehugger Grixis\n\nPyro Sultai",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "karlek97",
            "body": "SEX IS BACK ON THE MENU",
            "score": 108,
            "replies": []
        },
        {
            "author": "Thundermare1",
            "body": "Best Special Guests of any set. Wild, they also come in new foil treatment in collector boosters.",
            "score": 40,
            "replies": []
        },
        {
            "author": "TacoBowser",
            "body": "these show up in play boosters right?",
            "score": 26,
            "replies": [
                {
                    "author": "OldJanxSpirit42",
                    "body": "Maybe not the dragonscale foil version, but special guests do come in play boosters",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Lord_Jaroh",
                            "body": "A special guest per box, maybe, is not exactly a good ratio.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "OldJanxSpirit42",
                                    "body": "It's possible, not probable.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "BarryOgg",
                                    "body": "I got the single one I needed for my owl collection in the BLB prerelease, so I'm manifesting those odds again.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MTGCardFetcher",
                                            "body": "[Ledger Shredder](https://cards.scryfall.io/normal/front/7/e/7ea4b5bc-18a4-45db-a56a-ab3f8bd2fb0d.jpg?1664410287) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Ledger%20Shredder) [(SF)](https://scryfall.com/card/snc/46/ledger-shredder?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/7ea4b5bc-18a4-45db-a56a-ab3f8bd2fb0d?utm_source=mtgcardfetcher&format=text)\n\n___\n\n^^^[FAQ](https://www.reddit.com/r/MTGCardFetcher/comments/3xtmbp/)",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Descent900",
                                            "body": "Yeah I got a Chrome Mox out of a Aetherdrift Play booster. Hoping I could be so lucky again.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "lonewolf210",
                            "body": "but according to the graphic Bordless Special guests are only in collector boosters",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DAspoder46",
                    "body": "RIGHT?!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "DarkHollowThief",
                    "body": "Can confirm from the stream, they do, but only nonfoil",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Multievolution",
                            "body": "I recall hearing special guests in aetherdrift were like on per box or something? So really rare. Unfortunately these are not the fetches that will make owning fetches affordable.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chowdahhh",
                    "body": "I've gotten a special guest card in a play booster before, so I'd say yes",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "strolpol",
            "body": "That’s how you reprint fetches in standard I guess, make them special guests that aren’t legal",
            "score": 27,
            "replies": []
        },
        {
            "author": "kytheon",
            "body": "Things that sell the set:",
            "score": 20,
            "replies": []
        },
        {
            "author": "AporiaParadox",
            "body": "The Verdant Catacombs flavor text is a direct callback to the flavor text of the Tarkir block fetches.",
            "score": 17,
            "replies": [
                {
                    "author": "Glamdring804",
                    "body": "I'm honestly a little annoyed that it's the only one. Like, they should have done all five that way, or gone for quotes for all five. The inconsistency tickles me.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Jahooodie",
                            "body": ">The inconsistency tickles me.\n\nFirst time dealing with Wizards, hunh? \\*slaps knee and chuckles\\*",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ImperialVersian1",
            "body": "HELL YES!",
            "score": 11,
            "replies": []
        },
        {
            "author": "Glamdring804",
            "body": "Okay these are great, but I have to nitpick: Why does only one of them have a \"where Dragons once XXX....\" flavor text? It's clearly a call back to the Tarkir printings of the allied fetches, but if you're gonna do that, why not do it for all of them? Or just do Khan quotes for all five of them? The inconsistency!",
            "score": 11,
            "replies": []
        },
        {
            "author": "SonOfZiz",
            "body": "Will these (or at least a less fancy version of the enemy fetches) also be on a bonus sheet in the main set? Or collector only?",
            "score": 3,
            "replies": [
                {
                    "author": "karlek97",
                    "body": "SPG can appear in play boosters, like always. The fancy foil is probably collector booster only though",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Banana_man3",
                    "body": "Special guests appear in play boosters, I think the odds are 1 in 64 packs or so",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OneLeggedPigeon",
            "body": "As someone who's been waiting for borderless art for the enemy fetches, I'm extremely annoyed with these being special guests. Average of 1 for every 3ish boxes average on recent sets. This was a stupid choice on wizards part.",
            "score": 3,
            "replies": [
                {
                    "author": "Banana_man3",
                    "body": "But money, you don't want the poor company to starve?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "overoverme",
            "body": "Imagine working on Aetherdrift and seeing all the things dragonstorm is doing and realizing you're working on the set that is going to sell the least of all sets in 2025.",
            "score": 12,
            "replies": [
                {
                    "author": "kytheon",
                    "body": "Vehicles was never going to outsell Dragons.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Milskidasith",
                    "body": "Magic designers don't work on commission, I seriously doubt they're getting that jealous over their set assignments.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Esc777",
                            "body": "Not to mention a majority of the designers probably worked on BOTH concurrently. ",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Milskidasith",
                                    "body": "I appreciate you commenting concurrently",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Esc777",
                                            "body": "LOL thx reddit ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Esc777",
                            "body": "Not to mention a majority of the designers probably worked on BOTH concurrently. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Milskidasith",
                                    "body": "I appreciate you commenting concurrently",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "_Joats",
                            "body": "Not to mention a majority of the designers probably worked on BOTH concurrenty.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "A-Generic-Canadian",
            "body": "I wonder how the number of these will compare to their counterpart from MH3.",
            "score": 2,
            "replies": [
                {
                    "author": "Orgerix",
                    "body": "Much lower. A special guess is only in around 4% of collector and 1.5% play boosters if we take aetherdrift numbers, and fetches are probably not the only special guests. With MH3 you had 60 rares and 20 mythics so around 7% par play booster, only taking into account the guaranteed rare/mythic slot.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lavinius_10",
            "body": "Great SPG cards this time around. The enemy fetches and the ultimatums",
            "score": 2,
            "replies": []
        },
        {
            "author": "theclumsyninja",
            "body": "I may have to buy a second collector box",
            "score": 2,
            "replies": []
        },
        {
            "author": "ObsoletePixel",
            "body": "I have never needed a card more than I need that scalding tarn\n\n  \nthat art is absolutely stunning",
            "score": 2,
            "replies": []
        },
        {
            "author": "tocalomagirl",
            "body": "The scalding tarn is so pretty 😍",
            "score": 2,
            "replies": []
        },
        {
            "author": "DivinePotatoe",
            "body": "And just like that, the price of boxes at LGS/Amazon went up like 80 to 100 USD.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CookiesFTA",
            "body": "Ahh yes. What's better than giving expensive lands a reprint? Giving them a super rare reprint that will only be more expensive.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fanverleon",
            "body": "Really sad that there are no new special guests for arena",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mysterious_Demand_65",
            "body": "Those are so sexy",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreezingEye",
            "body": "I’ll definitely be collecting these.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stunning_Put_9189",
            "body": "[[Marsh Flats]]\n[[Scalding Tarn]]\n[[Verdant Catacombs]]\n[[Arid Mesa]]\n[[Misty Rainforest]]",
            "score": 1,
            "replies": [
                {
                    "author": "MTGCardFetcher",
                    "body": "#####&#009;\n\n######&#009;\n\n####&#009;\n\n[*All cards*](https://mtgcardfetcher.nl/redirect/mih0uix)  \n[Marsh Flats](https://cards.scryfall.io/normal/front/9/d/9db3ba6d-eb7f-4f5b-9a3b-c6239c3baa42.jpg?1738703598) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Marsh%20Flats) [(SF)](https://scryfall.com/card/mh2/248/marsh-flats?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/9db3ba6d-eb7f-4f5b-9a3b-c6239c3baa42?utm_source=mtgcardfetcher&format=text)  \n[Scalding Tarn](https://cards.scryfall.io/normal/front/7/1/71e491c5-8c07-449b-b2f1-ffa052e6d311.jpg?1738703652) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Scalding%20Tarn) [(SF)](https://scryfall.com/card/mh2/254/scalding-tarn?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/71e491c5-8c07-449b-b2f1-ffa052e6d311?utm_source=mtgcardfetcher&format=text)  \n[Verdant Catacombs](https://cards.scryfall.io/normal/front/9/4/94c229ea-90da-4aa0-bfda-b162fb3b5b8b.jpg?1738703665) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Verdant%20Catacombs) [(SF)](https://scryfall.com/card/mh2/260/verdant-catacombs?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/94c229ea-90da-4aa0-bfda-b162fb3b5b8b?utm_source=mtgcardfetcher&format=text)  \n[Arid Mesa](https://cards.scryfall.io/normal/front/2/5/25ac5405-df7b-4097-914a-022cb18e20d4.jpg?1738703645) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Arid%20Mesa) [(SF)](https://scryfall.com/card/mh2/244/arid-mesa?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/25ac5405-df7b-4097-914a-022cb18e20d4?utm_source=mtgcardfetcher&format=text)  \n[Misty Rainforest](https://cards.scryfall.io/normal/front/8/8/88231c0d-0cc8-44ec-bf95-81d1710ac141.jpg?1738703648) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Misty%20Rainforest) [(SF)](https://scryfall.com/card/mh2/250/misty-rainforest?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/88231c0d-0cc8-44ec-bf95-81d1710ac141?utm_source=mtgcardfetcher&format=text)\n\n___\n\n^^^[FAQ](https://www.reddit.com/r/MTGCardFetcher/comments/3xtmbp/)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TuasBestie",
            "body": "These are gorgeous man",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrimmKat",
            "body": "look at all these sick SPGs ill never pull :')",
            "score": 1,
            "replies": []
        },
        {
            "author": "obsidianandstone",
            "body": "This was on my bingo card\n\nAlso, these are probably going to be hella price inflated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "f5d64s8r3ki15s9gh652",
            "body": "Ooh I wonder if this means we’re getting main-set wedge triome reprints",
            "score": 1,
            "replies": []
        },
        {
            "author": "HauntedLightBulb",
            "body": "How is it verdant catacombs is the *only* one to continue the allied fetches flavor text from Tarkir?????\n\nEdit: typo",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Joats",
            "body": "Called it",
            "score": 1,
            "replies": []
        },
        {
            "author": "c001357",
            "body": "I guess that's one way of reprinting them outside of standard \n\n\nforgot they can do that now",
            "score": 1,
            "replies": []
        },
        {
            "author": "N00b_Sensei",
            "body": "this lands are standart playable?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BobtheBac0n",
            "body": "Wait what's SPG-TDM mean?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rushias_Fangirl",
            "body": "Do SPG cards even affect pricing? Genuinly asking",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crimson_Raven",
            "body": "Great reprints",
            "score": 1,
            "replies": []
        },
        {
            "author": "Entbriham_Lincoln",
            "body": "Scalding Tarn is beautiful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BullsOnParadeFloats",
            "body": "Hopefully they're printed enough that it drops the price to the level the ally fetches are at, because I could use some",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rafmar210",
            "body": "Standard legal?!?",
            "score": 1,
            "replies": [
                {
                    "author": "Gorithis",
                    "body": "Special Guests are not Standard legal",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Rafmar210",
                            "body": "Thank you",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ferrismo",
            "body": "Holy heck, a couple weeks ago I was going to comment on a post about power creep in standard and joke about printing fetches in a standard set. While not being printed into the standard format it will be fun to have these as a surprise during draft night and they are a welcome inclusion in this set.\n\n\nEdited for clarity.",
            "score": -2,
            "replies": [
                {
                    "author": "SilverGekko",
                    "body": "Special guests slot is not standard legal.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ferrismo",
                            "body": "I never said it was?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AbordFit",
            "body": "They have ran out of ideas for special guests already?",
            "score": -34,
            "replies": [
                {
                    "author": "kitsovereign",
                    "body": "We're complaining about fetchlands now?",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "Dwarvenmathemacian",
                    "body": "No? Fetches are just strongly associated with Tarkir but they don't want to put them into standart/reprint them in regular stadart rare quantities.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "EthicsXC",
                    "body": "Ally fetches came out in Tarkir and were just reprinted in MH3. These make sense",
                    "score": 14,
                    "replies": []
                }
            ]
        }
    ]
}