{
    "title": "The rise of tech neofeudalism in the US should be studied.",
    "author": "Bamboozleprime",
    "subreddit": "ThatsInsane",
    "rank": 5,
    "score": 322,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 40,
    "url": "https://i.redd.it/hc1b8chgqhpe1.jpeg",
    "id": "1jebwxr",
    "selftext": "",
    "comments": [
        {
            "author": "sunraoni",
            "body": "Maybe you having unregulated/unaccountable chats with tech robber barons isn't a great idea.",
            "score": 114,
            "replies": [
                {
                    "author": "hydrocarbonsRus",
                    "body": "This is the thing we need to see when democrats think of him as some saviour.\n\nHe’s the same good looking, psychopathic, controlled opposition as the republicans. He’s no friend.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "VealOfFortune",
                    "body": "Maybe listening to the guy who looks like a villain from Captain Planet and owns a vineyard in Napa and launders...\n\nWait, sorry wrong notes.... FRENCH Laundry. Thaaaats right...FRENCH Laundry.... A guy who dines at FRENCH Laundry...not LAUNDERS FRENCH MONEY 💁\n\nWhere was I going with this again?  \n\nOhhh yeah... You trusted THAT guy...??????",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "kempff",
            "body": "If Newsom isn't already in a tech mogul's contact list there's a reason.",
            "score": 68,
            "replies": [
                {
                    "author": "VealOfFortune",
                    "body": "He's in every single one of their phones... Probably a \n\nBi-MoNtHLy ChAt to discuss the *\"preponderance of uncaptured capital in the technology space amongst mavens of the sphere of influence in the scope of a wealth of information to inform and respond to a whole gamut of corresponding verticals through which we can grab ahold of the reigns and have an IMMEDIATE response to the underlying qualifications of an underserved market!!!\"* \n\nOr so I hear...",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Contemplating_Prison",
            "body": "Lol this doesnt seem real. Fucking daily beast",
            "score": 36,
            "replies": [
                {
                    "author": "Scanner771_The_2nd",
                    "body": "He has been sucking up and selling out for a bit. He was just on Charlie Kirk's podcast and soon Steve Bannon's. He thinks it will help his 2028 bid.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "VealOfFortune",
                    "body": "It's so fascinating to seen the paradigm shift.... from \"If Kamala Wasn't a Black Woman Gavin Would Have Run\" to  \"Ughhh What A Sleazeball\".... 😂",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Secret_Photograph364",
            "body": "“Said the daily beast”",
            "score": 30,
            "replies": [
                {
                    "author": "Chazzam23",
                    "body": "It's consistent with his rightward drift MO.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Chazzam23",
                                    "body": "Is Politico better?  \nIt is sourced and everything\nhttps://www.politico.com/news/2025/03/18/newsom-ceos-burner-phones-00235044",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Secret_Photograph364",
                                            "body": "Yes, so why is this person quoting the daily beast instead of politico exactly?",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Chazzam23",
                                                    "body": "Probably what was in their feed.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "VealOfFortune",
                            "body": "He's a fucking chameleon, has been since time immemorial... Just so happens that he's not GOBBLING AT THE ALTAR OF PROGRESSIVE COCK ANYMORE, so now Democrats wanna disown him 😂😂",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VealOfFortune",
                    "body": "What's NBC News have to say about the matter? Better yet, what's AP's take on it? 🧐",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "eyeballburger",
            "body": "Sure, bud.",
            "score": 12,
            "replies": []
        },
        {
            "author": "VealOfFortune",
            "body": "The rise of self-absorbed narcissistic, cabalist, elitist chameleons to the highest office in California.... I am just SHOCKED!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "RamblinLamb",
            "body": "My bullshit meter just pegged out...",
            "score": 5,
            "replies": []
        },
        {
            "author": "8six7five3ohnyeeeine",
            "body": "Neither side gives a fuck about us. We should all learn this sooner rather than later. We need to take out power back from all of them.",
            "score": 7,
            "replies": [
                {
                    "author": "soundcloudcheckmybru",
                    "body": "I don’t know why you’re getting downvoted…i’m sorry, has this two party system really been serving you fucks?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TheRealDrSarcasmo",
                            "body": "The tribalists hate when you point out that both villages are awash in shit.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "8six7five3ohnyeeeine",
                                    "body": "Exactly this. Sure the dems are the obvious better choice, but if you really believe that a majority of em give a second thought about you as they pad their stock portfolio with more money than you could ever really comprehend then I just feel sorry.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Healthyred555",
            "body": "probably smart since trump had these tech oligarchs at his inauguration, i know zuckerberg and some may hate trump but just going along with him for power, safety and money, maybe newsom can be their off ramp or tell democrats what corruption is going on with trump",
            "score": 0,
            "replies": [
                {
                    "author": "Stork_nest",
                    "body": "Most delulu take of all time. Get your head out of your ass he's not doing this as some sort of altruistic goal. He wants to be the next puppet. Democrats aligning with the tech billionaires ruining this country is not a good thing. 🙄",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "PrismrealmHog",
                    "body": "Yea na, I'm not even American and even I know Newsom is up to absolutely no good with this move.  \nDude is in cahoots with effin' ~~Goebbels~~ Steve Bannon.\n\nHe's doing a Tulsi.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "sevbenup",
            "body": "Ohhh is this like with the Pagers??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cottonmist",
            "body": "From politico from Daily Beast, yeah whatever, a lot of stuff coming up about Newsom already guess “news sites” trying to get head start on the misinformation",
            "score": 1,
            "replies": []
        },
        {
            "author": "zdragan2",
            "body": "“I’m here” coming from the guy who just dumped the trans community because they’d outlived their political usefulness. \n\nSeem slegit /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "MicroSofty88",
            "body": "You have to post the actual article with this type of thing. Just a screenshot of a headline doesn’t cut it",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrtrouble22",
            "body": "POS newsom",
            "score": 0,
            "replies": []
        },
        {
            "author": "666TripleSick",
            "body": "Lmao!!! Yes, that’s EXACTLY how it works!! If you believe this stupidity then I can clearly see how you voted Republican. lol",
            "score": -1,
            "replies": []
        },
        {
            "author": "TVLL",
            "body": "He’s finally realized how much his screwups have cost him. He’s too accustomed to everyone in CA kowtowing to him.\n\nOnce the world saw his incompetence (along with Comrade Bass) with the Palisades fire, his stock went down dramatically.\n\nHe can see the presidency slipping away and is taking crazy measures like this and the podcast to try to gain back lost ground.",
            "score": -8,
            "replies": [
                {
                    "author": "Chazzam23",
                    "body": "He will never be the candidate, let alone President.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "insertwittynamethere",
            "body": "I mean, I really don't think it's a dumb idea to start looking at burner phones, especially if you have a disagreement with the way government is heading. This seems more like a break in case of emergency type phone if things devolve to tech leaders who may not be on board with the whole Yarvin Curtis Dark Enlightenment crap as followed by people like Peter Thiel, who owns a company made for crunching big data from the government, specially DoD, and marrying that with AI in Palantir.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Tussen3tot20tekens",
            "body": "Even if true. It’s just a gesture. Don’t read anything more in it.",
            "score": -8,
            "replies": [
                {
                    "author": "DecorativeGeode",
                    "body": "But what kind of gesture? It feels like courting favor.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impossible_Secret649",
            "body": "When will America be recognized as a satellite state for billionaires?",
            "score": 0,
            "replies": []
        },
        {
            "author": "VealOfFortune",
            "body": "#The Fall of \"PROGRESSIVES\" Should Be Studied.",
            "score": -1,
            "replies": []
        },
        {
            "author": "GeorgesWoodenTeeth",
            "body": "🤡",
            "score": -4,
            "replies": []
        },
        {
            "author": "Amethoran",
            "body": "Is it because y'all know youve fucked around to long and now you're gonna start finding out? Gotta call up cheeto and his buddies when the poor come for them.",
            "score": -1,
            "replies": []
        }
    ]
}