{
    "title": "Great Unclean Ones are the best, not the worst!!!",
    "author": "KingBabyPudgy",
    "subreddit": "totalwar",
    "rank": 19,
    "score": 319,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 38,
    "url": "https://i.redd.it/vnb9kn4x0dpe1.jpeg",
    "id": "1jduxlw",
    "selftext": "I've seen people say that the great unclean one unit sucks as a SEM and compared to Toad Dragons.\n\nI absolutely disagree on that. The reason being is that great unclean one units are meant to stay within infantry lines or even soak up missile damage or take charges.\n\nThey are not meant to chase missile units, though you could still do that if you have no better option.\n\nAND they are extremely great spellcasters!!!\n\nDid you see the tech tree of Nurgle, they get buffed to an insane degree.\n\nThey could hold so much abilities that you can just not use any winds of magic at all.\n\nI love great unclean ones.",
    "comments": [
        {
            "author": "TherapyByHumour",
            "body": "They also have the most joyful smiles, how can you hate a face like that??",
            "score": 128,
            "replies": [
                {
                    "author": "blackturtlesnake",
                    "body": "Which face?",
                    "score": 38,
                    "replies": [
                        {
                            "author": "AdSingle3338",
                            "body": "Both",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Solmyr77",
                            "body": "The face that launched a thousand plagues.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Alastor234",
                    "body": "Nuh Gorduz Backstabber has the best smile",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "Due-Proof6781",
            "body": "And the grandfather loves them all",
            "score": 35,
            "replies": []
        },
        {
            "author": "HelpfullOne",
            "body": "I just love their voice lines\n\n\"Time to enjoy ourself !\"\n\n\"I DO IT FOR MY CHILDREN !!\"",
            "score": 35,
            "replies": [
                {
                    "author": "Gungan-Gundam",
                    "body": "*Don't make me pick a favourite*",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Wardaz",
                    "body": "\"This will bring grandfather such joy\"",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "No_Jackfruit_4109",
                    "body": "\"Come children, see what gifts grandfather has brought\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tyberious123",
            "body": "Yea great uncleaned ones are great for the nurgle faction… but that’s it. They don’t get the fancy extra bound spells for warriors of chaos. And if I wanted missile soak I got chaos warriors or chosen high armor/ silver shields. They can duel okay… but if I wanted duelist for warriors of chaos I got plenty of good hero choices and other cheaper options. For nurgle they are fantastic unit late game. Absolutely a meme unit for multiplayer.\n\nSum up I find greater demons of every faction under Whelming for cost and amount of time it takes to get them. the exception being when playing the mono god faction and researching the tech. Then the greater demons cook. But for the warriors of chaos greater demons are really meh.\n\nBut great uncleaned ones get 10/10 for animations and fun factor.",
            "score": 24,
            "replies": []
        },
        {
            "author": "Bensteroni",
            "body": "I also love rolling one or two greater daemons in my late game armies for the same reason, but in the multiplayer community these guys suck. They don't have the best base stats to be worth their price tag. I think all greater daemons could do with maybe a 5% or 10% ward save to give them a little more survivability",
            "score": 44,
            "replies": [
                {
                    "author": "Xmina",
                    "body": "Issue is that alot of units that are garbage are really good in multiplayer like dwarf miners due to how cost works. So typically speaking a lategame unit either has to be able to clear out 5-6 units of miners or equivalent value by itself or isnt worth bringing. Thats why balancing campaign the same as multiplayer ends up with these really wonky situations where slannesh who gets mulched in autoresolve get big nerfs because their low teir crap in multiplayer outpreformed similarly costed units but they dont like add it back in as a tech lategame or something you are just gimped because of multiplayer battles.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Bensteroni",
                            "body": "Exactly! Seekers just outperform everything. But it's not always the case that big units fail to perform; the new Thundertusk for the ogres absolutely gets restricted or banned for multiplayer, they're just absolute units. That's why I suggested a moderate 5-10% ward save, since it wouldn't be super impactful in SP but it would be noticeable in MP",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Koolasuchus69",
                                    "body": "Seekers have a hitbox bug right now which is what is making them overperform.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Bensteroni",
                                            "body": "Oh is that what it is, okay, thank you. I thought it was something about their hidden stats like maybe attacking more often than their animation indicates or something",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Koolasuchus69",
                                                    "body": "That’s not far off tbf, the issue means that more of them can attack at once. iirc it came alongside a stat buff for them so they just blend everything now. \n\nNot really a factor you ever think about when comparing units but shows how impactful it is I guess lol.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Bensteroni",
                                                            "body": "After watching a couple of YouTubers or streamers discuss hidden stats, it's now one of the main things I think about haha, it definitely feels both impactful and weirdly unrepresented. We have ranged damage represented by a damage per 10 second value - why can't it also be calculated for melee?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Koolasuchus69",
                                                                    "body": "Stat analysis is how I ended up in mp lmao.\n\nI think it would be difficult to have where it wasn’t misleading in some form. Amount of entities in combat is always a factor, as is opponents melee defence. \n\nRanged attacks have factors as well of course but it’s easier to eyeball accuracy and the 2/3(?) missile block chances to adjust for the dps.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Gripmugfos",
                    "body": "You can always tell if someone plays singleplayer or multiplayer more based on how they talk about units, even if they don't specifically mention it. In multiplayer, cost effectiveness is paramount, since you are trying to put together the 20 best units you can with a given set of resources, in single player, after a while it's not a concern and you are just trying to put together the 20 best units period.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrimsonSaens",
            "body": "Their lore and design are both great, but their function in armies leaves something to be desired. The unit becomes good in campaign with tech and Ku'gath's buffs, but the exalted/lord version is just worse than the Nurgle daemon prince. In MP, both generic GUO's are situational at best.\n\nIf it was up to me, the Pestilent Decay ability would be exclusive to GUO's and maybe Tamurkhan/Epidemius.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Ampris_bobbo8u",
            "body": "if an army doesnt have a lot of missile units a greater unclean one general can solo the army.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Ascendant488",
            "body": "The diarrhea animation that they have is something special",
            "score": 7,
            "replies": []
        },
        {
            "author": "Sith__Pureblood",
            "body": "Nurgle >>> every other god and race in Warhammer Fantasy",
            "score": 18,
            "replies": []
        },
        {
            "author": "Rheanar",
            "body": "Why would you want an expensive late game SEM to just soak missile damage and charges? And shouldn't that be done by actually tanky units like chosen, or even better, lords and heroes? \n\nI wouldn't call having to research several techs to get 2 uses of bound spells \"extremely great spellcasting\". Researching several techs just to buff one unit is painful.\n\nBeing a slow SEM is just bad. Can never get it were it's needed in time, can never get it out if it's dying. Maybe if they were a lot tankier it would make up for it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Any_Grapefruit_6991",
            "body": "I just get them because they look so cute",
            "score": 2,
            "replies": []
        },
        {
            "author": "RasantReasand",
            "body": "Nurgle - always a big smile on the smelly belly",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ares42",
            "body": "In my experience a GUO with bound spells is one of the top 3 most impactful (normal) units you can put in an army. The fact that bound spells doesn't have a CD means if you bring 3-4 of them you can just decimate armies insanely fast. No other unit except maybe Dreadquakes can just slam down that much destruction on the battlefield.\n\nAre they amazing beyond the spells though ? Nope, but it doesn't matter when you already won the battle.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Koolasuchus69",
            "body": "Soak up missile damage? Their weakness to missile attacks is like the only thing holding them back lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Eexileed",
            "body": "Last time i played a Nurgle campaing i had like 4 of these in every army, impossible anyone would call them bad. These guys get 2 usages of bond spells for the whole lore of nurgle, which turns them into a caster. Thats quite a bunch of buffs and heals, debuffs and damage for free. And they got this freaking awesome design.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Antique_Ad_9250",
            "body": "The argument is like comparing apples and oranges. It's even wilder when I remember that GUO would beat all other monogod SEM on release.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dei_c",
            "body": "If there are no projectiles they are good, if the enemy has projectiles they are very useless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dovahkiin419",
            "body": "the thing with great unclean ones is you kinda need to get into their branch of the research tree to unlock their other two spells for them to really beat out road dragons. now i am doing that this campaign since i inherited 4 of the bastards when i confederated ku’gath, and yeah it is nuts to be able to drop 4 blight boils for free is absolutely insane, and 8 will be nuts, but they start off with a stream of corruption and miasma of pestilence, neither overcast, which is 8 winds of magic total, and miasma of pestilence is a bad spell when not overcast. \n\nI think they’re fine, they just require a good chunk of research investment that mostly benefits just them, especially since the right hand side of that branch has really small stat boosts for only a handful of units that you won’t be fielding many of. Admitedly the last two in that tree are also quite nice, the lore of nurgle is an extremely powerful damage source for nurgle armies, especially when not playing tamurkhan (not that it’s not still good just that when you’re playing tamurkhan you just get so many good damage units so fast) but going through those two mediocre nodes is a bitter pill to swallow",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yopcho",
            "body": "Running 19 of them with the techs that give them all the spells and more uses, is the funniest doomstack ever.\n\nFun, familly, pus, shit and carnage for all 🥰",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cassodibudda",
            "body": "If we are talking about turn 100+ when you have all techs unlocked, sure, they are not bad. But at turn 100+ you usually have already won a long time before and are just playing for the lulz\n\n\nBut before then, all the unlocking in the tech tree comes at a price, the opportunity cost of not unlocking other techs. So you have a GUA with spells and weaker chosens or stronger chosens and a toad dragon or a pox rider. I will take the latter thank you, I already have a Nurgle caster in the army (I am a single player player, in case it wasn't obvious)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tamsta-273C",
            "body": "They act more as spellcaster hero and not what would you expect from SEM. Nice to have a couple but wouldn't be sad without them as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nurgle_Enjoyer777",
            "body": "I love their voice acting.  they actually sound quite intelligent, if not the most intelligent of the greater daemons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "McBlemmen",
            "body": "Nah they're pretty awful. None of the greater demons are even close to being as powerful as they should be, with maybe the one exception being lords of change once you get all the tech tree upgrades.",
            "score": 1,
            "replies": []
        }
    ]
}