{
    "title": "Sieges may not be as bad as you thought - Testing/Dispelling Some Myths/Tips",
    "author": "Corsair833",
    "subreddit": "totalwar",
    "rank": 14,
    "score": 119,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 92,
    "url": "https://www.reddit.com/r/totalwar/comments/1je1mpk/sieges_may_not_be_as_bad_as_you_thought/",
    "id": "1je1mpk",
    "selftext": "Wall of text incoming - TL;DR at the bottom.\n\nI’ve heard many people say things about sieges which I wasn’t sure were correct - I’ve played quite a lot of sieges and actually quite enjoy them (I used to really not like them), and whilst they definitely have problems I think there is also a lot of misinformation out there, and because many people simply don’t enjoy them (or potentially misunderstand them, as I used to), I think that there’s a certain element of the ‘skill issue’ meme going on.\n\nI did a few quick tests to look into some of these. All testing is empire vs empire in custom battles, ultra unit size, normal battle difficulty, map is Altdorf, I’m defending the AI is attacking. All numbers are approximations averaged across several units however they’re broadly correct.\n\n**(1) Walls -**\n\n*\"Walls are useless, you may as well defend chokepoints\" -* Tested two units. - Xbow vs Swordsman\n\n**Land battle - Xbow vs Sword -** Directly charging at me in a Land Battle on flat terrain the Xbow gets off 3-4 volleys before the swordsman arrives, leaving a full health swordsman with approximately 103 models left and approximately 5200hp of its total 8280 remaining (approx 1/3 damage taken).\n\n**Siege - Xbow vs Sword -** Directly charging at my Xbow stationed on the wall the Xbow gets off around 6-7 volleys before the swordsmen climb half way up the ladder, leaving approximately 70 models left and 3500hp (approx 1/2 damage taken).\n\n* Important point - Once the enemy swordsmen were half way up their ladders I was able to retreat my Xbows to a new position deeper within the city (again on elevated terrain, either because of the map or on one of the firing platforms), giving my Xbow the chance to shoot its full volley again and from an elevated position. I can easily continue this tactic on any siege map until the Xbow runs out of ammo, meaning this 450 gold unit can perform easily for 1000+ gold.\n* Important point 2 - If you have an xbow on the wall and a swordsman directly behind it (also on the wall), you can kill much of the attacking unit with the crossbow, swap the crossbow and the swordsman (crossbow retreats into the city), and the swordsman can easily finish off the remaining attacking swordsmen (defender took around 1/10th casualties/hp damage) before retreating itself.\n\n**Land battle - Sword vs Sword** \\- 50/50 obviously as they're the same unit.\n\n**Siege - Sword vs Sword -** Directly charging at me on a wall - in the default formation when you click a unit onto the wall (4 men deep), leaving your men alone - the defenders won the fight, with approximately 4000hp remaining, and around 60-65 models.\n\n* Important point - The major casualties for the defending unit started when the attackers cut all the way through the centre of the unit and started hitting the defending units in the soldiers’ side. Prior to this they took very few casualties.\n* Important point 2 - Unfortunately you cannot drag units into a deeper formation, meaning they’re always going to get cut through if you just leave them there with no orders. Giving an attack order when the enemy are on the wall makes it take a far longer time for the attacker to break through the centre of the defender’s formation, and your soldiers more readily face the attackers, meaning they perform far better. As can be seen here around 2/3 of my soldiers survived an attack (when giving an attack order it is approximately 4500hp remaining and 78 models, meaning to defeat an equivalent unit you only lose 1/3 of your own unit).\n* Important point 3 - Trying to retreat your unit whilst there is an enemy coming up the ladders results in huge casualties. It's better to only fight when you're sure that the enemy will be routed, and retreat once they are routed.\n\n**(2) Towers -**\n\n*\"Towers suck\" -* they're not world winners but they're not too bad. A tier 1 tower will take approx 1/5th the health from a swordsman before it reaches the wall. A tier 2 tower approx 1/4th the health. Tier 3 approx 1/2 the health. Tier 4 I cba testing but it's quite a lot.\n\n* Important point - This is completely free damage, if I have tier 3 towers and you're attacking, and 2 of those towers are shooting, it's easily possible for me to kill 3-4 units (if we consider that most units rout at around 20% health remaining) *without having lost a single soldier myself*.\n* Important point 2 - A lot of the damage for these towers is AP, meaning that they can kill expensive armoured units. This can be very valuable.\n* Important point 3 - The wall towers do approximately the same damage as their supply-using build-able counterparts. This means that if you park a cheap spear unit under a built tier 3 tower, and the spear lasts let's say two times as long as it would have taken the enemy to reach the wall, a tier 3 tower can kill the equivalent of a unit of chosen (1250g) for the cost of 1400 supplies and a sacrificial lamb.\n\n**(3) Emplacements suck -**\n\n\\*\\*\\*\"\\*\\*\\**What's the point in barricades?\" -* They basically have the same force-multiplying effect as walls. Your own units can pass through them with no problems at all. This can buy you time for your ranged units to be shooting, doing lots and lots of damage. If an enemy is in melee with a barricade with ranged units stood on top of it, the ranged units will not fire. Place one of your own units in front of the barricade, and your ranged units will fire. When you feel it's the right time, retreat.\n\n**(4) Overall summary of my rambling**\n\n* Point 1 - Siege defences act as a force-multiplier. Depending on how well you play, how good the defences are, etc, you can expect a 2x to 3x force mutliplier. Don't expect your garrison with a gold value of 3000 to defeat a 19 stack of Chosen lead by Archaon. Do however expect it to be able to reasonably beat an army twice to three times its own strength/cost (if played correctly).\n* Point 2 - Elevation bonuses. CA released a blog a few years ago about how good elevation bonuses are. This can be seen when fighting from walls, or the tops of barricades, or even simply fighting on hills. Your units do a lot, lot more damage. Most siege maps are littered with places to fight with the hill advantage.\n* Point 3 - Fatigue. Whilst the enemy is attacking, your units get to stand still for quite a lot of the time. The enemy don't. Your units are generally fighting at a better level of fatigue, especially if you use the barricades to fight and retreat, then rest.\n* Point 4 - Always fight and retreat. If you defend your walls and retreat at the correct time (and the battle isn't horribly imbalanced), you can kill approximately the value of your own entire army before the enemy has even taken the walls. This is before you've even used your supplies. The important point here is retreating at the correct time. If you mess up your timing, you can take enormous casualties.\n* Point 5 - Each minor supply location should be defended by at least 5-6 units. If you don't have that many, it's better to just let them have it. If you have to sacrifice 2 units so that 3 can retreat to the next location, so be it\n* Point 6 - Sieges are confusing. There's so much going on that they can be really confusing and overwhelming. I suspect this is one of the reasons most people don't like them. Come up with a fight-and-retreat plan before pressing start battle.\n* Point 7 - **Added as edit** \\- *Enemies climbing over the walls everywhere*. This is true, and to clarify I would consider walls to only be the first line of defence. You should be losing fewer than 10% of your soldiers on the wall before retreating to the more defensive chokepoints. The point of the walls in the game is that it allows you to kill a significant amount of the enemy army whilst taking no damage yourself. Your main points of defence are the minor supply locations. As I said I have 5-6 units defend every minor supply location, and If I don't have enough I just pick the most defensible ones. I'm in no way suggesting it's a good idea to fight to the death on the walls; I'd only say shoot missiles from the wall and retreat in good time, and only fight in melee on the walls when it's going to be a quick rout before you retreat your melee units :). If they're attacking in 6 positions on the wall and you can get value from 3, get value from those 3 and retreat to the minor supply locations without getting bogged down.\n* Point 8 - **Edit 2 -** *The purpose of walls is free value, not to stand and hold*. As many people have pointed out, the enemy usually has more units than you, and will ass-ladder all over the place, meaning if your melee units fight it out on the walls they'll get surrounded and overwhelmed, even if they are winning. To clarify I don't think you should make your main stand at the walls, you will get surrounded and killed. I think you should shoot from them until the enemy is close, then retreat to the more defensible minor supply locations. The only reason I would have a melee unit fight on the walls is if it will rout a heavily damaged enemy unit quickly enough for my unit to retreat to the minor supply location.\n\nI hope that all of this perhaps makes sieges a bit more fun for a few people. Enjoy.\n\nTL;DR - Sieges may not be as bad as you thought if you give them another try, and make use of a few of the possible tips and tricks, some of which are shown here.",
    "comments": [
        {
            "author": "itzxat",
            "body": "I don't think most people who say, for example, \"Walls are useless\" literally think that there is no use to the walls. If defending units weren't at a significant advantage fighting on the walls that'd be ridiculous. \n\nWhat they mean is that since enemy units can climb up anywhere on the walls and the AI will never attack in a siege without substantially outnumbering the defender, there's no point in trying to defend them 90% of the time because the AI will just climb up everywhere and any units on the walls will either be surrounded or stuck in a fight on the walls whilst the enemy caps objectives. Might as well just defend the objectives directly. \n\nWhereas if you take older Total War games without magically spawning ladders, each enemy ladder or siege tower becomes its own choke point where you can actually bring the advantage of being the defender to bear. \n\nOther Total War games that do let units climb walls also do it better. \n\nThree Kingdoms allows units to scale walls but because fatigue is more impactful and arrow towers are dangerous and numerous. The player is discouraged from just rushing the walls. It can work in Three Kingdoms but is dangerous and you have many better tools at your disposal (fire arrows, siege towers, turtle formation, the almighty trebuchet). Even against a relatively weak garrison, if you just throw your units at the walls in Three Kingdoms you are gonna take heavy casualties. \n\nWarhammer 3 encourages just rushing the walls because it's way less risky than other games and if you don't rush in fast the enemy will build towers and barricades and make life even more miserable once you're in the city.",
            "score": 138,
            "replies": [
                {
                    "author": "Dreadcall",
                    "body": "There are some siege maps are cool to defend, like the empire forts.\n\n  \nBut most sieges do not take place on those maps. And the regular siege maps suffer from exactly the problem you say. \n\nThe AI will not attack them unless it has a significant autoresolve advantage. This means it usually has a large numerical advantage. It will split up its forces to attack multiple wall segments, and you simply cannot commit enough forces to each to stop or even meaningfully delay them. If your try to hold as many  attacked walls as you reasonably can, some portions of the attackers will make it into city unchallenged, and will be able to win through capturing point faster than the fight for the walls is over.\n\nYour other option is to try to funnel the enemy in the paths inside the city, in a way that prevents the enemy from winning by capture, and hold them in chokepoints, preferably under buildable towers.\n\nThe former is somewhat viable against the very slowest of enemies, but usually the latter is the more successful option.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "NoticeDear7552",
                            "body": "> The AI will not attack them unless it has a significant autoresolve advantage.\n\nThis is only true on lower difficulties of the game. On higher difficulties the AI takes pretty much any fight it has a slight AR advantage in, making sieges both more common and more winnable.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Dooglers",
                                    "body": "In my testing difficulty level has 0 impact on what fights the AI will take.  It is pretty easy to test.  Play at highest difficulties and wait until the AI attacks you over end turn and they have an auto resolve victory.  Then load up the end turn and lower the difficulty.  They will still attack you even if they now are projected to get a decisive defeat.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "NoticeDear7552",
                                            "body": "Given how complex the AI is I don't think that actually proves anything. Fiddling with the difficulty mid-campaign seems like a great way to mess up how the AI works, in fact.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Travolta1984",
                                    "body": "Not from my experience. I play exclusively on VH and can't remember the last time I defended a siege battle.\n\nMaybe it's the AI mod that I use, who knows",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "NoticeDear7552",
                                            "body": "I play on legendary and I have to play defensive sieges pretty regularly. The only reason I could see that someone wouldn't be is if they're not playing aggressively enough on the campaign map.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Noraver_Tidaer",
                    "body": "It's not just about this, either.\n\nIt's that while your army is sitting on top of the walls waiting for the approach, you're getting sniped and blown up by siege weaponry, fire power, and spells.\n\nIt's great that OP likes to test, but test against a real army, not just a unit VS a unit.  In a realistic situation, your archers are getting struck by lightning, jumped by furies, peppered with arrows, or having boulders tossed at them.\n\nIt's not as easy as *\"Just retreat them when the enemy is close!\"*.\n\nOne of the major contributing factors to this is that towers have such a MASSIVE range (Which is fine), but enemies can spawn in already half way to your siege defense.  It gives the towers barely any time to shoot.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Abandonment_Pizza34",
                            "body": ">It's that while your army is sitting on top of the walls waiting for the approach, you're getting sniped and blown up by siege weaponry, fire power, and spells.\n\nI don't quite follow your logic: an enemy using siege weapons to besiege you is bad somehow? Like, yeah you can't just chill atop a wall while your towers kill everybody, that would've made sieges unbearably boring, don't you think?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Justicar-terrae",
                                    "body": "Sure, but the problem isn't that attackers have useful tools. It's that fortifications aren't a significant obstacle for the attackers to overcome. It's like assaulting a sandcastle with a bulldozer, the fortifications are so trivial that the dozer itself is entirely unnecessary. \n\nHere, the walls don't significantly slow the enemy's advance, which means their only real utility is to offer your ranged units a platform from which to fire a few volleys at the approaching army. This utility is *easily* stripped away by artillery, magic, or flying units that will kill and/or detain your ranged units while the enemy army continues its advance. At that point, you will lose more units than if you had simply ignored the walls to defend a capture point. When defensive structures make your units *more* vulnerable, it's easy to see how people become frustrated with defensive sieges.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Abandonment_Pizza34",
                                            "body": "I still don't get the logic. Like, yes, it's supposed to be hard to conventionally defend a pseudo-medieval fortress against giant ass dragons, demonic giga-cannons and mages capable of sending cosmic astral avalanches on top your head. Real life armies wouldn't have to chill for 3 years besieging some random castle if they had mammoths and giant zombie bats.  What's the supposed \"fix\" for this?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "fish993",
                                                    "body": "I don't think it's the dragons/monsters/magic that is anyone's main issue with sieges, it's the fact that the walls barely limit enemy infantry in the first place, and infantry make up the core of virtually every army (especially early on). It's trivial for a larger enemy army to spread out and have units climbing the walls far beyond the ability of the defenders to block. If walls had the basic utility of actually funnelling the attacker through chokepoints (whether that's the gates, siege towers, or holes in the wall with artillery) then having to consider enemy units that can attack defenders on the wall would be an actual decision, whereas now it's just putting your units in danger for barely any benefit.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Justicar-terrae",
                                                    "body": "It would be very difficult indeed to defend a mundane castle against such threats, but the castles of Warhammer are presumably designed with such threats in mind. Nobody is gonna waste time and resources building a useless fortification, so if the Empire/Dawi/Elves/etc. build a fortress, they'll build one that can stand up to these threats. \n\nAs for in-game solutions, the most obvious fix would be to remove units' spontaneously generated pocket ladders. In older titles, armies had to spend a turn or two building ladders like we currently do with siege towers. With a limited number of ladders, attackers couldn't as easily swarm the walls to overwhelm the defenders; they had to wear the defenders down with successive (costly) waves.  \n\nAnother fix would be to implement designated staircases/ramps for the walls, like we had in older titles. These structures acted as secondary choke points for defenders to keep enemies from pouring into the city. Each wall had several ramps, so attackers could still outflank the defenders with sufficient numbers. But attackers couldn't just swarm into the settlement across its entire front all at once like they currently do. \n\nA third fix would be to implement better choke points in city streets. Obviously not every city is built with siege defense in mind, but castles and forts should have sensible defensive layouts with multiple kill zones. Towers shouldn't be positioned behind architecture that blocks their view of the capture zone, and defensive platforms shouldn't face nonsensical directions. Medieval 2 and Shogun 2 did this well with multi-walled and multi-tiered castles, respectively. Even Empire did a decent job with its star forts and garrisoned defensive buildings.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Abandonment_Pizza34",
                                                            "body": "I don't see how choke points, ramps and lack of ladders would change the fact that giant zombie dragons from outer space and demonic cannons shooting magical fireballs make \"archers on the wall\" tactic obsolete. Or what kind of castle design is supposed to counter any of that, without total bs like force fields and such. \n\nAs I already said in another comment, the real problem is that when playing without unit caps you start facing crazy doomstacks around mid game. When most of the enemy army is infantry or cavalry like it's supposed to be, sieges become pretty easy, even with ass ladders and all the other nuisances.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Justicar-terrae",
                                                                    "body": "To answer your first specific hypothetical, these changes would make it far easier to deal with the dragon by extending the window in which the dragon must fight without the support of grounded troops. If you didn't need to worry about the enemy infantry swarming your walls en masse, you could park a few anti-large units on the wall to defend your archers from flying monsters. And while the dragon is occupied by your spearmen, your archers can resume their harassment of the units below. \n\nThese proposals would help against artillery for the same reasons. \n\nTo start, let's look at how we currently deal with enemy artillery as a faction without summons or map-wide army abilities. At present, the only answer to attacking artillery is to man the walls so that your towers can shoot back. But since the enemy can swarm the walls, you'll often lose control of the towers very quickly. If the towers were more strategically spaced and/or harder for attackers to capture, then you would have an easier time fighting back.\n\nBut also, and perhaps more importantly, if your archers have more time from the wall before being overrun, then their losses to artillery would be more acceptable. In general, artillery is more devastating to undamaged units (more standing models means a bigger target), meaning the first few shots are the ones that hurt the most. Taking that damage to get off 2-3 volleys before abandoning the wall is rarely worthwhile. But taking that damage (plus a little more from follow-up shots) to launch a dozen volleys at the enemy below is a more enticing prospect. \n\nAnd if you have a multi-walled setup, like Empire or Medieval 2, then the primary walls can block some of the shots aimed at units on the secondary walls.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Abandonment_Pizza34",
                                                                            "body": "I'm sorry if that sounds rude, but most of your comment boils down to \"I want archers on walls to work against any enemy no matter what\". \n\n>let's look at how we currently deal with enemy artillery as a faction without summons or map-wide army abilities\n\nBy having units that counter artillery (of which there's like a million options), not by putting archers on walls and wondering why they're getting wrecked by cannonballs.\n\n>And if you have a multi-walled setup, like Empire or Medieval 2\n\nYou already have a multi-wall setup, that's what platforms and barricades are for. You've got a ton of options where to put your troops, that's the point of this system. Sometimes it's archers on walls go brr, sometimes you've got to get creative. \n\n>then you would have an easier time fighting back\n\nAgain, siege battles are already very easy when facing more \"normal\" army compositions instead of crazy doomstacks that AI throws at you in vanilla TWW. It's fixed easily with unit caps so that you don't have to play around 50 hell cannons obliterating your archers on the walls.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Justicar-terrae",
                                                                                    "body": "Fair enough. And, I hope you aren't offended when I say that most of your responses seem to boil down to \"I don't think fortifications should be meaningful obstacles to attacking forces, but I don't like when the AI brings strong units.\" \n\nI'm glad that mods exist to enable unit caps for those who want them. But not everyone feels that unit caps are an adequate substitute for core siege features that were present in prior titles.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Abandonment_Pizza34",
                                                                                            "body": "I'm not offended, it's just my point is exactly the opposite: fortifications are already formidable obstacles, and AI having tons of strong units is the only thing that can make sieges hard as a defending player (but still pretty easy because without unit caps you can bring a ton of strong units as well). \n\nIn fact, you're the one complaining that siege battles are too hard because archers on the walls aren't as efficient as you'd like them to be. This has nothing to do with \"core siege features\" because those are either a) irrelevant like pocket ladders; b) already in the game like \"multi-wall designs\"; c) make no sense in a world of magic and giant demon dragons.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Covenantcurious",
                                                    "body": ">Like, yes, it's supposed to be hard to conventionally defend a pseudo-medieval fortress against giant ass dragons, demonic giga-cannons and mages capable of sending cosmic astral avalanches on top your head. Real life armies wouldn't have to chill for 3 years besieging some random castle if they had mammoths and giant zombie bats. What's the supposed \"fix\" for this?\n\nGive the defender equally fantastical defences?\n\nSame as real life fortresses started fielding cannons and mortars almost as soon as armies did.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Abandonment_Pizza34",
                                                            "body": "Equally fantastical defenses would make sieges literally impossible to lose. You already have towers firing magic ice comets and spawning from thin air in the middle of a fight, what else do you want, ground-to-air missile systems to counter fell bats?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Holy_Anti-Climactic",
                                    "body": "I think his problem is that op had the idea first, that sieges are good for defenders, and created the test to prove it. He talks about how good the archers on the wall are and how they lose no health and are free to retreat but has no counter archers, wizard, or artillery harassing them at the same time. So his test is not as conclusive as it may first seem.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Abandonment_Pizza34",
                                            "body": "The test shows that a besieged army would easily defeat a 2-3 times bigger attacking army of similar composition. Good siege equipment will make it easier for the attacker and harder for the defender. That's kinda the purpose of siege equipment.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Timey16",
                    "body": "> Other Total War games that do let units climb walls also do it better. \n\nIn more detail: either the climbing took ages, SERIOUSLY exhausted units (and exhaustion was a MASSIVE debuff compared to Warhammer) to the point they died like flies, Units could fall in the climbing attempt and die meaning just climbing would cost you tons of casualties or a mix of the three.\n\nClimbing a wall was therefor more of a emergency response but not the go to default with a siege tower as a \"nice bonus\".\n\nI think what walls need is the ability for units to shoot straight down (like Machicolations) so then your archers and gunners can just shoot at the completely defenseless guys climbing up the wall.\n\nWhat I see also as a possibility would be certain polearmed units (or other long range melee units) being able to throw down ladders killing all units currently on them and potentially breaking the ladder (once all ladders have been destroyed no more spawning ladders for that unit).\n\nSo by massively manning the walls with helbadiers and have them run the wall up and down and destroy the ladders you could in theory just completely shut down all ladders until the enemy runs out of them.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "CrimsonSaens",
                            "body": "What are the fatigue debuffs in 3K? I can't find them listed online.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Corsair833",
                    "body": "**Force multiplier -** I appreciate what you're saying and this is something I've heard many times, what I'd say to it however is that many players expect their forts to be much stronger than I think may be fair for them to be. As I said forts currently allow you to fight with a 2-3 force multiplier, which I think is quite a fair number. I think that perhaps if you're in a position where your opponent is so much stronger than you that they can climb anywhere without you being able to address them at all (even with retreating to the minor supply locations after getting value from the walls), perhaps you should lose.\n\n**Ass ladders -** If it's simply that the opponent has more units than you (as is usually the case), I'd say get as much value out of the wall as you can and retreat to chokepoints/minor supply locations before you take any damage. I think the idea is that you shouldn't be actively fighting at the walls unless you can get a very quick victory, you should be fighting mainly at the minor supply locations (chokepoints). You can't cover every area of the wall, and naturally your opponent is going to pick certain areas you can't cover. You just use the walls where appropriate to get free value *where you can* without actually committing to a fight. If you're outnumbered, pick a couple of locations to fight and retreat.\n\n**Towers -** An additional point I'd raise is that if your opponent is spreading out all over the map, this gives you the opportunity to garrison more towers (and then retreat once the opponent is close, before you take any damage). More towers means more free damage. If I have two tier two towers shooting that nets me perhaps 1-2 unit's worth of damage. If the enemy's so spread out that I have 5 towers shooting? Perhaps 3-5 units worth of damage?\n\nRegarding the AI not attacking unless they're at an overwhelming advantage, I'm not sure if this is true. I've frequently had the AI attack when their force is approx. 1.5x as strong as my force (including my garrison). At 1.5x my strength plus my walls the attacker can be quite easily defeated.\n\nPlease let me know if you have any thoughts on this :)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "itzxat",
                            "body": "I don't think you're wrong I think we're just looking at it from different perspectives. \n\nFor me the problem isn't that they're too hard or I don't know how to play them it's just that I don't find the ways that they play out fun compared to previous games. \n\nOther Total Wars feel like you're defending a city, Warhammer 3s feel like you're playing a tower defence game. And because the defender can build all these defences mid battle, the attacker is encouraged to play the role of a tower defence game and charge in as fast as possible, unless you have an overwhelming artillery advantage and it happens to be artillery that doesn't suffer game breaking Line of Sight issues when trying to shoot at enemy units. \n\nIf you like the way Warhammer 3's sieges play out then honestly more power to you I'm glad someone has fun with them but I just don't like em.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LilXansStan",
                    "body": "“AI will never attack without substantially outnumbering the defender”\n\nIm running a Skarsnik campaign right now and saw Gorbad sieging Barak Var’s last settlement and decided to try confederating him. However, once i got into the region Gorbad and two other full stacks plus their three Waaagh stacks grouped up and just sat there for 7 turns until the dwarf city surrendered\n\n60 greenskin units sitting there starving out a dwarf minor settlement with literally no other territory or armies just makes no sense. Especially when after confederating i saw that Gorbad already had 4 provinces but stacked all his armies and brought his rapid expansion to a screeching halt for seemingly no reason other than knowing i was about to pounce on Gorbad and force a confederation",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Agtie",
                    "body": "> Might as well just defend the objectives directly. \n\nThis logic only works because the AI is garbage. It will climb the walls even if you don't defend them, so you get the exhaustion bonus regardless. It then trickles around the city, throwing a few units at you at a time for you to pick off.\n\nIt's essentially cheesing the AI, it hasn't been programmed to handle a defender that doesn't spread out to defend the walls and you're exploiting that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CrimsonSaens",
                    "body": "I lean more on these are people simply repeating an easily memorable catchphrase they read/heard somewhere. Replying to some people who have made the \"walls are useless\" argument in the past revealed to me many of these people don't know basic facts like the fatigue penalty from climbing ladders.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "itzxat",
                            "body": "Whilst I'm sure there's some of that as there always is, you also have to consider the fact that if the walls \\*feel\\* useless to the vast majority of players then doesn't that say that there is something flawed about their design?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CrimsonSaens",
                                    "body": "Trying to parse flaws of game design through player \\*feels\\* in the modern day is a quest of madness. Not only do you have several layers of bias to weed through, but modern day discourse is flooded by people parroting what they read/heard on social media. Blake's Takes made an awful video about sieges last week, with one section called \"walls don't matter.\" That video is very likely to affect online discourse more than OP's testing, or even the realities in the game.\n\nThe only safe conclusion to gleam from online commenters feeling the walls are useless is that there are still serious flaws in the siege game mode. Whether the problem is actually the walls, and what the solution is, requires data and testing to solve.\n\nAlso, /r/totalwar is not the \"vast majority\" of players. Even the aggregate of all online discourse isn't the vast majority. Most people are playing games casually for fun. They load up a game, think it was neat or bad, turn it off, and never comment on it to others outside maybe their personal friends/family.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PuzzleMeDo",
            "body": "What you're describing is defensive sieges. Yes, it's true that someone defending in a siege can make quite good use of the walls etc, if they try. They can also do pretty well ignoring the walls if they know how to setup a good chokepoint.\n\nPersonally I *don't* know how to set up a good chokepoint because I don't fully understand which points I need to defend and which points I can ignore.\n\nWhy? Because I don't get enough practise, because the AI hardly ever assaults cities unless it has completely overwhelming force. Even if you can win (sometimes because the AI screws up and leaves its second army standing outside the walls getting shot at), it's a fairly rare and insignificant part of the game.\n\n95% of the siege battles I fight are when I'm the attacker. And the AI is very bad at using walls.",
            "score": 29,
            "replies": [
                {
                    "author": "Book_Golem",
                    "body": "I kind of feel like the AI is passable at using walls. Put unit on wall, defend wall. Sure, it doesn't retreat like the OP describes, but it holds your forces up and gets them shot by towers a bunch.\n\nWhat I find it's bad at is defending the rest of the city - the AI will throw wave after wave of troops into your units after you breach the gates or take a wall, and the siege generally turns into a grind there where you win on army losses before ever having to interact with the city itself. \n\nAs a caveat, this sounds nigh impossible to program, so I do understand why it's like that!",
                    "score": 5,
                    "replies": [
                        {
                            "author": "PuzzleMeDo",
                            "body": "I can usually position my forces to hardly anyone gets shot by towers. (Most siege maps have a pretty blatant weak point.) And the AI does bare minimum \"stand on walls\" defending, but they don't tend to (for example) fire arrows as you approach, then switch in a melee unit as you climb the ladders, and retreat the archers down into a position to shoot up at attackers who have reach the top.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Book_Golem",
                                    "body": "That's fair. There are definitely a few maps with obvious coverage issues! At least the wider firing angle means you can't just stand between the towers anymore.\n\nI guess my point is that I notice more issues after breaking through the walls (or the gate) than before that point.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wild_Marker",
                            "body": "When even the players are struggling to figure out how to defend, the AI is going to have an impossible time. \n\nThe maps just aren't built for the armies fighting in there.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Corsair833",
                    "body": "Yep the battle AI isn't amazing at sieges unfortunately but it's broadly serviceable. It also kinda sucks in land battle :(. Regarding CAI not attacking - it does rarely attack you're right, it usually attacks in my experience when it has around 1.5x the strength of the garrison (which I think is fair, it'd be no fun at all if the AI suicided its armies into your forts repeatedly). I learned how to play them mostly by messing about in custom battle, and now I find them much more fun in campaign :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "temudschinn",
                            "body": "Sorry, but saying the AI is passable at defensive sieges is sugarcoating the issue.\n\n\nIn many matchups, the AI is so terrible at handeling defensive sieges that it performs worse than in land battles. An army that might be a challenge in an open field is often a pushover when besieged.\n\n\nThe reason for this is that the AI spreads out their army along the walls, making it very easy to overcome them by just concentrating on a few key areas. They are also very bad at defending victory points, i've won battles where some dangerous elements of his army were still alive but defended a useless piece of wall.\nWorst of all, they absolutely love to clump  up 5++ units against a single hero that dares to pass through a gate (and get obliterated by aoe spells).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Marcuse0",
            "body": "Comparing one swordsman against one crossbow unit doesn't really address the issue of walls, which is that almost every single unit that isn't monstrous or cav can scale the walls and there's no way to effectively cover all the walls to fight up there. Walls provide no defensive bonuses to units on top of them, and trying to cover multiple angles of attack allows you to be taken apart piecemeal instead of fighting together at a choke point. \n\nSieges used to work better when units had to build each piece of siege equipment and you could station your units where the siege equipment was and concentrate your defense where the enemy will attack.\n\nAdvocating \"always fight and retreat\" makes no sense when the cities are so huge that your units can't reach your fallback positions before they're caught and run down which happens a lot. What this amounts to is it's preferable to leave *token* forces on walls to activate towers only.",
            "score": 32,
            "replies": [
                {
                    "author": "Chagdoo",
                    "body": "I don't see why a unit atop a wall needs a defensive bonus when your attacker will be heavily fatigued when they finally ass ladder up to you. The fatigue is already effectively your defense bonus.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Covenantcurious",
                            "body": ">I don't see why a unit atop a wall needs a defensive bonus when your attacker will be heavily fatigued when they finally ass ladder up to you.\n\nLook at OP's post: \\*\"\\****Siege - Sword vs Sword -*** *Directly charging at me on a wall - in the default formation when you click a unit onto the wall (4 men deep), leaving your men alone - the defenders won the fight, with approximately 4000hp remaining, and around 60-65 models.\"*\n\nIn a perfect mirror-match the defender took nearly 50% casualties, *Swordsmen* on Ultra is 120 models, because of how formations and wall fighting works as described just after. That is an awful showing to me, quite clearly showing that *Fatigue* isn't enough. Just imagine if more offensive units like *Chaos Warriors* or *Savage Orcs* climb up, possibly supported by characters/mages or missile units.\n\nTo me this test really shows that walls are significantly underpowered. A mirror-match should be an uncontested sweep.\n\nEdit: on the casualty calculation it is important to remember that the attacker isn't killed to the man but rather routed, probably at 20-30%health.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Agtie",
                                    "body": "That's substantial, and is one of the more climber favoured examples. \n\nSwordsmen have basically no armor, so the armor loss from exhaustion has minimal impact, and the loss of charge is a wash as they both have the same charge bonus.\n\nThe way Melee Attack and Defense work also are also minimized in this scenario. It becomes far more critical when there are large disparities between the units, Ex: Defensive unit on walls vs offensive unit climbing. In some extreme examples, like high MD units vs low MA climbers, you can end up with the impact of exhuastion being as much as quartering the climber's DPS (if you factor in how much of their damage would have been the charge they don't get to do).\n\nSwordsmen vs Swordsmen, the impact of exhaustion on the climbers is like -35% DPS, +15% damage taken (mostly MD impact), before accounting for the entity trickle factor. \n\nChaos warriors will be taking about 50% more damage (mostly armor impact), -30% DPS.\n\nSavage orcs take barely more damage, just lose the ~30% DPS, but more importantly for both them and Chaos Warriors is they don't get to use their charge bonus at all, which is a huge part of their damage in a field battle scenario.\n\nPlus this example is leaving the unit alone, if you order it to attack the climbers or reform It does a lot better.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Corsair833",
                    "body": "What I'm saying is that you need to pick your moment to retreat. If your units are actually fighting at a disadvantage on the walls I believe you have not retreated quickly enough. The only times I would stand and fight on a wall is if I knew that my melee unit would defeat their melee unit and then be able to retreat.\n\n  \nRegarding defensive bonuses on walls, ranged units get a very significant elevation bonus, and thus do lots more damage. Melee units don't get stats bonuses however they do get the opportunity to have several of your men fighting one or two of the attacker's men once they climb up over the ladder. As you can see from my testing, the defending melee unit always quite significantly wins when defending against an equivalent unit on the wall. If you fight against a unit you've already shot mostly to death with your now-retreated ranged units, you can frequently rout said unit (and then retreat yourself), whilst taking practically no damage.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Agtie",
                    "body": "> Walls provide no defensive bonuses to units on top of them\n\nThey provide immense defensive bonuses.\n\nCompare a swordsman vs a swordsman climbing the wall. The one on the top of the walls brutalizes the climbing version. Exhaustion + trickling entities is a huge disadvantage.\n\nThere's also huge damage reduction against missile units, immunity to a number of spells, and immunity to grounded large units.\n\n> your units can't reach your fallback positions before they're caught and run down which happens a lot.\n\nEnemy units climbing the walls are exhausted (-15% speed) and take a very long time to actually get the entire unit over the walls. \n\n> fighting together at a choke point\n\nWhat you are refering to is cheesing the incompetent AI, which will trickle a couple units at a time to your choke in the middle of the city after exhausting themselves climbing unprotected walls. The AI was not designed to attack an opponent that doesn't spread out to defend the walls.\n\nA competent opponent would enter without climbing the walls (so no exhaustion), capture all free points first (giving them bonuses), then hit you with everything all at once. They would also bring an army that isn't 90% melee infantry, and would likely have the advantage in the choke battle due to having artillery / ranged / magic advantage.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "blodgute",
            "body": "The thing about walls being useless isn't that walls don't help one unit beat one other unit\n\nThe reason people don't like walls is that they don't fulfil their primary defensive function of allowing a smaller force to hold off a larger one.\n\nIf I stick a unit of swordsmen on the walls, the enemy is going to climb up the entire wall and sure I'll fight off the one enemy unit that climbs up right in their face, but all the others are going to either flank it or just run to the capture points.\n\nMeanwhile if I stick my swordsmen in a street behind the wall, the enemy can't get past without going through my swordsmen. \n\nNow personally I don't think walls are useless, but they are far too easy to get on and off, which makes them feel pretty shit to use",
            "score": 29,
            "replies": [
                {
                    "author": "Corsair833",
                    "body": "This is why I say fight and retreat, yes I also use the chokepoint in the street behind the wall, but I squeeze as much damage out of the wall defence as I can first. I would only ever fight a melee fight on a wall against a unit I know can be quickly routed before I'm able to retreat to the chokepoints you mentioned. If my unit is going to get bogged down instead of routing the enemy quickly I'd rather retreat to a chokepoint. The point is that it allows you to very easily rout a much weaker (usually very damaged) unit without taking many casualties yourself.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Hrydziac",
                            "body": "The problem is the AI will generally not attack settlements without a pretty large advantage, so keeping units on the walls is usually less viable than just stacking all your units on the best chokepoint before the victory location. By the time you even have a few kills the other units are on the walls and will run inside, so if you're going to have to retreat right away anyways you may as well save your vigor and deploy inside on the chokepoint. \n\nAlso, I could be wrong but I think most complaints about sieges are talking about offensive sieges.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Better_Employ_8104",
            "body": "I thinks siege maps are too big. Plus i wish there is no limit on garrison capacity. e.g. when u have t5 walls and hall and ur friend builds outpost it should not replace some of your units.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Moidada77",
            "body": "They are objectively worse than other sieges in the franchise in comparison is the point.\n\nThe paths are too small for ultra and large... like play on small or medium and units tend to jitter and get stuck less.\n\nBut no one wants to play warhammer with like 300 men armies.\n\nSome maps are better.\n\nCathay wall maps have the best use of walls where it's an incentive to defend them as hard as possible with ample space for fighting outside and sallying out to prevent ladders hitting walls.\n\nSome chaos maps are just rat mazes.\n\nThe barricade system would be good IF the AI didn't path through them to defend them.\n\nTowers are whatever...they are functional.",
            "score": 8,
            "replies": []
        },
        {
            "author": "naturtok",
            "body": "This is going to make me try more sieges. I think the only point that sucks now is how shitty garrisons are and how we have so little control over what goes into them. \n\nIf I could choose what units were in my garrison, I'd be much more attached to the army and my ability to defend the settlement. \nI wonder how difficult it'd be for buildings that add garrisons to just add gold value, and then you can customize your garrison with the accumulated gold value. I guess that's sortve like just having an army dedicated to defense, but with supply lines and the general emphasis on attacking over defending there's already enough keeping me from making defensive armies by choice.",
            "score": 10,
            "replies": [
                {
                    "author": "federykx",
                    "body": "They should just have made garrisons work like in Medieval 2",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Corsair833",
                    "body": "Great stuff glad to hear it! :)\n\n  \nWhat I'd say regarding garrisons is that the way they're designed right now they're supplemental to armies, and not a replacement for them. They allow one of your smaller armies to defeat an opponent's much larger army, by retreating to a city. I personally prefer this approach as it encourages the player to actively play on the campaign map rather than just building castles everywhere and only using armies to attack and not defend. \n\nCurrently an empire tier 2 city garrison building costs 1600 and provides tier 2 towers/gates as well as 4 units. The units it provides have a total cost of just over 2000 and crucially cost absolutely no upkeep (without the garrison those units would be around 650 upkeep), making it one of the most cost-efficient buildings in the game :)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "naturtok",
                            "body": "Yeah thats definitely fair. Though, I typically play tomb kings which has army caps, making it not easy to keep an army on hand for the inevitable beastman army coming out of nowhere or tzeentch nonsense. On vh/vh or vh/legend, garrisons are significantly weaker than any army that will be attacking mid/late game, so I've rarely felt having the garrison helped since even with all the tricks and tactics the garrison is both too weak and rarely consisting of the units you'd want in that situation. \n\nIdk, I can try and pay more attention to my garrisons and see if I'm just missing it, but it just feels so bad spending 30 minutes trying to win an unwinnable defense vs just auto resolving and sending an army over to take it back. I just wish a fully built up garrison actually felt like it could reasonably defend against a single doom stack or even just a well-made army, because on higher difficulties it just doesn't feel that way. \n\nIdk. My bad on the rant lol I'll be playing sieges with my actual armies now, at least",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "recycled_ideas",
            "body": ">Walls - \"Walls are useless, you may as well defend chokepoints\n\nThe reasons walls are useless is that you'll never have enough troops to man them and so the enemy can come up where you don't have them.\n\nThere are also units that handle ranged fire much better as well as ogres which can just destroy a wall or gate 45 seconds in. Lots of factions can also just shred things on your walls including Empire. I've never seen ranged do close to that kind of damage against, but Empire has fairly weak melee and fairly strong ranged.\n\n>Towers - \"Towers suck\" - they're not world winners but they're not too bad. A tier 1 tower will take approx 1/5th the health from a swordsman before it reaches the wall.\n\nAgain, you're testing against a slow trash unit with limited armor, they don't do anything like that against most targets and once the walls are breached they're basically useless.",
            "score": 7,
            "replies": [
                {
                    "author": "Corsair833",
                    "body": "See here\n\n  \nPoint 7 - **Added as edit** \\- *Enemies climbing over the walls everywhere*. This is true, and to clarify I would consider walls to only be the first line of defence. You should be losing fewer than 10% of your soldiers on the wall before retreating to the more defensive chokepoints. The point of the walls in the game is that it allows you to kill a significant amount of the enemy army whilst taking no damage yourself. Your main points of defence are the minor supply locations. As I said I have 5-6 units defend every minor supply location, and If I don't have enough I just pick the most defensible ones. I'm in no way suggesting it's a good idea to fight to the death on the walls; I'd only say shoot missiles from the wall and retreat in good time, and only fight in melee on the walls when it's going to be a quick rout before you retreat your melee units :). If they're attacking in 6 positions on the wall and you can get value from 3, get value from those 3 and retreat to the minor supply locations without getting bogged down.\n\n\n\nPoint 8 - **Edit 2 -** *The purpose of walls is free value, not to stand and hold*. As many people have pointed out, the enemy usually has more units than you, and will ass-ladder all over the place, meaning if your melee units fight it out on the walls they'll get surrounded and overwhelmed, even if they are winning. To clarify I don't think you should make your main stand at the walls, you will get surrounded and killed. I think you should shoot from them until the enemy is close, then retreat to the more defensible minor supply locations. The only reason I would have a melee unit fight on the walls is if it will rout a heavily damaged enemy unit quickly enough for my unit to retreat to the minor supply location.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Travolta1984",
            "body": "This post just reminded me that I can't remember the last time I played a siege battle as defender. Today the AI almost always prefer to drain your troops using attrition\n\nSome of my best WH2 memories were, playing as Empire, defending your settlements against, what felt at the time, insurmountable chaos invasions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "YOuNG53317",
            "body": "Sieges will always suck ass until they fix the gate bug and pathing bug. I don’t mind defending sieges but attacking is atrocious",
            "score": 5,
            "replies": []
        },
        {
            "author": "litmusing",
            "body": "Sieges clicked for me when I finally gave in and decided to fight the two or three small battles at separate walls instead of one big one like back in WH2. \n\n\nSplitting up my resources and micro like that didn't feel intuitive, but it does make the enemy split theirs too, and I was surprised at how effective just one ranged unit can be.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LeMe-Two",
            "body": "First, most of the time you are not 1:1 enemies in sieges but are attacked by larger forces.\n\nThe real problem with \"wall being useless\" is not them not being well, walls and behaving like ones, but the fact that EVERY small unit (including flying ghosts lol) will pull out a ladder making them extremely easy to overrun from every direction. \n\nThe fact that cities most of the time are in the middle of nowhere means 90% of the time, garrison will get attacked from too many directions making it better to ditch the walls and go somewhere inside.\n\nFR why does mountain fort have attacker deployment zone all around itself?",
            "score": 4,
            "replies": [
                {
                    "author": "naturtok",
                    "body": "I wonder how much of this could be solved by just making the maps larger and moving the deployment zones out. Give the defender a better fighting chance to pelt the enemy on their approach. Add spots for you to set up arty and have the deployment zone be further than arty range to really make sieges feel like they have multiple stages (approach, bust through, street fighting). Would also, as an attacker, make alternative units like flyers, stalk units, and cav much more valuable than they currently are, improving army variety.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "mimd-101",
            "body": "I tend to move back to choke points with buildables (which are great). There are just a lot of walls to cover and I find it hard to pull troops back fast enough. But it's usually with garrison only forces. If I have enough troops I'll layer them, a few at the beginning walls, then back to chokepoint, etc. Priority is trash first. Some choke points, like nuln's castle, are so much better than others, that it's a poor choice to defend most of the city and better to devote all to the choke point.\n\nI don't mind sieges. Only real annoyance I've had is some wonky AI that sits outside waiting, but it's only happened a few times for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cleverbird",
            "body": "I mean, my main issues are the horrendous pathfinding, shitty collision boxes around buildings, ass-ladders and the fact the AI can multitask like a bazillion things at the same time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NomadBrasil",
            "body": "Play Pharao and see how shit the sieges in Warhammer are",
            "score": 1,
            "replies": []
        },
        {
            "author": "stiffgordons",
            "body": "Respectfully, your analysis looks like a good and fair assessment of the merits or otherwise of sieges as a form of gameplay.\n\nTo me, this entirely misses the point.\n\nI don’t want “balanced” sieges, I want sieges that feel like sieges. Arbitrary stat bonuses don’t achieve this. Ass ladders certainly don’t. Defense in depth? I’m sorry did I miss the memo where we’re playing a WW1 trench war simulator?\n\nI want to make my glorious stand on the walls of Altdorf or lay the Kunnin’ plan to overrun the walls of Karaz A Karak. Nor hold X point to make y currency go up to get z stat bonus.",
            "score": 1,
            "replies": []
        },
        {
            "author": "strangetines",
            "body": "What makes sieges crap is how narrow all the pathways in the cities are. It turns everything into a cluster fuck and destroys manoeuvring which is the main advantage any player has over the a.i. For the same reason small land battle maps where the a.i can just cover the entire width with troops are unpopular.\n\nI've never cared about units using ladders, they get shot up on approach and then have a penalty to their stats once they get there, its a decent way of dealing with things and means both the player and a.i can seamlessly launch sieges. That's not the problem and never was the problem. It's totally fine for there to be a decision to be made about trying to hold the walls or abandoning them to fight from the city itself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrimsonSaens",
            "body": "I have had some success fighting on the wall when I could park a missile unit on an elevated piece of terrain behind the wall. That way handgunners (or whatever) can snipe out the enemy lord, and other problematic infantry, at the cost of a chaff infantry unit.\n\nI enjoy playing sieges when the forces are fairly balanced (with defender advantages taken into account). IMO, the real problems with sieges are the AI/pathfinding, crummy maps, and the lack of faction identity representation (how the different factions defend/attack).",
            "score": 1,
            "replies": []
        },
        {
            "author": "PiousSkull",
            "body": "The real issues with sieges are assladders that mean the attacker is able to scale the walls everywhere, AI that tends to break, and poor pathing that causes annoyances like conga line units.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperSprocket",
            "body": "Very hard to judge what mechanics are strong or not when the AI is brainless and pathing borked. With capable AI and decent pathing you'd likely find that what is effective dramatically changes.\n\nI think that there'd be a big issue with the lack of effective counter-battery and gates/walls being too fragile. Flooding walls would likely become a problem too since suddenly there'd be a lot more value to keeping them and their towers up.\n\nBut since the AI isn't capable of more than trying to take walls or standing idle on defensive points who knows.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Rememberancer",
            "body": "A for effort but this was a useless experiment because Empire v Empire is maybe the least representative case in a game with demons and monsters and vampires and dragons and invincible Dwarf/Chaos/Cathayan infantry and legendary lords and all this other bullshit which makes your conventional siege play moot. \n\n\nAlso, the issue with sieges is not that they are hard, it's that they require a particular style of play that in this game just isn't that fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dean771",
            "body": "All your points are largely irrelevant to me because sieges are not fun to me\n\n  \nIf a video game isn't fun their isn't much left to redeem it",
            "score": -2,
            "replies": []
        },
        {
            "author": "Nazir_North",
            "body": "Well put, and while I don't disagree with anything here, I still think magic ass ladders are a huge issue for the defender and I really wish CA would rework them.\n\nIf ladders had to be constructed as siege equipment and were visible on the map (i.e., being carried by the unit), then that allows the defender to make more strategic decisions about where to focus their defenses.\n\nI'd also like to be able to place artillery on the walls. It absolutely boggles the mind that the Empire's finest engineers can't figure out how to get a cannon up a flight of stairs.\n\nLast wish list change... allow the defender to sally out and fight in the field! Nothing worse than trying to defend a walled settlement with a cavalry-focussed army where they all start inside the walls.\n\nCurrently I find attacking far easier than defending, even with armies of equal size, which is the exact reverse of how it should be.",
            "score": 1,
            "replies": [
                {
                    "author": "trixie_one",
                    "body": "> Last wish list change... allow the defender to sally out and fight in the field! Nothing worse than trying to defend a walled settlement with a cavalry-focussed army where they all start inside the walls.\n\nOkay this one confuses me, as you can just move them outside of the walls when the battle starts. Even with enemy cav or other fast units you can clear the gates and get your own faster units out and about to harrass the enemy. There's plenty of gates on most maps so you've got lots of exits to get everyone you need to get out without them jamming up.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Nazir_North",
                            "body": "I'm thinking about the sally option that was in Medieval II, for example, where the defender can choose to fight in an open field, not on the siege map.\n\nEven if I get all my cav outside the walls before the enemy gets there, the exterior portion of the map (for most siege maps at least) simply isn't large enough to pull off any serious mass cavalry maneuvers.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "trixie_one",
                                    "body": "Gotcha, still I have got some decent use out of it, given the AI will usually split up their forces which can give you some big gaps to maneuver in to delay them as they'll move some forces from the assault to chase after your cav, and you can also potentially take out any slower moving stragglers when their main force gets onto the walls.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rybakrybak2",
            "body": "I like WH3 sieges (mostly with modded maps), and the mod that removes assladders and makes them a piece of buildable siege equipment amplified that enjoyment significantly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "McBlemmen",
            "body": "The 2 big problems I have with sieges are the pathfidning and the way the AI attacks from all sides at once. Its not fun to defend agains. Other than that i think they're allright. But definitely better in the non warhammer games. \n\nIts funny that people are nostalgic for the WH1 and 2 sieges though. Talk about revisionism.\n\nI dont understand why CA doesnt just add ladders as a pre-siege construction like how it used to be, instead of ass ladders. Then you could still have specialist units like nasty skulkers or some skaven units that can still climb the walls without pre-built ladders.\n\nGood post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "niftucal92",
            "body": "Generally, I totally agree.\n\nBut here’s my pet peeve: if you have a faction like the lizardmen with many unit types, sieges can be really fun to defend. You can sally out, hold a line, skirmish, send out aerial support, etc. \n\nBut my main bois, the dwarfs, canonically the hardest nuts to crack in siege defenses, really struggle to make use of the tools available on these sprawling maps (slayers are the among the only lads with the speed necessary to reliably retreat, which is kinda the opposite of their personal goals). I’d love for a reworked Karak siege map that utilized much simpler chokepoints with clear artillery sight-lines. And for more gyrocopters in their garrisons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tamsta-273C",
            "body": "Sieges are bad as i thought because i play this game for years.\n\nWalls are useless because everyone can climb them and can climb of wherever they like. Melee units on walls are useless, artillery on walls concept of full fantasy and the building inside have sole purpose of blocking path finding.\n\nMaybe once in a blue moon they are fun but overall it's annoying non logical buggy system which the promoted as revolution. Remember trailers? Sieges was promoted as 4d chess level strategy with each plot of city as opportunity and what we got? sieges from temu...\n\nRome 2 had it better.",
            "score": 0,
            "replies": []
        },
        {
            "author": "thedefenses",
            "body": "I think there is a couple misconceptions at play here, when its said \"wall are useless\", it does not mean \"never man them, just leave them from the beginning\" although depending on the enemy army and your defensive map, that can be the right play, most often you leave a couple units on the walls to active the towers, get maybe 1 or 2 volleys off and then retreat to your proper defensive position, which while makes sense, makes these big sturdy outer wall feel like a speed bump and a couple kill rather than a real defensive line.\n\nOn towers, they do suck, they are fucking worthless compared to 3K towers for example, they are inaccurate, low damage, slow fire-rate and without upgrades, don´t even deal with infantry that well, tier 3's and 4's are decent but outside of them, kinda just junk.\n\nOverall, defensive sieges also suffer greatly due to how shitty the garrisons are, with or without the garrison buildings, they are low in amount, composed of low tier units, units that can't fight well in a siege or demand tactics that can't be properly used in sieges.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Abandonment_Pizza34",
            "body": "Sieges definitely have problems but the more I read what people complain about, the more I believe that the core issue is just how overpowered AI army composition quickly becomes when playing hard difficulties. Compared to default garrisons even mid game AI armies are ridiculously strong. \n\nTabletop caps mod makes most battles, including sieges, far more enjoyable to me, and I'm sure when CA implement their own cap system many complaints about sieges being unfair would cease.",
            "score": 0,
            "replies": [
                {
                    "author": "Corsair833",
                    "body": "I always viewed garrisons as supplemental to an army, not a replacement for it. In that light, they work really well, basically a free army to back up your own small army which otherwise wouldn't have been able to beat the AI's powerful army",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FUCK_MAGIC",
            "body": "\"Walls are useless, you may as well defend chokepoints\"\n\nThen OP goes on to use an example of walls compared to a fight without a chokepoint....\n\nThe point of a chokepoint is \"concentration of force\" where you can greatly outnumber the enemy 10 to 1 as they have to funnel through a narrow bridge/gate and can only fit one unit at a time (thus rendering all the units stuck behind immobile and ineffective).\n\nYou would easily win a chokepoint defense battle against a much much larger army than what you could hold off on a walled siege.\n\nIn a chokepoint battle you can have 100% of archers and 100% of your artillery firing throughout the whole battle at once concentrating fire on the single solitary spot that the enemy is forced to funnel through. \n\nIn a siege battle you can only fit one ranged unit or a melee unit to each wall segment, meanwhile the enemy can have it's whole army in the same area vs only 2 or 3 of your archers max. The rest of your ranged units none of your artillery will be able to fire, but the walls don't stop the enemy at all. They get the bonus of concentration of force (not you).\n\nThe ass ladders allows the enemy to attack anywhere they want without being forced into a chokepoint, nullifying the defensive point of walls entirely. The walls only end up preventing you from being able to fire with 90% of your ranged units.  \n\nYout tips and tricks are worse than just defending a chokepoint.",
            "score": 0,
            "replies": [
                {
                    "author": "Corsair833",
                    "body": "You can do huge damage to an enemy on their approach to the wall, and then retreat to a chokepoint. Why would you not take the free damage on the enemy by using the wall before retreating into the city?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FUCK_MAGIC",
                            "body": "There is no chokepoints, that's the point.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TeriXeri",
                                    "body": "Some maps have layered areas to retreat to,  like Altdorf and Nuln , problem is , many maps are just squares with like 3-4 approaches , and uneven tower distribution along walls means there's mostly always 1-2 directions with less towers when attacker.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "temudschinn",
            "body": "I feel like your post is, probably not on purpose, a massive strawman. You misunderstand many issues with sieges and many of them arn't adressed at all.\n\nThe core issue with sieges is simple: They are not fun.\n\nThis core issue then has multiple has 3 manifestations: The optimal strategy is not engaging with the siege mechanic, the AI sucks, and there are many bugs/glitches.\n\n**First problem: Not actually playing the \"siege\"**\n\nWhether you are attacking or defending, actually playing a \"siege\" is not a good strategy.\n\nWhen attacking, it is best to look for a wall segment without towers (nearly all maps have one), park your army there, then break the gates with your cav/lord and slowly kill off the enemy units one by one. Actually storming the city is generally a mistake.\n\nThis just isn't engaging gameplay. Its a lot of waiting for single units to fight each other until one dies.\n\nAnd its not getting better when defending. As you admitted yourself, the best strategy generally is to not even fight for the walls, but only use them to shoot a few volleys and then retreat to a chokepoint with a tower emplacment or two and grind down the enemy there.\n\nIn both cases, you barely interact with 90%++ of the map.\n\n**Second Problem: The AI**\n\nTW AI is generally problematic, but the added elements on siege maps often just break the AI completly. It is not smart enough to concentrate its forces when attacking nor defending; it just lets its superior cav sit inside walls and getting shot to pieces; it clumps up units to absurd density, making them good targets for spells; it often just suicides any flying units including lords at the beginning of the battle. To be fair, the last issue exists in field battles as well, but the consequences are way different: In field battles, the time between the enemy lord suiciding and the enemy infantry reaching your lines is limited. In sieges, its basicially infinite.\n\nAnd before I hear \"well you don't have to abuse the AI\" - yes I do. For example, the AI spreads out their army across the entire map - what am I supposed to do? Place half my army in the nothingness to even the playing field? Or if they send in their entire army to defend a single unit entering the city - should I just ignore this clump of units and purposefully cast my spells somewhere else?\n\n**Third Problem: The bugs and pathfinding**\n\nPathfinding in sieges is just something. Again, this is an issue that exists in land battles as well, but has way more impact on sieges. You want to attack through a gate? Your unit can and will get stuck. You want to break the gate? The enemy will open it, your lord will glitch inside the gate which then closes again. Your units breaks? Yeah they are retreating through the entire enemy city now, instead of actually running away.\n\nThe AI also can't upgrade their towers for some reasons, making the supply mechanic somewhat worthless after a few minutes of time.\n\nOh, and flying units have a busted charge against any units on walls. I know this isn't technicially a bug (the enemy units take fall damage when charged) but come on - deleting elite infantry within seconds might look cool, but defeats the purpose of the game imho.\n\nOverall, sieges allow for very, very onsided battles if you refuse to play it as an actual siege, i.e. a battle where you try to defend/take a city. They reward or even enforce absurdly boring gameplay and take ages to play out, thanks to the huge siege maps. They are also very, very map and race dependent: Some layouts give the defender at least a moderate advantage, while others are pretty much useless; and some units get absurdly OP while e.g. basic infantry is all but useless. Just not a fun experience.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mysterious_Canary547",
            "body": "Agreed. My own thought on the matter is that if players aren’t good at sieges then most of the time it’s a skill issue",
            "score": -14,
            "replies": [
                {
                    "author": "Moidada77",
                    "body": "Lol i guess this is the seasonal contrarian shilling session.\n\nSieges being a bad design with hoards of pathfinding issues and bad design must be player issue....CA made them perfect.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Corsair833",
                            "body": "I wouldn't say that they don't have issues, because they definitely do, and there are definitely some pathfinding issues like you say (though not nearly as many as there are made out to be) - I would just say that the sieges are actually quite fun if given a chance and had correct tactics applied (fight and retreat), which I don't think most players have done.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Mysterious_Canary547",
                            "body": "I’m not talking about pathfinding, which does need work. I’m talking about how one should actually fight sieges. Much like how OP is explaining",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BananaMaster420",
            "body": "Yeah but you have to consider that reddit is a bunch of parrots and the meme has already taken hold that walls are useless. This meme was never based on factual reality as anyone who played the game knew that you could take on a 2x force quite easily in a siege since TWW1.\n\nYou could unironically hold back the end times with one t5 garrison and t3 walls if you played well in tww1 (In 2 you could do it if an army was also garrisoned).",
            "score": -5,
            "replies": []
        }
    ]
}