{
    "title": "(completely honest and unironic) How do Witch Elves/Sorceress survive the cold of Naggaroth?",
    "author": "EnvironmentalDisk442",
    "subreddit": "totalwar",
    "rank": 4,
    "score": 187,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/totalwar/comments/1jec7lu/completely_honest_and_unironic_how_do_witch/",
    "id": "1jec7lu",
    "selftext": "I mean this in the simplest, most meta-context-ignoring way possible. Has there ever been any line in any of the games or stories or anything else that even alludes to an explenation? Is it dark magic, are they built different, is Naggaroth not that hardcore once you get used to it, anything.\n\nIf not I'd like to hear your personal headcanons.\n\nEdit: If Malekith hates the cold so much then why doesnt he change into a bikini? Is he stupid?",
    "comments": [
        {
            "author": "stompie5",
            "body": "I always assumed it was magic, because even Malekith has a voiceline saying he hates the cold",
            "score": 230,
            "replies": [
                {
                    "author": "Caligapiscis",
                    "body": "Unrelated, but one of my favourite bits of voice acting in the game is when he says \"diplomacy is so tedious\"",
                    "score": 69,
                    "replies": [
                        {
                            "author": "brinz1",
                            "body": "The dialogue is 10/10",
                            "score": 18,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Karrik478",
            "body": "In the original Warhammer Fantasy Roleplay Dwarfs and Elves didn't really feel the negative effects of inclement weather.   \nThe Dwarfs because they were tough. The Elves because they were magical.  \nThis sort of low grade magical glamour had a number of side effects but the one I always remember is that Elves smell funny to Goblins (which caused them to fear them in Warhammer Fantasy Battle).",
            "score": 83,
            "replies": [
                {
                    "author": "TheFifthFanatic",
                    "body": "I know in gotrek and felix the elves in elf slayer didn’t get muddy when they were walking three the mud or sand on them or rain. So i assumed it was like that",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "johnbr",
            "body": "Hate...  Hate keeps them warm. (Headcannon)",
            "score": 171,
            "replies": [
                {
                    "author": "ArcticGlacier40",
                    "body": "It definitely kept Anakin warm.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "yournames",
                            "body": "A little too toasty perhaps?",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "DakhmaDaddy",
                            "body": "Warm like sand?",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LouisVILeGro",
                    "body": "\"With Hate, All things are possible\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ardanros",
            "body": "In the immortal words of Cardi B, \"a hoe never gets cold\"",
            "score": 122,
            "replies": []
        },
        {
            "author": "Cereal_Ki11er",
            "body": "Your average witch elf probably wears clothes when outside in dangerous weather and removes most/all of it right before hitting the battlefield.\n\nIrl unless temperatures threaten frostbite you can stay warm so long as you maintain a high level of physical exertion.\n\nEven when frostbite is possible you can avoid freezing to death for as long as you maintain a high level of physical exertion, although you may lose extremities.  Obviously if temperatures are like -100 this doesn’t apply, I have no idea how cold Nagaroth is supposed to be.",
            "score": 41,
            "replies": [
                {
                    "author": "Coming_Second",
                    "body": "The witch elves also get extremely high before battle. You don't feel the cold so much when you've had a line or five.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "TheMaginotLine1",
                    "body": "I love to imagine witch elves 99% of the time dress nornally or even quite conservatively only to them strip just before battle.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TriumphITP",
            "body": "contrary to the unchanging total war map, there are actually seasons in the warhammer fantasy world.",
            "score": 84,
            "replies": [
                {
                    "author": "DerRommelndeErwin",
                    "body": "It's still the upper part of fanatsy Canada",
                    "score": 58,
                    "replies": [
                        {
                            "author": "TriumphITP",
                            "body": "maybe that's why morathi's start is so far south",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Thannk",
                                    "body": "Dark Elves live in the far north for economic reasons as it makes slave escapes less likely and ties into the main industries of Naggaroth being mining (as a reference to North American gold rushes) and because the southern, American half is full of monsters and various indigenous groups the Dark Elves don’t want to deal with. The Dark Elves can deal with the cold and solitary monsters, not so much extremes of humid hot and cold and endless hordes. They only maintain a few watchposts that are directly connected to the underground ocean so they can bypass the surface, and even then only to find any Dwarf or Elf invasions or serve as resupply points for raids on the Lizardmen. \n\nLustria and the Chaos Wastes are both preferable to Dark Elves to Warhammer America. Alith Anar is the only one who’d want to live there. \n\nMorathi’s start location is an intrigue story for people to write stuff about which was made a settlement for gameplay reasons, not intended as an actual Dark Elf city where people live.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheLord-Commander",
                    "body": "They do call Naggaroth \"the land of chill\" and Naggarond the \"City of Cold\". So it seems like the Dark Elves do live in perpetual cold.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Cadet_BNSF",
                            "body": "I mean, we call Chicago the windy city and Alaska the Land of the Midnight Sun even though neither of those are anywhere near perpetual conditions",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Psychic_Hobo",
                                    "body": "The Kislev campaign victory artwork is of a summer's day in the field, if I recall",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Mister_q99",
                                            "body": "Yeah the whole point of that campaign is that Ursun hadn’t roared for like 6 years, which is what makes it summer in Kislev",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RyuNoKami",
                                    "body": "Even London gets the sun more often than not.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wolkk",
            "body": "Math, negative temperature and negative clothes make a positive.",
            "score": 86,
            "replies": [
                {
                    "author": "EnvironmentalDisk442",
                    "body": "I get the joke but wouldn't negative clothes be nurgle? (you're so naked your insides are outside)",
                    "score": 24,
                    "replies": [
                        {
                            "author": "realblaketan",
                            "body": "that’s just Slaanesh with extra steps",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Amathril",
                            "body": "Yep. Nurgle, that's insides out. And Slaanesh, that's, well, outsides in.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Hayes77519",
                            "body": "That is inverse clothes. \n\nKhorne is no clothes (Khorne hates clothes)\n\nSlashes his negative clothes (removes others clothes on contact)\n\nTzeentch is contrapositive clothes.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Relative_Business_81",
            "body": "Canonically, iirc, dark elves have a resistance to cold that they imbue into the magical items they wield. Also, most of their cities are underground and are lit by flames that are powered by slaves and most of the tasks that they do outside of the shelters are also performed by said slaves. And I vaguely remember hearing something about them doing selective breeding to be hardier in the cold. ",
            "score": 60,
            "replies": [
                {
                    "author": "JohnGoesDerp",
                    "body": "only hag graef is stated to be anything resembling underground",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "LiminalLord",
                    "body": "Live under ground.....have slaves.....powered by flames....hate the dwarves....hate the elves....wait a minute! That's just tall Chaos Dwarves!",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Live_Measurement3983",
                            "body": "Chaos dwarfs are short \nDark elf not short",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "LiminalLord",
                                    "body": "SHORT?!?",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EnvironmentalDisk442",
                    "body": "This is cool, and makes sense. Thank you.",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "R3guIat0r",
            "body": "I always wonder the same about armored kossars in shirtless armour",
            "score": 14,
            "replies": [
                {
                    "author": "HermeticHormagaunt",
                    "body": "Bah, for elves it's magical and natural resistance to cold, for Kislevites it's true slavic grit and mustaches",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Useful_Perception640",
            "body": "Spamming blood Boil prayer on lowest Setting",
            "score": 8,
            "replies": []
        },
        {
            "author": "KolboMoon",
            "body": "Four reasons.\n\nAlcohol. Dark Elves canonically drink wine and other alcoholic beverages to keep themselves warm. This isn't speculation, this is directly from the Malus Darkblade series.\n\nMagic. Witch Elves have herbs and blessings from their god, Sorceresses have a variety of spells.\n\nInnate cold resistance. Dark Elves are used to freezing temperatures. They've been stuck in the ass-end of freezing nowhere for millennia.\n\nClothes. *Someone bring me a cloak!* As strange as it may sound, neither Witch Elves nor Sorceresses are half-naked all the time. Not to mention that Hellebron has a funny line of dialogue in the game where she demands that someone brings her a cloak, and it triggers only when she's stationed in a freezing climate.\n\nI would also like to correct a mistake that one commenter made ; contrary to what he said, the Dark Elves don't live underground. They're not Drow, they're **Druchii**.",
            "score": 10,
            "replies": []
        },
        {
            "author": "A_Wild_Goonch",
            "body": "How do they keep their cold ones alive is my question",
            "score": 8,
            "replies": []
        },
        {
            "author": "TheTowerDefender",
            "body": "I think they are quite hot...it balances out the cold of the environment",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ordinaryundone",
            "body": "A real ho never gets cold",
            "score": 4,
            "replies": []
        },
        {
            "author": "Coming_Second",
            "body": "Nagarythe was Ulthuan's Newcastle.",
            "score": 3,
            "replies": [
                {
                    "author": "PeterRum",
                    "body": "Am from Liverpool. Have seen ladies on a night out stride through snow and ice wearing less than Witch Elves. They are in the way to clubs where they will dance energetically. Often they are also bolstered by lemmo and fizz.\n\nPerhaps the Dark Elvish ladies partaking in frenetic exercise while off their faces on drink and drugs makes sense after all.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GodOfUrging",
            "body": "The elves cracked the code of clothing, and realized that as long as they *look* hot, they *feel* hot, so it balances out the cold.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BAMyouhaveaids1",
            "body": "The explaination for the unexplainable in fantasy settings is always magic",
            "score": 5,
            "replies": []
        },
        {
            "author": "SnooTangerines6863",
            "body": "> , most meta-context-ignoring way possible \n\nWhy would you ask this in a over the top fantasy setting? 'How does magic work, but explain it with maths'?",
            "score": 2,
            "replies": []
        },
        {
            "author": "JudgementalChair",
            "body": "They use the slaves they capture as personal heaters. Every time one of them starts to get chilly, they cut a slave open and let the fresh blood warm them up",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vimanys",
            "body": "The secret wind of magic known as \"Druchii T&A\" is a pathway to many abilities some consider to be unnatural. XD\n\nAt least most Druchii women (Aside from Morathi and her gross black feet) wear footwear of some kind, unlike the Drukhari of 40k, for some reason.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dracos5589",
            "body": "Because they're hot",
            "score": 2,
            "replies": []
        },
        {
            "author": "armbarchris",
            "body": "Magic. Dark Elf society is all about displays of power, and showing off that you are a) not even the slightest bit afraid of attack and b) so magically powerful that you can waste effort on keeping the cold out is an excellent way to show how powerful you are.\n\nKerp in mind that magic in Warhammer is *very* hard to control and *incredibly* dangerous, and as such smart wizards don't use magic if they can do the thing without it. Casual stuff like conjuring a small light instead of using a candle is more impressive then summoning a lightning bolt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Live_Measurement3983",
            "body": "Hmmmm that is good question I was thinking about it few weeks ago\nMaybe there building or because they born there\nI know some of them born in Ulthuan like morathi and Hellebron",
            "score": 1,
            "replies": []
        },
        {
            "author": "Phelyckz",
            "body": "Magic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sokoly",
            "body": "You don’t need clothes when you inspire others to help keep you warm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Curious-Ad2547",
            "body": "They don't. Just kite them out till they freeze to death.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lord_Crisp",
            "body": "Hoes don't get cold",
            "score": 1,
            "replies": []
        },
        {
            "author": "Azhram",
            "body": "I assume mqgic. They are heavily into magic and crafting, surely most have enchanted items for protection. Also probably dress more sensible outside of combat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BelligerentWyvern",
            "body": "Naggaroth actually isnt that cold except the very north end. The middle and south have vast plantations worked by slaves and you need some light and warnth to grow anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BarNo3385",
            "body": "Definitely some low level magic at work. But also, Elves are potentially just built differently, less susceptible to cold etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "guy_incognito_360",
            "body": "Cuddling?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd-Difficulty-9875",
            "body": "They are biologically adapted to survive in that harsh environment and they also use dark magic to be resistant against the cold 🥶",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiaoYingSimp",
            "body": "Magic",
            "score": 1,
            "replies": []
        },
        {
            "author": "Careful_Car_9864",
            "body": "Dude, they're hot",
            "score": 1,
            "replies": []
        }
    ]
}