{
    "title": "Shogun 2 - I forgot you can actually play as a ship, Its so cool!",
    "author": "BierIsDeManier",
    "subreddit": "totalwar",
    "rank": 3,
    "score": 153,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 10,
    "url": "https://v.redd.it/2v9q3vy8nipe1",
    "id": "1jegizk",
    "selftext": "",
    "comments": [
        {
            "author": "BierIsDeManier",
            "body": "I love the French Ironclads. It feels like playing a sniper with its very high damage, range and accuracy.\n\n(Shogun 2 - fall of the samurai dlc btw)\n\nEdit: I noticed when the first ship got shot in the back, it sank there first. The second ship got shot in the front and it sank in the front first, cool details.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Fletaun",
            "body": "My favourite move is to overload my engine for massive speed boast and ram enemy ship with my ironclad",
            "score": 8,
            "replies": [
                {
                    "author": "AuxNimbus",
                    "body": "And then watch them blow up HEHE. I do love that too haha",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CozyMoses",
            "body": "Gods I miss naval battles in total war. Ultimate Admiral and Ultimate Admiral Dreadnoughts has been scratching my itch for naval combat in strategy games in the mean time.",
            "score": 17,
            "replies": []
        },
        {
            "author": "stefthegrey",
            "body": "You can I think post Shogun enjoy this with siege equipment, and holding onto the fire button you get to fly with the projectile, in rome 2 I just put it on slowest speed and launched fiery death at ships trying to board. Firing line was effective",
            "score": 3,
            "replies": [
                {
                    "author": "BierIsDeManier",
                    "body": "Yeah, that also works with shogun2. Even with arrows, bullets and fire mongoles, its really cool indeed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LuluGuardian",
            "body": "This shit is so damn cool!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Biggu5Dicku5",
            "body": "Naval battles were sweet... hopefully CA remembers how to make them again, one day...",
            "score": 4,
            "replies": []
        },
        {
            "author": "SergeantPsycho",
            "body": "Waiting for a naval battle to start in War Thunder while I'm watching this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeyGotWingsNow",
            "body": "Mom can we have 19th century World of Warships\n\nWe have 19th century World of Warships at home\n\n19th century World of Warships at home:",
            "score": 1,
            "replies": []
        }
    ]
}