{
    "title": "Ford government to make gas tax cut permanent despite carbon tax change",
    "author": "xc2215x",
    "subreddit": "ontario",
    "rank": 10,
    "score": 690,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 250,
    "url": "https://globalnews.ca/news/11085650/ford-government-to-make-gas-tax-cut-permanent-despite-carbon-tax-change/",
    "id": "1je26ig",
    "selftext": "",
    "comments": [
        {
            "author": "beem88",
            "body": "So between this and the carbon tax, gas should be 23c cheaper per litre. What do we want to bet it still sits in the $1.50/L range? Oil companies cash in, we lose revenue from the gas tax that goes toward public transit and road infrastructure.",
            "score": 913,
            "replies": [
                {
                    "author": "Comedy86",
                    "body": "This is exactly it. Gas was $1.40/L before the carbon tax was implemented. During COVID with it in effect, gas got down as low as $0.70/L. I'm betting on it staying around $1.40/L or dropping a lot then creeping back up 2-3 weeks after April 1 and then we're going to hear it is all because of tariffs or something else. Gas won't get cheaper, the O&G sector will just get richer.",
                    "score": 318,
                    "replies": [
                        {
                            "author": "createdincanada",
                            "body": "Well, it’ll go back up April 15 because of summer blend. That should add 15c.",
                            "score": 75,
                            "replies": [
                                {
                                    "author": "chipdanger168",
                                    "body": "Lol the summer gas blend does not add 15c. Just another lie. It never drops 15c for winter blend",
                                    "score": 61,
                                    "replies": [
                                        {
                                            "author": "Bl1tzerX",
                                            "body": "That's the joke",
                                            "score": 78,
                                            "replies": [
                                                {
                                                    "author": "iamtheliquornow",
                                                    "body": "Correct, each summer and winter you have to add the additional 15c. Lol there is no removing the 15 c when the season changes. That would be silly.",
                                                    "score": 29,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "blckshdw",
                                            "body": "“We’re switching to the summer blend that’s why it’s more expensive. It’ll go down in a little bit”\n\nAlso\n\n“We’re switching to the winter blend, that’s why it’s more expensive. It’ll go down in a little bit”",
                                            "score": 36,
                                            "replies": [
                                                {
                                                    "author": "Veaeate",
                                                    "body": "Sounds like Tim's when they change their coffees \"every 20 minutes\"",
                                                    "score": 13,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Barbecue-Ribs",
                                            "body": "Takes 30 seconds to double check but apparently nobody has an IQ high enough to throw some statscan data into excel. \n\n\nOn average over last 25 years we see a noticeably higher gas price in summer vs winter. ~8c difference between December and July.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "BreadStix333",
                                    "body": "Summer blend gas? Lol",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "chewy_mcchewster",
                            "body": "63.3 in Ottawa, but yes I doubt prices will change.. for a week they'll be lower.. then right back up because reasons",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "K13_45",
                            "body": "That’s a lie. Carbon tax for Ontario was implemented in [2019](https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/carbon-pollution-pricing-federal-benchmark-information.html). Gas prices averaged $1.26 in 2019, [source](https://www.cer-rec.gc.ca/en/data-analysis/energy-markets/market-snapshots/2019/market-snapshot-canadas-gasoline-prices-in-summer-2019-were-lower-than-summer-2018.html)",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "IsaacJa",
                                    "body": "What part is a lie?\n\n\nYour source is the Canadian average, not the Ontario average, and is not necessarily representative of what happens in the cities.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "K13_45",
                                            "body": "Okay here’s a new source that details each [quarter](https://www.ontario.ca/page/ontario-energy-quarterly-oil-and-gas-q2-2020) average price in Ontario 2019. Still not the $1.40 OP claimed.\n\nOf course it will vary city to city. That’s why averages help.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "IsaacJa",
                                                    "body": "I imagine that OP was looking at what the prices did in their area, maybe comparing most expensive in 2019 to cheapest in 2020. While the numbers are a bit questionable, the trend and underlying point aren't and are supported by your sources; the carbon tax is not a dominant factor in the price of gas. It's a bit misleading imo to say that OP is \"lying\".\n\n\nI've seen gas prices vary more for a high demand weekend than for carbon pricing. Companies are going to charge whatever they can sell it at. The carbon and provincial gas taxes reduce (or redirect) their profitability, but we as consumers do not feel that.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FizixMan",
                                    "body": "In spring 2018, they were at (then) record highs flirting with $1.40. [It was a major policy plank for Doug Ford going into the 2018 election.](https://web.archive.org/web/20220601043850/https://ontariopc.ca/doug-ford-will-cut-gas-taxes-by-ten-cents-per-litre/)\n\n> The average price of regular unleaded gas across the province is sitting just shy of $1.37/litre according to data compiled by the Ministry of Energy.\n\nhttps://www.cbc.ca/news/canada/toronto/ontario-election-gas-prices-1.4644750\n\nThe Canada Energy Regulator had Toronto at $1.386/L on May 22, 2018.\n\n2018 is probably the period that the other commenter is thinking of.\n\nI think the point is that bottom line price charged for gasoline has more significant factors affecting it moreso than just carbon surcharges, and that gas companies will charge whatever the market allows. They're happy to keep prices artificially higher when possible to make that extra profit. And now that people are used to having gas in the ~$1.40 range instead of crying foul, gas companies may continue to charge generally higher prices. Basically the [Overton Window](https://en.wikipedia.org/wiki/Overton_window) for gas.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "K13_45",
                                            "body": "Thank you for actually linking information. Actually insightful and contributed to the discussion",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Comedy86",
                                    "body": "And in [Q2 2018](https://data.ontario.ca/dataset/ontario-energy-report-supporting-data/resource/28465ea4-88d2-4558-9eb2-f88bd70932a6), the average gas prices were $1.34/L in Ontario followed by Q3 being $1.32/L average. That was \"before the carbon tax was implemented\". In my part of the Province (the GTA) prices hit as high as around $1.44-$1.46 at the highest points.\n\nSo please, don't call someone a liar because you cherry picked the exact time that works with your narrative.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "K13_45",
                                            "body": "Gas prices always fluctuate because of the price of oil before that all the time. Op was acting like that was the normal and it was not by far. Here’s some [info](https://www.macrotrends.net/1369/crude-oil-price-history-chart) on crude oil prices. Notice how 2018 peaks pretty high. While 2017 and 2019 are lower and the gas prices were lower on average in both of those years.\n\nLiar was far, but they linked nothing to back up their claim. But I’m the one cherry picking information. Gas prices were up to 1.37 in 2014 but that wasn’t the normal, it levelled out.\n\nI’m not arguing that prices won’t go back up after knocking off the 17.6 cents. They probably will, that’s just how it goes.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pgsavage",
                            "body": "BRENT WAS HIGHER YOU FOOL.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MissionDocument6029",
                            "body": "Bobby stubbed his left toe on the oil rig. Price going up 15 cents",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Superteerev",
                            "body": "Lowest it got in northwestern ontario was like 0.98",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OriginalNo5477",
                            "body": "Oh it hit lower than 0.70 during covid. I filled up my car and 4 Jerry's at Costco for 0.37.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Harambiz",
                            "body": "It’s dropping in Covid was because the Saudis flooded the market with cheap oil to get a better OPEC deal. The carbon tax also was not even close to what is now, it goes up every year on April 1. Thank god Carney cut it, people who live in rural areas like me spend much more on energy than what we got back.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Saorren",
                    "body": "it droped 10c here for now, i fully expect to see it back at 149in under a week though.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Thomase1984",
                            "body": "Was below 1.40 in areas of KW last week. Had to snag gas at 1.54 this morning.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Dyslexic_Engineer88",
                                    "body": "There is a random gas bar on Franklyn Blvd, near Savage Dr. that had Gas for 1.35 last week.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "icebeancone",
                            "body": "It went up 16¢ in Ottawa for some reason. $1.36 to $1.52.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "chretienhandshake",
                            "body": "It didn’t drop in about half the gas station here.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "backlight101",
                    "body": "The provincial sales tax has been removed for quite a while now, this makes it permanent, no change expected.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "OverallElephant7576",
                            "body": "If you notice the price actually didn’t change much, it was weeks before the oil companies sucked up that 5 cents",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "backlight101",
                                    "body": "Fuel prices fluctuate all the time.  Taxes make a difference, if they didn’t we’d have the same fuel prices as the US or Vancouver.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Dry-Faithlessness184",
                                            "body": "There's fluctuation and then there's still always between 1.40 and 1.50",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "backlight101",
                                                    "body": "And it’s over $2 in Vancouver, part of that is due to taxes….",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "icebeancone",
                                                            "body": "Its mostly because they have to ship a majority of their fuel via sea from Washington. Yeah, there are taxes, but that doesn't contribute nearly as much to the additional fuel cost as transportation and import costs does.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "innsertnamehere",
                                    "body": "Fuel prices vary so much it’s hard to see the taxes, but there is a reason gas is far more expensive in BC and far cheaper in the US. BC taxes fuel a lot more and the US taxes it a lot less.\n\nThe savings absolutely get passed to the consumer.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "OverallElephant7576",
                                            "body": "Of course taxes play a part in the price, but once they go up, they don’t go down because organizations know the customer can and will pay for it at that price. They would be not be fulfilling there responsibilities to their shareholders if they left that on the table",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "innsertnamehere",
                                                    "body": "Market economics - a gas station cuts price by 1 cent to undercut the gas station next door and drive customers to their station. The other station does the same - and this repeats until they can’t cut prices any longer or else face unprofitability.\n\nIf this wasn’t true, why isn’t gas still $2+ a litre? We were paying that in 2021. Why not now? Because if one station had kept it at $2, another could undercut it and take its business. So it’s in the shareholders interest to remain competitive or else they will face declining sales.\n\nCompetitive markets are a thing and gas is no different.\n\nGas is extremely fungible and prices are clearly advertised- this makes the market *extremely* competitive. A majority of the market simply buys gas at the cheapest station, which means companies have to compete on price to attract business.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OverallElephant7576",
                                                            "body": "Not really true. Go to a place like Saskatchewan where there is not much competition and you see once one station raises their prices within a half hour they all are at the same price. We are paying what the market will bare without any long term loss in customers. If they kept prices at 2 bucks a litre they would see their consumer base start to erode as more and more people wouldn’t be able to afford to drive or cut down on their driving",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "innsertnamehere",
                                                                    "body": "There are smaller overall factors which complicate it - but as a whole prices will decline with a decline in input costs (i.e. taxes) in a competitive market. This has been proven thousands of times and gas is no different - if anything, it is a prime example of competitive markets.\n\n  \nI mean if you don't believe me, wait until April when the carbon tax comes off and gas prices drop from $1.50 to the low $1.30s.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Barbecue-Ribs",
                                                    "body": "The Canadian gov releases nice datasets that show gas prices in different regions over time with breakdowns for base price and taxes. What you are saying is like some child’s understanding of market pricing and isn’t what happens in reality.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Blondefarmgirl",
                    "body": "  You're right.  That's what I always said too.  The oil companies will keep the money.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "spderweb",
                    "body": "Ding ding ding!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "This_Tangerine_943",
                    "body": "Yep. 1.46 in Ottawa. Greedflation is rampant and only getting worse with tariff noise.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ChrisMoltisanti_",
                    "body": "Yes. Public money to private industry. That's the conservative MO. It's the entire point of everything they do. It's why beer is in corner stores - take revenue from the province and redirect it to billionaires. Underfund public services and usher in private \"options\". Continue to decrease government revenue until those private \"options\" become the norm and only option.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "RandoRambo1",
                    "body": "Carbon tax and gas tax removed temporarily to persuade voters to vote for Carney in the election. Once the election is won by Carney, reinstate the carbon tax at a higher rate. Classic bait and switch.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "dudeonaride",
                    "body": "All to drive Ontario even deeper into debt at a time we really need the money. Ford's as bad with our money as Trudeau and Harper.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "-insignificant-",
                            "body": "When was the last time a conservative government was actually fiscally conservative? I'm so sick of people saying they're fiscally conservative when he's spent who knows how much on stupid shit like getting out of the beer store contract rather than just paying it out till the end.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "janus270",
                                    "body": "More people -offline- need to know about how much of our fucking money Doug Ford has wasted on stupid shit.  I talked about this with a coworker - the tunnel under the 401, the Ontario Place fiasco, the Beer Store contract, ripping out bike lanes and preventing people from suing - they weren't aware of *any* of that.  This is not a dumb person, either, just ignorant of all of the stuff that's been happening because sometimes this shit comes at us like a firehouse.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "-insignificant-",
                                            "body": "Let's not forget one of his earliest failures, the fucking license plates that they didn't consult anyone on. Couldn't be fucking read by scammers, what a joke.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "dudeonaride",
                                    "body": "1950s?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "innsertnamehere",
                    "body": "Gas is extremely competitive and low margin, believe it or not. Gas stations make almost no money on it and most profits come from the convenience store attached.\n\nThe ford cut is making an existing temporary cut permanent, so it won’t make it any cheaper than it currently is.\n\nGas prices will drop 15-18 cents overnight on April 1 when the carbon tax is removed.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Hot-Storm6496",
                            "body": "This is correct, the individual gas stations don't make much on gas sales. The oil companies on the other hand...",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "nocomment3030",
                            "body": "Gas STATIONS are low margin but the gas companies are very profitable",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "innsertnamehere",
                                    "body": "Yes but stations are the ones that pay the taxes and set the prices.\n\nThe oil companies sell bulk to the stations pre tax and that pricing is unaffected.\n\nIt’s a very competitive market and we will see a significant drop in gas prices April 1 as soon as the carbon tax comes off.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "chipdanger168",
                            "body": "Gas prices should actually drop 23c",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Reasonable_Cat518",
                            "body": "Won’t someone think of poor Big Oil struggling to make a profit!",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "innsertnamehere",
                                    "body": "To be clear that’s not what I was saying. I was just saying that it’s an extremely competitive market and that stations will have to cut prices immediately to stay competitive.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fez-of-the-world",
                    "body": "https://www.gasbuddy.com/gasprices/ontario/toronto\n\nGas is down. Like 20-ish cents down.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TraviAdpet",
                            "body": "I paid 1.41 Thursday/Friday that’s not down enough",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "iiRichii",
                            "body": "I paid $1.49 in Welland this morning",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "whynottoeverything",
                    "body": "Gas is actually up right now and I figure it won’t go down at all",
                    "score": 1,
                    "replies": [
                        {
                            "author": "innsertnamehere",
                            "body": "Carbon tax doesn’t come off until April 1 so you won’t see any difference until then",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GuzzlinGuinness",
                    "body": "$1.28 in Sarnia",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TraviAdpet",
                    "body": "1.37 here in Peterborough, was 1.41 on Friday still waiting for the drop.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BtheCanadianDude",
                    "body": "I'm sure the savings will come aaaaaaaaany day now. \n\nNo one's gonna save a dime at the pump, but they sure as shit will stop getting the rebate cheques. So less money for the average person, less services for the average person, way more money for oil execs. Conservatism in action!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "obliviousofobvious",
                    "body": "Almost like the carbon tax really didn't add anything of note to the price of gas and O&G are just gougers?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "onedoesnotjust",
                    "body": "we will never see lower prices, they are too greedy",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lsaran",
                    "body": "The cost of goods is primarily based on what the market can bear. I would follow on your bet that the tax savings will only result in more profit for O&G companies and less tax revenue.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "_dmhg",
                    "body": "I’m losing my mind for real, how did we get here and how can we get out",
                    "score": 1,
                    "replies": [
                        {
                            "author": "beem88",
                            "body": "Voter apathy and uninspiring leadership from the other political parties.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "burlyginger",
                    "body": "People need to realize that goods generally aren't priced at cost + margin. \n\nThey're priced at what the market will pay for them.  \n\nIs an oil company going to reduce price to benefit consumers at the cost of lost revenue?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OrbAndSceptre",
                    "body": "Exactly. I use Quebec as a point of reference and despite our taxes being about 14 cents less than QC yet Ottawa has the same gas prices as Quebec City. Go figure.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "carbon_ape",
                    "body": "Okay, so what do we do? Ford bad guy everything?",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Swarez99",
                    "body": "As the dollar drops our gas goes up.  That’s going to take a chunk out of any gas savings as a fyi.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Business_Influence89",
                    "body": "23 cents is not accurate. Gas will go down by the 17.6 cents but the 6 cent a litre “cut” has already been made; it’s just being made permanent not temporary.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "blackfarms",
                    "body": "Plus HST, so closer to 30c/L. Could be paying $1 L by the time summer pricing comes into effect.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neutral-President",
            "body": "So we’re permanently subsidizing the fossil fuel industry now?",
            "score": 295,
            "replies": [
                {
                    "author": "ruadhbran",
                    "body": "Have been for ages already",
                    "score": 65,
                    "replies": []
                },
                {
                    "author": "gweeps",
                    "body": "Of course. We are the serfs.",
                    "score": 88,
                    "replies": []
                },
                {
                    "author": "Certainly-Not-A-Bot",
                    "body": "And non-drivers are now subsidizing all our freeways forever, don't forget that part. Ford has eliminated the only two prices that the government levies directly on cars",
                    "score": 50,
                    "replies": [
                        {
                            "author": "Dyslexic_Engineer88",
                            "body": "I drive an electric car, pay no gas taxes, and still use the roads...",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Certainly-Not-A-Bot",
                                    "body": "Yeah this is a big problem. For this reason, we should be taxing vehicles based on how much they drive, not how much fuel they consume",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Dyslexic_Engineer88",
                                            "body": "I would happily pay a yearly fee based on how many km I drove if the gas taxes were removed and every driver had to pay it, not just EV drivers.\n\nI am not going to complain about it cause right now I am taking advantage of the system, and guys with big trucks are subsidizing my roads, with the higher amounts of fuel they use.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "highwire_ca",
                                            "body": "Tax based on how far driven, rated fuel consumption, weight (heavier vehicles beat up the roads more).  For EVs, that's how far driven and weight (and most EVs are quite heavy compared to ICE equivalent).",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Fif112",
                            "body": "Non-drivers still benefit from roads existing. \n\nYour food is delivered by them, your goods travel by them, your mail moves around on them. . \n\nYou pay for the busses even if you don’t use them, you pay for the hospitals if you ever need them and you pay for the parks even if you never set foot in one. \n\nAnd there’s no way you’ve never been in someone’s car, in and uber or in a taxi. You use the roads. \n\nI’ll never understand why this stupid argument exists.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Reasonable_Cat518",
                                    "body": "Busses in my city and I’m sure across Ontario get their service cut year after year because they’re not generating enough of a profit for city council to justify them. They’re treated like a business. Roads on the other hand get handed billions of dollars without a question. They’ll happily widen a useless suburban arterial but cut a bus route’s frequency that runs through a low-income area. They’re not comparable, and no, not everyone benefits from your overbuilt roads.",
                                    "score": 31,
                                    "replies": []
                                },
                                {
                                    "author": "bravado",
                                    "body": "You don’t understand why this argument exists because you actually don’t know how fucking expensive a suburban highway is compared to a streetcar line or a bus route when you actually want to spend public money effectively.\n\nThe 401 is 20+ lanes across at some points. That’s an astonishing amount of infrastructure to maintain and a shocking amount of valuable land taken up to move a piddling amount of people. But it’s more than just one highway. It’s every multi-lane suburban road and extra wide residential street where public space is given away for free for private parking. This last sentence is really key... It's the reason why city taxes keep going up and the things cities can do keep going down. Auto infrastructure is a huge liability.\n\nIf someone paid the real costs of their trip on the 401, the 407 wouldn’t look so expensive in comparison anymore… that’s a subsidy. When something is subsidized for so long (driving), people literally can not fathom the real costs once they become apparent. For example: the costs of maintaining the Gardiner in 2020 (before it was uploaded to the province) were 44% of the entire city transport capital budget. Some bus routes and streetcar lines move more people daily than that highway.\n\nWhen people make this argument, you have to place driving in the same category as all other types of transit. If we want to move people in the most space and cost effective way, driving is dead last. The fact that it’s possible to do without going bankrupt is only because of subsidies.\n\nCongestion and traffic is not just the cost of doing business as a big city. Many global cities have much more people per sq ft than Toronto and manage to get around quite well. We have congestion and traffic and horrible public finances because we love driving and can't see an alternative (although there are many).",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "Certainly-Not-A-Bot",
                                    "body": ">Non-drivers still benefit from roads existing. \n\nSure, but not nearly as much as drivers, and especially not when it comes to monstrosities like the 401. All the extra lanes don't benefit me in any way.\n\nAlso, if you internalize the costs of driving, then I'd be paying for exactly the cost I impose on freight and maintenance people and such instead of paying taxes so that we can do just one more lane bro on yet another stroad or freeway.\n\nAnother point I'll add is that the public should subsidize buses, hospitals, and trains because they're all good for society. Cars are bad for society, so we should not subsidize them. It's like asking whether we should subsidize smoking",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "skyywalker1009",
                                    "body": "Because 10 billion is spent on a highway that primarily serves cottage country, something generally only people with cars get to enjoy.  Meanwhile the want for easy intercity travel is largely ignored.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Fif112",
                                            "body": "And 90% of that is paid by drivers. \n\nSuck it up.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "nocomment3030",
                                                    "body": "Where did you get that number?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Fif112",
                                                            "body": "https://www.chch.com/chch-news/ontario-road-costs/\n\nThis was a study commissioned by the Canadian Automobile Association and carried out by the Conference Board of Canada.\n\nIt says that, overall across the province, Ontario drivers in light vehicles such as cars, minivans, suvs, and pickup trucks pay $7.5 billion a year in things like fuel taxes, vehicle registration fees and tolls. That is as much as 90% of the cost of maintaining roads. Specifically in the Greater Toronto Hamilton Area, we pay more than the cost.\n\nEdit: part of that funding goes towards policing the highways as well.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "nitro0769",
                                                                    "body": "Doug Ford eliminated fuel taxes and vehicle registration fees, and very few of the roads in the province are tolled, and the one that generates the most tolls is privately owned, and doesn't contribute to Ontario's road budget.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Fif112",
                                                                            "body": "This is from 2024.\n\nFind me what the new number is and we’ll talk, but until then this is the number.\n\nEdit: Oops misread the date and put my own number in.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Nomoras",
                                                                                    "body": "> Posted:October 18, 2013 | 12:52 AM",
                                                                                    "score": 5,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "energy_car",
                                                                                    "body": "That article is from 2013, you are lying, and even this out of date article says that drivers are only covering 70%-90% of the costs of the roads. Meaning before the gas tax and registration fees were eliminated non drivers are subsidising drivers by $750m -$2.25b per year.",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "1slinkydink1",
                                                                                            "body": "they would rather bury their heads in the sand rather than understand the truth.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Fif112",
                                                                                            "body": "You posted this comment after I already called myself an idiot for misreading the date. \n\nFuck off 👌",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "tekkers_for_debrz",
                                    "body": "We benefit ever so slightly but it’s so inefficient and climate destructive that it needs radical change. Time to build alternate methods of transport.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Fif112",
                                            "body": "“Ever so lightly”\n\nYeah no, my original comment covers an argument against what you just said.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Vecend",
                                    "body": "And they paid for them via the prices they paid which had the costs baked in, this is the second time ford has cut income from vehicles that use the roads that should be used for paying for the road maintenance now that money has to come from somewhere else and I would be willing to bet that it wont be from increased taxes, so here comes more social programs getting funding cuts, social programs like our healthcare so I hope you don't mind wait times getting even longer.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "combustion_assaulter",
                    "body": "We still subsidizing, this part of it is slightly more in the open then the backroom deals that are typically made",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "whynonamesopen",
                    "body": "Always have been.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AcanthisittaFit7846",
                    "body": "Ford’s Progressive Conservatives:\n\nWe may be conservative in name but we’ll subsidize corporations like the best of them!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "combustion_assaulter",
            "body": "Why wouldn’t we do this? Our healthcare and education systems are so flush with money and resources, so we obviously don’t need these tax dollars.   /s",
            "score": 55,
            "replies": []
        },
        {
            "author": "michyfor",
            "body": "If Ford wants to do something  good for Ontario why doesn’t he stop throwing money away and use it to fix healthcare instead? \nIt’s like he will literally do anything and tie up funds on anything but the elephant in the room. \n\nThis was unnecessary.",
            "score": 8,
            "replies": []
        },
        {
            "author": "J0Puck",
            "body": "Just means to me that big oil companies will jack the price up, meaning no savings. They did the same thing when ford cut the tax in 2022 during the Russia Ukraine war.",
            "score": 5,
            "replies": []
        },
        {
            "author": "1slinkydink1",
            "body": "God he’s so regressive and has already set us back decades on weaning us off of personal vehicle reliance. Our crumbling infrastructure has never been more desperate for funding and he’s just going to keep subsidizing gas guzzlers and suburban development.",
            "score": 49,
            "replies": [
                {
                    "author": "bigsmackchef",
                    "body": "I don't live anywhere near public transit,  I will be reliant on a car until theres atleast some other option that isn't taking ubers or taxis everywhere",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "sincerely-wtf",
                    "body": "You're forgetting that rural communities exist where having a vehicle is essential.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "NefCanuck",
                            "body": "We could use the extra tax revenue to help build up transit options in rural communities 🤷‍♂️",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Tasty_Principle_518",
                                    "body": "Transit in rural communities doesn’t exist because it can’t exist . No ones going to be happy floating the cost of a bus route to pick up 10 people.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "NefCanuck",
                                            "body": "There are many services that people pay for that they never use though and folks aren’t yelling about it (fire department and police for example)",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sincerely-wtf",
                                    "body": "I wish.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "maple_leaf2",
                            "body": "Sure, it's fine that people want to live like that. They can also benefit from park and ride services when visiting larger cities.\n\nThe problem is that car dependent lifestyle is heavily subsidized",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sincerely-wtf",
                                    "body": "How so? Last I checked, cars cost tens of thousands of dollars and gas prices are nothing to sneeze at. Also in most urban areas, you must pay for parking as a worker or a renter. Public transportation is cheap but unreliable, and infrastructure is lacking in the north. You need to have the luxury of time with public transportation as it currently stands.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "maple_leaf2",
                                            "body": "Rural areas are just less efficient, less people paying taxes per service provided (including road maintenance etc.). \n\nI will highlight the fact however that a rural area is often more efficient than a suburban one since true rural living often means less services (septic tanks instead of sewage for example)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Master_of_Rodentia",
                            "body": "Yes, and too many people move to them due to our failures in upzoning cities, and our subsidization of their utilities. If they costed a fair price for what the province pays to support them, they'd be less compelling to people. The total car dependency is just a negative aftereffect.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Purplebuzz",
            "body": "Gas companies will report record profits again this year.",
            "score": 5,
            "replies": []
        },
        {
            "author": "No-Section-1092",
            "body": "This is even stupider than it sounds, because:\n\n1. Cheaper gas encourages people to drive more often, and over the long run it encourages people to buy bigger, heavier, stupider vehicles with worse mileage and live in further and further car-dependent suburbs (IE drive even more)\n\n2. More people driving in bigger vehicles accelerates road rot and worsens traffic congestion\n\n3. The gas tax pays for road repair and public transit. \n\nSo you’re encouraging people to drive more often while giving us less money to maintain the infrastructure they drive on, and less money to build up alternatives.\n\nCar-brain makes everybody poorer. STOP. SUBSIDIZING. DRIVING.",
            "score": 85,
            "replies": [
                {
                    "author": "psychodc",
                    "body": ">1. Cheaper gas encourages people to buy bigger, heavier, stupider vehicles with worse mileage as well as drive more often\n\nCar prices and interest rates have more to do with car purchases than the ever-fluctuating price of gas.\n\nEdit: adding that most people are just focused on their monthly payment.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "fuzzywuszy",
                            "body": "100% disagree with the gas comment and 100% agree with the car comment. The price of gas determines whether you will take day trips or not, drive instead of walk, etc. yes the price of gas doesn’t usually effect in the short term your yes/no to driving to work, but it definitely effects what you do with your time off.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Facts_pls",
                            "body": "That's not true.\n\nPlenty of people buy hybrids precisely because it saves on fuel. In deciding between a hybrid vs gas car, I am literally calculating how much money I save on fuel in the long run and how much extra do I have to pay for the hybrid upfront.\n\nI expected every educated person with basic maths skills to do some version of this calculation.\n\nDon't think it's that different for other similar cases.\n\nMaybe you are one of those - \"buy the biggest baddest car you can afford with all the cash at hand\" type of guy.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Rexguy120",
                                    "body": "Donald Trump was elected twice. Your faith in the average person is completely unfounded.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "psychodc",
                                    "body": "You give people too much credit. Most people do not think this way. I think it factors into the mental calculus but most are primarily focused on their monthly payment.\n\n>Maybe you are one of those - \"buy the biggest baddest car you can afford with all the cash at hand\" type of guy.\n\nNo. I drive a Civic that I purchased 7 years ago and am riding it into the ground.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Character-One5388",
                            "body": "Yeah that's sick, out of a sudden people change from a 40k Toyota to a 80k 5.3L F150 just because gas price is lower?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fuddle",
                    "body": "Look at this guy over here thinking gas prices will get cheaper. \n\nDon’t worry, the gas companies will come up with some bullshit reason to keep prices high despite the taxes going down. \n\nHowever lately they aren’t even trying that hard. Last I heard it was “Uh, something about summer gas or pipelines or whatever, it rained in Texas and…whatever prices are going up”",
                    "score": 5,
                    "replies": [
                        {
                            "author": "No-Section-1092",
                            "body": "So by that logic there’s no point in lowering the tax. You should therefore agree that we should actually keep raising it to curb the negative consequences of driving while funding alternatives.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TraviAdpet",
                            "body": "Gas in 2006 was 1.36, prices should have been $2/L by inflation alone.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "joyridah",
                    "body": "Maybe he’s just trying to give people more money in their pockets given some of the uncertainty that we are facing ?\n\nHonestly, cheaper gas doesn’t mean start buying massive gas guzzling trucks..it gives them sole savings that they can use towards everyday essentials, like groceries",
                    "score": -4,
                    "replies": [
                        {
                            "author": "UltraCynar",
                            "body": "Except the gas isn't cheaper. The gas companies gobbled that up. This is you paying twice, at the pump with the higher price and now with a permanent tax cut which is subsidizing the gas companies.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "No-Section-1092",
                            "body": "I also said it encourages people to drive more, which would offset any savings, and gas prices are already a hell of a lot lower than they were even two years ago.\n\nPoliticians need to be thinking about the long term consequences of the incentives they create, not just the short term fix. Ontario roads are already clogged with ridiculously oversized SUVs and F150s precisely _because_ we have underinvested in alternatives for decades. This is yet another example of that.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "K13_45",
                                    "body": "I will drive the same amount as before. Gas prices don’t change that. I’m sure there’s lot of people like myself.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "No-Section-1092",
                                            "body": "[You are one data point.](https://www.thestar.com/opinion/contributors/correcting-the-record-on-carbon-pricing/article_efb69115-f65b-5f44-9dcb-3b42565c7e5a.html)",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mr_ToDo",
                            "body": "Three things\n\nOne, do people actually notice the few bucks they save on gas? On the personal budget the tax cut can't be all that much\n\nTwo, most people I personally know won't apply budget in a way that even if they think about would make a lick of difference. I'm sure there will be a few people that the extra 5-30 bucks a month is a big deal but I'm betting they are in the minority\n\nAnd three. The thing I worry about the most is the road repair part. If repairs are put off those few bucks have the potential of going to go negative on the repairs people are going to have to put into their vehicles in the end, and if they aren't budgeting people those are going to be very unexpected expenses that happen sooner. I know in Manitoba where they did a fuel tax break you can see a lot of road repairs that have been put off and it's made for some insanely crappy roads in just a year.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "International-Ad3447",
                                    "body": "If a person drives 10k km a year which is lower than average at 10l/100km they're saving $200 a year extra at 20 less cents per litre",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UltraCynar",
                    "body": "Don't worry about #1, gas companies gobbled up any discount. This is just a subsidy to the gas companies and now it's permanent.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No-Section-1092",
                            "body": "“Taxes don’t impact prices” — Average Redditors",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FordsFavouriteTowel",
                    "body": "Your first point is so out of touch",
                    "score": -3,
                    "replies": [
                        {
                            "author": "No-Section-1092",
                            "body": "It’s also correct.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TryingMyBest455",
                            "body": "It’s not though? If you go to buy a new car when gas is cheap, fuel efficiency isn’t as much of a priority. \n\n\nIf gas is cheap you don’t balk as much at road trips, or at a longer commute\n\n\nIf gas is expensive you reduce consumption to lower costs",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FordsFavouriteTowel",
                                    "body": "When has gas been “cheap” post Covid exactly?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TryingMyBest455",
                                            "body": "Cheap is relative, obviously \n\n\nIf gas is $1.60, $1.45 seems like a steal because it is *cheap relative to recent prices, and the price of surrounding gas stations*",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "icebeancone",
                                                    "body": "$1.45 isn't cheap. You're still getting ripped off. Gas should realistically be around $1.00.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "No-Section-1092",
                                                            "body": "Gas “should be” whatever the market price is, plus some tax to compensate for the damage its consumption imposes on public infrastructure and the environment.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "icebeancone",
                                                                    "body": "Fine. The market price should be around $0.85 then.\n\nThat better?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "No-Section-1092",
                                                                            "body": "If it isn’t, then it’s not the market price.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "icebeancone",
                                                                                    "body": "Indeed it isn't. Hence the phrase \"should be\".",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "No-Section-1092",
                                                                                            "body": "There is no should. The market decides the should.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "icebeancone",
                                                                                                    "body": "Then perhaps we need a market adjustment to reflect what it should be",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "No-Section-1092",
                                                                                                            "body": "You’re still not getting it. There is no should.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "icebeancone",
                                                                                                                    "body": "Well there certainly is a market adjustment",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "No-Section-1092",
                                                                                                                            "body": "The market is always adjusting. That’s why prices change. Not because we believe or want them to be at some arbitrary low number. That number is always in flux, and not up to us.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "icebeancone",
                                                                                                                                    "body": "A \"market adjustment\" in the context that I was using typically refers to an external disrutpion to the \"flux\" you mentioned. Usually by government intervention or some sort of unforeseen event. You speak of the market like it can't be manipulated.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "No-Section-1092",
                                                                                                                                            "body": "It can be, but it shouldn’t be, unless we have _very, very_ good reason to do so.\n\nIn this case, making gasoline artificially cheaper has enormous negative consequences for the environment, health, society, infrastructure, traffic and public finances.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "icebeancone",
                                                                                                                                                    "body": "The impacts on all of those things could easily be mitigated. The biggest impact would be to the Oil & Gas sector. But right now that business is being kept on artificial life support with your dollar so that fossil fuel oligarchs don't lose their fortune. There are many factors that go into the determined market price for fuel, but don't be so naive to think that the biggest influencer isn't greed.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "No-Section-1092",
                                                                                                                                                            "body": ">The impacts on all of those things could easily be mitigated. \n\nEasily? Lol no\n\n>The biggest impact would be to the Oil & Gas sector. But right now that business is being kept on artificial life support with your dollar so that fossil fuel oligarchs don’t lose their fortune. \n\nI don’t support subsidies to dirty fuels, that’s the point I’ve been making",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "icebeancone",
                                                                                                                                                                    "body": "You're missing the point that I have been making. The market ***IS*** being manipulated by an external force. But it's not the government. The subsidaries are one thing, but the artificial inflation of the price of fuel by the oil sector needs to stop. That is what I was referring to when I say what the price \"should\" be. A market adjustment is needed to correct it.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "No-Section-1092",
                                                                                                                                                                            "body": "There is no “artificial” market inflation. Sellers of anything, anywhere are _always_ trying to sell for the highest price at the maximum volume. In the absence of government intervention, the only thing that caps that price is competition. _That’s_ the market price.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "icebeancone",
                                                                                                                                                                                    "body": "Market price, by definition, is determined by supply and demand. By artificially reducing the supply (ie, slowing production), the oil company's can collaborate to manipulate the market price. That is artificial market inflation. I know the oil sector is not the only sector guilty of this. However this can be easily fixed by imposing regulations on production minimums.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "TryingMyBest455",
                                                            "body": "And a 2 bedroom detached home isn’t cheap at $300k, because it should realistically be $150k?\n\n\nIt’s relative. Of course it would be cheap if it were cheaper. It’s more expensive because it’s more expensive. \n\n\n*The point is*, if a discretionary cost like gas - and yes it is discretionary - is *less expensive* people tend to use more of it. \n\n\nIt’s like how if natural gas went down in price people would keep their homes warmer in the winter",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TraviAdpet",
                                            "body": "From 2006 to now if you factor in inflation gas should be $2\n\nAt its height of 2006 gas was 1.36, we are within spitting distance of that. I can’t say gas is expensive.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SpecialistElegant554",
                    "body": "You sound like one of those r/fuckcars gremlins. Also, this is a really stupid take in general. No one is upsizing their cars because gas is cheaper, quit writing shit before using your brain. Gas tax does not in fact pay for any of that.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "No-Section-1092",
                            "body": "I’ll say whatever I please.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ProfAsmani",
            "body": "Yeah we don't need tax money in Ontario for healthcare or anything.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Popgallery",
            "body": "Tax cuts and free money. Where is the added revenue coming from?",
            "score": 3,
            "replies": []
        },
        {
            "author": "lexcyn",
            "body": "Dumb move. Millions of dollars of lost revenue for the province.",
            "score": 7,
            "replies": [
                {
                    "author": "1slinkydink1",
                    "body": "Cutting revenues for car drivers/owners has been Ford's MO since day 1. And these are cuts that are basically impossible to roll back because it will be so unpopular to reinstate them. He's set us back decades financially and also to make any progress on weaning Ontario off heavy car dependencies.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "haixin",
            "body": "Called it\n\nI said it before, once these things go off, they will not come back on. Prices will not change, only thing that will be done is a producer surplus would be created leading to transfer of wealth to the producers and out of government hands.",
            "score": 3,
            "replies": [
                {
                    "author": "Barbecue-Ribs",
                    "body": "This is just retard logic… go to statscan and look at gas prices over time.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "haixin",
                            "body": "Is it though, look at what gas prices were when ford pauses the tax to start. Prices dropped over night but within fee days they were back up above 125.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Barbecue-Ribs",
                                    "body": "Daily fluctuations are too random for you to make any conclusions. Also, you might be confused about your timelines. \n\n\n\nJuly 1, 2022 tax cut introduced. \n\n\nJuly 4, 2022 (closest datapoint from Ontario.gov dataset): Toronto West - 186.4\n\n\nWhere were gas prices 125?\n\n\n\nFor fun here are CAA averages across the province found using web archive. \n\n\n\nJuly 2, 2022: 193.6\n\nJuly 3, 2022: 189.5\n\nJuly 4, 2022: 188.3",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "UltraCynar",
            "body": "Another tax break for the corporations and less money for the province. We get screwed both ways.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zraknul",
            "body": "How about instead of cutting the taxes, we use them as originally intended and spend the money fixing our crumbling highways?  QEW Niagara is a disaster, it's a game of dodge the trenches of removed material.\n\n\nWe can't maintain what we have and they want to build more.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GoldRecordDaddy",
            "body": "Prices will still go up.",
            "score": 2,
            "replies": []
        },
        {
            "author": "harve6",
            "body": "The tax he put on gas he's now taking off and looking for credit....right",
            "score": 2,
            "replies": []
        },
        {
            "author": "ILikeStyx",
            "body": "Ford never intended to undo the gas tax cut... and the gas companies have already taken it up as profit.\n\nRemember... less income for the gov't means less services and worse infrastructure.... sorry rural folks, hospitals closing at night and on the weekends is what you'll have to accept, we just don't have the money!",
            "score": 2,
            "replies": []
        },
        {
            "author": "CatsLeMatts",
            "body": "Bad news is the only news I think I've ever heard the past few years.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TryingMyBest455",
            "body": "I’d rather pay the full gas tax and have that revenue go towards social services and public transit infrastructure",
            "score": 4,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ontario-ModTeam",
                            "body": "Posting false information with the intent to mislead is prohibited.\nPosts or comments that spout well disproved conspiracy theories will be removed.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "TryingMyBest455",
                            "body": "I’m sorry you feel that way",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MrAkbarShabazz",
                                    "body": "I’m sorry too that I’m valued based on my identity as opposed to my content. But you know as long as some groups feel better…",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "TryingMyBest455",
                                            "body": "???",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lobeline",
            "body": "OPAC will just set it to the highest selling price point since they know the max we will pay once the taxes are removed. They’re greedy, and this is how their brains work.",
            "score": 3,
            "replies": []
        },
        {
            "author": "burkieim",
            "body": "When you go to the pump and see lower prices just remember corporations and the rich won. \n\nIt was a rebate program, not a tax. The reason why conservatives branded it a tax is because they did not benefit because they are too wealthy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sulanis1",
            "body": "The problem is, this is going to starve the government of more money which will raise the debt and deficit. Which I thought conservatives were good at?\n\nAll while corporations make more money..\n\nThis was a stupid fucking move back then and now. So now all of you should go to your boss and ask for a.50 cents deduction in pay and that will help your future.",
            "score": 2,
            "replies": []
        },
        {
            "author": "idontlikeyonge",
            "body": "Genuine shame, 1st April would have been the perfect time to add back on the provincial sales tax on gas.\n\nI drive about 20,000km a year, cheaper gas is always nice - however the government needs money also. Driving in a luxury, and I should be contributing to the tax revenues of the country in a way which reflects that.",
            "score": 7,
            "replies": [
                {
                    "author": "backlight101",
                    "body": "Driving is not a luxury for those not serviced by public transit.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "notuqueforyou",
                    "body": "Driving is not a luxury. Civil planners over the last 40 years have designed our cities so that having a car is essential.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "HeyHo__LetsGo",
                            "body": "Not to mention those of us who live in rural areas.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Vecend",
                                    "body": "I live in a rural area, I get around with no car just fine and so did people before cars existed.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Enchilada0374",
                                    "body": "Choose to live in*",
                                    "score": -17,
                                    "replies": [
                                        {
                                            "author": "AC_470",
                                            "body": "It’s true, they should just move to one of Canada’s many and notoriously affordable cities.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "Enchilada0374",
                                                    "body": "If rural living is cheaper, then they can afford it.",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "author": "backlight101",
                                                            "body": "Housing maybe, everything else, not so much.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ImGeorges",
                                            "body": "This is the dumbest comment. What do you even gain by correcting that?\n\nWhether someone chooses to live in a rural area or not, that is not your problem.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Enchilada0374",
                                                    "body": "💯  it isn't my problem if they choose to live far from services. They don't get to complain about the costs.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "ImGeorges",
                                                            "body": "Honestly they do get to complain. We have a huge land and cramping everyone in the biggest cities it's just mad stupid. The rural areas are also part of the country and they deserve to be treated as such. A lot of folks were born in those places and can't afford to leave their homes to pay thousands of rent for a tiny box.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rajhcraigslist",
                                            "body": "What if you are born there?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Enchilada0374",
                                                    "body": "Your parents choose to live there.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "rajhcraigslist",
                                                            "body": "Nope. They didn't. Where do you think toilet paper and vegetables come from? You need people to live in rural settings. Many of them get paid crap wages and can't get out of there. If lucky, the kids can get out but even then.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "No-Section-1092",
                            "body": "And the last thing we need to be doing is continuing to encourage this status quo.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Sad-Concept641",
                            "body": "cities? they designed the CITIES? I've never had a car and lived across the GTA. in cities you don't need a car. people just want one so life is easier but in the top 10 most populated cities, no one \"needs\" a car.\n\neta: to most people, poor people literally don't even exist and dropped dead the moment they found out they NEED a car to survive in the GTA.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "PrailinesNDick",
                                    "body": "It really depends on where you work.  I live in Toronto and work in Mississauga.  24km.  25 minutes by car or 75 minutes by public transit.  Transit is not an actual option.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Sad-Concept641",
                                            "body": "yeah, it is. you just said you can take a bus for an hour to get to a completely different city you decided to work in lmfao",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "PrailinesNDick",
                                                    "body": "I also said it would take 3x as long.  May as well walk, that's only 3 hours.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sad-Concept641",
                                                            "body": "right, I said it's possible to have no car in the top 10 cities, people just want one to make life easier. you came in and said you need one so you can avoid the hour bus trip to work in a complete different city that you live in. therefore you absolutely can live without a car but you don't in order to make life easier. you chose to work in another city. the city you live in has so much transit you would be laughed away for saying there is not enough.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "PrailinesNDick",
                                                                    "body": "You said GTA, Toronto and Mississauga are both squarely in the GTA.  Tons of people *need* to live in one and work in the other.  You keep saying *choose* as if I prefer driving 24km daily when I could have just decided to work next door.\n\nYour entire point is that people don't need a car to live in a city and I gave you a really common use case for someone to *live in a city and need a car*.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sad-Concept641",
                                                                            "body": "no YOU said you live I  Toronto and work in Mississauga. had you said you lived in Hamilton and worked in Toronto you might have a case but half of those folk take the go train into the city. YOU need a car. many others do not.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PrailinesNDick",
                                                                                    "body": ">but in the top 10 most populated cities, no one \"needs\" a car\n\n\nYou, like 3 posts ago.  Obviously people need cars I don't know why you're playing at this stupidity.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Sad-Concept641",
                                                                                            "body": "they literally don't NEED a car though. you proved it by saying you can take a bus for an hour. sorry you're so stuck up you can't take a bus for an hour but hundreds of thousands of people do it everyday.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Prestigious-Use5483",
                                                                                                    "body": "A car is essential in Toronto, unless you live within an hour away by public transit to work.  Don't forget that extra time and energy you're consuming using those services.  So while you may be right (technically) by saying no one NEEDS one, it is ESSENTIAL for most people who have to travel farther distances and value their time.  Got kids? That extra time saved will more than pay for itself if you have to take your kids to school, doctor appointments, after school activities, etc.  This is why we are saying a car is NOT A LUXURY, it is ESSENTIAL.  Same like healthcare not being a luxury for the rich and it being essential for our economy.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Sad-Concept641",
                                                                                                            "body": "nope that's a luxury when hundreds of thousands of people, with kids, continue to use the punky transit system because they can't afford a car. most commuters into Toronto take the go train because driving is ridiculous in the city and the traffic makes it equally as long to drive as the train.\n\nit is a luxury, youre just in a higher class that wants to see a luxury as an essential when hundreds of thousands of people live without it. be grateful you can afford this LUXURY because many cannot and guess what? they didn't just drop dead. they use public transit.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ItsMyBramptonAccount",
                                    "body": "I'd love to see you get my weekly grocery run home without a car. Weighs about 150lbs if I had to guess.\n\nI live in the 9th largest city in the country.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Sad-Concept641",
                                            "body": "I take mine on a cart. I've carried a 67\" tv on a cart. I'm sorry you're not smart enough to come up with solutions that hundreds of thousands of people do who cannot afford a car to begin with. so I'd have no problem with your grocery run as most people who take the bus wouldn't buy 19 cases of water to carry home.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NovelStudio565",
                    "body": "I smell sarcasm!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PhiberOptikz",
                    "body": "Luxury? Must be nice to see it as that. For the rest of us who don't have that privilege, driving is essential",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "OBoile",
            "body": "Boo. It sucks that doing the right thing isn't popular.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChanelNo50",
            "body": "That's nice but gas companies can charge whatever they want and they know what we're willing to pay because we've been doing it for a while",
            "score": 2,
            "replies": []
        },
        {
            "author": "Arrow208",
            "body": "Libtards here want more taxes lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "SuspiciouslySuspect2",
            "body": "Y'all can just avoid all the shenanigans and get an EV (more used options available by the day).\n\nI don't miss stressing over gas prices. Now I pay ~9$ for 500km+ of range (admittedly more like 300 in the winter if you wanna be toasty).",
            "score": 2,
            "replies": [
                {
                    "author": "BabadookOfEarl",
                    "body": "I hear used Teslas are getting cheaper 😆",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SuspiciouslySuspect2",
                            "body": "Eh, buy 'em used, debadge 'em, never give Elon a dime more though. \n\nI have no problem with anyone driving them (just don't put kids in the backseat). But, if you're any kinda human, put in the hour-long effort to make them a personal \"fuck-you\" to Elon, and assume it might be gone any moment. \n\nThe insurance might get expensive fast though.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BabadookOfEarl",
                                    "body": "For sure. No subscription services. For the small number I’ve been in, I wouldn’t actually buy one either though, Elon aside.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SuspiciouslySuspect2",
                                            "body": "There are far better options: Hyundai/Kia, GM, Ford. Different EVs excel depending on your priorities.\n\nFor the not-rich, GM usually wins on bang-for-buck/comfort, at the cost of mid charging and tech.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Latenight2nite",
            "body": "It’s $1.39 here so does that mean it will go down to $1.20",
            "score": 1,
            "replies": [
                {
                    "author": "UltraCynar",
                    "body": "No. ",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "LordofDarkChocolate",
            "body": "Who pays for this - because I’m pretty sure the Oil companies will not be dropping their prices. Those prices are set by whatever the price of a barrel of oil is going for. It has nothing to do with government (provincial or federal) taxes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bentjamcan",
            "body": "Don't act surprised.  \nConservatives are about power and money, not serving their constituents best interests.  \nNever forget that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Samhth",
            "body": "When will the government start monitoring the O&G industry and preventing them from colluding? Seriously O&G and Grocery chains are single handedly abusing the system and causing inflation to stay where it is at despite reduction in consumer spending.",
            "score": 1,
            "replies": [
                {
                    "author": "TheGreatFilth",
                    "body": "We need green hat italian guy",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zraknul",
            "body": "How about instead of cutting the taxes, we use them as originally intended and spend the money fixing our crumbling highways?  QEW Niagara is a disaster, it's a game of dodge the trenches of removed material.\n\n\nWe can't maintain what we have and this idiot wants to build more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "notaspy1234",
            "body": "The only good thing he's done for Ontario is the gas cut.",
            "score": 1,
            "replies": []
        },
        {
            "author": "differentiatedpans",
            "body": "Can we axe the carbon tax but increase the provincial tax because our roads and bridges and other transportation infrastructure is kind of in the shitter in a lot of places.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Facts_pls",
            "body": "To all the people who keep saying that oil companies will just pocket all the difference and grow their profits...\n\nHave you heard of competition? Gas prices are literally advertised on Google maps. You can see the prices at a glance and just go for the cheaper one.\n\nIf company A significantly overcharges for gas vs company B, customers will just go to company B.\n\n----\n\n\"but but.... they all collude to keep prices high\"\nThen why aren't the prices 2 dollars or even more if they can jack up the price as they want? Something is clearly stopping them from charging arbitrary prices.\n\nIs collusion possible, yes. Is it likely or significant? Usually no. I think people are still salty from the bread pricefixing scandal and just assume collusion everywhere.",
            "score": 1,
            "replies": [
                {
                    "author": "TheGreatFilth",
                    "body": "No it's blatant price fixing, same as the grocery industry and telecommunications company's in Canada. The reason they don't make gas a million dollars is because they need people to just scrape by so they can have their CEOs get raises, have record profits and buy more property. If everyone couldn't afford gas or groceries or internet then we would stop consuming, going out and producing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Skyscreamers",
            "body": "If it means gas goes down to almsot 1.10 a litre then I’m down we pay way to much for gas",
            "score": 0,
            "replies": []
        },
        {
            "author": "lizard_alien2",
            "body": "Ford actually does something good and people in this sub still complain lol",
            "score": -6,
            "replies": [
                {
                    "author": "TraviAdpet",
                    "body": "Starving the government funding isn’t a good thing. As it is carbon tax accounted for 17 cents of the price of gas and we haven’t seen it go down yet but the government is getting none of that money.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Dorwyn",
                    "body": "A reduction in gas tax means the revenue needs to be made up from somewhere, like from the lower incomes that have no car or smaller, more fuel efficient cars.  This is wealth transfer to the rich, it is not the good thing you think it is.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "arumrunner",
                    "body": "Yupp, say something positive in this sub and get ready for the downvotes. The hate overcomes logic.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "1slinkydink1",
                            "body": "You can argue that you'll benefit but I think that everyone has explained pretty well why they disagree with this decision. It's not just a \"boo Ford\" hate on.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}