{
    "title": "Toronto protesters demand engineering firm cancel bike lane removal contract with Ontario",
    "author": "nurshakil10",
    "subreddit": "ontario",
    "rank": 7,
    "score": 529,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 95,
    "url": "https://www.theglobeandmail.com/canada/article-toronto-protesters-demand-engineering-firm-cancel-bike-lane-removal/",
    "id": "1je9oc1",
    "selftext": "",
    "comments": [
        {
            "author": "durrdurrrrrrrrrrrrrr",
            "body": "Bloor was shut down for years to put them in, and now that they’re finally done they’re going to shut Bloor down to rip them out. Do I have that right?\n\nETA this is to help with traffic",
            "score": 97,
            "replies": [
                {
                    "author": "RemarkableReindeer5",
                    "body": "Yup. They sure love to waste money",
                    "score": 28,
                    "replies": [
                        {
                            "author": "krombough",
                            "body": "Plus all the hours lost to the extra traffic this creates.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "i_donno",
                    "body": "Then Bloor will be shut down when the bike lanes are put back in (when Ford is gone)",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "RemarkableReindeer5",
                    "body": "Yup. They sure love to waste money",
                    "score": 8,
                    "replies": [
                        {
                            "author": "durrdurrrrrrrrrrrrrr",
                            "body": "I mean, how many paving contractors were present at this, the day of his daughter’s wedding?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "RemarkableReindeer5",
                                    "body": "Fair point",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RabidGuineaPig007",
                    "body": "It's the reverse of the EV chargers Doug ripped out in 2018, now going back. \n\nFishcully rasponsubble.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Morlu",
                    "body": "Shut down for years? They installed them in less than a week in the Etobicoke section.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FourNaansJeremyFour",
            "body": "The \"respectable\" big engineering consulting firms are all in on the endless roadbuilding gravy train. Not just Stantec but WSP, Atkins (formerly SNC), Wood, Golder, etc etc. I'd be very surprised if all of them hadn't wined and dined Douggo to make sure he committed to plenty more roadbuilding projects. I wonder if they weren't also pulling strings to kill WFH (alongside the office space realtors)\n\n\nBuilding roads for massed private transport makes you much more money than building public transport projects does. Just like making cars is far more lucrative than making buses. (To say nothing of the endless cash cow of repairs for the asphalt mafia). We don't get the transport infrastructure we need - we get whatever pays for the execs' holidays and cottages.",
            "score": 12,
            "replies": []
        },
        {
            "author": "obviouslybait",
            "body": "Do it",
            "score": 50,
            "replies": [
                {
                    "author": "Muthafuckaaaaa",
                    "body": "Done!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "crinklyplant",
            "body": "Posted yesterday on Cycle TO's website:\n\nToday the Ontario Superior Court of Justice denied our injunction to stop the province from removing bike lanes in Toronto. \n\n**While the decision is disappointing, it doesn’t impact the bigger charter challenge and our chances of success on the merits of the case.** The judge agreed that our case raises serious concerns about potential harm the lane removals could cause to cyclists. That hearing is scheduled for April 16th.\n\nIn court this week, however, new documents were released that belie the province’s own statements that the legislation is in the public interest.\n\nIncluded among the documents were a government-commissioned report in late 2024 from engineering firm CIMA estimated that removing critical bike lane infrastructure would increase collisions by 54 per cent–that’s all collisions, not just people on bikes. Furthermore, removing the bike would lead to an increase in cyclists using sidewalks, creating hazards for pedestrians. \n\nThe documents also show what we’ve been saying all along: the proposed removal of the three downtown Toronto bike lanes would be unlikely to achieve Ontario’s goal of reducing congestion and tackling traffic, a key claim repeated by the province without evidence to justify the legislation. Now we know even the province’s own experts don’t agree.\n\nOn the legal matter, the injunction outcome was based on the “balance of convenience,” one component of a three-part test used by the Court to determine whether to grant an injunction. In cases like this one, where an applicant seeks to suspend the operation of validly passed legislation, the Court presumes that the legislation is in the public interest and serves a valid purpose. \n\nBut from our perspective, nothing in the content of Ontario’s documents is a surprise. MTO and their experts confirm what Cycle Toronto, advocates, and opponents to this legislation have been saying all along that:\n\n1) Ripping out bike lanes won't solve congestion and will make traffic worse\n\n2) There is no mythical network of secondary roads that could replace the target bike lanes\n\n3) Moving ahead with these removals will put people's lives at risk\n\nWhile we’re not taking anything for granted, those documents, including high level conversations with Ministry of Transportation staff, also suggest that removal work isn’t imminent in the next couple of weeks.\n\nWe remain confident and look forward to a full examination of the evidence at the hearing on April 16th.",
            "score": 25,
            "replies": [
                {
                    "author": "Gonnatryhere",
                    "body": "The reports demonstrate that Ford is removing the bike lanes for personal means, acting against what science tells us is faster and safer. Never mind the fact that a premier should not be meddling with the affairs of a municipality.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "crappy_diem",
            "body": "Anyone have the non paywalled version? Curious to know what firm is holding the contract.",
            "score": 24,
            "replies": [
                {
                    "author": "bbqpauk",
                    "body": "Its a company called \"Stantec\" based on the article.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "SheerDumbLuck",
                    "body": "Stantec",
                    "score": 22,
                    "replies": [
                        {
                            "author": "crappy_diem",
                            "body": "Oof, doubt corporate will care what protestors think. Really wish PEO had more of a spine in these matters - detriment to the public good and safety after all.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "ikeda1",
                                    "body": "That's actually a good point...at what point does the PEO have a duty to step in, if at all, if their P. eng.'s are wasting time and money on make work projects.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "CyberEd-ca",
                                            "body": "The threshold is much higher than you are imagining.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ikeda1",
                                                    "body": "Unfortunately you are right. PEO can hardly get their eit screening efficiently sorted. Is imagine attempting to govern grifty/useless engineering contracts is somewhere on th bottom of the list or not in it at all",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CyberEd-ca",
                                                            "body": "What you want to do is an end around of both the democratic process and the courts. You seem to think that engineers should rise up like the Potemkin sailors to enforce some revolutionary belief about the necessity of bike lanes.\n\nThis is a fundamental misunderstanding of the role of engineers in our society.\n\nEvery engineer understands that there are competing interests in any design.\n\nIf you want bike lanes on every street, go about that change democratically. Or contest the constitutionality through the courts.\n\nThere is no such regulatory requirement or industry standard that requires bike lanes on those streets. It is not a thing.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SheerDumbLuck",
                                    "body": "I hope the employees take a stand.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "the_asset",
                                            "body": "P. Eng.'s in Ontario could take a stand.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CyberEd-ca",
                                                    "body": "Change the regulations so that every road requires bike lanes.\n\nOtherwise, no.\n\nEvery engineer understands there are competing interests in any design or activity.\n\nTake it to the courts. Claim that your Section 7 Charter rights are impacted. See how far that gets you.\n\nOr use the democratic process to get the change you want.\n\nBut don't say it is up to engineers to grab the revolutionary power to usurp the rule of law...that would be against the code of ethics.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "londonsdungeon",
                    "body": "https://archive.ph/GSQLD",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mzeb91",
                    "body": "https://www.removepaywall.com/search?url=https://www.theglobeandmail.com/canada/article-toronto-protesters-demand-engineering-firm-cancel-bike-lane-removal/",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yaughl",
            "body": "Keep bike lanes and introduce congestion pricing for cars like New York did.",
            "score": 11,
            "replies": []
        },
        {
            "author": "ref7187",
            "body": "The City of Toronto should blacklist Stantec from any contracts",
            "score": 12,
            "replies": [
                {
                    "author": "M-Dan18127",
                    "body": "Do you have any idea how huge Stantec is.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "RabidGuineaPig007",
                            "body": "> Stantec\n\nThe Kruger Industrial Smoothing of Canada. They were responsible for the implementation of bike lanes on Wilson Street in Hamilton and they have to literally be the dumbest design of bike lanes in the world. It's like they got an intern to do it, and that intern was related to a Board member. No one who worked on that ever rode a bike.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "muddaFUDa",
                    "body": "Can’t the city deny permits for the project?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ref7187",
                            "body": "Good question, not sure how this works, but ultimately the Province can overrule the City on anything. They can even overrule them on blacklisting, but the Province would be silly to fall into that trap.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "muddaFUDa",
                                    "body": "Sounds like they can at least drag their feet and maybe things will change when Dougie goes after the federal CPC leadership",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "muddaFUDa",
                                    "body": "Sounds like they can at least drag their feet and maybe things will change when Dougie goes after the federal CPC leadership",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MasterpieceNo9966",
                            "body": "if the province has jurisdiction to call for the project i doubt it, but dont know for sure. would end up in the courts i would think",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MasterpieceNo9966",
                    "body": "would be an insane overreach",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Niicks",
                            "body": "The insane overreach is Douggie acting like the mayor of Toronto.  The science shows that bike lanes reduce congestion and now we have to deal with the gong show of their removal for reasons he has made up entirely in his own mind.  I say pile on the public pressure and do everything possible to hinder this project of his.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "MasterpieceNo9966",
                                    "body": "i agree with you on the doug ford trying to throw his weight around here. doesnt mean pulling stantec off bid list is appropriate",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Niicks",
                                            "body": "Why not?  It seems like Doug is constantly playing dirty pool in every situation he's in and civility politics is rapidly disappearing.  Left and centrist leaning politicians didn't start being jagoffs so I say we should checking them into the boards.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MasterpieceNo9966",
                                                    "body": "your advocating  targeting the contractor not doug ford and his government",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Niicks",
                                                            "body": "Will certainly make other contractors look at working closely with Doug Ford think differently,  wouldn't it?",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "MasterpieceNo9966",
                                                                    "body": "you think he will be unable to find contractors to do work for the province? your out to lunch\n\nwhat will happen, is contractors from other parts of the province/ other provinces will do the work and it will cost more of taxpayers money",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Niicks",
                                                                            "body": "Oh I'm sure we can put up enough of a hassle if the public would mobilize over the issue.  Write in campaigns,  protests and peaceful sit ins when they attempt to start work.\n\nThese politicians and their lackeys don't listen so we need to stop being so polite about how we are voicing our opinions.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MasterpieceNo9966",
                                                                                    "body": "best of luck",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "SnooOwls2295",
                                                                    "body": "Nah it wouldn’t. Staying on the good side of the province is worth billions of dollars more than the City. The City needs firms like Stantec more than they need the City. Stantec is a Canadian company that does good work, we’re already black listing American firms, let’s not put the City’s capital program at risk for an losing fight. \n\nGo after the local MPs, protest at their offices, maybe sue the government for endangering cyclists.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "zeth4",
                                                            "body": "They chose  to do the project which undermines the municipal government  why should the city deal with them in the future?\n\nI've seen consultants/contractors blacklisted municipalities for far less",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SnooOwls2295",
                                                    "body": "Because they do good work and are a Canadian firm, we already don’t have as much competition as would be ideal and are blacklisting American firms. It would be detrimental to the City to not have Stantec as an option on future work.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Niicks",
                                                            "body": "Your points are valid.  Counterpoint however, they should back out of this particular contract due to public outrage.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "SnooOwls2295",
                                                                    "body": "I would love if this work didn’t happen, but whether it is them or someone else, targeting the engineers is not going to stop it. Someone will take the money to do the work. Also, they probably wouldn’t want to do anything to risk their relationship with the province.\n\nI think our efforts are better spent texting Doug in the middle of the night about this.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ref7187",
                            "body": "Not at all. They didn't have to do the work for the Province. \n\nEdit: fair enough, there is nothing technically wrong with what Stantec is doing. But I still think it is wrong.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "MasterpieceNo9966",
                                    "body": "what conflict of interest? being contracted for a job, and doing it?\n\nyour upset they arent taking a political side here",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "iamPendergast",
                                            "body": "\\*you're, and why not ban them? They advertise their sustainability credentials etc. but obviously don't practice what they preach.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "SnooOwls2295",
                                                    "body": "I stated this in another comment, but, the City needs Stantec more than the other way around. We are already banning American firms from biding on work, losing one of the world leading engineering firms that happens to be Canadian would be detrimental to competition in our bids. \n\nStaying on the good side of the Province is literally worth probably hundreds of millions of dollars more for Stantec than any work they would miss out from from the City. There is no way they would drop the contract due to this threat and it would not deter any other firm from doing work for the Province.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "MasterpieceNo9966",
                                                    "body": "thank u",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ref7187",
                                            "body": "Edit: whatever. I still think it's wrong what they're doing, and not in our interests as the people of Toronto.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "MasterpieceNo9966",
                                                    "body": "what a reach",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ref7187",
                                                            "body": "Edit: see previous comment",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "MasterpieceNo9966",
                                                                    "body": "so because one politicized project got taken down you think its appropriate to take them off all city bid lists? thats bully tactics, not different than what doug ford is doing/does",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ref7187",
                                                                            "body": "Well, let's see how much they are making off this contract then. I think it's wrong for a company to profit by going against the people of Toronto's democratic decisions. The City of Toronto represents our interests and they can make a decision based on that.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SnooOwls2295",
                                                                                    "body": "Technically under out democratic system, the Province has the right to do this and represents “our interests”. I greatly disagree with removing bike lanes, but I think your angle of attack is wrong.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ref7187",
                                                                                            "body": "I said the people of Toronto, not Ontario. People from outside Toronto should not have the power to dictate how Torontonians use their streets.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "SnooOwls2295",
                                                                                                    "body": "I agree in spirit, but from a sense of how a firm should act, it is based on the actual law/rules, not as we think it should be.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "ref7187",
                                                                                                            "body": "I agree 100%. My point is that this is a statement of values by Stantec, and we can judge whether they align with ours as Torontonians.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "zeth4",
                                                                            "body": "Yes.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "theothersock82",
            "body": "I am all for giving bikes their own seperate infrastructure but they should never sharing the same roads with cars. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Reveil21",
            "body": "Time for everyone to start riding bikes and showing drivers how much an inconvenience it is to them to properly share the road. No side of the lane to be courteous, be right in the middle like recommended.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -9,
            "replies": [
                {
                    "author": "greensandgrains",
                    "body": "What’s funny? I like a joke.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "This_Tangerine_943",
                            "body": "Chow's silence on this.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "datums",
            "body": "\"Turn down this money you've already agreed to accept for reasons.\"",
            "score": 0,
            "replies": []
        },
        {
            "author": "Yaughl",
            "body": "~~Keep bike lanes and introduce congestion pricking for cars like New York did.~~\n\nReddit decided to be buggy and duplicated my comment. Sorry.",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -45,
            "replies": [
                {
                    "author": "Ratsyinc",
                    "body": "Lol democracy? Now that's just insane. Democracy in this case would be allowing the residents of the cities whom this affects to vote in representation to tackle these municipal issues - crazy idea, I know.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "a-_2",
                    "body": "> they only like democracy when it does exactly what they want\n\nThe bike lanes are on roads maintained by the city of Toronto. The government democratically elected by Toronto put in the bike lanes. Even at the provincial level, all the ridings with the bike lanes have gone to Liberal or NDP parties that support them. Yet Ontario is overriding that to take them out against the wishes of the politicians and governments elected in the affected areas.\n\nYeah, they're legally *allowed* to do that, but people are also allowed to protest. That's a fundamental part of democracy.",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "king_bungholio",
                    "body": "I mean you could say that the bike lane was voted for when Chow won. Or when Tory won since I believe the plan was made under him.\n\nConversely, the bike lane was an election issue provincially in Etobicoke-Lakeshore (Bloor bike lane), and the local PC MPP who ran on removing it was soundly defeated. I don't think the PCs have a single MPP in any riding where the bike lanes to be removed are, so you could say that democracy has spoken in that sense too.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "socialanimalspodcast",
                            "body": "The OPC have almost never had a mandate within Toronto since they came back into power, and yet they routinely fuck with the city of Toronto. \n\nYou could say that neither working class OPC voters or the OPC themselves fully understand the purpose or definition of a mandate.",
                            "score": 30,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "totaleclipseoflefart",
                    "body": "What was democratic about how the province unilaterally implemented their agenda for what’s a municipal issue?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Circusssssssssssssss",
                    "body": "Protest is exercise of democracy and not entitlement unless it ventures into property destruction or obstructing travel...",
                    "score": 28,
                    "replies": [
                        {
                            "author": "noleksum12",
                            "body": "I agree with this 100%.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "totaleclipseoflefart",
                            "body": "And even then, saying protest that ventures into property destruction is inherently entitlement is just ignorant and ahistorical.\n\nSlavery. Apartheid. Jim Crow. Several major genocides. Etc. etc. etc. No possible way the victories that were won against these things happen without disruption.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThatAstronautGuy",
                    "body": "Ford is overruling democracy. People in Toronto have voted for bike lanes time and time again, and Ford hates seeing them on his drive to work so he's having them ripped out despite all evidence being in their favour.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "backlight101",
                            "body": "I’d love to see the outcome of a referendum on bike lanes in Toronto.  I’ll bet they are less popular than you think.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "backlight101",
                            "body": "I’d love to see the outcome of a referendum on bike lanes in Toronto.  I’ll bet they are less popular than you think.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "ThatAstronautGuy",
                                    "body": "Referendum from who? People who don't live in Toronto? Because yeah, commuters who care about literally nothing but their ability to drive from point A to B will be against anything they perceive as being in the way of that, even if they're wrong. But the city of Toronto, who controls those roads, voted in a very explictly pro-bike lane mayor, and has done so for years.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Flanman1337",
                    "body": "Except Conservatives haven't won a seat in the ridings effected in 3 different majority elections.\n\n\nIf bike lanes were actually the problem, they wouldn't have amended their bill to SPECIFICALLY name specific Toronto bike lanes. These ridings also had a municipal elections whose day to day operations and maintenance of bike lanes is the responsibility of. And every time they elected pro-bike lane representatives. ",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ref7187",
                    "body": "People from outside Toronto don't get to dictate how we use our streets",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ChrisRiley_42",
                    "body": "Remind us, when did Ford run on removing bike lanes?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Teleke",
                    "body": "You know there's still time to delete this comment 😅",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "keyboardnomouse",
                    "body": "This idea about democracy coming from a Trump fan.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "onaneckonaspit7",
                    "body": "They are certainly acting childish, but stonewalling progress and not committing to going forward with making Toronto less car centric is also dumb. The one city in Canada that needs to do it. Classic Canada",
                    "score": 4,
                    "replies": [
                        {
                            "author": "JasonTO",
                            "body": "Toronto always manages to lag behind what the civilized world is doing. It has a knack for doing the exact wrong thing at the exact wrong time. \n\nIt's like SkyDome all over again. Oh, the culture is shifting to more intimate, retro-style ball parks. Let's plant a concrete, multi-sport monstrosity right on prime downtown land.\n\nOf course it's a stretch to compare two projects decades apart, but I do think there is a common denominator here that continues to infest Toronto psyche and that plagues just about everything it attempts to do in terms of city building.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "onaneckonaspit7",
                                    "body": "Doesn’t help that projects take forever to get off of the ground, are often half measured, and the almost ceremonial greasing of the palms for former politicians via contracts.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "noleksum12",
                    "body": "Unfortunately, that seems to be the attitude of a lot of people these days.  But primarily those on the far spectrum of politics.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "keyboardnomouse",
                            "body": "\"People I disagree with don't like democracy\" is the attitude of people that voted MAGA.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}