{
    "title": "One Piece: Chapter 1142 Official Release Discussion",
    "author": "Skullghost",
    "subreddit": "OnePiece",
    "rank": 1,
    "score": 272,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 191,
    "url": "https://www.reddit.com/r/OnePiece/comments/1j79exg/one_piece_chapter_1142_official_release_discussion/",
    "id": "1j79exg",
    "selftext": "**Chapter 1142** is out on [Mangaplus](https://mangaplus.shueisha.co.jp/titles/100020) and on [Shonen Jump / Viz Media](https://www.viz.com/shonenjump/chapters/one-piece)!\n\nPost all discussions, reactions about this release in this thread.\n\nJoin us on the [One Piece Discord](https://discord.gg/onepiece) to discuss One Piece instantly with fellow nakama!\n\n**BREAK NEXT WEEK - New Chapter on March 23, 2025**",
    "comments": [
        {
            "author": "GabrielGameFreak",
            "body": "\"Midterm Ex-Slam\" is so good, Viz cooked with that one",
            "score": 287,
            "replies": [
                {
                    "author": "Flippercomb",
                    "body": "Makes so much more sense too, I was confused on the pun in the scans",
                    "score": 60,
                    "replies": [
                        {
                            "author": "fuska",
                            "body": "> Midterm\n\nBurst out laughing at that one after the translation confusion.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mammoth_Ask3797",
                    "body": "German here. Can you explain please?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GabrielGameFreak",
                            "body": "It's a pun on the term \"Midterm Exam\", aka an exam (Prüfung) taken in the middle of any of any given academic period (i.E. The middle of a school year). The \"am\" part is replaced by the word \"Slam\" because it is an attack. The whole thing is a pun based on him being a teacher.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skullghost",
            "body": "https://preview.redd.it/o2wp9mtzjone1.jpeg?width=1775&format=pjpg&auto=webp&s=32c2967b4cd7973e1e327ee4ca3400be90541784\n\nKillingham must have eaten either the dream dream fruit or sleep sleep fruit to make the children sleepwalk. I’m also assuming that the fruit’s ability would allow the user to bring these nightmares to life.\n\nThe kid who said that their mom is their nightmare must have it rough 🤣\n\nMakes sense that Gunko is afraid of Nika especially since he’s the embodiment of freedom",
            "score": 195,
            "replies": [
                {
                    "author": "RexRender",
                    "body": "It’s a brilliant kidnapping power. Making the kids sleepwalk while bringing nightmares to life for the adults to deal with. It’s a combination power that makes it perfect for such infiltration activity.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "Serbaayuu",
                            "body": "I think the actual sleep**walking** is Gunko.  It's a good teamup.  I would guess Killingham only puts people to sleep, but with Gunko's arrows they're forced to walk anyway.\n\n(I guess by itself, Killingham's power would mainly be used to put some of his enemies to sleep and make the rest of the enemies deal with the nightmare minions.)",
                            "score": 85,
                            "replies": [
                                {
                                    "author": "Spiritfur",
                                    "body": "Plus, in the scene of the kids walking away from the school, we can see an arrow right next to them pointing in the direction they're headed.",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "trackandphilld",
                                            "body": "Did anyone else think that Sommer's comment about  being hurt by those you love was eluding to his ability? The injured PE teacher did warn Saul not to touch the kids. That would include Sommers in the game they were making out of stealing the giant kids.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Animante",
                                            "body": "Nice catch!",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AnubisIncGaming",
                    "body": "That one kid got us to a literal Big Mom",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Heavenansidhe",
                    "body": "Most likely eaten the kirin fruit with a mythological power. It is literally in his name and he has the awakened cloud behind him.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Serbaayuu",
                            "body": "Do kirins have some association with sleep mythologically?  The sleeping kids are clearly his DF power so if there's no link between the two traits that'd be a bit strange.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Heavenansidhe",
                                    "body": "It's up to oda. Chinese/japanese azure dragons dont shoot air scythe too but kaido could. Buddha definitely did not send shockwaves in buddhism.",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "Serbaayuu",
                                            "body": "Those are minor fight powers.  This dreaming into reality appears to be this character's entire gimmick.  So there'll need to be a stronger justification for it.  \"He ate the Kirin-Kirin Fruit so he can make nightmares real\" will need some kind of mythological justification.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "bodg123",
                                                    "body": "Bro he's a zoan.",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "Serbaayuu",
                                                            "body": "And yet he can put people to sleep and summon up their nightmares.\n\nThus my question: is there mythological precedent for kirins being related to dreaming?  I'm not super familiar with the beast but I didn't find anything like that in my cursory study when he first showed up.\n\nIf not, maybe he isn't a zoan.  Maybe he just looks like whatever he last dreamed about.",
                                                            "score": 20,
                                                            "replies": [
                                                                {
                                                                    "author": "bodg123",
                                                                    "body": "There isn't. And yet he's still a zoan. That much is obvious. Especially with his name being a reference to the qilin.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Serbaayuu",
                                                                            "body": "I agree it seemed obvious on his introduction, but if kirins/qilins don't have dream powers, then that would be a very confusing devil fruit.\n\nIf he was a mythical zoan with the power to bring out nightmares, why wouldn't Oda make him a [Baku](https://en.wikipedia.org/wiki/Baku_\\(mythology\\)) instead?  What specific reason did he choose kirin for?\n\nHe doesn't write his book 1 chapter at a time - this character and his eventual defeat are already outlined in a notebook somewhere - so there must be a good reason for him to look like a kirin.  The question is: is that reason related to his devil fruit powers?",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "bodg123",
                                                                                    "body": "They don't, but as someone said above, the Buddha isn't known for Shockwaves.\n\nBakus have the face of a tapir.\n\nMaking the nightmare power change to kirin lore is not much of a difference from using a kirin design for a Baku. So the possibility is he used kirin for design and Baku for the abilities since they are both chimeras.\n\n\nThe other possibility is we are seeing two separate abilities here. One could be a dream manipulation ability, and the other could be a kirin. The sleeping could be apart of a dream ability, or caused by hypnosis. Similar to jango or Mrs goldenweeks color traps. The kids are just following the arrow so who knows.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "aLittleBitFriendlier",
                                                                                            "body": "Just jumping into the mix here, but I always interpreted Sengoku's shockwave as being an incorporation of the buddhist gong into his powers. It seems like a justifiable ability to include if that's what Oda intended.\n\nI feel like a Kirin having dream powers is a larger departure from myth than the buddha producing shockwaves",
                                                                                            "score": 7,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Serbaayuu",
                                                                                            "body": "> the Buddha isn't known for Shockwaves\n\nBecoming giant, golden, and ultra-powered (like a deity) seems to be the primary Buddha power, not just making shockwaves.  Countless very strong people in One Piece make shockwaves with their punches or slashes or kicks.\n\n\"The kirin fruit lets the user create nightmares\" would be like if Marco could turn people to stone per a gorgon or if Kaido had the power to talk to plants per a dryad - it doesn't make sense for it to be tied to this fruit.\n\nIt's possible that putting the kids to sleep is not specifically the power at work, however I would argue that Killingham repeatedly dozing off is obviously meant to be part of his fruit affecting his waking nature, like Trebol's runny nose.\n\n> So the possibility is he used kirin for design and Baku for the abilities since they are both chimeras.\n\nSo you are arguing that he made a kirin zoan purely because he liked how it looked, and did not bother referencing the relevant mythology?  I find that hard to believe.\n\nI think it's more likely that there is some folk legend about a sleeping kirin that you and I are simply unaware of.",
                                                                                            "score": 6,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "bodg123",
                                                                                                    "body": "I completely disagree with you.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Neggiedotcom",
                                                                                                            "body": "Serbaayuu is just objectively correct",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "bodg123",
                                                                                                                    "body": "No he's not. Just because it's not associated with the lore doesn't mean oda didn't choose to use it as part of the ability.\n\n\nThere aren't many explanations here. He's got a horse/giraffe looking face which is associated with the kirin. So unless he's part mink, he doesn't have a Baku devil fruit as Bakus look like tapirs.\n\n\nHe isn't correct.",
                                                                                                                    "score": -1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "314GeorgeBoy",
                                                                                                                            "body": "Or his ability isn't what is putting people to sleep/making nightmares come to life",
                                                                                                                            "score": 5,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bluthbanana20",
                                            "body": "Reminds me of the Buddha Palm from Kung Fu Hustle",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Wise-Cardiologist-83",
                                            "body": ">Buddha definitely did not send shockwaves in buddhism\n\n\nThat's how Buddha hunted in ancient times. ",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Spore64",
                    "body": "I like to think that there are different iterations of Nika and her being afraid of that nightmare is due to it being the Nika iteration from Elbaf",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "IzziTheEpic",
                    "body": "Maybe killingham’s fruit allows dreams to come true; and he knocks his victims out with a gas, which is why he has the gas mask. Then Gunko makes the sleeping children walk with the arrow arrow fruit. I still think Killingham has a mythical zoan fruit but who knows.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "No-Gas-1550",
                    "body": "How do I read this part of the manga",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ace_gsb_lol_king",
                    "body": "isn't possible its a mythical zoan type with sleeping/ dream abilities. I can't imagine the celestial dragons being okay with a non human looking person as a holy knight given all the racist \"sub-species\" rubbish Garling said.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "UsoppIsJoyboy",
                    "body": "Yea no he has mythical zoan kirin that has sleep powers\nAnd the nightmares are from the other guys",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Impossible_Permit195",
                    "body": "I think he put them to sleep and Gunko is making themsleep walk. Does anyone know if Qirins have sleep powers associated with them? If not I’m wondering if he’s a Minks? But that feels like a stretch given all the other celestial dragons are humans.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mammoth_Ask3797",
                    "body": "I read somewehere that the Kirin also is seen as protector of children. So maybe making kids sleepwalk is part of the awakened power of his fruit. And he in fact ate the nightmare fruit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Boneyard_Ben",
            "body": "So we got someone who can bring people's fears to life. Keep this guy away from Usopp or he'll end the world faster than anything Loki can do.",
            "score": 184,
            "replies": [
                {
                    "author": "ElSleepychameleon",
                    "body": "Luffy's going to be put to sleep and have nightmares of meat trying to eat him or without a mouth so he can't eat.\n\nDora the explorer going to show up and ask Zoro for directions",
                    "score": 69,
                    "replies": [
                        {
                            "author": "Exaskryz",
                            "body": "You got Dora wrong. Dora's worst nightmare is asking Backpack for the Map and instead out pops Zoro",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MechanicGopher",
                    "body": "Usopp quite literally fears the WORST that could happen, that’s why he’s always prepared",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "HydroLightning",
                    "body": "it feels so easy to just say- they're scared of their enemies' defeat.  \nIt's a cool power though.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "x_deity_x",
                    "body": "But he’s drunk",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MannfordsFinest",
                            "body": "Usopp so drunk that he has no fears, looking like a brave warrior of the sea. Sobers up and realizes what he’s done.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MajinAkuma",
            "body": "I like how Tusk was given two title cards to show two sides of him.\n\nAlso, the kid who’s afraid of his mom basically drew Big Mom.",
            "score": 53,
            "replies": []
        },
        {
            "author": "Soft-Comfort-7474",
            "body": "Loki is such a menace\n\nhttps://preview.redd.it/r6js9lwsione1.png?width=1169&format=png&auto=webp&s=06993ffa7dfbb59afed0903a9f8a63656e7546b9",
            "score": 90,
            "replies": [
                {
                    "author": "guckfender",
                    "body": "The way this panel flows is sooo good you can literally see the full swing flow from panel to panel",
                    "score": 64,
                    "replies": [
                        {
                            "author": "RichieBFrio",
                            "body": "Oh yeah, the action lines between both help a lot to the movement effect",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ClusterGarlic",
                    "body": "If the theory that he is actually good is true, then why would he threaten to burn Elbaph?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Serbaayuu",
                            "body": "To make it impossible for the Holy Knights to escape because the entire country will be on high alert instead of partying.",
                            "score": 66,
                            "replies": [
                                {
                                    "author": "januarysdaughter",
                                    "body": "The school put the country on alert anyway. Loki just hit the tree to be a dick.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Serbaayuu",
                                            "body": "I doubt Loki could hear that horn.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "laiika",
                                                    "body": "Even if he did, the giants respond to the horn and fire at the same time, so Loki more than likely got his strike off first for there to already be a fire when the horn sounds",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Kungfudude_75",
                                            "body": "Loki has been chained up in the underworld, he doesn't know the children have been attacked, just that Elbaph is in danger but not necessarily aware yet. \n\nThat said, I'm 50/50 on his motives. I don't think he'll be good, so much as he'll be an ally against the World Government who is also opposed to Elbaph, someone who has to be dealt with after his goals and the stawhat's are no longer in allignment. Then we'll get essentially Strawhat v. Oars 2.0, with every side being much more powerful.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "KNZFive",
                            "body": "He's also possibly trying to raise enough hell so that everyone is forced to let him go so he can go stop the Holy Knights.\n\nHe could also just be an asshole who ultimately does have good intentions.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "RajinIII",
                            "body": "Unsure, but Luffy trusts him and Luffy has yet to be wrong about someone's character.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "FivePoopMacaroni",
                                    "body": "Yeah it seems like an obvious misdirect for Luffy to show up, get a thousand warnings and signs that he's evil, then free him anyway. Either Loki is good or it'll be something about how his Nika power makes him compulsively free anyone in chains.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "RajinIII",
                                            "body": "I'm almost sure it's the former. It seems to be a pretty clear parallel to Zoro at the beginning of the series. There's multiple characters who have a reputation of being one way, but are actually totally different once we meet them like Zoro, Kuma and Law",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "FivePoopMacaroni",
                                                    "body": "Yeah that tracks. I was also thinking about parallels with Fishman island, with the prophecy of destruction.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "matheusco",
                                    "body": "Wasn't Luffy wrong about the white hair guy? Kanjurou I think.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "root_of_all_squirrel",
                                            "body": "Just goes to show how freaking good Kanjuro was at acting. He really lived his role. He was ready to jump into the oil with Oden and the others.\n\nMy take is that Luffy couldn't sense his betrayal because he can sense emotions with his CoO. But Kanjuro was just perfect (in a bad way).",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "pboy1232",
                                    "body": "Rob Lucci",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Rukasu17",
                                    "body": "For once I'd be great for luffy to finally have to answer to screwing up things",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "laiika",
                            "body": "It’s his only bargaining chip. He can’t outright warn them. Hajrudin just finished saying how he’s constantly lying. It’s more effective for Loki to play into the false perception rather than try to convince them he’s being honest",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "MajinAkuma",
                            "body": "It’s a warning.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "UsoppIsJoyboy",
                            "body": "Its not a theory \n\nOf course hes good",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "beeekali",
                            "body": "We gotta stop thinking he's good, he proved us wrong ;) Even if he redeems himself after, what he did here IS bad.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Gibbs-free",
                            "body": "A few days late on this, but I think he actually does mean what he says.\n\nHe's proven that he could destroy Elbaph without the chain removed, so why would destroying Elbaph be the end goal of removing his chain? And if he was a master manipulator then his best should really be better than a brute force threat and a claim that his freedom would be needed to save Elbaph.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rukasu17",
                    "body": "Why the hell is luffy acting so surprised for? Unless he's missing brain cells, he knew exactly that this was going to happen",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "azevedus",
            "body": "Alright, Midterm Exlam is a much better translation",
            "score": 67,
            "replies": []
        },
        {
            "author": "sirius_arte",
            "body": "ussop will defeat or stop killingham and get a 1 billion bounty mark my words",
            "score": 67,
            "replies": []
        },
        {
            "author": "kinatty05",
            "body": "Feels the Luffy and Loki confrontation with Gunko will come soon. Although with Loki making that attack, I’m not sure what will cause that last cuff to be uncuffed",
            "score": 26,
            "replies": []
        },
        {
            "author": "leolegendario",
            "body": "Here is that kid's mom, she looks a lot like Big Mom, I would fear her too.\n\nhttps://preview.redd.it/6wovqhftwone1.jpeg?width=130&format=pjpg&auto=webp&s=37517a18b53820c903e1c8cb63330a2a45e7eb7e",
            "score": 89,
            "replies": [
                {
                    "author": "MechanicGopher",
                    "body": "I bet there’ll be a joke where a straw hat, like Chopper, mistakes it for Big Mom. Or maybe Big Mom will show up for real and they’ll first think it’s the nightmare.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Ill-Ad3844",
                            "body": "I NEVER want to see Big Mom active in the story again",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "pmIfNeedOrWantToTalk",
                                    "body": "I def don't want to see her for hundreds more chapters, BUT, if she comes back looking like a zombie with massive burn injuries, and has a quick fight as a secret boss, I won't be mad about it...",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Communismisbadithink",
                            "body": "I thought she died, or was that never confirmed?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ill-Ad3844",
                                    "body": "Her and Kaido's status is currently unknown, but i do hope they are DEAD",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "pauserror",
            "body": "The last line of this chapter by Gunko just messed my head up and now I want to know her backstory. Why Nika and what is Oda cooking here?!\n\nI feel like Gunko was never a slave of celestial dragons, 5 elders, or holy knights. She was probably a recruit of the holy knights, similar to what they tried to do with Loki. Meaning, some holy knight approached her in the common world and asked her to join and she said yes I assume.   \nWho was she before joining and why did she accept that offer? She must have some original ability or skill to get that offer and still be alive now hanging out with Shamrock.\n\nDid she actually have some encounter with a version of Nika that terrified her? It'll be crazy if she was also at the god valley incident for some reason and whatever went down involved Nika.",
            "score": 25,
            "replies": [
                {
                    "author": "EvilVenom_567",
                    "body": "Great theory, but I had thought of the exact opposite - Gunko was a celestial dragon and growing up she heard all the tales about how a single man led an army against the 20 kingdoms and almost beat them, How they had to erase his name from history. Hence developing the fear of NIka",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "InteractionExtreme71",
                    "body": "Could just be a young CD hearing horror stories about Nika",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Malamasala",
                    "body": "Considering Gunko's powers, I just assume she really likes predetermined and orderly things. She doesn't want chaos and uncertainity.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Serbaayuu",
            "body": "Aha, I get why Killingham is constantly falling asleep now.  He has some sort of Dream-Dream or Nightmare-Nightmare Fruit.  This is another big boon for my theory that a lot of the Holy Knights are hoarding \"ridiculous\" type fruits similar to Nika's, though I suppose the monsters looking like drawings could mainly be due to the fact that they're from the minds of children.\n\nMaybe Robin and Chopper's fears will be more realistic.  If Bonney gets involved we might see a fucked up Saturn one more time, too.  That would be fun (especially if she manages to beat it without Luffy's help this time.)\n\nWhether I stick hard to my theory is gonna depend on what Sommers' fruit is... Let's wait patiently.\n\nAlso, lol at \"fire & lightning means Linlin is coming back\" from this subreddit last week and then Loki just swings his hammer instead.\n\n-----\n\nAlso, what ship are they talking about??  Do they have an ally on the island?  All four of the Holy Knights teleported onto Elbaph.",
            "score": 81,
            "replies": [
                {
                    "author": "aLittleBitFriendlier",
                    "body": "How does Gunko's power fit in with your theory? It's a remarkably simple concept for a devil fruit, and very dynamic and powerful as a result",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Serbaayuu",
                            "body": "When I first saw her my reflex was to relate her power to a \"to be continued\" narrative line based on how it looks.\n\nIf I look at it from the right angle, it's absolutely some Looney Tunes shit.  Some character has a magic arrow that forces you to go in the direction it points?  That is ridiculous.  Bugs Bunny would do this.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "aLittleBitFriendlier",
                                    "body": "I have to say, those are some pretty liberal interpretations that can be applied to basically any devil fruit in the series. For your theory to hold water, these powers all need to be ridiculous no matter what perspective you look at them from.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Serbaayuu",
                                            "body": "Definitely a few of them.  But if the Holy Knights were badass-serious you'd expect them to be more into hoarding Logias and the like.  \n\nI'm still patiently awaiting more evidence but I've been really digging the idea of Imu being Ink-Ink for a super creative final fight against Luffy, and if Imu's minions are also of the same caliber, it makes sense they'll be able to keep up with Luffy now if they're on the same mental level as him.  (While still not being literally untouchable by the rest of the SH crew like the Elders are.)",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "aLittleBitFriendlier",
                                                    "body": "Logias are powerful, no doubt about that, but so far the most busted fruits have been the mythical zoans. Mythical fruits especially tie in with the celestial and godly motifs of the world nobles which, combined with their (alleged) rarity, make them the most fitting type of fruit to hoard. For me, that sufficiently explains their prevalence among the world nobles without the need to invoke additional theories.\n\nAs for the ink fruit theory, I'm really not convinced. There's absolutely no good evidence for it, and I it just doesn't feel right to me. Maybe I'll be proved wrong though",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Serbaayuu",
                                                            "body": "I think our best evidence so far is that the Knights' tattoos are inked on them and are explicitly what grant them the power to use the magic circles.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "aLittleBitFriendlier",
                                                                    "body": "What other material are tattoos supposed to be made of besides ink? And why do you need ink powers to explain magic tattoos?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Serbaayuu",
                                                                            "body": "That's not the direction I ask the question from.\n\nInstead, try: what kind of Devil Fruit power would allow someone to grant temporary immortality, huge transformation, and teleportation via magic circle?\n\nLet's assume for now that the Elders' individual powers are their own, not Imu's.  That leaves the above 3 to think about.\n\nWe know it can't be a *teleporter power* specifically, since that doesn't account for the other two options.  It could be something like a Magic-Magic or Sorcerer-Sorcerer power, but that seems kind of off, I wouldn't really expect it.\n\nThe other option besides Ink-Ink that I think is pretty plausible with our current information is Devil-Devil, and I can see the value of the wordplay.  Deals with the devil, the appearance of a huge devil in the Adam mural, and teleportation through a dark abyss all make sense here.\n\nI personally prefer Ink-Ink because it'll make an awesome fight against Luffy's Nika, and because Ink powers would be the perfect fit for someone who wishes to >!redact!< a period of history, which is Imu's primary villainous trait.  Ink can also be used to write all manner of spells, which would explain the dark-magic theming there's been lately, and to write contracts, which could loop back to the deal with a devil thing.\n\nCould also just be some kind of original god unique to the mythos but I hope not.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BillMurrayAmA",
                                    "body": "It's kinda similar to the Dragon's Dream stand from Jojo's part 6, but a lot easier to understand, lol.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Alexandre_Man",
                            "body": "she's not a holy knight though",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "aLittleBitFriendlier",
                                    "body": "What on earth is your justification for that statement?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Alexandre_Man",
                                            "body": "Ah nevermind I'm stupid. I mixed \"holy knight\" with \"world noble\".",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "aLittleBitFriendlier",
                                                    "body": "I see. She isn't confirmed to *not* be a world noble, though. Until we have direct confirmation in the story or an SBS, it's most likely that Oda just forgot to show Gunko's and Shamrock's 'saint' title during their introduction, since it seems completely unbelievable that Shamrock isn't a world noble.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Skullghost",
                    "body": "I was also thinking of possibly a nightmare-nightmare fruit, however I don’t think you can get it to work without the person falling asleep. Probably awakening the fruit would allow nightmares?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Serbaayuu",
                            "body": "If anyone is an *Awakened Nightmare* a Holy Knight is a good bet.\n\nAside from that, I would not consider it a stretch that a Nightmare-Nightmare Fruit's powerset could include putting people to sleep.  That's the only way it'd be particularly powerful so it would make sense to include.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "astrange",
                                    "body": "There was already a random guy in Whole Cake who could do that. Wasn't really explained.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Serbaayuu",
                                            "body": "There was?  Got his wiki page anywhere?  I don't remember him.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "astrange",
                                                    "body": "https://onepiece.fandom.com/wiki/Bobbin",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Serbaayuu",
                                                            "body": "Ah hypnosis.  Yeah I remember him now, must have only happened in like one panel.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Arkayjiya",
                    "body": "Fire and lightning was a clear symbol of Linlin being a Nemesis to them in yet another way, but I didn't know some people thought she was coming back here.\n\nI mean it's not impossible but the lightning reference is no evidence for it.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "nopiestofropes1",
                    "body": "The kids also drew out their fears as well. Maybe they have a power similar to kanjuro? Because the fenrir monster looks awfully similar to the kids drawing of it",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Serbaayuu",
                            "body": "Possible, but might be too limited - how often does someone draw a picture of their fear?  Makes more sense to me that he can put people to sleep and summon the thing they're thinking about.  Since they're kids and they just did this hours ago, that's what's on their minds.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "leolegendario",
            "body": "Gunko when she sees Luffy in Gear 5:\n\nhttps://preview.redd.it/j8s1f5kfwone1.jpeg?width=519&format=pjpg&auto=webp&s=fd4586e27d8f65d6ec2e8cba44b2730df6cff752",
            "score": 62,
            "replies": [
                {
                    "author": "KNZFive",
                    "body": "She'll put those arrows on herself and hightail out of Elbaph.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "OP_1K",
            "body": "Damn, I was not expecting Yamato to go straight for Who's Who in this part of the cover story. Now I am excited to read what happens next with her, Ulti and Page One as the cover story moves forward.\n\nYo! Loki really is a giant among giants seeing as Hajrudin (feel free to corrct me if I have written his name incorrectly) does not even reach his knees. And I am guessing that have s hammer also has a Devil Fruit ability of its own seeing as he is able to summon lightning with it.\n\nI am enjoying how quickly the members of f the Gods Knights on Elbaph were quick to enact their plan during this chapter. But now I find my self wondering if the ship that they are talking about has already arrived or if they will still have to wait for the ships that will help them carry out their plans to arrive at the shores of the island of warrior giants.\n\nI also enjoyed the way that the three members of the Gods Knights interacted with each other. They definitely are interesting villains and I look forward to reading more of their antiques as the arc progresses.",
            "score": 16,
            "replies": [
                {
                    "author": "Comfortable_Ad_574",
                    "body": ">Damn, I was not expecting Yamato to go straight for Who's Who in this part of the cover story. Now I am excited to read what happens next with her, Ulti and Page One as the cover story moves forward.\n\nI hope they'll work under Yamato, and Ulti apologise to Tama for hitting her.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "OP_1K",
                            "body": "I doubt that they would willingly work under Yamato, but I could be wrong.\n\nHowever, I agree that Ulti should apologise to Tama.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Comfortable_Ad_574",
                                    "body": "For Ulti Page One is the most important thing in the world. And Yamato just saved him from Who's Who.\n\nIf Yamato allows them, Ulti and Page One will work for Yamato.\n\nI hope Ulti will apologise to Tama and be nice to her.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "OP_1K",
                                            "body": "Ah, I had not thought of the possibility of them working under Yamato in that manner. It is an interesting thought to consider.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HalfMoon_89",
                            "body": "Ulti didn't just hit Tama, she tried to kill her.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Comfortable_Ad_574",
                                    "body": "Incorrect. Ulti herself said she could have harmed her worse.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "serj_odama",
            "body": "let's go Yamato! is this the longest cover story, at 28 issues?\n\nmid-term ex-slam is a top tier move name\n\nlol all took was 1 punch near for the kids to fear luffy and those associated with him\n\nwith the kids fears coming to life, we got all the norse mythos creatures making an appearance. also with how the creatures look and that they originated from kid's drawings made me think of kanjuro's fruit ability.\n\n\nloki like luffy that even with seastone on, base strength is insanely high",
            "score": 34,
            "replies": [
                {
                    "author": "CrewOrdinary8872",
                    "body": ">let's go Yamato! is this the longest cover story, at 28 issues?\n\nNah, most cover stories are 30+ chapters. Some of the longest ones are:\n\n* Decks of the World - 48 chapters\n* The Stories of the Self-Proclaimed Straw Hat Grand Fleet - 46 chapters\n* Caribou's Kehihihi in the New World - 46 chapters\n* Miss Goldenweek's \"Operation: Meet Baroque Works\" - 43 chapters\n* Hatchan's Seafloor Stroll - 40 chapters",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "januarysdaughter",
                    "body": "No, Caribou's Kehihihihi in the New World, The Tales of the Self-Proclaimed Grand Fleet and Bege's Oh My Family were 46 chapters. From the Decks of the World was 48.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "leolegendario",
            "body": "This panel here is so beautiful:\n\nhttps://preview.redd.it/v7qa10qiwone1.jpeg?width=903&format=pjpg&auto=webp&s=8c723c8fbafabbe66e91733ec5448e1d64da5e56",
            "score": 49,
            "replies": []
        },
        {
            "author": "Jezamiah",
            "body": "\"Anyway I started swinging\"\n\n- Loki",
            "score": 10,
            "replies": []
        },
        {
            "author": "Rockettmang44",
            "body": "What if kilinghams form is a misdirect? What if he can have different forms as part of his fruit? It's shown he can conjure nightmares come to life. What if the gag of him continuing to fall asleep is that he is turning into one of his own nightmares as a form?",
            "score": 21,
            "replies": [
                {
                    "author": "Serbaayuu",
                    "body": "\"A mythological creature of harmony and benevolent leadership!  Aaaaa!\"\n\nCelestial Dragons really would",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "nopiestofropes1",
                    "body": "The kids also drew out their nightmares and handed them to the teachers. The fenrir monster looks pretty similar to the drawing the kid made",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "kdarkrai",
            "body": "I hope all this leads to the Gaint Kids overcoming their fears in some way fueling a sense of adventure in them leading them to become brave warriors or atleast brave kids.",
            "score": 7,
            "replies": [
                {
                    "author": "HalfMoon_89",
                    "body": "You know they will.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ComeAlongWithTheSnor",
            "body": "For once I'm actually *happy* to see a break. Isn't this the longest no-break streak in a very long time? Oda needs some rest lol.",
            "score": 32,
            "replies": [
                {
                    "author": "Yassopeking",
                    "body": "You think oda  drew this last week ?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Minimum_Elk6542",
                            "body": "who did?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Yassopeking",
                                    "body": "He did",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tiabato",
                                    "body": "He drew this... But not last week",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Minimum_Elk6542",
                                            "body": "two weeks ago?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "MajinAkuma",
                                    "body": "No. It’s only 3 chapters.",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "OP_1K",
                                    "body": "We had recently gotten four chapters non stop  starting from chapter 1136 and ending with 1139.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Yassopeking",
                                    "body": "You sure its 5 or 6 ?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ComeAlongWithTheSnor",
                                            "body": "Honestly, no lol. I remember people talking about it being a \"record with no breaks\" like 3\\~ish chapters ago and before that it was probably another chapters with no break.\n\nI couldn't tell you when the last break was but it feels like 5-6 chapters worth",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gatemansgc",
                    "body": "4 weeks, break, and we just had 3 weeks and now a break\n\nwell-deserved.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "PoliticalVtuber",
            "body": "Loved this chapter, but I'm a bit disappointed in Luffy for betraying the giant's trust :[",
            "score": 6,
            "replies": []
        },
        {
            "author": "RazZaHlol",
            "body": "Killinghams nightmare fruit which manifests nightmares to monsters in the real world will be interesting to watch when he faces the straw hats. \n\nWe will probably see some ridiculous versions of nightmare Nami from multiple Strawhats.",
            "score": 11,
            "replies": [
                {
                    "author": "Mouseheart",
                    "body": "> when he faces the straw hats. \n\nI'd like to think it is either going to be everyone in the crew facing their own nightmare/inner demon, or Usopp going up against him, conquering his fears once and for all and becoming the warrior he is meant to be.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaptainDiabetes410",
            "body": "I like the theory I saw that Killingham is some kind of black horse I cant remember if they said the actual name I think it was apart of Norse or Japanese mythology but the powers of it and all sounded too similar and the sleeping part of the creature",
            "score": 5,
            "replies": [
                {
                    "author": "xxNyarlathotep1",
                    "body": "Could be a NightMare.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CaptainDiabetes410",
                            "body": "But mares are female horses so I’m not sure but definitely possibility",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "megasean3000",
            "body": "Wonder if Loki will help against the Holy Knights or if he’ll betray them to be a bigger menace?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Don_di_Age",
            "body": "The Black Nika has a black beard (pun intended) similar to a certain major final antagonist and fellow Yonko...",
            "score": 5,
            "replies": []
        },
        {
            "author": "wanofan900",
            "body": "Looks like Killingham's abilities are a little overpowered.\n\nAnd Ragnir, even though its just the weapon of Loki, already makes him look powerful just on its own.\n\nAnd I can't help but feel that these kids are being built up to having to go through a trial of fire through their fears. It also feels like the pacifist teachings of modern day Elbaf is being hinted to be not such a good thing for Elbaf.",
            "score": 4,
            "replies": [
                {
                    "author": "wanofan900",
                    "body": "And I have to say it.\n\nThe idea of Nika being a destroyer being more than what the giants interpreted Nika to be through the Harley is interesting and unexpected.\n\nIt'll be interesting to also see whether the idea of Nika being a destroyer instead of a liberator is something that's gets explored the deeper we go into this arc.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "AceAltered",
                            "body": "+1\n\nIt makes a lot of sense to me that a being or person that more or less embodies freedom and imagination can be a liberator or a monster, and i am here for however Oda explores this",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Work_In_ProgressX",
            "body": "Holy shit the principal is Zudomon",
            "score": 6,
            "replies": []
        },
        {
            "author": "Grand_Set_1362",
            "body": "I don’t think Loki’s hammer has any special abilities. Doesn’t it look like the lightning hits where the massive sword pierces Elbaph?\n\nI think it’s “just” a mix of ACoC shenanigans (there is huge black lightning on the panel below) with the sparkles of a huge hammer hitting metal with a LOT of force. Or the sword acting like a lightning conductor. Loki said ”If I keep landing blasts, eventually they’ll hit **something**”\n\nhttps://preview.redd.it/r27jpqoq7aoe1.jpeg?width=521&format=pjpg&auto=webp&s=7c54a9480001003641fc622af5e881a6c380973a",
            "score": 6,
            "replies": [
                {
                    "author": "Pale-Possible-2648",
                    "body": "Agreed",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "leolegendario",
            "body": "Mr. Tusk looks like a giant mink hybrid, maybe that's what Dosundadas are.\n\nHis hammer looks a little bit like Dosun's hammer, could be another hint of the Dosundada race.\n\nIf he is half mink, one of his parents must resemble Islewan, a former member of the Whitebeard Pirates who formed his own crew after leaving them.\n\nI think that the power to put people to sleep and bring their fears to life belongs to Killingham and Sommers' ability will have something to do with the way Mr. Wolf was injured, Roses/Thorns that pierce whoever comes into contact with the target (the children), because of his phrase \"To know love is to wound one another\" and the warnings of Wolf to not touch the children.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Cgi94",
            "body": "Every amazing thing I see Loki do the death flags raise on him for me😭. I wonder what causes the lightning to strike. Is it a supreme grade blade🤔. Is he using Conquerors somehow through the weapon on a more advanced lvl than Emma🤔.\n\n  \nThat last spread of the fears was dope. The monster trio being with Loki definitely would provide more development for other giants and strawhats.",
            "score": 8,
            "replies": [
                {
                    "author": "nomequeeulembro",
                    "body": "Elbaph was shown to have lots of ancient tech, and Emmet has shown us haki tech (the knot) existed back then. So maybe it's a special weapon from the void century that uses haki?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Comfortable_Ad_574",
            "body": "Who's Who is down, I hope Yamato, Ulti and Page One (and Tama) become friends now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ThisIsYourFriendAron",
            "body": "Okay hear me cook guys. What if Ragnir ate the Lie Lie fruit and in order for it to gain more power you need to make a big lie, such as Loki saying he was going to destroy them all but hit no one. And this is also how Ussopp ends up carrying it",
            "score": 9,
            "replies": [
                {
                    "author": "Taiyoukun",
                    "body": "Nah didn’t Vegapunk already confirm that objects can only eat Zoan fruits",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ThisIsYourFriendAron",
                            "body": "Oh forreal?! Didn’t know that",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bednow",
                    "body": "That is a good theory to think of.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "PNG-",
                    "body": "HMmmmmmmm i like this one!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SaltPass2438",
            "body": "So Fenrir is highlighted in page 14 maybe that is Loki's fruit? Is that why Loki specifically called that dog the Wolf? Fenrir Loki Ragnir...where is Thor?",
            "score": 4,
            "replies": [
                {
                    "author": "statiky",
                    "body": "I feel like in this version, Hajrudin (or however you spell it) is Thor.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Malamasala",
                            "body": "Or Oda was inspired by the west and made Thor a woman.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NotAnnieBot",
                            "body": "To me it seems we are looking at the older generation of the gods so Thor might not factor in yet. In the actual mythology, Loki and Odin are blood brothers. Hajrudin also has a move called Gungnir which is the same name as Odin's spear.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MonDking",
            "body": "Why is this not a pinned post?",
            "score": 6,
            "replies": []
        },
        {
            "author": "Smashmatt202",
            "body": "Do you think Principle Tusk is a hybrid giant, or was he just born with that walrus face?",
            "score": 2,
            "replies": [
                {
                    "author": "Pale-Possible-2648",
                    "body": "Mink is the only explanation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ill-Ad3844",
            "body": "\\- Finally Yamato goes into action !!\n\n\\- Who is gonna save the children from Killingham ?",
            "score": 2,
            "replies": []
        },
        {
            "author": "PowerDreamer2493",
            "body": "Question is how tough are these nightmares? With haki I feel like they’re just fodder",
            "score": 2,
            "replies": [
                {
                    "author": "Pale-Possible-2648",
                    "body": "They a little bit stronger than Numbers.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "AttitudeBeneficial51",
            "body": "https://preview.redd.it/2lutzzeqycoe1.jpeg?width=1290&format=pjpg&auto=webp&s=c6ea5eaee0a19e10dd51cef01c05d5e4f0f8652c\n\nWhy does Mr Wolf tell Saul he must not touch the children?",
            "score": 2,
            "replies": [
                {
                    "author": "chins4tw",
                    "body": "From context I'm guessing anyone who touches the sleep walking children end up sleep walking also.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kimbleturk",
            "body": "I haven’t scrolled entirely through. \n\nBut could the creatures on the llast panel represent the strawhats. With nika obviously, and maybe some animal. But there are 10 creatures depicted.",
            "score": 3,
            "replies": [
                {
                    "author": "FivePoopMacaroni",
                    "body": "I count 12. \n\nThat said, you're right that there's a lot of potential overlap. \n\n- Nika for Luffy\n- skeleton for Brook\n- angry cloud for Namiswan\n- huge warrior for Usopp\n- wolf could maybe be Zoro\n- maybe the mole in the helmet could be Robin\n- hat on the far left monster could be sort of like Chopper\n- octopus could be Jimbei or Robin \n\nMost of those feel a bit like a stretch though.\n\nThat said there's also an older woman way on the left that looks kinda Big Mom-ish. I have no idea what the dragon, bird, or ghost would be.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "kimbleturk",
                            "body": "Yeah true I could have miscounted. But your overlap is sort of what I made of it\n\nIt kind of reminded me of that world story picture from 2 chapters ago. \n\nIt was the same shot",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "bednow",
                            "body": "Where is Sanji btw ? 😆",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DimashiroYuuki",
            "body": "Thankfully, Gunko is not afraid of showing her panties in public. That would be... awkward.",
            "score": 3,
            "replies": [
                {
                    "author": "Pale-Possible-2648",
                    "body": "😂😂😂😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BobtheFiveHalf",
            "body": "Are some of those teachers named after wrestlers? Wolf, Blade,Tusk? I guess I will Google that. Anyway, I don't know of Kirin being sleep related creatures so why does Killingham have such a power? Is he the one also conjuring up the nightmare creatures? Another thing, Loki probably burnt that branch last chapter as they did say he burnt a village down and now we can see how.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Incubus-Dao-Emperor",
            "body": "Nice chapter, on a side note it would be interesting if Oda introduces a Blood Logia devil fruit in one piece.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ComplexTumbleweed728",
            "body": "My take is that Gunko is afraid of Nika. Because Nika was a trigger for her slave friends to fight for liberation, which lead to their death. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gentlemenbig",
            "body": "Somehow till now I didn't notice Killingham always has the awakened cloud scarf. We haven't been given his power yet just hints, but in curious what that's about",
            "score": 1,
            "replies": []
        },
        {
            "author": "Owl_Capone1990",
            "body": "Loki could have taken his eye covering off now; curious he didn’t, gotta be some lore to his eyes",
            "score": 1,
            "replies": []
        },
        {
            "author": "rholindown",
            "body": "Killingham somewhat reminds me of a seahorse, and then that made me think of that seahorse from the filler episodes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MJDooiney",
            "body": "That kid’s mom appearing had me rolling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HalfMoon_89",
            "body": "Makes sense someone like Gunko would be afraid of Nika. A god that frees people instead of enslaving them? Terrifying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The2nd_man",
            "body": "“If you want to save elbaf undo the last cuff now” loki somehow knows the holy didn’t just leave empty handed i just hope the giants gets to save the children somehow and learn the truth behind this attack and not just blame it on loki",
            "score": 1,
            "replies": []
        },
        {
            "author": "4square666",
            "body": "After this chapter what do people think of Loki having the Uranus DF? Uranus is the Greek God of Sky and Loki just called down a lightening from the sky.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FabForest",
            "body": "Since the monsters seem to be based on the kids drawings, could it not be a fruit like kanjuros fruit, but also able to bring any drawing to life?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaltPass2438",
            "body": "So the basic knowledge we know is that there is 12 supreme grade sword, is Ragnir one of those? If not, then is there any other weapon right now that has power other than a devil fruit?\n\n\nSo does Ragnir have a devil fruit or what? I just want an straight up answer",
            "score": 0,
            "replies": [
                {
                    "author": "IzziTheEpic",
                    "body": "How can someone answer you when all we know is the same information you have. I doubt it’s a supreme grade sword because it’s not a sword. We’ll just have to wait for it to be explained.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "IzziTheEpic",
                                    "body": "To be more accurate they are “supreme grade blades” and whitebeard’s weapon may not be a sword, but it definitely has a blade. The hammer has no blade to it at all.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ComplexTumbleweed728",
            "body": "If Loki have the doga doga no mi, the giants will think that he animated the children's drawing. Only to find out he is still being cuffed with seastones. And realised he is not trying to destroy Elbalf.",
            "score": 0,
            "replies": []
        }
    ]
}