{
    "title": "Most misunderstood one piece fight",
    "author": "Severe-Quantity230",
    "subreddit": "OnePiece",
    "rank": 18,
    "score": 2608,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 208,
    "url": "https://www.reddit.com/gallery/1jdi63i",
    "id": "1jdi63i",
    "selftext": "The number of people who believe Usopp isn't loyal to Luffy because of this is staggering when he has proven his belief in Luffy a lot of times in the story or saying he was trying to save his skin when he wasn't even the one in danger.\n\nHis life wasn't at stake here; it was Nami's, and he wouldn't watch her die because of something like this. In the past, when it was his life, he said Luffy will be KOP like in Alabasta\n\nbut this time around it was Nami's and he won't force his ideals on his friend or just watch her die.",
    "comments": [
        {
            "author": "Ok_Title_4273",
            "body": "Yeah exactly. Nami is about to die and people want him to tell her “just die for luffy’s pride”. People treat characters like robots. One piece wouldn’t have been a masterpiece if the characters were robots.",
            "score": 1714,
            "replies": [
                {
                    "author": "YourTeacherAbroad",
                    "body": "Franky is a great example of this... oh wait...",
                    "score": 538,
                    "replies": [
                        {
                            "author": "PsychologicalBid179",
                            "body": "Frankys no robot, hes all man. Hence why he gets annoyed when his bounty picture is the general franky or the thousand sunny, or the bad end comics where he turns himself into a ship",
                            "score": 283,
                            "replies": [
                                {
                                    "author": "Infamous-Class-7862",
                                    "body": "Exactly. HE IS A MAN. A\n\n![gif](giphy|4uMy0wqz6V1SM|downsized)\n\nMAN",
                                    "score": 147,
                                    "replies": [
                                        {
                                            "author": "heprer",
                                            "body": "Hard boiled man!",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "BGTheHoff",
                                            "body": "A real mans man? \n\nhttps://www.youtube.com/watch?v=jW9cnAbiyrA",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Luffytheeternalking",
                                    "body": "Please..... Franky is a perverttttt\n\n\nA proud self proclaimed one at that",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MuddyBenelli",
                            "body": "You could say a super example.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dramatic_Leopard679",
                    "body": "Then they criticize Ace for standing up to Akainu after he insulted Whitebeard. Ace acted just like the Strawhat Crew, he just couldn’t survive to make it look epic.",
                    "score": 143,
                    "replies": [
                        {
                            "author": "Ok_Title_4273",
                            "body": "I think Ace’s situation is more complicated than that. Generally the strawhats wouldn’t do the same as Ace especially in a high stakes situation like marineford. \n\nAce had an identity crisis. His existence itself was challenged by akainu.",
                            "score": 105,
                            "replies": [
                                {
                                    "author": "Hieichigo",
                                    "body": "They Even highlight how Roger was the same when they talkes Bad about their crew. Nothing to do with a identify crisis. Jeez, some people really do have reading comprenhension issues",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "CryWolf007",
                                            "body": "Bruh Ace literally has time and time again asked why he was even born in the first place. At such a young age, he witnessed people ridiculing Roger and hearing them say that Roger is evil, wrathful, and that if he has any kin, they would be more than happy to kill them just by sharing a bond/blood with Roger. \n\nThe reason why Ace disliked everyone except Sabo is because he assumes people will start hating him the moment they knew about his real identity. Even Dadan herself has told him that if Roger has a child, they will automatically hate that person. He literally asked Luffy if Luffy is glad that he's around in which Luffy replied positively so that's why he started liking Luffy.\n\nFor Ace, having a father figure was as important to him as his own life whom he thought was worthless. When Whitebeard took him as a member, he tried to kill WB 100 times before mellowing out and confessing that he was Roger's son. Expecting rejection, Whitebeard actually just set it aside and told him that he loved his crew, his sons, equally so that's when Ace started liking WB and eventually became one of his most loyal members. Ace became too loyal to WB that he personally went out to sea to bring Blackbeard to justice for breaking the only law in their ship and smearing Whitebeard's name.\n\n Remember Ace intially dreaming of becoming Pirate King? He gave up all that to make Whitebeard the Pirate King instead. So when Akainu started dissing Whitebeard in front of him, Ace just couldnt hold back himself from getting baited. This is a guy who put all his stake in Whitebeard, his acknowledged father figure. His reaction to Akainu's provocation might be foolish to some but for Ace, it was like disrespecting everything that he stands for. All his life he was denied of a father growing up and now that he has one which he even gave up his dream on to make that person \"realize\" theirs (he has always thought Whitebeard wanted to be Pirate King), someone then goads him by badmouthing the person he looks up to the most. It was understandable Ace has lost it right then and there and paid the price with his life.",
                                            "score": 55,
                                            "replies": [
                                                {
                                                    "author": "Luffytheeternalking",
                                                    "body": "I think even if he ignored the taunting and tried to run away, Akainu would have still pursued him. Nobody knew that Shanks would come and stop the war. So Akainu and other admirals would have killed Ace either way imo. Unless WB was planning to take out all the marines with him to let his crew and allies escape. WB himself was critically injured at that point",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Hieichigo",
                                                    "body": "I'm not saying he did not have an identify crisis. I'm saying that it has nothing to do with him returning to get killed",
                                                    "score": -15,
                                                    "replies": [
                                                        {
                                                            "author": "CryWolf007",
                                                            "body": "If Ace had no identifty crisis, then he wouldnt have gone back. His identity crisis had a domino effect in his life. It was the reason why he became very loyal to Whitebeard whom considered him as a son. It is then the root cause why he sought out Blackbeard despite his crewmates and Whitebeard advising against it as BB breaking the one rule in their ship and getting away with it was like a spit to Whitebeard's name. It has then resulted in his eventual defeat and eventual execution. Ultimately, it was the reason why he had gone back and risked everything.\n\nAce knew Whitebeard was already planning to die in Marineford so hearing Akainu badmouthing WB's legacy just didnt sit well with him. He couldnt let go such disrespect to his dying father's name. I guess people who could understand Ace the most are people who have a father/mother/brother/sister figure in their life that they love and highly respects.",
                                                            "score": 10,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "HistoryWillRepeat",
                                            "body": ">Jeez, some people really do have reading comprenhension issues\n\nSpelling issues too, apparently.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ok_Title_4273",
                                            "body": "They do similar things for different reasons",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "thepineapple2397",
                                    "body": "After a lot of hardship, Luffy has learnt that sometimes it's better to live to fight another day. Ace's death was likely what caused this shift that we've now seen a few times in the series",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gandalf_The_3rd",
                            "body": "One of the most important lessons Shanks taught Luffy was to not pick unnecessary battles. Luffy's crew started to learn the same with Bellamy in Jaya. Against Ulti Nami was fighting for her captain's dream, a worthy fight. All Whitebeard wanted was for Ace to get out alive, yet Ace ignored that, and spun back for some words Whitebeard couldn't give a damn about. That's the main difference.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Hieichigo",
                                    "body": "Lol, someone who clearly did not understand what they read. It was not about whitebeard, it was about him. They Even did a comparison of how Roger was the same when people talked about his crew.",
                                    "score": -9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "tam-tam8",
                            "body": "I feel like the one factor that makes the difference is that they just had this entire fight just to save Ace and he knowingly throws that away over a single remark. \nBut I agree that people would view the entire thing differently if he did survive.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Folinhu",
                            "body": "tbh that is pretty criticizable, he's 100% acting stupid there, it just doesn't reflect poorly on the writing because this mistake fits ace's character.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Environmental-Ad2071",
                            "body": "Glad you brought this up",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "heavymarsh",
                            "body": "People here don't realize that they're technically saying the same thing.. One side is saying \"Why did he do it? It's stupid.\" and the other side is saying, \"I understand why he did it, still stupid. \" We only have different reaction about it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FoodyHH",
                    "body": ">One piece wouldn’t have been a masterpiece if the characters were robots.\n\n>!\\*sad Emet noises\\*!<",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Ok_Title_4273",
                            "body": "Emet my love",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Vicky_Roses",
                    "body": "Doesn’t the text being used with the lack of a thought bubble mean that he’s either thinking to himself or muttering something to himself? I never saw the anime scene of this, so I don’t know what they got out of this, but ffs bro can’t even say something to himself that nobody else is going to hear him say anyway. \n\nEven if this was some kind of regression in character development, who the fuck doesn’t have moments where they are actively trying to be conscious about changing something about themselves, but still have moments when they slip mentally? The problem isn’t that you’re thinking it. The problem would be if you acted out on it and let your worst tendencies win over. Again, I don’t even agree that this is what it was, but for the sake of argument, Usopp didn’t even do anything here that would have changed the course of the plot in any way considering that no one else could have heard him.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ok_Title_4273",
                            "body": "It was definitely inner monologue.\n\nSome people don’t even realize it but yeah.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sasukuto",
                    "body": "Honestly, if he had told her to speak her mind here it would have kind of ruined the moment completely and also put a black mark on Usopps character for me. Like Usopp and Nami specifically have always had a strong friendship. Obviously all of the crew like each other, even Zoro and Sanji do deep down, everyone in the crew has distinc relationships with each other and Nami and Usopp are clearly ment to be very close friends. They (alongside Chopper) are the cowards of the crew. They get scared when everybody else gets excited, they understand each other and because of that they grew close. Having Usopp tell any crew member to sacrifice themselves would be bad, but like it would be less bad if it where, say, Luffy or Sanji or Zoro, he'll even Franky or Brook. One of the head strong people who are known to rush into danger easily, one's who regularly try to get themselves killed anyway. But to tell that to Nami, his fellow coward, just kinda makes him come off like an asshole.\n\nAnd even putting all that aside, the most satisfying part of that moment was having Nami herself be the one to do it. We like Usopps moment in Alabasta so much because that is him making the decision to piss off the enemy even more all so he could stand up for his friend, it was a strong moment of courage for a known coward. And as mentioned above, Nami is also famous for being one of the crews cowards, so having her be willing to risk her own life for Luffy is what makes the moment great. If she had a friend in the background peer preasuring her into doing it the moment simply doesn't hit as hard. It has to be Nami and Nami alone that makes that decision.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Faustroll110110110",
                    "body": "I agree that Usopp would never push Nami to die because she need to follow his ideals. But at the same time the things he thinks in this scene contradict the one from alabasta in a thematic way (Usopp was teaching Chopper how important a friend dream is, and here he implies that its ok to lie about your friends dreams). Oda could simply not include this panels from Usopp and nothing would be lost, quite the opposite",
                    "score": 15,
                    "replies": [
                        {
                            "author": "crypticsage",
                            "body": "He was thinking it though. Didn’t tell Nami to lie. That’s why the te t is written the way it is. \n\nHad he been the one asked, he wouldn’t have lied.",
                            "score": 47,
                            "replies": []
                        },
                        {
                            "author": "IVD1",
                            "body": "What is worse for Luffy's dream?\n\nNami lying to Ult or Nami getting killed?\n\nI think Luffy made it clear in Wholecake that he wouldn't / doesn't want to make it without his friends.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Faustroll110110110",
                                    "body": "well this hypothetical came out of nowhere, ofcourse nether Luffy or Usopp whant to see Nami dead. All i am saying is that Oda could just skip this Usopp panel, since we had a moment in the series that represents a moment of THEMATIC and not circunstantial contradiction.",
                                    "score": -13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "tam-tam8",
                            "body": "I feel like the panel is more about the fact that he wouldn't judge Nami for choosing to save herself. Because if it was about that he absolutely wanted her to lie he would have just said it out loud. Him thinking this and us seeing it right before Nami says the thing is also a good method to make the moment hit harder. \nIt could be frased in a different way that would make Usopp look better though.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Faustroll110110110",
                                    "body": "really liked your interpretation of him keeping this for himself, its an angle that i did not consider. I still think it would be better out of the page but your take made the moment less anoying to me as an Usopp fan, thank man!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "tam-tam8",
                                            "body": "That's nice to hear, thanks. I do think the wording kinda did him dirty.\nI really hope he gets a really good moment soon so people will finally stop hating.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ShadowDurza",
                    "body": "Even worse, this single page is literally taken out of context. On the next one, she basically affirms her own belief in Luffy.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cheap_boxer2",
                    "body": "No sir! I love the one piece robot characters",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ThatGuyJ3",
                    "body": "But in Alabasta, he was literally yelling at chopper that there are certain time you can’t back down when your friend’s dream was disrespected . So… yeah.. awkward",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Ok_Title_4273",
                            "body": "That’s because ussop was the one in danger. Telling your captured friend to die is a horrible thing.",
                            "score": 24,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AlterNk",
                    "body": "The problem is,do you think Usopp would said that to Sanji or Zoro?  Cause I don't, like, I don't think Oda would ever write that scene with them, and frankly, I don't think he'd ever write that scene like that if it was any of the male straw hats in nami's place (maybe with the exception of chopper). \n\n\n\nThe problem with that scene is not that Usopp is cowardly, it's that he's treating Nami as lesser than what he would that any of her male counterparts, he's basically insulting her and her determination.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "Ok_Title_4273",
                            "body": "This scene can’t be done with other strawhats because of the ussop-nami dynamic. Nami saying that luffy will be the king of the pirates is only powerful because it is nami.\n\nI mean nami is definitely not as strong as the monster trio. This isn’t a secret.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Sky-kunn",
                                    "body": "https://preview.redd.it/675tfly6pape1.png?width=1013&format=png&auto=webp&s=75a0ea617b60618d7e05a5c9adc692b40b9e7969\n\nYeah, it's kind of a callback to this talk between Nami and Usopp, not exactly about Luffy being the King of the Pirates, but about the conviction they have. Nami was being tortured by Ulti and did not betray her beliefs.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "AlterNk",
                                    "body": "You're avoiding the question. If the male straw hats were in the same or similar danger, would he think the same? The answer we both know is no, and that's a problem, what type of relationship do they have that makes Usopp think lesser of her? How is that a good thing?\n\n\nIs not about if the scene works or not, if the life of a male straw hat was in danger as Nami's was, he wouldn't have think to tell them to renounce Luffy's dreams, that's what matters. \n\nHave the balls to at least admit that he wouldn't, or the face to lie and say that he would. But skipping the question all together is like super disingenuous.",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "Ironmaiden1207",
                                            "body": "What in the fuck is this? 😂 \n\nIt's not about their genitalia, it's about their character. If Nami was a man, the exact same thing would happen. Zoro/Sanji wouldn't, but that's not because they have cocks brother 😂",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Oreo-and-Fly",
                                                    "body": "I can see this for Chopper replacing Nami.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "AlterNk",
                                                    "body": "You're weird for the way you phrase it... Like super weird.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "Ironmaiden1207",
                                                            "body": "But that's the truth no? That's exactly how you make it sound.\n\nSuddenly it's \"weird\" when someone else says it. Brother, you started it 😂😂😂",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "AlterNk",
                                                                    "body": "Well, for once I don't reduce men and women to dick and pussy....",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ironmaiden1207",
                                                                            "body": "LOL it's funny that's how you think of it when I phrase it that way, but I just parroted your sexist shit. \n\nDo better",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AlterNk",
                                                                                    "body": "I'm sexist for saying Usopp treats her differently (lesser) cause she's a woman and that's bad?\n\n\n Are you stupid? Rhetorical question btw, I get that you are.",
                                                                                    "score": -1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Funny0000007",
                                            "body": "you dont get tired of being stupid?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AlterNk",
                                                    "body": "I'm right, tho.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "theramboapocalypse",
                                            "body": "What are you yapping about? Why would you compare Zoro or Sanji to Nami it's a whole different class of fighter.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AlterNk",
                                                    "body": "Tired of repeating myself tho, so, learn how to read and come back later.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Sanchopanzoo",
                            "body": "Oh come on. Nami has a high power output but little and like next to zero defense next to a Franky or Sanji and that is totally fine, because she can kill you with one hit. .. by the way we had that scene in EL too.. two times.. every strawhat is different.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "AlterNk",
                                    "body": "Little to 0 defense my ass, pre TS Nami tooke beatings like a champ. Plus I said in the same position, meaning their life is also at \"risk\", is easy to dismiss it saying it wouldn't be a problem for them  because they can tank it. But do you genuinely think if Usopp would say (I know he was thinking it not saying it outloud) the same for them if he thought they were at the same risk as Nami was?\n\n\n Cause I genuinely think that would go against his character completely. As you said every straw hat is different and Usopp is not the type that would think that of his male crew mates. Chopper, for example, would definitely think that even if it was Zoro or Sanji, cause that's his personality, but Usopp wouldn't and that's why it sucks. Cause we either have to take it as an off character moment that Oda used to make it more emotional, or assume it's in character that Usopp sees Nami as lesser in that regard.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "Sanchopanzoo",
                                            "body": "What are you talking about? Tell me one time Nami took hits like ANY other strawhat. She always took less damage that the others, she had to be smart. Usopp probably knows that like all the other strawhats. It makes sense for him to tell her to LIE. And this was Kaidos crew I mean wtf is your head cannon.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "AlterNk",
                                                    "body": "Miss double finger",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "Skullwings",
                                                            "body": "How…how badly did she get beat in that fight again ?\n\nThe foot stab I remember just fine, but outside of that how bad was it ?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AlterNk",
                                                                    "body": "stabbed a few times (twice in the feet for some weird reason), had a pilar and part of a roof dropped on her, hitted with punches that broke said pilar.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sanchopanzoo",
                                                                            "body": "It was very dangerous, but she didn't get hit as hard as any other straw hat in that arc. She used smart tactics to not get hit fully. Dude if anything that moment you seem to hate actually shows how much more she can take now, but it has its limits because she is no monster.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AlterNk",
                                                                                    "body": "I disagree, she  fought the equivalent of n2 and got hit a few times. Dodge a lot? Sure, but saying that she didn't got it as bad as the rest (excluding Usopp and luffy) is.more agenda than reality.\n\n\nBtw you guys need to take a step back and get out of the \"I must defend one piece at all cost\" mentality. Cause I don't hate the moment, I just say that it gives Usopp a bad characterization. Like I know that they talk about being weak and braking in two seconds. But that was jokes, obviously neither would break easily as demonstrated already. And what Usopp did was kinda disrespectful.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "NormalWorldliness867",
                            "body": "You ever heard of a brother protecting their sister?! Just like siblings usopp knows he is supposed to protect Nami even if she can handle her own because that’s just who he is, and that’s a dumbass argument Usopp AND Nami know damn well the different monsters sanji, zoro, and the other male characters are. Usopp and nami know their roles aren’t to be fighters and they know they are considered the weakling trio so of course they’d worry about each other more than they would any other straw hats, shit even Usopp and nami know Robin ain’t no joke because they know they can rely on Robin and most of the male straw hats to get the job done. We really using gender cards in one piece in the BIG 25🤦🏽‍♂️I thought Zoro showed that gender doesn’t determine one’s strength or weakness with his speech to Kuina and tashigi",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "AlterNk",
                                    "body": "He ain't protecting. Ain't the rest of the straw hats as muchas a family? What about a brother protecting his brother? Wouldn't that work as an argument as well? But we're all agreeing that in the same situation (as I explained to the other dude that means equal risk proportionally) Usopp wouldn't act the same. Why? Is it perhaps cause she's a woman? \n\nBtw Zoro can say what ever he wants he still refused to cut down Monet cause she was a woman.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "NormalWorldliness867",
                                            "body": "We’re going through This in reverse because this just pmo.\n\nZoro literally did what mihawk did to him “you wouldn’t kill a fly with a canon” showing monet wasn’t stronger than Zoro so Zoro had no reason to use haki against her because fear was enough.\nIt comes down to if it’s little or big bro, usopp would 100% do the same thing for chopper because even though chopper is strong he knows damn well chopper isn’t a fighter while with someone like Zoro or hell even brook he knows brook is a strong swordsman and he can hold his own even in the face of death.\nA son wouldn’t or more like shouldn’t be worried about a father because the father is the pillar of the family and represents strength or even an older brother or sister who are supposed to support the little ones, of course Usopp would think the same for all of his nakama but he wouldn’t to the same extent with other members. He’s not gonna be thinking this for Zoro or robin because like I said he knows they get shit done so he automatically relies on them while Nami and chopper, he knows they’re as scared as him because they’re not fighters they’re support. (It’s not canon but stampede is a great example that shows Usopp acts the same when any member is in danger as he did with luffy in that movie)",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "AlterNk",
                                                    "body": "Bs, moments before he was telling Luffy they can't go with half measures now that they're in the new world and then he half measure Monet cause she is not strong enough to be killed? At best that's head canon, but again, if we are going for comparations that would be like saying Zoro wouldn't have killed Orochi if given the chance, cause he's too weak... It in a more canonical note all the gifters he slashed during Wano.\n\n\nIm not gonna touch the stuff you wrote about family dynamics cause is one step away from what you'd find in a christian add from the 80s. But I disagree fundamentally with the idea you'd worry less if your older siblings are about to die than if your younger one was. \n\n\nNami ain't the little sister tho, she ain't a kid, and the problem is that he treats her like one, you can say x is stronger or weaker but in terms of relationship  they're equal. And treating her as the \"younger sister\" when she has proven time and time again to be able to sit in the grown up table, even more than Usopp has btw, is bs. There's no reason for that condescension other than \"she a girl\". It's that lack of respect of condescending her own determination, treating her as a child when she clearly has the feats to show otherwise.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "KingKoon1",
                                                            "body": "Omg , you're just being so obtuse because you want this to be a sex thing soooo bad. Like what ? you have a WHOLE panel above that explains THEIR dynamic . They are both \"Cowards\" who will get shit done/goin when pushed & for the better of others & they both know this about each other. & The argument being stated is no different from tryna keep your friend outta some shit cause you KNOW how they are \n\nOf course he wouldn't say this to Zoro, Luffy, etc because THEY FIGHT actively it's their jobs & what they like to do like c'mon now",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Article_West",
                    "body": "Then they will say \"Ace is an idiot bum that died to a \"your dad\" joke\" (and they're kinda right).",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Glad_Sky_3664",
                    "body": "Brcause there is 0 Tension and believabiity. Even a 3 year old toddler here would not believe Nami or Usopp's life in danger.\n\nBecause readers never believe Straw Hats are in danger they also don't care about their stress i  near-death situations.\n\nThis is something Oda cultivated eith his cheap fake deaths and asspull miracles in Post-TS over and over again.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Ok_Title_4273",
                            "body": "Bullshit. There is almost no manga that kills characters as important as the strawhats. \n\nTension doesn’t mean that we know this character would die lol. It is more complicated than that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SanestOnePieceFan",
            "body": "when you look at things from ussops perspective its pretty easy to see where he comes from. Even in the times he runs away like from the tontattas. Look at it from his perspective. He KNOWS for 100% fact that he is not going to be able to defeat Trebol no matter what he does. But this guy is guilted by the tontattas to 100% knowingly throw away his life. He does it and what happens? He gets obliterated in the next panel. But by some divine providence Sugar stumbled upon the only scenario that he could have won in.\n\nI want to stress that he KNOWS FOR A FACT THAT HE CANT WIN AND WILL 99.99999999% CHANCE DIE, and he was right. But he turns around anyways. He knows he has a next to 0% chance to affect the outcome of the fight whether he fights or not so is it so bad that he runs away? Criticizing him for this decision in hindsight because he does come out on top is so 20/20 hindsight its absurd.",
            "score": 452,
            "replies": [
                {
                    "author": "SudsInfinite",
                    "body": "This is like people misunderstanding when he told the samurai that they should run away and cling to life instead of trying to fight a losing battle that they will die in just for honor. People think that he's reverting back on his character growth, but he isn't. Usopp has gotten more brave, but what he's saying here is that it's worthless if all your death is going to do is bring honor. It's not worth dying for pride, you should cling to life so you can fight again another day",
                    "score": 240,
                    "replies": [
                        {
                            "author": "Shmarfle47",
                            "body": "Easily one of my favorite Usopp moments so far.",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "mcdad_dy",
                                    "body": "Usopp has grown so much but because he's still not going toe to toe with yonko like luffy and zoro people think he hasn't. In reality he's at his strongest when he is FAR THE FUCK AWAY FROM ANYONE AND EVERHTHING! He's a sniper for Oda's sake! Let him snipe!",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "BaldBeardedBookworm",
                                            "body": "The moment that got me to become convinced of Usopp’s character development was in egghead when that one guy said he was gonna do that thing to Robin and Usopp, Nami, Chopper and Brook spun around and said ‘over our dead bodies.’",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Oreo-and-Fly",
                            "body": "Peeps saying he does nothing in Wano but THIS is one of my highlights from Wano.\n\nWhat's so honourable about giving up and dying for a cause. Them throwing their lives and giving up then disrespects Izo and Ashura Doji and Oden. \n\nFight to your last breath. Thats what Hyogoro did. He was willing to end his life AFTER he raged out and ensured safety of his people.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Buecherdrache",
                                    "body": "Also he ran support for otama, proclaiming that he is the one who gets the gifters on their side. In other words he willingly got the enemy to focus on him, risking an attack by someone far more powerful, just to make sure that Otama was safe and could help the others.\n\nSomehow people seem to underestimate the importance of being a support figure in such a battle and that that's what snipers literally are supposed to be. They shouldn't be battling in first line. Usopp literally acting like a sniper is so heavily criticised and it's just insane",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LedgeEndDairy",
                    "body": "Honestly it's just not written well. Oda kind of fails to write Usopp correctly, which is where a lot of the hatred and/or confusion comes from.\n\nHe said in Water 7 that he would never again fail them. Then he said it again during the time skip.\n\nThen he said it again on Fishman Island.\n\nThen he said it again in Dressrosa.\n\nThen he sa...\n\nYou get the point.\n\nWater 7 to Enies Lobby is his growth moment, and we're hoping he's going to be taking the grand line more seriously and start acting like he's a member of the Pirate King's crew and he just...doesn't. He's always lagging behind the rest of the crew. Which would be fine if it wasn't *literally the entire point of him leaving the crew in Water 7* to begin with. That whole arc was about him finding his courage in himself again...and then he just keeps losing it over and over, and not in a satisfying \"it takes time to be brave\" sort of way - he NEVER experiences any sort of permanent character growth. His growth is entirely confined to each arc, and then regresses back to \"old Usopp\" at the beginning of the next arc.\n\nTake Dressrosa: Usopp has the potential to absolutely BODY Trebol if he would have trained properly and taken things more seriously, but instead he just wants to goof off with his friends, and they pay the price for it. It isn't that people who criticize these moments think he should have turned around and died, we think *he shouldn't have been in that weak position to begin with*. Usopp has monster trio potential, he truly does. But he squanders it. We've seen him tank hits that Zoro would have struggled with numerous times (he comes out beaten and battered but *still survives*), the story has also made a point to show us he's basically in the top 5 of sniper skill in the OP universe...and then Oda just never really capitalizes off of that.\n\nOda is constantly putting him in that weak position so he can serve the narrative purpose of \"courage of the weak\", but it just ends up getting tired after a while because we know that any growth he experiences will immediately be ret-conned in the next arc when he has to play the fool again.\n\nIt's similar to Vegeta serving as a jobber to Goku. Vegeta is shown as strong, gets beaten by a big bad so we can accurately gauge their strength when Goku ultimately defeats them. DBZ/S is constantly criticized for this trope. It's the same concept with Usopp.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SanestOnePieceFan",
                            "body": "are you seriously getting on usopp for not following through with what he is saying? lmao.\n\nThen comparing him to vegeta as if they had ANYTHING in common? LMAO\n\nYou demonstrate a wild misunderstanding of what water 7 is saying about usopps character and his role in the crew. It isn't about being brave or being serious about being member of the pirate kings group. It is about his internal self worth issues and his role in the crew is what sanji says. You do what I can't, I'll do what you can't.\n\n\"Usopp has the potential to absolutely BODY Trebol if he would have trained properly and taken things more seriously\" based on literally fucking what.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "LedgeEndDairy",
                                    "body": "> are you seriously getting on usopp for not following through with what he is saying? lmao.\n\nYes.\n\n> Then comparing him to vegeta as if they had ANYTHING in common? LMAO\n\nI literally spelled out the way they're related in very stark, very clear language. If you didn't understand that it's because you refuse to, not through any fault of mine.\n\n> You demonstrate a wild misunderstanding of what water 7 is saying about usopps character and his role in the crew....It is about his internal self worth issues\n\n...and I quote: \"That whole arc was about him finding his courage in himself again.\" What did you read? Because it certainly was NOT my post.\n\n> and his role in the crew is what sanji says. You do what I can't, I'll do what you can't.\n\nAnd I had no issue with that in Water 7 to Enies Lobby. I began having issues with it when his role literally disappeared after that.\n\nWhat has Usopp accomplished since Enies Lobby? Sugar. And talk-no-jutsu to the samurai in the raid and a few other minor details.\n\nThis is *not* \"what he can do.\" It's literally not. We've seen what he's capable of, he's not meeting his potential. He's not even doing the bare minimum. That's *literally* my complaint with him. You are so ready to jump the gun to argue that you have failed to comprehend anything from my argument and are instead just taking everything out of context.\n\n> based on literally fucking what.\n\nI...*literally* explained how. In my post. That you apparently did not read. Because this is the fourth or fifth direct thing you've said that demonstrates you made no effort to comprehend what I wrote.",
                                    "score": -10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Oreo-and-Fly",
                            "body": ">He said in Water 7 that he would never again fail them. Then he said it again during the time skip.\n\n>Then he said it again on Fishman Island.\n\n>Then he said it again in Dressrosa.\n\n>Then he sa...\n\n>You get the point.\n\n\nSo when has he failed them?",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LoneOldMan",
                    "body": "Nah... \nWhat a true coward who was also brave was when King(OPMan) faced the monsters that could kill him. \nHe did it because it was necessary.\n\nWhile Ussop ran and only returned because of guilt. \n\nAnd the biggest difference between the is the fact that Ussop actively lying of his strenght and manipulating other beings to follow him. \n\nIt was Ussop that caused the situation you wrote about in the first place.\n\nIt is okay to be coward. What is not okay is a hypocrite, manipulating and lying piece of shet. And when things are dire. He is always the first one trying to run away.\n\nToo bad Oda did not keep using Sogeking plot for Ussop to improve. When Ussop was wearing the Sogeking mask, he acted more like King(OPMan) who is a brave coward. He looks calm on the outside, but is trembling in fear in the inside.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Utilitas1",
            "body": "Op fans will theorize for 100 hours how some character who appears for 1 panel picking their nose will wind up being the next God fruit wielder, but refuse to look at main characters with any nuance.",
            "score": 231,
            "replies": []
        },
        {
            "author": "AceInTheHole3273",
            "body": "He's literally thinking about how Nami should, and I quote, \"just lie to her\". It's insane that anyone holds this against Usopp. He just doesn't want his friend to die.",
            "score": 124,
            "replies": [
                {
                    "author": "omyrubbernen",
                    "body": "The fact that he thinks it's a lie to say Luffy will never be the pirate king proves how much he believes in Luffy.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "Oreo-and-Fly",
                            "body": "Ha that's a fun way to look at it",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "False-Hope-1341",
                            "body": "Very well said.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "soma81",
            "body": "People love taking Usopp and Sanji scenes out of context to justify their hate boners for them",
            "score": 170,
            "replies": [
                {
                    "author": "Dax_Maclaine",
                    "body": "I mean the sanji scenes aren’t out of context. They’re just complete character slander. The anime literally had him bark like a dog for 30 seconds because stussy was hot, and an actual plot point was him dying from nose bleeds because he saw a bunch of mermaids after not seeing women (or at least his type of women lol) for 2 years\n\nI can enjoy the good writing for his character, but I can’t just ignore that lol",
                    "score": 74,
                    "replies": [
                        {
                            "author": "GloomyLocation1259",
                            "body": "Although not 1:1 with the manga, Sanji is certainly a deviant that would do this shit lol",
                            "score": 28,
                            "replies": []
                        },
                        {
                            "author": "AceInTheHole3273",
                            "body": "I don't think they were referring to FMI Sanji when talking about taking him out of context (I am willing to go to bat about how FMI Sanji is actually very funny, *especially* in how it's this stupid joke used as a genuine and legitimate plot point in a gut splittingly hilarious subversion of the trope, but that's an argument for another day), but rather about how they'll slander him for asking for Robin's help, or ignore all the genuine motivations Sanji had for doing what he did in WCI and simplifying it down to \"he's seen Luffy fight for other people before so this is dumb\", the *most* disingenuous take that ignores both Sanji's own personal emotional issues (that are set up throughout the series and contextualized in this very arc) and the stakes that are set up against him.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "reseday",
                            "body": "what is wrong with barking to Stussy? Sanji is Sanji, don't put your masculine expectation on how Sanji should act. The core theme of One Piece and Luffy's philsophy in general is to accept the diversity of everyone's characters.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChickenNuggetRampage",
                    "body": "It’s as simple as saying that Ussop is happy to risk his own life, but he’s not so happy tisking Nami’s life",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leon_98",
            "body": "His speech to the samurais also was one of the best in character speeches ever\n\nUsop is strong and courageous because he confronts these challenges willingly while knowing that is probably going to die \n\nSay what you want, he is to me one of the best characters in all one piece",
            "score": 83,
            "replies": [
                {
                    "author": "Zingerific99",
                    "body": "I hate that that scene gets overlooked so much, it’s one of my favorite scenes in Wano.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Oreo-and-Fly",
                    "body": "Its SO good. I cant believe people argue and say anyone else would have the same impact.\n\nIt WOULDNT. Usopp's the coward and even then he runs from death.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReadingSteiner300",
            "body": "I’d also like to add that Usopp saving Kinemon and Kiku/being the main reason the Kibi Dango was spread to so many people.\n\nIs completely and utterly disregarded as inconsequential.\n\nUsopp essentially got punished by the fandom for doing the support role that he was supposed to be playing…..\n\nEspecially since he has had an obvious VERY important role planned for Elbaf since a long time ago.",
            "score": 38,
            "replies": []
        },
        {
            "author": "breadoftheoldones",
            "body": "The Panda gifter though",
            "score": 20,
            "replies": [
                {
                    "author": "Hamlak_Glitterpussy",
                    "body": "You just had to make me take a closer look, huh?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "breadoftheoldones",
                            "body": "Always",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "UlteriorMotive66",
            "body": "Then the anime just had to go and ruin it at the start! 😡\n\nhttps://preview.redd.it/oo83jyk1cape1.jpeg?width=1080&format=pjpg&auto=webp&s=5a1fff0dc7ce5606c278403056dcc215d03cdf0d",
            "score": 47,
            "replies": [
                {
                    "author": "HistoryWillRepeat",
                    "body": "What'd the anime do?",
                    "score": 22,
                    "replies": [
                        {
                            "author": "just_a_random_dood",
                            "body": "In the anime, he starts by pretending to be Nami's voice while saying that Luffy will become the Pirate King so that Ulti attacks her instead of him. He literally puts Nami in danger in the first place. I don't know if that's what he does in the manga as well, I haven't gotten to Wano in my reread yet :/",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "HistoryWillRepeat",
                                    "body": "Omg that's wild! He does nothing like that in the manga.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "just_a_random_dood",
                                            "body": "apparently it starts around ep 1002\n\nhttps://www.youtube.com/watch?v=Ne-2fq2nZoo\n\nI don't remember if he exactly says \"Luffy will be the next Pirate King\" in Nami's voice, but I remember that for some reason, and it was relatively recently that I was watching it for the 1st time :P if it happens, it's probably 1002 or so, the 2 of them don't spend much time with Ulti",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Emptypiro",
                                            "body": "usopp does pretend to be nami in the manga.  when he shoots them he says a one liner that is supposed to seem like nami is saying it then they both start running away",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "HistoryWillRepeat",
                                                    "body": "I'll have to do a reread. I've been meaning to do one starting at Wano for a while now.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Emberwolf_Furry",
                    "body": "https://preview.redd.it/7viq8h9qfape1.png?width=640&format=png&auto=webp&s=0448f059228a7a13cd14032020185b4d30675ca3",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "RoiKK1502",
            "body": "This moment right here from chapter 10 really encapsulates what Usopp's going through in my perspective.\n\nhttps://preview.redd.it/tyduy8q0pape1.jpeg?width=1242&format=pjpg&auto=webp&s=c76191c0b529506ab3201d20e9760eae1b2307d3\n\nIf it's his life at stake - Usopp would risk them for the dreams of any of the Strawhats.  \nBut in this moment he cannot \"kill\" Nami by telling her to die for Luffy's honor. It's on her to risk her own life.",
            "score": 22,
            "replies": [
                {
                    "author": "Skullwings",
                    "body": "Unrelated.\n\nBut MAN is that some clean artwork. (I mean yeah it’d Oda but still).",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "plogan56",
            "body": "This how you can tell \"fans\" apart, because usopp was just worried abour nami safety, if put in the same situation we all knew he wouldn't buckle either",
            "score": 25,
            "replies": []
        },
        {
            "author": "Ittakes1totango",
            "body": "Who in the world would think that Usopp or any other member is not loyal to Luffy at this point?  If you are in already in Wano, you must be so dumb to think that.\n\n\nALL members and a bunch of of people are willing to give their live for Luffy.  \n\nFrom all member, I but he has always proven his loyalty since Arabasta.  Even after he quit the crew in water 7, he was willing to risk his life against Luci to save Luffy.  He then, reinforced that loyalty after Luffy forgave him and taking back to the crew.",
            "score": 11,
            "replies": []
        },
        {
            "author": "chrometrigger",
            "body": "It's crazy because this is exactly why the strawhats are so strong. each of them would be willing to die for each others dreams but doesn't want any of the others to die for it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Emberwolf_Furry",
            "body": "https://preview.redd.it/ft1de4unfape1.png?width=1920&format=png&auto=webp&s=c76198be4a293490dd6bf20e3def08948b52f980",
            "score": 8,
            "replies": []
        },
        {
            "author": "RickHard0",
            "body": "The next panel,of Nami crying, is legit one of the most gorgeous drawings of her in the whole series",
            "score": 2,
            "replies": []
        },
        {
            "author": "Invictum2go",
            "body": "I don't think it's misunderstood, just exagerated. Ussop's loyalty to Luffy **is indeed weaker** than his love for his Nakama, but I think his Captain would be very ok with that. I doubt Luffy would've cared if Nami lied to save her life, or if Ussop lied back then. \n\nThat being said, I for example expected Nami to have that moment on her own, and having Ussop think that and kinda inserting himself in the middle of a Nami and Ulti moment (or rather, being placed there by Oda) kinda took away from it a little. It makes perfect sense, but it's unnecessary at the same time. Maybe the idea was to make the reader think Nami would actually say it? It's the only reason I can think of to not leave him out of this. \n\nEither way it feels like the page and scene would've worked a lot better if Ussop just didn't even add his 2 cents and let this be a Nami only moment, it didn't seem to add much besides the obvious (that he cares about her more than he cares about shouting Luffy's dream, duh, surprise to no one). Just my take on it tho.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KLPM2013",
            "body": "It's understandable. My only gripe with it is that Nami cannot lie about it that makes Usopp look so bad. It also doesn't help that Usopp hasn't had a real moment to shine in roughly 10 real world years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raydnt",
            "body": "Usopp is the best kind of hypocrite. \n\nHe'll tell others to do anything if it means to save their skin, but when it comes down to him, he will never relent.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ultimate_Ace",
            "body": "That's just the power scalers who dont understand anything about one piece. They just come for the pretty colors.",
            "score": 3,
            "replies": []
        },
        {
            "author": "poyopoyo77",
            "body": "Nami is basically like his sister and people really wanted him to *encourage* her to get herself killed. Usopp hate is often so non-sensical.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PolPolud",
            "body": "Hot/Cold take I dunno yet\n\n\nUsopp never betrayed Luffy at water 7 and he was 100% justified in his opinion",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dax_Maclaine",
            "body": "My issue with Usopps character isn’t that this is so atrocious or anything, but there isn’t anything positive to offset it and there hasn’t been since dressrosa which is now like 10 years ago. In wano, he sold essentially snake oil to toki and then felt bad and it was probably the only time he actually hurt somebody with one of his lies, and then did nothing in wano other than deal 0 damage to the ppl in this situation (at least Zeus did something for Nami even if she still lost), he shot some dango in fodder mouths, and made a gifter save some ppl. He wasn’t even doing the majority of the saving. \n\nThen on eh we got literally nothing. I’m really hoping we get something on elbaf because usopp got so much focus pre ts and was so good, and this was supposed to be his arc.",
            "score": 2,
            "replies": [
                {
                    "author": "Sky-kunn",
                    "body": ">In wano, he sold essentially snake oil to toki\n\nShe actually stole it. It doesn't nullify your main point, but a lot of people think he was scamming kids too and sold it to Otoko.\n\nhttps://preview.redd.it/ohkr0ht6jape1.png?width=1028&format=png&auto=webp&s=22bcc58784368ee4b196d2c6824c299325f62719",
                    "score": 17,
                    "replies": [
                        {
                            "author": "HistoryWillRepeat",
                            "body": "Wow, I totally forgot this and it's crazy since it gets brought up constantly when people are slandering Ussop. Very enlightening. Thanks.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Dax_Maclaine",
                            "body": "I just realized I’ve been calling her toki instead of toko for a while when that’s odens wife. Oopsy.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "UnaliveInsyde",
                            "body": "I have the colour version of this screenshot, and I was just about to upload it myself",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dookie12345679",
                    "body": "This won't be Usopp's arc, but he'll get the Wano Zoro treatment. A major power up, a new ability or two, a major fight, and maybe even a new weapon. People were disappointed that Zoro wasn't the focus of Wano, but he got advanced conquerors Haki (the strongest kind of Haki in the verse), a new form, tons of insane feats, and a new weapon. Their favorite character just getting basic conquerors Haki would be a dream come true for certain people/agendas",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Faustroll110110110",
                            "body": "I much rather him having good character moments and growth than having power ups and feats. Sanji got way more character growth than power ups in whole cake, and it was much better this way imo",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Killjoy3879",
                                    "body": "hell sanji got more power ups and character growth in even wano as well. I don't feel like a character needs to wait to have an \"arc\" so to speak, it just feels weird that ussop is handled the way he is. It's been genuine years since i really felt his presence or impact in the story like he used to have.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Faustroll110110110",
                                            "body": "yeah man, Ussop is one of my favorite characters, but he is a nothing burger ever since the time skip",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dax_Maclaine",
                            "body": "I don’t even need him to get a powerup (I mean it would be nice but that’s not the main thing). I want him to learn more about his dream.\n\nJust learning more about his haki and a bit more of his duty is what I really want",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "beargrimzly",
                            "body": "There's an almost 100% chance of a seriously unearned power up coming Usopps way. I just hope that if it happens Oda sticks with the change instead of resetting Usopp to just barely past his syrup village development like he has every arc since then.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Dax_Maclaine",
                                    "body": "I really truly hope it’s a deserved power up that he earns. Whether it be a weapon that he earned by doing something or gaining more knowledge on his haki, just something that fits the narrative and not just the fight he’s in as a subject to power creep",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "beargrimzly",
                    "body": "Seriously, imagine if Kaya, someone who was essentially tortured with insincere attempts to heal her sickness by Kuro for possibly years, saw this?\n\nOda isn't brave enough to confront just how fucking bad he's fumbled Usopp though so I'm sure it will never come up again.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Dax_Maclaine",
                            "body": "Never even thought about that, but yeah one piece is written in a way where the straw hates for the most part avoid consequences. \n\nOther than water 7 (which is my favorite arc because we see the only real inner conflict), none of the straw hats face any real repercussions. \n\nSanji not fighting women has never got anybody killed and has only hurt him. Nami already moved on from the fishmen and only remet Hachi who was attempting to redeem himself. The only real accountability there was jinbei apologizing to her. Usopps lies usually don’t hurt anybody because they’re a gag, but that time they did and the story brushed past it and hasn’t revisited it. \n\nIt’s why I think the vivi/robin reintroduction is so important. It needs to happen and needs to be executed well imo. I don’t want vivi to just be like “it’s all good” and move on like nothing happened, and even worse if it never even happens",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "beargrimzly",
                                    "body": "Yup. The setup for actually good character growth is always there. It's like he's barreling right for thoughtful meaningful character development over time, and then forgets about it or turns it into a stupid joke.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Dax_Maclaine",
                                            "body": "Just wrote it in another comment, but my only idea as to why is that his character was growing too quickly for a 1100 chapter story and so he just paused the growth until the end so all of the strawhats could accomplish their dreams around the same time",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "__Big_Hat_Logan__",
                            "body": "Kind of sucks because I really like pre-skip usopp a lot",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "beargrimzly",
                                    "body": "Actually felt like he was going somewhere. Post Enies Lobby the future seemed so bright.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dax_Maclaine",
                                            "body": "Agreed. He went from a complete coward to realizing what he needs to do in arlong park and alabasta. \n\nThen in w7/thriller bark he uses the alter ego to instill fake confidence and make him act earlier and be more proactive. It seemed like all he needed to do was grow a bit more and learn that despite his fear he could be Sogeking without the mask. But my guess is his story was progressing too quick so Oda just slapped a big pause button on his character and hasn’t revisited it since except dressrosa, and even that I have issues with.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ArtOk3920",
            "body": "Exactly. People fail to realize that a lot of people treat themselves differently the. They do their loved ones. Of course Usopp would do the same thing Nami did, but he also didn’t want Nami to die and he knew he wasn’t strong enough to protect her from Ulti and Page One.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kipkame11",
            "body": "Ussop's bread and butter is lying to save his skin - he wanted to save his friend the best way he knew how. Only in the most dire of situations would he resort to this, obviously I think",
            "score": 2,
            "replies": []
        },
        {
            "author": "Derangedberger",
            "body": "One Piece fans having media literacy challenge \\[difficulty: impossible\\]",
            "score": 2,
            "replies": []
        },
        {
            "author": "tam-tam8",
            "body": "Yeah that! And most Straw Hats would have shared his sentiment. The only one I could see agree that the person in danger should definitely say the thing that would get them killed is Zoro, but I don't buy that as what he would feel in the situation",
            "score": 2,
            "replies": []
        },
        {
            "author": "Proud-Mulberry-7175",
            "body": "Porém, no mesmo passado, quando viu a Nami em risco de morte contra um inimigo mais poderoso, ele se levantou e lutou. CP9. O Sanji aparece pra salvá-lo, mas ali, ele também estava disposto a morrer pelo amigo.\n\nO problema do Usopp em Wano é o trabalho todo (ou a falta de contexto maior). O Usopp tá desde Dressrosa sem nem tentar. E não culpo o personagem, é decisão do Oda.\n\nTem grande chance do Usopp sair do tão esperado Elbaph exatamente igual a gente viu depois do timeskip. Aquele Usopp que enfrentou o Luffy, CP9, Thriller Bark e até tentou enfrentar o Kizaru… nem apareceu mais.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NINCloser",
            "body": "I just don't get the character, I think by now he has basically zero value except for comic relief.  I hoped that he would change after Water 7 but no. \n\nHe doesn't drive the main story, he doesn't discover something interesting, he has no moral code that he sticks with and in every fight he would be replaceable by a two panel of any other crew member defeating the enemy. He is just the character that gets pulled along because he was there at the right time. \n\nF'n Karibu in the Barrel is more useful for the Story...",
            "score": 2,
            "replies": []
        },
        {
            "author": "tpk7777777",
            "body": "Every straw hats are GREAT. They are the best friends you wish to have in your real life.",
            "score": 3,
            "replies": []
        },
        {
            "author": "beargrimzly",
            "body": "I don't think anyone is insinuating Usopp is actually betraying Luffy here, just that its kind of insane that here we are 1000 chapters in and he's still sniveling and crying instead of just being proud to see someone stand up for Luffy against overwhelming odds. We're not asking for him to 180 and turn into Goku, we're just asking him to offset moments like these with some genuine, if sometimes unintentional bravery a little more often than once every 250 chapters (roughly). \n\nInstead all we got was him watching a child try to heal her dead father with fake medicine he sold her, and there was no follow up for his guilt about that.",
            "score": 2,
            "replies": [
                {
                    "author": "SanestOnePieceFan",
                    "body": "proud? Bro, in his mind Nami is about to die lol",
                    "score": 17,
                    "replies": [
                        {
                            "author": "beargrimzly",
                            "body": "Yeah? It would demonstrate a change in perspective. I don't think its insane to ask for some character development.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "HistoryWillRepeat",
                                    "body": "Would Ussop being willing to sacrifice Nami be considered character development for him?",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HistoryWillRepeat",
                    "body": "He just doesn't want to watch his friend die. What do you think Luffy would have done in that situation? Do you think he'd be thinking \"No, Nami! Don't save yourself! Say something bad ass about how cool I am!\"\n\nNo, Luffy would be thinking \"Nami, save yourself! Don't kill yourself trying to protect my pride!\"",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Zilox",
                    "body": "If only you actually read OP and realized toko stole the oil from usopp... but asking an usopp hater to read is too hard :(.\n\nNo one would be proud of nami for dying bc she said luffy will be king, not even luffy himself. He saw ego killing ace already",
                    "score": 4,
                    "replies": [
                        {
                            "author": "beargrimzly",
                            "body": "If Usopp hadn't advertised the oil, do you think she still would have taken it and tried to use it later?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Rikafire",
                                    "body": "You know that was the cover they gave him right?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sean_avm",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gunslinger_11",
            "body": "I would not want to see my friend head butted to death, if a grave lie is what it takes to keep my family/friends alive so be it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far_Swan_5882",
            "body": "Nothing is wrong in what Usopp was thinking, simply put he just isn't respecting each crewmates preparation to risk their own life, especially when going up against an emperor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "l01_j01",
            "body": "I LOVE THISSS",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emptypiro",
            "body": "Unrelated note. That panda gifter might be even more cursed than 4tricks",
            "score": 1,
            "replies": []
        },
        {
            "author": "frogmanfrompond",
            "body": "Wtf happened?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future-Engineering68",
            "body": "man created a narrative in his head, i though everyone knew ussop is a coward, wasnt much to misunderstand",
            "score": 1,
            "replies": []
        },
        {
            "author": "BitViper303",
            "body": "I understand it perfectly. Doesn’t mean I have to like it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Lower_Delay4294",
            "body": "sorry, but most people understand that. the issue is that usopp is still mostly useless apart from dressrosa and this defense barely makes up for his reputation of being the opposite of a brave warrior of the sea. he still had to be guilted into fighting and only became sugar's weakness out of luck?",
            "score": -7,
            "replies": [
                {
                    "author": "HistoryWillRepeat",
                    "body": ">the issue is that usopp is still mostly useless apart from dressrosa\n\nIt's like you read Water 7 and just completely ignored the messaging. Ussop is not useless. He's just not a strong fighter. He does things on the crew that the fighters can't do.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Lower_Delay4294",
                            "body": "tell that to chopper and robin. chopper made the kung fu point because he wanted to combine arm and jump points and be more useful in combat scenarios. robin came up with a way to fight a shonen 1v1 out of her desire to become stronger for the crew.\n\noda set him up to be finally on the right path towards being a brave warrior of the sea when they returned to sabaody, and people like you are still clinging to early water 7 usopp. usopp was out there waging war against the world government in enies lobby but now it's okay for him to regress because of early water 7??? it's okay to admit when oda is fumbling some aspects of the series. stop reading the manga backwards and upside-down.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HistoryWillRepeat",
                                    "body": "I'm sorry, but you're so confidently incorrect it's comical.\n\nDo you remember Ussop's fight with Jabra? Do you remember what Sanji said to Ussop after? \n\nOda couldn't have made it anymore clear that Ussop doesn't need to be powerful to be useful to the crew.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Lower_Delay4294",
                                            "body": "you know what's funnier? clinging to water 7 usopp while missing the point. usopp is more than a decade away from water 7 and ennies lobby. it's delusional at this point.\n\nchopper, nami, and robin aren't as powerful as the monster trio. they aren't even the designated combatants, yet they've displayed more guts and willingness to fight than the lying coward who wants to become a brave warrior of the sea. why? because they know they have to. you don't take down a yonko with crew members half-assing it. you don't become a brave warrior of the sea while constantly running and lying your way out of dire situations. oda couldn't have made it any clearer that he's fumbling usopp for years now while waiting for elbaf.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "HistoryWillRepeat",
                                                    "body": ">you know what's funnier? clinging to water 7 usopp\n\nI'm not? You've said this multiple times and I'm starting to think you think I'm someone else? Or you're just fighting ghosts. \n\n>usopp is more than a decade away from water 7 and ennies lobby.\n\nYou're confusing real world time with the straw hats sailing time. Yikes. \n\n>chopper, nami, and robin aren't as powerful as the monster trio. they aren't even the designated combatants, yet they've displayed more guts and willingness to fight than the lying coward who wants to become a brave warrior of the sea. why? \n\nBecause Chopper, Nami, and Robin's main character traits aren't being cowardly. Ussop's is. That's just a god awful argument.\n\n>you don't become a brave warrior of the sea while constantly running and lying your way out of dire situations.\n\nThat's exactly why Ussop's dream is to become a brave warrior of the sea!! Because he's a coward.\n\n>oda couldn't have made it any clearer that he's fumbling usopp for years now while waiting for elbaf.\n\nLet's just agree to disagree. You're clearly very emotionally motivated on this topic and that's annoying, to say the least. Also, I'm not really interested in having a discussion with someone who resorts to petty insults when their opinion is pushed back on.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "21SGesualdo",
                    "body": "Brother in the sugar fight he literally had the entirety of w7-el character development ripped out of him due to Robin being turned into a toy. Of course he’s gonna regress in the moment.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Folinhu",
                            "body": "village boy usopp was willing to die fighting the black cat pirates, later on he almost died fighting against mr 4 and merry christmas, he should also have memories of fighting perona, he was never as much of a coward as dressrosa portrayed him to be.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Lower_Delay4294",
                                    "body": "toei flanderized sanji so bad, but at least we can ignore those parts of the anime. meanwhile, manga usopp has been flanderized to hell and we can't escape him.\n\ni was excited for him when he appeared in sabaody and when he was forced to take a step forward in dressrosa. but i didn't think we'd have to wait until elbaf for any hope of him finally growing up. and the first thing he did? be a coward. he could have defeated that cat but he didn't and it's cringe.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Lower_Delay4294",
                            "body": "exactly my point: he wasted those two years.\n\nmeanwhile, chopper is out here slapping a headliner while nami would rather die than lie. are they irrational decisions based on emotions or loyalty? yes, neither of them regressed the way usopp constantly does.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KitsuneKamiSama",
            "body": "I'm NGL you can try to defend it but it felt like a mischaracterisation, you can say he didn't want her to die but he could have also shown some emotional development, like an internal struggle of 'I know you don't want to say it... but if you keep it up you'll die!' But then never actually saying it, because he remembered how he felt in the same moment. Instead going out of his way to do everything to save her, maybe actually getting a great hero moment of the arc.\n\nI know just feel Ussop leans way too much in to the 'coward' part post timeskip without enough of the 'heart of a hero' part we saw in key moments pre timeskip.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Folinhu",
            "body": "ok so he's not a coward, just stupid? he's been in the crew for a while, he should know what the straw hats are all about.",
            "score": 0,
            "replies": []
        },
        {
            "author": "EldridgeHorror",
            "body": "My position is the exact opposite.\n\nI totally agree it is within character for Usopp to fight to defend Luffy's dream as that's the kind if man he wants to be but isn't going to push that ideal on others, especially if it would endanger a friend.\n\nMy problem is I don't see this being in character for Nami. A character who has no qualms being a coward, lying, openly thinking things like honor is stupid, etc. \n\nShe would lie to get to safety and circle back around to help her friends. \n\nThis is just because Oda wants a moment of every Strawhat facing down a scary opponent and declaring Luffy will be king. And he couldn't do that with Nami in a worthwhile way while sticking to her character.",
            "score": -4,
            "replies": [
                {
                    "author": "HistoryWillRepeat",
                    "body": "Nami has shown she has principles though that she defends. She's faced enemies head on when they violate those principles. Don't underestimate how much she believes in Luffy and what she'd do to defend his name. She can definitely be just as hardheaded and brave as anyone else on the crew.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "EldridgeHorror",
                            "body": ">Nami has shown she has principles though that she defends. She's faced enemies head on when they violate those principles.\n\nWhen those enemies are a threat to something tangible, like Vivi or children. Not something she has shown trouble comprehending, like honor.\n\n>Don't underestimate how much she believes in Luffy and what she'd do to defend his name.\n\nI'm not. But it's the \"throw yourself on a bomb vs disarm the bomb\" argument. Nami would do the right thing and the smart thing simultaneously. Letting herself and her friends get killed over Luffy's honor isn't smart. There's nothing to gain from doing that.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "HistoryWillRepeat",
                                    "body": "I think this whole scene becomes different when you remember Nami's backstory. Bellemere basically did exactly what Nami is doing in this scene. All's Bellemere had to do is deny that she has children, but she doesn't do that because she loves Nami and Nojiko too much. Alls Nami has to do is say Luffy won't be PK, but she doesn't because she believes in him and loves him. \n\nNami is doing exactly what her mother did by throwing her life away for her beliefs and love.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "EldridgeHorror",
                                            "body": "Might be all the more reason it's terrible, because it hammers in on Nami taking the wrong lessons from her backstory.\n\n\"You, your mom, and your sister could have all kept being a family but your mom decided she'd rather get killed right in front of you, orphaning you a second time, because she didn't want to lie this one time. The single most tragic moment in your backstory was because she refused to lie.\"\n\nHonestly, it was bad enough when Bellemere told her not to steal and Arlong told her to steal and her takeaway was \"yeah, I'm gonna keep stealing.\" \n\nShe learned all the worst things from Bellemere and forgot pretty much all the good.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "HistoryWillRepeat",
                                                    "body": "What exactly are you arguing here?\n\nThe conversation started because you said this scene doesn't fit Nami's character. I explained that Nami is basically reenacting her past trauma. Something that's very common and understandable even if it isn't \"smart.\"",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "EldridgeHorror",
                                                            "body": "Which I am conceding to you. I may have gone on a rant about not liking her, but I concede the point to you. It makes sense for her.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hamlak_Glitterpussy",
                    "body": "I find myself agreeing. As for your last point, her standing up to Kaido himself after the latter declared Luffy dead (something only licensed doctors can legally do for a reason) could've been that moment though.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EldridgeHorror",
                            "body": "Hadn't considered that, but you're right. That would have been a much better time for her declaration.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RoderickThe13",
                    "body": "My assumption is that Oda writes moments like this in response to the dumb things he sees fans say in their letters to him. The same kind of stupidity you often see from people online, where they genuinely think that Nami would sell Luffy for money if she had the chance, or let him die and run away. This is Oda's way of telling them straight up that that's wrong. Even if the moment itself might seem force it at least leaves no room for questioning.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GATLA_",
            "body": "I’m gonna say it that was the worst most spineless moment of Usopp in the entire series",
            "score": -7,
            "replies": []
        },
        {
            "author": "bodg123",
            "body": "Usopp is by far the most loyal member of the crew.",
            "score": -4,
            "replies": [
                {
                    "author": "BitViper303",
                    "body": "You mean the guy who legit left the cre because he didn’t agree with the captains actions?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "fatmanbrigade",
                            "body": "Ah yes. The same guy who later donned a new identity, stuck through with the crew all the way through hell on earth, and became the pivotal defining character that aided in rescuing the crew member they were doing all this for, that guy? Yeah, such an unloyal crew member.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BitViper303",
                                    "body": "Never said he was unloyal. Just that he’s not the most loyal in the crew",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bodg123",
                            "body": "Is this some sort of stupid gotcha question? I stand by my statement.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HermanManly",
            "body": "Usopp is by far the best written character in all of One Piece.\n\nDoesn't mean that everyone has to like him, of course.",
            "score": -4,
            "replies": [
                {
                    "author": "Mamba-Mentality024",
                    "body": "Best written is wild 😂",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rysler",
            "body": "Usopp *lying* to gain an advantage? Say it ain't so!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Specific_Delay_5364",
            "body": "So I’m confused your argument is that people don’t understand and get upset at Usopp because he tells Nami to Lie and not sacrifice herself because Ulti is laughing at Luffy’s dream and to prove your argument that everyone is wrong who thinks this is you to use a panel where Usopp talks about sacrificing yourself because someone laughed at Luffy’s dream.",
            "score": -1,
            "replies": [
                {
                    "author": "soge_king420",
                    "body": "Holy shit brother use punctuation!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "magneticFrenchFry",
            "body": "while I partially agree, this also shows usopps cowardice on full display. nami wouldn't betray her beliefs for luffy even just in words if it costed her life, but usopp would slander his captain if it meant stopping himself from stubbing his toe.\n\nI think this was a fine character moment, but it just shows why I personally do not like usopp as a character. he's brave and represents the human side of the world, but I also find it hard to connect to a character that shits himself at any sign if danger no matter how dangerous it is. sure he locks in when he needs to, but when he's not standing uo for himself and his crew he's just cowering in fear in the background doing nothing. I'm not asking usopp to be up on the rooftop fighting kaido, I'm asking usopp to consistently stand up for himself and his crew rather than in specific moments. I don't like seeing usopp only fight for what he believes in when his life is in danger. you know a character that takes the idea of cowardice and does it better? nami. nami is with usopp nearly every arc and they always freak out together, but nami is always the one who wants to act while usopp wants to run. nami wants to push through that fear no matter what rather than usopp only sometimes pushing through the fear.",
            "score": -7,
            "replies": [
                {
                    "author": "Zilox",
                    "body": "Then you got it totally wrong. Usopp would NEVER slander luffy to escape danger. He is willing to give up his life, he isnt willing to tell nami to do the same.\n\nUsopp already did it, go reread one piece",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfessionallyLazy_",
            "body": "Don’t care, didn’t ask, Usopp is still a bum for this and everything else he does",
            "score": -19,
            "replies": [
                {
                    "author": "Skullwings",
                    "body": "Least unstable Usopp hater.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "xstationcubed",
            "body": "Exactly. Usopp's dream is to be a brave warrior of the sea, and so backing down when he's afraid is a failure for him to achieve his dream. Nami has no such goal and has no need to abide to the rules he sets for himself.",
            "score": 0,
            "replies": []
        },
        {
            "author": "MrTyrantZero",
            "body": "Only people will lower intellect or who really don't pay attention wouldn't understand the obvious.\n\nThey ALL care about each other, even Sanji and Zoro in their weird way, and here is no different. \n\nUsopp cares about Nami so he doesn't want to see her die, just like when Sanji stepped in to fight Kuma in Thriller Bark but \"nothing happened\" after that.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Krait972",
            "body": "I disagree. This is a copium take, everyone else was willing to upheld Luffy's dream, heck even other characters did.\nFreaking Momonosuke had to deal with the same thing as Nami and was courageous enough to say it despite being at risk of being killed. It's time to stop trying to find excuses for Ussopp. He messed up, that's it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mamba-Mentality024",
            "body": "I feel like Usopp telling Nami to lie is obvious enough for anyone with basic reading comprehension skills. I think the slander comes from, Usopp not completing his fight against Page 1 and getting bailed out by BM.",
            "score": -1,
            "replies": []
        },
        {
            "author": "IvyWood",
            "body": "Unironically, the only time Usopp went all out was against his own captain.",
            "score": -4,
            "replies": []
        }
    ]
}