{
    "title": "Theory: BlackBeards's fruit is miss-categorized",
    "author": "Lonewolfli",
    "subreddit": "OnePiece",
    "rank": 14,
    "score": 767,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 108,
    "url": "https://www.reddit.com/r/OnePiece/comments/1jducaa/theory_blackbeardss_fruit_is_misscategorized/",
    "id": "1jducaa",
    "selftext": "Blackbeard's power has a some inconsistencies with what we know of Logia fruits.\n\nPrimarily, his body isn't intangible. He chocks it up to the unique nature of a black hole. But, consider that he's mistaken about the identity of his Yami-Yami No Mi. Just like Luffy with his Gomu-Gomu No Mi.\n\nHis knowledge of the fruit presumably stems from the Devil Fruit Encyclopedia, which we now know includes intentional misinformation  \nAbout the Hito-Hito No Mi [Mythical Model Nika].\n\nNow I wonder if that's the only Devil Fruit to be renamed. Suppose Imu had other Fruits from history they needed expunged.\n\nI'm wondering if the Yami-Yami is also a Zoan, \nSomething like a Moon God or Devil\n\nMy best guess would be Beelzebub, specifically the demon of Gluttony from Christian lore. It fits Blackbeard's Greed & lack of self control.\n\nApologies if this theory has already been made, it's the first I've shared.\n\n\n\n",
    "comments": [
        {
            "author": "jaehaerystark",
            "body": "I think that it is a logia. The problem is that it has a weakness. Like water for Crocodile (sand) and Luffy/rubber for Enel (electricity), the weakness makes them tangible. Blackbeard's problem is that his weakness is light. And light is everywhere, so he's always tangible. The only exception we've seen is when he covers himself and Whitebeard at Marineford. Blackbeard doesn't strike me as somebody who wants or needs privacy to do his thing, so I think the covering was necessary. \n\nI'm sure we'll get answers one way or another eventually and I can't wait!",
            "score": 1177,
            "replies": [
                {
                    "author": "Neyubin",
                    "body": "You know what generates a lot of light?\n\nThe Sun.",
                    "score": 529,
                    "replies": [
                        {
                            "author": "simalexan",
                            "body": "Ace’s ability - Sun (Flame) Emperor",
                            "score": 187,
                            "replies": [
                                {
                                    "author": "Norblin",
                                    "body": "Or the sun god Nika",
                                    "score": 125,
                                    "replies": [
                                        {
                                            "author": "staticpls",
                                            "body": "who doesnt have actual fire powers or light powers",
                                            "score": 55,
                                            "replies": [
                                                {
                                                    "author": "gullibleocean32",
                                                    "body": "watch him get a idea(light bulb) and use the idea light bulb in the fight vs blackbeard",
                                                    "score": 109,
                                                    "replies": [
                                                        {
                                                            "author": "Libriomancer",
                                                            "body": "I was with you until I remembered who we were dealing with… our lovable idiot “thinking”.",
                                                            "score": 27,
                                                            "replies": [
                                                                {
                                                                    "author": "DannyDootch",
                                                                    "body": "It would probably played as a gag where luffy supposedly has a good idea but it was actually him using his toon powers to create a giant lightbulb to hit blackbeard with.",
                                                                    "score": 14,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "gullibleocean32",
                                                                    "body": "yeah i also was questioning luffy thinking when i wrote this lol",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "11711510111411009710",
                                                            "body": "Lol that would be funny. He's trying to figure out how to beat him, has an idea, sees that the light from the light bulb hurts Blackbeard, and uses that instead, forgetting about whatever idea he had in the first place.",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Unusual_Zone_8822",
                                                            "body": "My favourite head canon idea is luffy and law fight Bb, law gets hurt and has to give himself surgery on the battlefield, luffys power is his imagination so watching law gives him the idea to surgically remove BBs devil fruits leaving him with none.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Aspie_Astrologer",
                                                    "body": "Not until he finally eats a mother flame... ;)\n\nJoyboy would have had access to plenty of mother flame, so the fruit is heavily associated with sun powers because Nika has always used the mother flame to power his fruit to another level (gear 6 if you will).",
                                                    "score": 16,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "magpye1983",
                                                    "body": "Because… the light was taken in “The First World”.  The people had a planet that was eternally bathed in flame (constant sunlight?) and the people dreamed, Nika rose, and they reached for the forbidden star. The Earth God was enraged and darkness fell.\n\nThe Earth God had the power to darken out light.\n\nBlackbeard now has both earth trembling powers, and darkness powers.",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Substantial_Pick6897",
                                                    "body": "Luffy can punch with fire though, which never made sense for a rubber boy",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "HutSutRawlson",
                                                            "body": "Sanji can kick with fire and he’s just a dude",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Nuggzulla01",
                                                            "body": "Friction. He relies on friction, maybe from his arm moving threw the air",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Tensaipengin",
                                                                    "body": "He made fire underwater.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "chopstick_chakra",
                                                    "body": "Is Redhawk a joke to you???\n\n![gif](giphy|MVa8iDMGL70Jy)\n\n/s",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "mugiwara_no_cus",
                                                    "body": "Red hawk?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "KamiAlth",
                                    "body": "Wait, so the donut bro literally counters BB fruit but still lost 💀",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "the_fire_fist",
                    "body": "Damn. That's a fantastic explanation. Light being everywhere makes him tangible. So I wonder if someone fights him in a pitch black area that will be his full power.",
                    "score": 99,
                    "replies": [
                        {
                            "author": "Hypekyuu",
                            "body": "Why do you think he always wins his fight off screen?\n\nNo light",
                            "score": 190,
                            "replies": [
                                {
                                    "author": "Glittering-Field7814",
                                    "body": "🤯🤯🤯",
                                    "score": 43,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cdr323011",
                            "body": "This shit is mind blowing to me bc he would be able to become the entirety of the inside space/ air around you if you were in a completely dark room right?",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "the_fire_fist",
                                    "body": "I know right. That would be mind boggling. Insanely powerful. If he can become the concept of darkness or something.",
                                    "score": 28,
                                    "replies": []
                                },
                                {
                                    "author": "thecanbubble",
                                    "body": "I think its more along the lines of kizaru. He doesnt just become all light does he?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "cdr323011",
                                            "body": "That is a good point",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Mnawab",
                                    "body": "Wouldn’t night time be an advantage for him",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Local_Vegetable8139",
                            "body": "Propably one of the reasons he used the courtain on whitebeard in marineford",
                            "score": 30,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "trilobyte-dev",
                    "body": "This is a really great theory.  Even if it doesn’t turn out to be true it’s still really good.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "ironicfuture",
                    "body": "Watch BB during the final fight cover the world in darkness and then we finally see his intangible form.\n\n100% that is why Oda made Gear 5, do we can have the light vs dark fight",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "Gravyluva210",
                    "body": "I love this. This goes along really well with my theory that the final war will take place during a solar eclipse. I don't think that the ancient people/joyboy were prophets, so the only logical conclusion I came up with as to why Roger was too early was because of him missing some sort of natural event. I don't really have this idea fully fleshed out, but a lot of it stemmed from not really understanding where Blackbeard fit into the lore of it all, but certainly if you are right this would be what Blackbead could be waiting for as he'd be most powerful in the moments of an eclipse.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Vileath2",
                            "body": "Commenting on Theory: BlackBeards's fruit is miss-categorized... That’s a really cool idea I’ve personally never heard of before. I don’t suppose a solar eclipse would activate sulong powers as the full moon is in view but it’s not lit up and it would cause total darkness in the path of totality which would make an interesting time to spring a surprise attack by Blackbeard.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "flyers28giroux0",
                    "body": "So Blackbeard and Luffy are going to fight in the Florian Triangle where Blackbeard can show his full power?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Vyalkuran",
                    "body": "I'd rather think Kuma's is being intentionally misleading if you ask me. Like what's \"Paw Paw\" supposed to even mean. Not bear bear but paw paw specifically as a paramecia.\n\nIt seems to be the only fruit that could comfortably scatter the poneglyphs around the world safely, so there is a great reason why it would not be grandiously named like \"travel travel fruit\" or \"repel repel fruit\" or something.\n\nOn the same note, Law's not being covered up is the odd one. Somehow they couldn't hide it but instead put enormous amount of bounty on it.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "thebearsnake",
                            "body": "I think with law's fruit, they were mainly concerned with hiding the immortality aspect, which A Celestial Dragon (Doffy) was the one to reveal it to the reader. And he knows other secrets that he hasn't revealed yet. So, others like Doffy basically caused a bidding war for the fruit in a way the Gov't wouldn't be able to pretend wasn't a thing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThatFatGuyMJL",
                    "body": "Yeah I feel the same way.\n\nA moonless night with cloud cover would make blackbeard an actual eldritch horror",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "NYCmob79",
                    "body": "This is canon at least in my head canon 😆",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ashguru3",
                    "body": "But then, what you're implying is that at night, he can become intangible? When there is an absence of light?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Shantotto11",
                    "body": "I just thought the cover was made of Sea Prism Stone which stopped the devil fruit power from escaping to another fruit. That meant that either the power clung to Teach as the only living organism in range or Teach cannibalized Newgate’s body similarly to how Lingling inherited Mother Caramel’s devil fruit power. Either of these scenarios would’ve bypassed the side effect of death from eating another devil fruit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PhoemixFox2728",
                    "body": "Yep this is what I’ve been thinking ever since I watched the whitebeard scene, I think that Blackbeard’s devil fruit/powers ate Whitebeard’s fruit for him and it actually has nothing to do with multiple personalities or nothing. Which is why Blackbeard teased Law that he could take *or* sell his fruit, but that’s just my two scents.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Arkayjiya",
            "body": ">Primarily, his body isn't intangible. He chocks it up to the unique nature of a black hole\n\nI mean it's possible but his explanation makes sense. His body does let attack pass through like any other logia but only if they have the capacity to escape the blackhole's gravity which is essentially impossible.\n\nThat doesn't disprove your theory completely, but remember that logias are essentially just fruits that transform you into an element. BB is darkness since stuff is absorbed inside him and darkness is an element as much as light or snow is.\n\nKatakuri's intangibility and embodiment of Mochi didn't make him a logia, so I don't think BB's apparent lack of intangibility makes him not one. When Oda defined Logias in a SBS anyway, intangibility was not part of the definition, only embodying and controlling a major element.",
            "score": 139,
            "replies": [
                {
                    "author": "ibelieveinmikehawk",
                    "body": "Just a quick point: Katakuri isn't intangible. He bent his body around Luffy's punches through observation Haki.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "Lenticularis19",
                            "body": "Katakuri used Observation Haki to counter Luffy's Armament Haki, which would otherwise bypass the Logia hacks. The reason Katakuri's fruit is not a Logia is that mochi is not a natural substance.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "ibelieveinmikehawk",
                                    "body": "Right. But regardless, mochi is not an intangible substance. It's not like lightning, fire, light, snow... It's a dough.\n\nAlso, the reason Katakuri's fruit is a \"special paramecia\" isn't because mochi's not an element, but because he can turn into mochi. Paramecia's don't do that -- the wax wax fruit or Magellan's fruit, for instance. They're limited to producing said substance. But Katakuri can actually transform into mochi.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Lenticularis19",
                                            "body": "Kuzan is also intangible, although ice is tangible.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Furicel",
                                                    "body": "Also, Crocodile would be the same as Katakuri",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ibelieveinmikehawk",
                                                    "body": "I don't think you know the definition of intangible. He most definitely is not intangible. Attacks won't damage him in ice form, he can break and reform, but he isn't *intangible*.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Furicel",
                                            "body": ">regardless, mochi is not an intangible substance. It's not like lightning, fire, light, snow\n\n![gif](giphy|5eFOZ3Ay2gAGpV0JdN)\n\nMy favorite intangible element ever: Sand.\n\nI love when I go to the beach and I can't go in there because I phase through the sand until I hit the Earth's core.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Tinystar7337",
                                                    "body": "Sand is intangible because it's a powder, but still the Mochi isn't intangible argument doesn't really work.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ibelieveinmikehawk",
                                                    "body": "You're showing a Gif in which Luffy is using water to touch Crocodile.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Arkayjiya",
                            "body": "Katakuri is Mochi and malleable enough to make holes in his own body and he can let attack pass through like Logias. The only reason he needs to use observation Haki is because of the haki of his opponents.\n\nAo Kiji is a logia and yet we see him do something similar to Katakuri against WB's weapon.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Deity_Majora",
                            "body": "> Just a quick point: Katakuri isn't intangible\n\nJust a quick point: you are wrong. Katakuri is as intangible as ever other semi/solid logia. Katakuri was originally called a Logia in the chapter release and was changed to a special paramecia due to not being a natural thing. We have seen Katakuri get hit with non-haki attacks and all that happens is the mochi deforms. Katakuri only need to vent around attacks if they are haki infused.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "harlojones",
            "body": "Naw. I think BB’s special catch that everyone in the story references is that he’s Joyboy’s descendent. The only classic representation of a pirate we have in the story coming from the first pirate in the story’s history.",
            "score": 42,
            "replies": []
        },
        {
            "author": "Hypekyuu",
            "body": "Nah, he's just weak to light\n\nThat's why Blackbeard always wins off screen\n\nWe can't see him",
            "score": 45,
            "replies": [
                {
                    "author": "siamkor",
                    "body": "AND HIS NAME IS ~~JOHN CENA~~ MARSHALL D. TEACH!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "JNDragneel161",
            "body": "The only reason I hope this isn’t true is because we’ve soon too many mythical zoans recently.",
            "score": 112,
            "replies": [
                {
                    "author": "asadkins90",
                    "body": "Well you have to take into account we’re probably dealing with the top 1% of power in the whole world. It only seems right that they have some of the strongest/rarest DF and top tier haki.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "aLittleBitFriendlier",
                            "body": "It makes sense in-world, but it's getting slightly repetitive. I'd love to see some more good old-fashioned logias and paramecias, like Gunko's.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "asadkins90",
                                    "body": "I get ya for sure. I miss pre time skip one piece really bad. It had sucks a carelessness in a way and the DFs were always pretty cool.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ponce-Mansley",
            "body": "It would be such a lame new surprise reveal that the main antagonist also had a falsely named fruit after all these years, and it would be even worse on top of Oda going out of his way to say \"Even though it doesn't seem like it should make sense, this very special fruit that Blackbeard spent his whole life scheming and murdering to get his hands on is actually a special Logia\"\n\n\nThey went out of their way in great detail to explain 800 chapters ago that the Yami Yami No Mi is special and different and won't act the way anyone expects. Then it was followed up with the insane reveal of BB taking Whitebeard's fruit. Pretty much all of that narrative effort would be undone by Oda going \"Haha nah actually he's just like secret Nika but EVIL\" ",
            "score": 38,
            "replies": [
                {
                    "author": "Batzn",
                    "body": "> They went out of their way in great detail to explain 800 chapters ago that the Yami Yami No Mi is special and different and won't act the way anyone expects.\n\nThat could also be just the case of nobody ever finding out why its special. The powers of his DF are all documented and even acknowledged to be somewhat of an outlier and the exact reason why teach wanted this specific DF. It isnt to far strechted that the reawon why it has those special properties could be because its actually not a logia and nobody ever was able to awaken it to know otherwise.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "GoldenWhite2408",
                    "body": "I mean also\n\nMarco said \nHim stealing the fruit has less to do with the Yami Yami and that\n*Something* about teach makes him able to even use 2 df\n\nSo BB is always special",
                    "score": 4,
                    "replies": [
                        {
                            "author": "orangi-kun",
                            "body": "Yeah I think that yami yami powers just helped him take the fruit powers from shirohige, being able to use 2 fruit powers is something special about him.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Mnawab",
                                    "body": "It’s not just two devil fruits, he can also transfer devil fruits from one person to another of his choosing. He planned on stealing Boa for himself so he can probably even hold more than two",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "orangi-kun",
                                            "body": "He never said that he wanted it specifically for himself, he could have wanted it for one of his crewmates. But yeah, there is nothing that indicates he can only hold 2 devil fruit powers.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gear7ththedawn",
                    "body": "Nah what's gonna happen is devil fruits will be explained and then we will all understand that in some form or another, all fruits begin as zoans and evolve with each user. Like Lucci and his fruit being as absolutely insane as he is. I imagine that if Lucci started learning about mythical leopards, he could bridge the gap between himself and any one he chose. He could choose himself what he is able to do next. Fruits mix with conquerors haki and evolve. They awaken and evolve. When Sabo took over Aces fruit and started using Aces moves, it became clear to me they have a memory. That memory also gives it the potential to change and evolve based on events, thoughts, feelings and actions taken by the user. \n\n\nI know it's a stretch but I'm almost 100% certain I'm right.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aesma_",
            "body": "It would be a bit weird.\n\nFirst of all because there is a big difference between BB's fruit and Luffy's. The Gomu Gomu no Mi does not appear in the devil fruit encyclopedia. We know that from Vegapunk. My understanding is that the encyclopedia predates the time the WG was able to censor things about the Gomu Gomu no Mi. But we know BB's fruit is in the encyclopedia because he tells Ace he remembered it from here. \n\nSecondly, I understand that the WG hid the truth about the Nika fruit because they didn't want it to awaken. It's already a bit weird that they wouldn't go after Luffy as soon as they heard about a Gomu Gomu no Mi user with a Strawhat telling everyone he wants to be king of the pirates, but whatever, I can accept that.\n\nHowever, I hope it stays an exception. I've seen too many theories lately about how \"X fruit is actually a mythical Zoan\". Chopper, Robin, Brook, Blackbeard... But you have to remember that every time Oda will try to introduce a new \"miscategorized\" fruit, he will have to explain why it happened. And I'm not sure I'd like the WG to be SO incompetent that they not only blundered with Nika but with every fruit they tried to erase from history.\n\nSo I hope it stays like Katakuri's fruit. A fruit that acts a bit different from the rest of the fruits in its category.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Outrageous_Plenty433",
            "body": "He's got PLOT ARMOUR fruit",
            "score": 4,
            "replies": []
        },
        {
            "author": "MightyPrinceAli",
            "body": "You right. \n\nHe actually has the Hito Hito no Mi Model: Niga",
            "score": 33,
            "replies": [
                {
                    "author": "Abadhon",
                    "body": "Lmao",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vistaaaaa",
            "body": "Yeah bro. All fruits are zoan. They just evolved.",
            "score": 3,
            "replies": []
        },
        {
            "author": "garbink",
            "body": "Please no more mythical zoans",
            "score": 3,
            "replies": []
        },
        {
            "author": "Abadhon",
            "body": "Nika for white form and Niga for black form",
            "score": 3,
            "replies": []
        },
        {
            "author": "Buzzek",
            "body": "With Gomu Gomu, it was easy for the government to change the name of the Nika fruit because it doesn't seem like a Zoan and it instinctively looks like a paramecia. Propaganda isn't even necessary here as long as people don't know who Nika is.\n\nBut in Blackbeard's case, he believes it to be Logia EVEN THOUGH it doesn't seem to behave like Logia. It's a completely opposite situation. Imagine if Luffy called himself a Zoan since the start of the series. That's why the same logic doesn't exactly work here. Narratively, the inconsistency makes Yami Yami more likely to be a Logia because it was acknowledged. It doesn't make sense to make it into a twist now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sharp_Aide3216",
            "body": "The mention of Black Nika in the recent chapter is a huge chekhov's gun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Majukun",
            "body": "God I hope not.\nThat stuff was bad with the gomu-gomu",
            "score": 1,
            "replies": []
        },
        {
            "author": "HisPri",
            "body": "Please No \n\n\nWhile i love Gear 5, i am still salty about Gomu Gomu is not Gomu Gomu. You are telling me no one dreamt of being a rubber boy? \n\n\nI am fine with him getting the third DF being a mythical zoan tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit-Engineer8778",
            "body": "I feel like Blackbeard would be able to make himself intangible if he was in a completely dark place. Any form of light makes him tangible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thepineapple2397",
            "body": "Katakuris fruit has the 3 properties that make logias  unique but he's a paramecia. Rules don't matter",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThyNerub",
            "body": "As Teach specifically targeted the Yami Yami above all other options, he seemed to know some secrets or to have made a plan based on it. I do think it is miss categorized, far more hinted unlike the gomu gomu, but Teach must probably knew it from the beginning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RAJPUT_HARSHIT",
            "body": "you know what kizaru can be a perfect match for him then if not luffy given kizarus immense speed and light attacks also he can fly",
            "score": 1,
            "replies": []
        },
        {
            "author": "EfficientChemical912",
            "body": "Not a big theory guy, but it surely sounds like a possibility. I mean, his fruit is clearly a special case, so its gotta have some secrets.\n\nIts the DEVIL fruit of DARKNESS. It neutralizes other fruits on contact and Blackbeard is the only person who successfully wields 2 fruits at once without dying when the fruit is about \"consuming everything\". No way thats not connected and its an ordinary logia.\n\nIf there is something like a primordial devil fruit, the devil fruit of the devil himself, its the Yami Yami No Mi.\n\nBut it would be kinda boring to bring the same plot twist twice with the fake name...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Meet_Foot",
            "body": "Interesting, but I don’t think so. His hobby is history and he called it something like “the most evil fruit in history.” It would be weird to know that - either from the book or from independent research - and yet be wrong about what it is. If the book called it the most evil, then why bother misnaming it? If it doesn’t and he found out on his own, then his knowledge goes beyond the book. My money is on the former, since we know his knowledge is at least partly from the book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Niinjas",
            "body": "No there are references in the show ehere people have said he was born with an abnormal body. Also he is constantly referenced as they, from the start. Maybe a conjoined twin?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jaldaba0th",
            "body": "We know that logia fruits are weak against elements that are naturally adverse to them, such as water with sand or rubber with electricity. With this in mind, I think that any source of light prevents Blackbeard from transforming. This would explain the black sheet that Whitebeard was wrapped in. In fact, the sheet covers Blackbeard from any form of light and this would have allowed him to transform into darkness and perhaps steal the power of the gura gura or the part of the body where it was preserved (we know with Big Mom that the body seems to be linked to the power).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Le0333",
            "body": "So blackbeard is like rimuru and luffy is like popeye... this battle will be legendary\nThe strongest anime power vs the strongest traditional cartoon/toonforce user",
            "score": 1,
            "replies": []
        },
        {
            "author": "KnightOfThirteen",
            "body": "Counter theory: all devil fruits are mythical Zoans that give the user the powers of some long-dead member of the ancient kingdom. Some of those people had elemental powers, some had shape-shifting powers, some had reality manipulation powers, but during the void century they were all \"killed\", but they had achieved immortality via the fruit rebirth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious_Plate_678",
            "body": "I need my spoilers",
            "score": 1,
            "replies": []
        },
        {
            "author": "thatoneguy7272",
            "body": "I have a Theory with devil fruits that similar or cohesive devil fruits can be combined. I personally think that Black Beard had eaten the Hebi Hebi no mi : model Apophis before ever getting the Yami Yami no mi. Apophis in Egyptian mythology is the God of darkness, chaos, and Earthquakes. He is also the mortal enemy of the Sun God Ra. It all fits together so neatly. Especially considering Luffy’s and Black Beards inherent reactions to each other. The unknown sun god and the god of darkness being oil and water for each other.\n\nEdit: I’m an idiot. I didn’t expand on my original theory. Apophis being the god of chaos, darkness and earthquakes. The original devil fruit may have inherently come with minor versions of those two fruits. And by Blackbeard consuming the fully realized versions of those devil fruits he enhanced his own abilities already granted by his original devil fruit. \n\nTake for example Luffy, if there is an actual Gomu gomu no mi, he would likely get even greater rubber like powers due to the rubber already being connected to his Zoan fruit. Something along the lines of plastic man being able to shape his body however he wants. \n\nThe hebi hebi no mi model Apophis also helps to explain the “strangeness” of Black Beards body which was reported before he ever got his hands on the Yami Yami no mi. The things like him “never sleeping”, snakes don’t have eye lids and appear to be awake all the time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "franz_fazb",
            "body": "I find this unlikely to be true, but at the same time, I dont really find it absurd. Could be, maybe. Who knows?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yassopeking",
            "body": "Yami yami is the reflection of luffy's hito hito, so its a zoan mythical model : black nika",
            "score": 1,
            "replies": []
        },
        {
            "author": "gear7ththedawn",
            "body": "Based on my theory that fruits evolve like Pokémon, you would be correct. Black beards fruit is 100% most certainly a God level zoan fruit of some kind. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "iDrum17",
            "body": "I really hope it is a logia because I want him to take whatever dope zoan fruit Imu has",
            "score": 1,
            "replies": []
        },
        {
            "author": "menyemenye",
            "body": "Fruit Categorization is a social construct made by world govt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlatinumSukamon98",
            "body": ">My best guess would be **Beelzebub, specifically the demon of Gluttony** from Christian lore. It fits **Blackbeard's Greed** & lack of self control.\n\n\nShouldn't it be Mammon instead of Beelzebub then?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HappyBluue",
            "body": "It's very funny that I've been thinking about blackbeard's fruit today as well (well, there are many one piece so I guess that it's not that surprising haha)\nI thought of the constant parallel between luffy and BB, and regarding their repsective fruit, on the one side we have luffy with a zoan that acts as a paramecia, and on the other side we got a logia that acts like a paramecia. It's not really an opposite like the pie panel, but another instance of \"they are both similar in almost all aspect, yet completely different\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pietjiro",
            "body": "Devil fruit categories don't have absolute rules, exceptions always exist, like Katakuri is a \"special paramecia\", Luffy is a zoan without zoan forms, the Yami could very much be just a logia without intangibility.\n\nAlso, what difference does it make? Luffy's fruit name change was purely narrative, it didn't change his powers and abilities. There is no point theorising such change without a good narrative reason. Yami being basically a Black Hole fits already pretty well as the antithesis of the Sun God, dark vs light, black vs white, I don't see the need of such change",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeteroHyouka",
            "body": "He has a special df that's all... Something that Katakuri doesn't... And Luffy's df isn't mistaken but retconned...",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrTyrantZero",
            "body": "To me that has been OBVIOUS since its introduction.\n\nAnd since we found out that the Gomu Gomu was not the Gomu Gomu, that opened the door for other DFs to be wrongfully categorized which means it became 10000000% clear that the Yami Yami is NOT a Logia.\n\nSince the fruit is nearly identical to the \"gomu gomu\", that's also 10000% a Hito Hito no Mi and I agree with the youtuber Sawyer7Mage, it's the MODEL: DAVY JONES",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConditionEffective85",
            "body": "I like this theory alot and to me it makes so much sense. The only way I can see it really being a logia is if he can become his element but needs a prerequisite beforehand.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmoothCriminal7532",
            "body": "The theory is its another yokai fruit which splits up your soul into 3. The fruit also gives some kind of secret knowledge. Which is why he has 3 fruits and knows a bunch of random shit he shouldnt.\n\nThe reason he can steal fruits is the same reason big mom gained hers but more specific like eating someones heart, the fruit becomes part of the body, replacing the heart or something.",
            "score": -3,
            "replies": [
                {
                    "author": "Arkayjiya",
                    "body": "I'm not so sure that's true anymore. Despite his flag, BB has been associated with duality and the number 2 a lot. He has lived \"twice as long as others\" for example, likely a reference that he can't sleep (he lives both at night and at day), all of that would hint that he can only have 2 DFs. Still, it is possible that he has three or could get three if he hasn't yet, that would make for an explosive final reveal for him to hype him up so I'm not discounting the theory completely.\n\n>The fruit also gives some kind of secret knowledge\n\nThat is much less likely than the rest. We don't know why he knows stuff because we don't know his past, there's no need for a supernatural explanation and honestly it would be kind of disappointing. What is more interesting: He has a motivation deeply tied to his past, rooted in History that grants him knowledge and that's also why Oda said his job would be archaeologist in the real world, or \"I learned it all from eating a weird fruit\".",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "HumongusFridge",
            "body": "LATEST CHAPTER SPOILERS BELOW\n\n\n\n\n\n\n\nI read the title and it snapped to me that maybe Yami Yami no mi makes the user be the abyss that god nights are using to teleport.\n\nAlso the second world Harley text goes \"Breath stirred within the void and the forest god sent forth demons.\" If we presume that demons are the devil fruits maybe Yami Yami no mi is a mythical zoan fruit that represents the forest god and that could explain its influence over other fruit powers.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Flat-Limit5595",
            "body": "Im in the camp its also a type of zoan like the supposed gum gum fruit. But there is another fruit thats might also be mis named as well. Whats up with the mochi mochi fruit its a “special” paramecia yet acts like a logia. It was even stated as a logia at first but was changed. If one zoan fruit makes you a rubber man, there may as well be one that turns you into mochi. Maybe a god of food or celebration or something. Might be a god of family like Hestia, use the mochi to stick people together both literally and through familial bonds. Hes the only person that was able to keep his family together and is most likely the leader of big mom pirates by now.",
            "score": -2,
            "replies": [
                {
                    "author": "rienceislier34",
                    "body": "I like this one",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "alfrado_sause",
            "body": "My guess is that Blackbeard has discovered that some Devil Fruits are Meant to be together. The Yami Yami and Quake Quake and some Zoan are likely to be the reason why the moonfolk needed to come to the planet. Possibly whatever DF Xebec had would work. Something  about being a world destroyer. Possibly a concept from the Harley about the Three Worlds? Paramecia. Logia and Zoan.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Toastman132",
            "body": "The closest thing we have to dumb fuck Christianity is Kuma and his bible. Let's hope we don't bring this brain rot to one piece",
            "score": -1,
            "replies": []
        }
    ]
}