{
    "title": "How Zoro Will Make a Permanently Black Blade",
    "author": "SnakeLiquidV",
    "subreddit": "OnePiece",
    "rank": 10,
    "score": 130,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 88,
    "url": "https://i.redd.it/due43xyp7gpe1.jpeg",
    "id": "1je4p73",
    "selftext": "\"I saw this on YouTube a while back. To forge a permanently black blade, a swordsman must possess a powerful swordsman's will – for example, Zoro's Demon Ashura – and must have mastered Conqueror's Haki. Once these conditions are met, the swordsman can use their kingly will to command their swordsman's will, infusing it into one of their blades and making it permanently black.\" Here the link to the video on YouTube https://youtube.com/shorts/5LmsOSU-kz8?si=oYYSBtpJQgmEEooe",
    "comments": [
        {
            "author": "TheGameologist",
            "body": "He will make the wado ichimonji a black blade when he pours all of his haki into it to deliver the greatest slash in The series (IN AN EPIC DOUBLE PAGE SPREAD!). The slash will be so epic that it will indeed reach the heavens, passing by kuina and cutting black Jesus.",
            "score": 1,
            "replies": [
                {
                    "author": "BlazeDrag",
                    "body": "Now I'm imagining he gets into a fight on elbaf and does that and its this big cool epic scene, only for the trunk of the adam tree in the background to also get cut in the process lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SnakeLiquidV",
                    "body": "🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "loangz",
            "body": "He need to find a good source of black paint and start learning how to paint.",
            "score": 88,
            "replies": [
                {
                    "author": "ver_bene",
                    "body": "Mihawk taught him well",
                    "score": 16,
                    "replies": [
                        {
                            "author": "JeffPhisher",
                            "body": "It be like some karate kid shit. In order to learn how to swing a sword you must first learn to swing a brush",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mnawab",
                    "body": "If he keeps taking out minorities the way he has, eventually, his blade will become black and he’ll probably kill that too. maybe that’s why his sword doesn’t wanna become black blade ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ConditionEffective85",
                    "body": "Maybe the ink df guy can do that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tiki-baha29",
            "body": "The issue I see here is that Oden and Roger and Rayleigh are all swordsmen with insane haki + CoC yet none of them have made black blades. You can also throw Shanks in the mix too as a person without a black blade yet has some of the strongest haki in the verse.\n\nIt's pretty clear we are missing a major component beyond just haki and overall strength. Otherwise why would only Ryuma and Mihawk be able to accomplish this?",
            "score": 1,
            "replies": [
                {
                    "author": "shortchangehero86",
                    "body": "Personally, I don't think Oden unlocked ACOC until he fought Kaido - Haki blooms in extreme combat.  So he definitely never *mastered* it.  Honestly, I don't have a full theory for Roger / Rayleigh outside of the fact that we should look into the things Zoro or Mihawk wanted to cut vs having more cutting POWER (if this makes sense).  Did Roger want to be stronger with more power, or do the literal impossible which is what Mihawk and now Zoro are doing?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tiki-baha29",
                            "body": "This is exactly why this *black blade forging* process is such a fascinating question. Even if Oden hadnt mastered ACoC until Kaido it still wouldnt explain Roger who did master it since we saw him use it against WB. It also wouldnt explain Shanks either. \n\nI have my reservations that its a power issue, because then all you'd need to forge one is more training and better haki and its hard to imagine the names we're dropping didnt reach the pinnacle of that. \n\nOne thing that would serve as a great hint to this would be to know when exactly Mihawk forged his black blade, was it during the Shanks duels? or after? Theres a missing piece here somewhere.\n\nI will say the notion you brought up of them wanting to cut something **greater** is an interesting one.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jojofan6984760",
                    "body": "If I had to guess, it's a mix of supreme control of armament haki, very strong conquerer's haki, *and* an ungodly single minded determination toward being the best swordsman. Shanks, Rayleigh, Oden and Roger all have/had incredibly strong conquerer's haki, and likely were good enough at armament haki to infuse their blades, but they all had goals that weren't \"be the best swordsman there is\". Shanks and Roger want/wanted to be the pirate king, Rayleigh had to be first mate and presumably look after everyone else on the crew, Oden was seeking to eventually return to Wano.\n\nRyuma, Hawkeye, and Zoro are different, because being the best swordsman in the world and constantly improving this one specific craft is their primary goal. They'll do other stuff to help achieve that, like Hawkeye being a warlord and Zoro joining Luffy, but ultimately being the best is the end goal they're trying to achieve. \n\nIn material terms, it gives these guys stronger reason to infuse their swords often, and get skilled specifically at doing so, as well for them to use the same swords for long periods of time. If the Merry taught us anything, it's that traveling with and caring for an object can give the object properties beyond what it \"should\" be able to do. I can imagine that using the same sword for a long time, constantly infusing it, and getting good at infusing it can lead to the haki getting \"set\" in the blade, making it black.\n\nTo be clear, I don't remember enough about what they've specifically said about black blades to know if there's specific textual evidence for this, but it feels like a good thematic reason for ryuma/mihawk to have a black blade where the other people listed don't.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SnakeLiquidV",
                    "body": "Lol they literally dont have a swordsman will.  Zoro has Demon Ashura.  They weren't true swordsman.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tiki-baha29",
                            "body": "Huh?\n\nSo Shanks/Roger and even Oden dont have a *swordsman's will*? How do you figure that?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SnakeLiquidV",
                                    "body": "It's just a theory.  But obviously they did not have 1.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "tiki-baha29",
                                            "body": "Where are you getting this notion of a \"*Swordsman's will*\"? What's the source of that?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SnakeLiquidV",
                                                    "body": "For example King was a swordsman but Zoro did not consider King a  true Swordsman.   Same can be said about Roger,Rayleigh ect ect",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SnakeLiquidV",
                                                    "body": "For example king was a Swordsman but Zoro did not consider King a True swordsman.   Same can be Said About Roger, Rayleigh and other swordmans.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "tiki-baha29",
                                                            "body": "No it cant. King specifically said he'll use whatever means necessary to win and used a modified sword to fight. How could you possibly equate that to Roger/Rayleigh/Shanks and even Oden, the guy who is literally from the land of swordsmen.\n\nYour rationale doesnt make any sense.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SnakeLiquidV",
                                                                    "body": "Oden was just not good enough swordsman believe it or not.  And Shanks is all round Fighter.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ichhassenamen",
                                                                            "body": "Man you Must have watched two piece already since you Know so much more",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SnakeLiquidV",
                                                                                    "body": "3 piece actually.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "SnakeLiquidV",
                                                                    "body": "Oden was just not good enough swordsman believe it or not.  And Shanks is all round Fighter.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tiki-baha29",
                                                                            "body": "As far as we're aware Shanks is a swordsman, he only ever fights with a sword and the fact he would have legendary duels with Mihawk also suggests that. \n\nOden is undoubtedly a swordsman but the fact he didnt get a black blade and neither did any other top tier swordsman is why there is a major component in this process that we're missing. It cant just be strength and haki.\n\nA \"*swordsman;s will*\" as you put it is not a real thing. Its not a concept that comes from the source material. It also doesnt add up that these people wouldnt have the will of a swordsman when they only fight using swords and nothing else.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SnakeLiquidV",
                                                                                    "body": "U literally c Ashura man.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "tiki-baha29",
                                                                                            "body": "So what? What does that specific technique have to do with making a black blade?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "SnakeLiquidV",
                                                                                                    "body": "Infusing his swords will into his blade by forcing it to submit to his will.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "tiki-baha29",
                                                                                                            "body": "He's infusing the will of his sword into the blade? \n\nAre you sure you wrote that correctly? If these swords already have wills how is he \"*infusing his swords will into his blade*\"?\n\nIf you meant to write that he's infusing his own will into the blade to make the sword submit then that still doesnt connect with Ashura at all, because thats just a sword technique. Also dont forget that Oden had already forced Enma to submit to him, he had mastered that blade yet it never became a black blade.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "SnakeLiquidV",
                                                                                                                    "body": "I'm tired man.  Goodnight 🤣",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "tiki-baha29",
                                                                                                                            "body": "You're the OP of this thread and you cant even explain the point you tried to bring up? lol ok. See ya.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "SnakeLiquidV",
                                                                                                                                    "body": "I explained it to many times to u man .  And it's a theory I saw on YouTube. What's your theory ?infusing conquering haki into the blade?kill countless people?keep using armament haki on it? Share a emotion with it?🤣🤣🤣🤣",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "tiki-baha29",
                                                                                                                                            "body": "You didnt explain anything, the theory you linked to doesnt even make sense. You created this notion of a \"*swordman's will*\" which isnt even a real thing in the manga and you kept repeating it to various posters in this thread as if its an established fact or something.\n\nI dont know what it takes to make a black blade, we're missing a major component in that process, and with only 2 examples of black blades vast majority of theories have no baseline.\n\nI'm not even the only person in this thread telling you what you're saying doesnt make sense. Maybe its time to abandon that theory since you cant even seem to properly explain/defend it.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "SnakeLiquidV",
                                                                                                                                                    "body": "It's like we did not know about advanced Haki.  You dont know but arguing with a guy that talks about a theory. 🤣",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "tiki-baha29",
                                                                                                                                                            "body": "Find a better theory. This one is garbage.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Young_Leaf77",
                                            "body": "No way you're sitting here saying Oden a LITERAL samurai doesn't have a swordsmans will? His sword is still imbuing itself with his haki post death????? Are you good?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SnakeLiquidV",
                                                    "body": "He couldve had a swordsman will but He lacked master conquering Haki.  He obviously did not master it.  Or he would've destroyed Kaido with ease.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dazzling_Meal1040",
            "body": "I think during his rematch with nusjuro he will break kitetsu the first with his kitetsu and in that moment he will turn it into a black blade",
            "score": 10,
            "replies": []
        },
        {
            "author": "Corgiboom2",
            "body": "Why did I come in here expecting a serious response? Its either \"black paint\" or \"racism\". I was actually hoping for some good stuff to read.",
            "score": 1,
            "replies": []
        },
        {
            "author": "modegazucantu",
            "body": "Zoro walks into home depot: \"You guys have black paint?\"\n\nEmployee: \"sir this is a wendys..\"",
            "score": 11,
            "replies": []
        },
        {
            "author": "ArtisticLink13",
            "body": "That would make an awesome tattoo",
            "score": 2,
            "replies": []
        },
        {
            "author": "SnakeLiquidV",
            "body": "Yeah reason Roger and many others did not have a permanently black blade is because they did not have a Swordsman will.",
            "score": 4,
            "replies": [
                {
                    "author": "ConditionEffective85",
                    "body": "Or they didn't have a bond with their sword.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ittakes1totango",
            "body": "https://preview.redd.it/9xb8yh923hpe1.jpeg?width=1877&format=pjpg&auto=webp&s=8bf3e5eec22c688172e63b08f6a9e60aef6c7321",
            "score": 1,
            "replies": [
                {
                    "author": "SnakeLiquidV",
                    "body": "🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "A_Blooming_Lotus",
            "body": "What's the difference between temporary black blade and permanent black blade? Isn't it okay as long the blade turns black when one fights? Also, why is it called black blade and not black sword? I thought blade and swords are different.",
            "score": 1,
            "replies": [
                {
                    "author": "RPGNo2017",
                    "body": "The only black blades in the story belong to strongest swordsman and sword god. Seems like a no brainer that Zoro would need to make his as a proof of surpassing them.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "TheDafca",
                    "body": "Haki isnt actually black its invisible so when Zoro makes his sword black it actually looks like that just for us. In universe his sword looks the same. So you have to actually turn it black by fighting and imbuding with haki for a long time(thats just a theory tho)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "tiki-baha29",
                            "body": "Thats not really true though. You can actually see haki, otherwise Doflamingo would not have teased Law over seeing Vergo's haki-buffed state and Smoker would have never reacted had it been invisible. \n\nEven in a recent chapter you see Luffy react to Gaban using haki on the key.\n\nHaki is visible.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jester_11",
                                    "body": "Maybe I miss something but isn't it visible for people that can use it, more like feeling it than seeing it. Or just like Jojo 's stand ?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "tiki-baha29",
                                            "body": "The whole \"*only users can see it*\" thing is really a Reddit notion that doesnt come from the manga. The reality is some haki is visible while other haki is not. \n\nUsing CoA as an example, the most basic variant is invisible (like when Luffy grabbed Ceasar on Punk Hazrd), However hardening is visible and generates a black hue (like Gaban using CoA on the key and Luffy seeing it).\n\nAdvanced CoA where you attack from a distance is invisible (this is what Rayleigh showed to Luffy and used against the elephant).\n\nSo some haki can be seen by not just the reader but the in-universe characters as well. Some Other haki is invisible still.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jester_11",
                                    "body": "Maybe I miss something but isn't it visible for people that can use it, more like feeling it than seeing it. Or just like Jojo 's stand ?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SnakeLiquidV",
                    "body": "Because it's just not a sword that can be permanently made black, Other blades can also be made permanently Black.  Temporary Black blade is made from armament Haki.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "T_Rochotte",
            "body": "Rayleigh didnt have a black blade and Zoro is this generations Rayleigh",
            "score": 1,
            "replies": [
                {
                    "author": "SnakeLiquidV",
                    "body": "Rayleigh did not have a swordsmans Will. Zoro has Ashura.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "T_Rochotte",
                            "body": "So Rayleigh wasnt a swordsman ?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gumpdslump-man",
            "body": "I wanna guess that, people who can use advanced forms of haki are able to see like an aura for ACoC. With the swords i think its just a name, or the haki infused into the metal turns the metal darker in color because of the “will” of its owner that was poured into it. Making the metal tungsten like in color and durability by it being hardened by the haki. The idea wasnt probably all that fleshed out and the editors pushed for some kind of visualization for haki in weapons, thus black blades were born.\n\nZoros gonna use his 4 sword style to unlock his black blade lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "GloomyLocation1259",
            "body": "Repeated aCoC on Wado + extra emotional attachment",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoiledKozuki",
            "body": "Luffy has some black paint",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mummiskogen",
            "body": "I'm convinced you guys think way more about this than Oda himself",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpecificSinger9487",
            "body": "Its hard to say now that zoro has enma which is a struggle for him to use and he not mastered that yet",
            "score": 1,
            "replies": []
        },
        {
            "author": "OatesZ2004",
            "body": "This is my pure head canon fan theory but I believe that for someone to achieve a black blade they must sacrifice their conquerors haki or armament Haki and seal it within the blade like how Joyboy had the haki knot this could explain why stronger characters haven't achieved a black blade.",
            "score": 1,
            "replies": [
                {
                    "author": "rienceislier34",
                    "body": "Sounds interesting",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AegonTarg_2",
            "body": "I feel also emotional attachment to the blade as well is important like wado ichimonji has a story behind the sword that it was kuinas sword that's why he is emotionally attached to that sword, he will probably need more of it to make it a black blade",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConditionEffective85",
            "body": "He better start working on making all 3 black no point in being the 3 style master if only one is black.",
            "score": 1,
            "replies": [
                {
                    "author": "SnakeLiquidV",
                    "body": "He only has  1 demon Ashura",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ConditionEffective85",
                            "body": "He has 3 swords and they're all his weapon equally.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SnakeLiquidV",
                                    "body": "Nah Wade is more special then the others . I linked the Video I watched on the theory. Not sure if u watched it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ConditionEffective85",
                                            "body": "Doesn't matter he's a 3 sword style not 1. Should Sanji only be able to use Diable Jambe with one foot?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pastry_d_pounder",
            "body": "He will use permanent marker",
            "score": 1,
            "replies": []
        },
        {
            "author": "riden95",
            "body": "As far as I remember Onimaru said a Black Blade needs to be forged by the owner by fighting many battles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KingJaffiJo",
            "body": "* Step1: Be put to sleep by Gillingham and dream of black blade\n* Step2: ???\n* Step3: Profit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Meet_Foot",
            "body": " That really sounds like word salad to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chopstick_chakra",
            "body": "Black blades don't make sense in universe. Haki is an invisible coating so how does coating something in an invisible cloak turn it a different color?",
            "score": -1,
            "replies": [
                {
                    "author": "SnakeLiquidV",
                    "body": "Oda only makes a temporary black blade Appear in color for us viewers to know they using armament Haki.  But in the one piece verse they cant see it. But conquering haki they can see.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "tiki-baha29",
                    "body": "Its not invisible, CoA haki can be seen.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "chopstick_chakra",
                            "body": "https://preview.redd.it/gqaqfd72mhpe1.png?width=466&format=png&auto=webp&s=b563c8b8dbfca08c0f876b8b0efecd4a466db385\n\nYou were saying?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tiki-baha29",
                                    "body": "I was saying that haki is visible, which your panel here doesnt disprove. This is where comprehension really kicks in because there are different hakis.\n\n- Rayleigh in this panel displays Advanced CoA to Luffy, which can be used to attack people from a distance. That haki is invisible and Luffy doesnt actually learn it until Wano where its still invisible.\n- Basic CoA has an invisible variant which Luffy uses when he grabs Ceasar the first time with Robin/Franky.\n- When characters harden themselves its visible which is where the black hue comes from. This is not just for the reader, characters see it too. (Law in chapter 690 sees Vergo's full haki coating / Luffy in chapter 1140 sees the haki being used on the key).\n\nRayleigh is not wrong in this panel because the haki he shows is advanced and is invisible but hardened CoA is visible, it also has an invisible weaker variant.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ll_akagami_ll",
            "body": "Why do you think he’s been focusing on enemies that are darker skin tone? Racist ass Zoro :D",
            "score": 1,
            "replies": [
                {
                    "author": "Contra-Code",
                    "body": "Man this joke sucks.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TadhgOBriain",
            "body": "Black blade... minority hunter... I'm sensing a connection here.",
            "score": 1,
            "replies": [
                {
                    "author": "Mummiskogen",
                    "body": "God you're unfunny",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TadhgOBriain",
                            "body": "Ah well. Cant please all of the people all of the time.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Contra-Code",
                                    "body": "It takes zero effort to just not say racist shit.\n\n  \nAnd before you say \"It's a joke\"\n\n  \nYes, it is. A shitty racist joke.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "luigigaminglp",
            "body": "I think Zoro's approach is hunting enough minorities to paint it black.",
            "score": -8,
            "replies": []
        },
        {
            "author": "pisidos",
            "body": "Better ask how many black he needs to slay to do it",
            "score": 1,
            "replies": []
        },
        {
            "author": "necropuddi",
            "body": "Zoro needs to hunt enough minorities and his blades will turn black.",
            "score": -9,
            "replies": [
                {
                    "author": "Mummiskogen",
                    "body": "You guys are incapable of funny and original jokes. In just this thread alone there are several comments like this, almost word for word. Bot much?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}