{
    "title": "Chapter 1143 Spoilers",
    "author": "khaledhn",
    "subreddit": "OnePiece",
    "rank": 4,
    "score": 645,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 139,
    "url": "https://www.reddit.com/r/OnePiece/comments/1je4uwy/chapter_1143_spoilers/",
    "id": "1je4uwy",
    "selftext": "**Cover Story**\n\nThe Straw Hat Crew Racing On Flying Fish\n\n**Short Summary**\n\nThe Giants Try To Help The Kids Who Have Been Kidnapped By The Holy Knights But They Can't Touch Them\n\nSommers Ate The Iba Iba No Mi Thorn Thorn Fruit When Someone Touches His Targets They Are Attacked By Thorns The Stronger The Love For The Target The More Painful The Thorns Are\n\nGillingham’s Fruit Is The Dragon Dragon Fruit Model Qilin He Can Materialize Objects From People's Dreams\n\nThe Holy Knights Are Eating In The Forest And Forget The Salt So Sommers Thinks About It Gillingham Uses His Power To Put Him To Sleep And Pulls Salt Out Of His Dream\n\nBack To Loki And Luffy’s Group\n\nLuffy Punches Loki With A Weak Blow And Loki Faints Zoro Notes That Loki Was Already Near Death\n\nLuffy Asks Gerth To Treat Loki Although Gerth Resists She Agrees To Help Him\n\nFlashback Of Hajrudin's Past Loki Bullied Him Since Childhood Hajrudin Wants Revenge For Their Father’s Murder\n\nAT THE END OF THE CHAPTER, LOKI WAKES UP AND SAYS: DO YOU REALLY THINK I KILLED FATHER BECAUSE I WANTED TO? I KNOW YOU DON'T BELIEVE THAT EITHER.\n\nNo Break Next Week\n\nWait For Full Summary Pew Pew",
    "comments": [
        {
            "author": "Adept_Crow_4159",
            "body": "Salt Piece lessgooooo",
            "score": 116,
            "replies": [
                {
                    "author": "UlteriorMotive66",
                    "body": "🧂👅",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Adept_Crow_4159",
                            "body": "https://preview.redd.it/2cyy92fzcgpe1.jpeg?width=639&format=pjpg&auto=webp&s=193d336c11a45c8653a23b358020e0e66ea59dcb",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "Sad_Lengthiness_9176",
                                    "body": "Kalifa also used thorns .. maybe there is a connection there ? NAH",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Encoreyo22",
            "body": "Just gonna reformat that for you a bit.\n\n**Cover Story:**\n\nThe Straw Hat Crew is seen racing on Flying Fish.\n\n**Chapter Summary:**\n\n- The Giants attempt to help the kidnapped children held by the Holy Knights, but they're unable to touch them directly due to an unknown force.\n\n- Sommers reveals he has eaten the Iba Iba no Mi (Thorn-Thorn Fruit):\n\nAnyone who touches his targets is attacked by painful thorns.\n\nSpecial condition: The stronger a person’s love or affection for the target, the more intense the pain inflicted by the thorns.\n\n- Gillingham possesses the Dragon-Dragon Fruit, Model: Qilin:\n\nHe can materialize objects from people's dreams.\n\n- The Holy Knights forget salt for their meal, prompting Sommers to think about salt. Gillingham puts Sommers to sleep and extracts salt from his dream.\n\nBack to Loki and Luffy's group:\n\n- Luffy punches Loki lightly, yet Loki immediately faints.\n- Zoro observes that Loki was already severely weakened and near death before Luffy hit him.\n- Luffy asks Gerth to treat Loki's injuries:\n\n- Gerth initially resists due to resentment but eventually agrees to help him.\n\nFlashback (Hajrudin’s Past):\n\n- Loki is shown to have bullied Hajrudin since childhood.\n- Hajrudin seeks revenge against Loki, believing Loki murdered their father.\n\n- Loki awakens and dramatically states:\n“Do you really think I killed Father because I wanted to? I know you don't believe that either.”\n\nNo break announced. Full summary to follow.",
            "score": 257,
            "replies": [
                {
                    "author": "NetflixAndNikah",
                    "body": "~~So Loki did kill his father, but maybe he had no choice?~~ Either King Harald was compromised by the world nobles or was about to betray the giants.\n\nedit: seems like a mistranslation of the spoilers - Loki most likely didn’t kill his father. So either Jarul killed Harald, or it was the holy knights. FREE LOKI.",
                    "score": 84,
                    "replies": [
                        {
                            "author": "Bignutdavis",
                            "body": "Maybe controlled like the King from Dressrosa",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "CaptRhapsody",
                                    "body": "Ooh, I like that theory. Would open up the idea that the WG does that kind of shit from time to time, and that Doffy’s actions in Dressrossa were just him emulating what he saw while he was a CD.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Adminisitrator",
                            "body": "FYI there is a correction about that sentence now",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Sad_Lengthiness_9176",
                            "body": "No he said \"because he wanted to?\" it means he was forced to like King harald was evil. He was definitely working for the WG",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "unHolyKnightofBihar",
                            "body": "King Herald Trump confirmed?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Adminisitrator",
                    "body": "https://preview.redd.it/5eyaw9lojgpe1.png?width=2611&format=png&auto=webp&s=0fb00f107b24a7555fa1ed104c98b07eaaa4d52b\n\n  \nplease add this correction",
                    "score": 21,
                    "replies": [
                        {
                            "author": "adnaphsaka",
                            "body": "u/khaledhn",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Comfortable-Monk850",
                    "body": "no break, yessss :D",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ROCKY_southpaw",
                    "body": "Ty for formatting! Much easier to read ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "caihlangeles",
            "body": "It's so great to see Oda coming up with fresh ideas for the Holy Knights. Their abilities are cool as fuck and they know each other's abilities very well so it's gonna be very dangerous when they're fighting together as a unit.",
            "score": 101,
            "replies": [
                {
                    "author": "FireFistRJ",
                    "body": "Luffy needs to ask Gillingham to be his nakama. Dude's dream of having an endless supply of meat will materialize.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "Galifrey224",
                            "body": "Luffy is gonna Kidnap Gillingham.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "OutrageousCost4818",
                                    "body": "I could see that. Wacky creature that can provide you with limitless meat. That is his true dream.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "QuizMasterAsh",
                                            "body": "There was a time when Luffy told his crew his dream ( we as readers never got to read it though).\n\nMaybe this time we'll see what's Luffy's dream really is?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "QuizMasterAsh",
                                            "body": "There was a time when Luffy told his crew his dream ( we as readers never got to read it though).\n\nMaybe this time we'll see what's Luffy's dream really is?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "leolegendario",
                    "body": "I love these gimmick fights that Oda likes to do.        \nThe moment they figure out how to overcome these powers is always very satisfying.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "NetflixAndNikah",
                    "body": "The thorns seem interesting. If the only thing Sommers can do is make it harmful for others to touch you, then he could use it on himself as a Gojo style shield cant-touch-me shield.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "PixellordOverHill",
                            "body": "Nami will be thorned and Sanji will still rescue her, even though his love is so big it should be impossible and kill him, cue to Enel-facing Sommers, Sanji saying something like \"nothing can stop my love\" or some shit",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Hewlett1995",
                            "body": "I called the thorn reaction along with the love attribute a couple of weeks ago using his quote about love hurting, his sword and funnily enough his underwear, I was immediately reminded of the quote love is like a rose, which he also wears on his chest, then the part about using himself was an extension I thought of too, but I was reminded of Estarossa from the seven deadly sins",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "VenomBGR",
                            "body": "except his power is related to love... if he's fighting someone, it's unlikely they will have much love for him :D",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dream208",
                    "body": "Kaido's \"haki transcends all\" really hit the mark. How do you even fight those abilities without ability nullfier like haki?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Buzzek",
                            "body": "I mean, they're gimmick enough that they don't make the user all that powerful. Kaido's strategy would be to Bolo Breath every single God's Knight so that they'd die and their abilities would disappear lol.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Kantro18",
                                    "body": "Kaido: “strategy is for people who don’t hit hard enough”.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nateriver69",
            "body": "The theory that King Herald was getting recruited by the Holy Knight so Loki killed him might be true",
            "score": 78,
            "replies": [
                {
                    "author": "Army_Soft",
                    "body": "Each new chapter we learn that Harold wasn't as good as giants may think. Although it could be that WG just manipulated him with nice words.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "DarkKnightUchiha",
                            "body": "True",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Kaizodacoit",
                            "body": "Dude was Neville Chamberlain.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jeremiasalmeida",
                    "body": "That was an easy one right?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "badwords",
                    "body": "The national fruit the royal family possesses probably allows Emu to control them. Loki probably had to kill the king to release him from the fruit then ate the fruit when it respawned and played the villain to be chained up so he couldn't be controlled himself.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eronosuke",
            "body": "That dream materializing powers is pretty handy af lol\nYou need money? Holup lemme just dream of gold bars\nFood? No problem",
            "score": 26,
            "replies": [
                {
                    "author": "leolegendario",
                    "body": "It's funny that he can already have anything he wants, being a Celestial Dragon, but he can have things that none of the others can, just by dreaming about them.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "AegonTarg_2",
            "body": "sommers seems like a sanji villain to me",
            "score": 28,
            "replies": [
                {
                    "author": "FireFistRJ",
                    "body": "Sanji being unable to touch his beloved Nami-san and Robin-chwan, which will make his leg on fire.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Dax_Maclaine",
                            "body": "All 3 of his legs…",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "OgOnetee",
                                    "body": "Third leg style: loin spin!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ExistentialPOV",
            "body": "since loki \"hate\" everyone, he can counter thorn thorn",
            "score": 21,
            "replies": [
                {
                    "author": "wanderer_089",
                    "body": "It turns out that Loki loves everyone the most. Thorn-thorn fruit to show how much he loves his people",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Impossible-Ice129",
                            "body": "Gonna be a fairy tail laxus situation",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "MajinAkuma",
                                    "body": "Laxus: „I‘m gonna kill everyone. Fairy Law!“\n\n*nobody dies\n\nNatsu: „Turns out you see everyone here as your friend instead of an enemy.“\n\nLaxus: „NOOOOOO! I AM LAXUS! I AM LAXUS!“\n\nNatsu: „Well, you’re weakened now from that stunt. Now I‘ve got a chance.“\n\nGajeel: „Yeah, thanks to me. And not even I was affected. Except for his lightning.“",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "leolegendario",
                            "body": "That would be a cool scene and a concrete way to show to the people of Elbaph that he is not the bad guy they think he is.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Head-Ambition-5060",
                                    "body": "Media literacy is dead",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "grimtrigger77",
            "body": "Someone was actually right on Sommers having power related to roses - thorns",
            "score": 20,
            "replies": [
                {
                    "author": "leolegendario",
                    "body": "I'm one of them, see [here](https://old.reddit.com/r/OnePiece/comments/1j52fbg/one_piece_chapter_1142/mgdis5d/?context=3).",
                    "score": 10,
                    "replies": [
                        {
                            "author": "lupenReinerDiamant",
                            "body": "👑",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gokuvega33",
            "body": "If Killingham can do this, then why are the Celestial Dragons complaining about a food shortage? Just go to sleep, and Killingham uses his ability.",
            "score": 20,
            "replies": [
                {
                    "author": "akelly96",
                    "body": "I'm guessing the food must not count as real nutritionally and disappears at some point. Works fine with salt because the seasoning doesn't matter once it's in your stomach. Either that or he can't do it very well at large scale.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "leolegendario",
                    "body": "Maybe the food don't taste the same, just like with the Cook Cook Fruit or he can't do that to everyone in the Holy Land.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Adept_Crow_4159",
                    "body": "Can’t sleep on an empty stomach, I guess /s",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Hagathor1",
                    "body": "Its not a true delicacy if it doesn't shrink the endangered species list",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NetflixAndNikah",
            "body": "Y’all if Killingham has the power to manifest things out of people’s dreams then I’m pretty sure I’m the reason the chapter spoilers dropped because I was dreaming about them last night. \n\nYou’re welcome.",
            "score": 21,
            "replies": [
                {
                    "author": "unHolyKnightofBihar",
                    "body": "He will materialize the One Piece once he fights Luffy",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adept_Crow_4159",
            "body": "Man i am honestly loving Sommers and Gillingham. Now that their powers are revealed i wanna see how they use them to fight the Straw Hats. What if Gillingham’s power works on Luffy. What is Luffy’s fear? Losing his friends? No meat? Maybe Ace’s death. So hyped.",
            "score": 35,
            "replies": [
                {
                    "author": "jgames09",
                    "body": "Doesn’t even have to be a fear, but anything in their dreams. That or Sommers really fears salt for some reason",
                    "score": 23,
                    "replies": [
                        {
                            "author": "MEGA_K4SP4R",
                            "body": "All those flavours and he chose to be salty",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Adept_Crow_4159",
                            "body": "Omg yes 😂\nIt’s probably dreams in general. \n\nWell then for Luffy, it’s meat for sure.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Swaggy_Skientist",
                            "body": "He’s a devil fruit user. Stands to reason he’s terrified of the sea (salt water). He travels via portals too, so he can avoid travelling by ship on the ocean.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Macacones",
                            "body": "I guess we could call him: Sommersault!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gokuvega33",
                    "body": "All he'll get is meat cause Luffy fears nothing, and he is probably always dreaming about eating.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ThemosttrustedFries",
                            "body": "I beg the differs. He litterally ran away from BigMom multiple times but at his current strenght he no longer fear her i guess.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "leolegendario",
                    "body": "I just want to see what he can take from each of the Straw Hats minds to the real world.        \nI love the theory that he will take Kuina from Zoro's head and Germa Sanji from Sanji's.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Adept_Crow_4159",
                            "body": "https://preview.redd.it/w8zino1negpe1.jpeg?width=640&format=pjpg&auto=webp&s=367c1e58e2b78daf4453fdd422ccf850eef63c12\n\nOh i have better idea for Sanji",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "leolegendario",
                                    "body": "That would be funny. He would awaken Hell Memories Lv. 2!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rei_Gun28",
                    "body": "If it's no meat then that is pure ass. Legitimately would ruin the whole aspect of it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chopstick_chakra",
            "body": "His dad was gonna betray Elbaph to the Gorosei so Loki killed him.",
            "score": 11,
            "replies": []
        },
        {
            "author": "FireFistRJ",
            "body": "Waiting for Gillingham to joke about bringing Nika to Gunko, and then the real Nika appears after some chapters.",
            "score": 22,
            "replies": [
                {
                    "author": "UlteriorMotive66",
                    "body": "https://preview.redd.it/o9ob23frcgpe1.jpeg?width=1895&format=pjpg&auto=webp&s=1c10065843c99464fe443fbb72abdef35994ed7d",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lightecojak",
            "body": "I’ll bet you that before eating his Devil fruit, Gillingham was told that the fruit would make all of his dreams come true and didn’t realize it was meant to be taken literally.",
            "score": 9,
            "replies": []
        },
        {
            "author": "THiedldleoR",
            "body": "That holy knight interaction sounds hilarious, can't wait to see that.",
            "score": 5,
            "replies": []
        },
        {
            "author": "MajinAkuma",
            "body": "The formatting is upsetting. Every word begins with a capital letter, and there’s no punctuation.",
            "score": 6,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MajinAkuma",
                            "body": "I agree.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MiB_Fatality",
            "body": "Free my homie Loki - he’s innocent #freeloki",
            "score": 5,
            "replies": []
        },
        {
            "author": "Deadtaor33",
            "body": "Usopp is gonna dream up something that saves the day somehow. Lol",
            "score": 5,
            "replies": []
        },
        {
            "author": "hopetothefuture",
            "body": "Zoro saves the kids because he has no love for them.  Sanji gets taken as well and zoro is hit with intense pain freeing him.",
            "score": 3,
            "replies": []
        },
        {
            "author": "toilet_for_shrek",
            "body": ">The Holy Knights Are Eating In The Forest And Forget The Salt So Sommers Thinks About It Gillingham Uses His Power To Put Him To Sleep And Pulls Salt Out Of His Dream\n\n\nThese guys...",
            "score": 3,
            "replies": []
        },
        {
            "author": "North-Drag7474",
            "body": "Maybe this guy will reveal us the actual dream of our captain. Just throwing it out there",
            "score": 3,
            "replies": []
        },
        {
            "author": "SaengerDruide",
            "body": "a new interesting Devil fruit combo just dropped:\n\n on a beautiful person Boa's mero mero no mi and the thorn fruit. people love you (or even worse: are forced to), and if they manage to touch you, they hurt themselves",
            "score": 3,
            "replies": []
        },
        {
            "author": "toni_dx",
            "body": "\"The stronger the love for the target the more painful the thorns are\". Are we gonna get a \"Fk them kids\" moment from any of the cast?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Nasty-Hombre",
            "body": "Gillingham is gonna put Ussop to sleep and accidentally pulls out Sogeking",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arrikon",
            "body": "Yeah nice devil fruits you got there, but how is that shit gonna help you when Luffy punches you with a bajrang gun",
            "score": 1,
            "replies": []
        },
        {
            "author": "SPJess",
            "body": "Finally people can stfu about Blackbeard being black Nika! I totally miscalled Sommers DF but I Knew the dragon guy was the reason the kids were sleep walking. \n\nEitherway what an interesting ability. Being able to completely materialize ones dreams. Evident by the fact Sommers was able to use the Salt from his dream and enjoy it even. Sommers probably would know if it had the sort of same kind of drawback Straussen's fruit has. So this means either they dream stuff lasts until the person stops thinking about it or that Gillingham can literally create things from people's dreams.  \n\nI'm starting to think that Sommers will be a Sanji opponent. \n\nEveryone called it, Loki didn't just kill the king for no reason. It was likely out of self defense, it was likely Loki saw the King handing the children of Elbaph to the Holy Knights which was vaguely alluded to by the one connecting the thread or-- Jarul. Being alive while Mother Caramel was doing it and being present at the castle during the fight. And the fact that one of the first things Sommers talks to Shamrock is visiting Haralds grave. \n\nEither way it's gonna be interesting",
            "score": 3,
            "replies": [
                {
                    "author": "jokleman77",
                    "body": "I think it’s a combo reason the kids are walking. Gunko’s arrows are probably causing the walking part",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SPJess",
                            "body": "Yeah I forgot to mention that. I have seen a number of \"theories\" stating Gunko was the reason for them sleeping too. But yeah i remember",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "UlteriorMotive66",
            "body": "https://preview.redd.it/g6b1rfk9cgpe1.jpeg?width=1453&format=pjpg&auto=webp&s=e9fb07fc7af959aa1be7157a8eb685b604a222e7",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ghost-99x",
            "body": "So the Theory about Harald being a rat of WG and wanting to deweaponize Elbaf through making their next generation soft is slowly becoming true.",
            "score": 2,
            "replies": []
        },
        {
            "author": "farlong12234",
            "body": "OH loki is just ussop",
            "score": 2,
            "replies": [
                {
                    "author": "UlteriorMotive66",
                    "body": "Reverse Usopp? His truths become lies?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unnome14",
            "body": "So hear me out, Sommers will use his ability on sanji or zoro, one of the two will then approach the other to help him and..........………………………………will be hit by a flood of thorns and the pain will be immense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mythoss2",
            "body": "I will believe you, Loki, I will believe you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "adnaphsaka",
            "body": "u/obzeen please pin this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "leolegendario",
            "body": "[I knew](https://old.reddit.com/r/OnePiece/comments/1j52fbg/one_piece_chapter_1142/mgdis5d/?context=3) that Sommers had the Thorn Thorn Fruit and I also got it right that it was Gillingham that made the dreams into real beings.",
            "score": 2,
            "replies": [
                {
                    "author": "Muelojung",
                    "body": "like every second person on this reddit had exactly the same thought about their powers",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "UlteriorMotive66",
                    "body": "wdym you 'knew'?!\n\nhttps://preview.redd.it/u17u4yzycgpe1.jpeg?width=750&format=pjpg&auto=webp&s=968b1fe3c8f6970f64a2155a02f5afeb84cc661e",
                    "score": 1,
                    "replies": [
                        {
                            "author": "leolegendario",
                            "body": "I have Future Sight.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FrankDenif",
                    "body": "Wow, how did you guess the thorns part? You are insane",
                    "score": 1,
                    "replies": [
                        {
                            "author": "leolegendario",
                            "body": "Because of the hilt of Sommers' sword and the rose on his chest.        \nThen I connected that with what Wolf said about the giant kids.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "FrankDenif",
                                    "body": "Do you have Vegapunk's devil fruit by any chance?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SpaceOdysseus23",
            "body": "I wouldn't be surprised if Harald was the first one to perpetuate the \"Loki is a liar\" story",
            "score": 2,
            "replies": []
        },
        {
            "author": "zappy487",
            "body": "Gillingham is Sanji's opponent confirmed.\n\nHe's about to get offscreened the second he tries to pull stuff out of Sanji's mind.\n\nIt's not even going to be a fight; Sanji is just going to chase him around trying to materialize a harem.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dry_Entertainment373",
            "body": "Interesting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "leolegendario",
            "body": "So Loki did kill his father, but there is a reason for it.         \nThe theory of King Harold's dealing with the World Government is really close to be confirmed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Physical_Building749",
            "body": "Then flashback begin next chapter",
            "score": 1,
            "replies": []
        },
        {
            "author": "MEGA_K4SP4R",
            "body": "I really like Sommers' Devil Fruit ngl",
            "score": 1,
            "replies": []
        },
        {
            "author": "amitd01",
            "body": "Salt-pull beats ass-pull",
            "score": 1,
            "replies": []
        },
        {
            "author": "iggydus",
            "body": "So the theory that King Harold was evil and had contact with the government may be true. After all there was that summoning circle in the throne room and from what we've seen its fair to assume you have to be there in person to make the summoning circle.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Careful-Ad984",
            "body": "So Loki is a good guy but still a massive jerk ",
            "score": 1,
            "replies": []
        },
        {
            "author": "MEGA_K4SP4R",
            "body": "Meanwhile God Knights are having a picnic lmfaooooo\n\nThey are such goofballs I love it",
            "score": 1,
            "replies": []
        },
        {
            "author": "januarysdaughter",
            "body": "Oh look, Hajrudin has a perfectly good reason to hate Loki besides killing their father.\n\n\nPoor Hajrudin. 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "baylonedward",
            "body": "Loki is definitely not the bad guy. He is probably the reason Elbaf is not yet destroyed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MilkOk5240",
            "body": "Calling it now, Sommers will make Hajrudin a target and we will see the biggest thorns when Loki touch him",
            "score": 1,
            "replies": []
        },
        {
            "author": "TallahasseeNole",
            "body": "He’s come out and corrected the last line. It’s actually “I know you don’t believe that either.” Which changes the meaning quite a bit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "scoobynoodles",
            "body": "Why are there multiple chapter spoiler threads?",
            "score": 1,
            "replies": [
                {
                    "author": "Transmatrix",
                    "body": "When spoilers come out, multiple people rush to release them. The two on the front page right now are this one and the image version. I will be upvoting this one and downvoting the other as I prefer the text version because it can be updated.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CANYUXEL",
            "body": "He heard papa was in cahoots with the WG so he decided to off him",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaltandPepperMix",
            "body": "There has to be a limit with an OP fruit like Gillingham's. Otherwise, Imu could have just ordered him to manifest the weapons or best methods to obtain their goals (Luffy, Vivi, Shirahoshi and BB)",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_am_Bearstronaut",
            "body": "Gillingham being able to materialize objects from dreams is really interesting. Especially if someone just has to think about something prior to falling asleep. \n\nSpeaking of which, whose idea was it to make the kids think/dream about their worst fears? Could there be more than one Elbaph citizen working with the CDs? Seems like the Holy Knights already had a plan prior to invading and how convenient for the Holy Knights for the kids to already be thinking of their worst nightmares prior to the HK even showing up 🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "Luffy13531",
            "body": "Maybe Loki is not a villain after all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Goldfischglas",
            "body": "Would be a crazy twist if Loki ends up being innocent. \n\n*[Everyone already called it because Oda always does this]*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComeAlongWithTheSnor",
            "body": "Pulling stuff out of dreams sounds so weirdly specific it's either going to be very important or never get used again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "heprer",
            "body": "Gillingham’s fruit would be amazing for Nami, she could take gold from dreams, infinite wealth. also Loki is a good guy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "L7Z7Z",
            "body": "Sommers and Gillingham will get defeated by Sanji and Zoro in Elbaf, and then the Holy Knights will hire new members ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Excellent-Chain-452",
            "body": "I already want to see Loki backstory making me love him more than i do, another good design by Oda",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wolfwood28",
            "body": "I've thought this for a while. Loki is weak af and it's all bluff. The hammer is either fake like Usopp's, or is the only powerful thing about him (ie the source of haki Luffy sensed). Loki (usually trickster god) will parallel liar god Usopp & give us his character development.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sisyphus-T-Jones",
            "body": "Straw Hats racing on flying fish?! WTF happened to Ulti and Page One? They’re in danger!\n\nAlso who tf is Gerth? Do they mean Gerd?",
            "score": 1,
            "replies": []
        },
        {
            "author": "andreamusa",
            "body": "\"When someone touches his targets they are attacked by thorns. The stronger the love for the target the more painful the thorns are\"\n\n\nStrange power, connecting love and thorns, but maybe it's explained with Vegapunk's theory of Fruits born from desires: someone desired to be defended from lovers they didn't love.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RinneganUser",
            "body": "This is the one that needs to be pinned, I'm tired of seeing a picture with no effort",
            "score": 1,
            "replies": []
        },
        {
            "author": "leolegendario",
            "body": "Taking things out of dreams is a really cool ability, I hope he use it a lot in his fights.         \nSounds like something Usopp will have to counter with his mind.",
            "score": 0,
            "replies": [
                {
                    "author": "Army_Soft",
                    "body": "I wouldn't say counter with his mind, but Usopp could face his greatest fear and by overcoming that fear he would finally became brave warrior of the sea.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "leolegendario",
                            "body": "What I mean is that he could create some things in his mind that could fool Gillingham and defeat him after he take its out of Usopp's dream.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Medical_Tea_9561",
            "body": "https://preview.redd.it/lougq9b6ggpe1.jpeg?width=1542&format=pjpg&auto=webp&s=75b66717471ef784a071cd2a978d96b240e53760",
            "score": 0,
            "replies": []
        },
        {
            "author": "Maxray2",
            "body": "Sommers fruit is so random. He kidnaps people, and when somebody tries to save that person he is attacked by thorns. Strength of the thorns is proportional to the bond between kidnapped and saver. such a random fruit! what about if people attack sommer directly? what if people save the kidnapee but they have no bond? what if the revolutionary army came to save the kids? they have no love for those particular kids, so they wont be stung by the thorns? \n\nhow can anybody even dream of such a power to make it materialize as a DF?",
            "score": 0,
            "replies": [
                {
                    "author": "jyhnnox",
                    "body": "Love is pain",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "E1Grek0",
                    "body": "See, I think someone like Sommers should have a random df.\n\nLet me explain. He is a member of the God's Knights he probably already has OP strength, Haki, Durability etc. He probably already can cut a ship in half using his bare strength.\n\nBut his fruit? Now that's horrible. Essentially your allies become your worst nightmare. Imagine he fights someone who is stronger than him( which let's be honest in the whole world there is maybe 100 people stronger than a freaking God Knight, who also happens to be a celestial dragon with unlimited wealth and resources) he can't beat them BUT he can attack their closest allies, family, etc. And you can't even save them! We don't know how the fruit works but I'm assuming he can also create thorns at will and mark everything with his thorn ability, example: You are a swordsman( you obviously love your sword) he hits your sword and now guess what, thorn sword you cant wield! The fact his df works remotely( according to the spoilers) makes it one of the most OP. You have treasure, boom people try to steal it and guess what...THORNS( if you are a thief, you love money trust me.) Your wife was stolen by Sommers and you tried to help her escape, boom thorns, now you dead.\n\nLowkey his fruit is totally fitting for a World Noble tbh.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}