{
    "title": "Breeding base",
    "author": "ssobersatan",
    "subreddit": "Palworld",
    "rank": 8,
    "score": 107,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 68,
    "url": "https://i.redd.it/5lpg82ooiepe1.jpeg",
    "id": "1jdzkht",
    "selftext": "Any recommendations for improving his?",
    "comments": [
        {
            "author": "balatro-mann",
            "body": "build another floor",
            "score": 26,
            "replies": [
                {
                    "author": "PhenoMoDom",
                    "body": "Mine has 8 pens spread over 4 floors.  It's only one side of my base there.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Dreamy_Peaches",
                            "body": "That’s a lot of up and down for egg collection. Especially when you’ve got pairs of philanthropists. Fitting 10 on one floor is brag worthy. Kinda hard to do while keeping it neat.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "ssobersatan",
                                    "body": "I wish they made it so, your transporting pals could collect them for you and drop em in the incubator.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "PhenoMoDom",
                                            "body": "I would love that!  I wonder if it's possible to do the full 25 breeding pens in one base?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ssobersatan",
                                                    "body": "On an unrelated note, this idiot randomly got this rainbow trait. Both his parents had demon god and diamond body 😑\n\nhttps://preview.redd.it/fjqflde5ofpe1.png?width=1080&format=png&auto=webp&s=a46bf309aecba3226b909a73cdd23503101e7ab1",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "PhenoMoDom",
                                                            "body": "I feel your frustration.  I've had some of the best perks show up on people who will never use them.  I have some strong ass chikpis though!  And non-mount pals that can run for days!",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "ssobersatan",
                                                                    "body": "Yeah!! Nothing can't be done😑",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ssobersatan",
                                                    "body": "I managed 10 pens on one level, if you stack, I guess you can 25 easily I guess!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PhenoMoDom",
                                                            "body": "Yeah, with some pillars you could definitely make a second level.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dreamy_Peaches",
                                            "body": "a box next to it would be so nice",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PhenoMoDom",
                                    "body": "Oh, I def like his setup.  I wasn't trying to say mine is better or anything.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "PhenoMoDom",
                                    "body": "The worst thing about the up and down is that I end up accidentally activating my mounts skill when trying to land for egg collection.  A little bit of the base is outside the bounds, so I've had to rebuild a few corner pieces and stair pieces.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Accurate-End-5695",
                            "body": "You can actually stack them on top of each other. There are some videos on it. Makes gathering eggs so easy from multiple pens.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ssobersatan",
                    "body": "10's not sufficient? 👀",
                    "score": 1,
                    "replies": [
                        {
                            "author": "balatro-mann",
                            "body": "depends on what you want to do lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ssobersatan",
                                    "body": "Current goal is to get like 20 jetdragons, all with perfect passives and 4 stars.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "balatro-mann",
                                            "body": "10 should be more than enough then",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ssobersatan",
                                                    "body": "Yeah, I have already spent a lot of time working on a frostallion army, now for the dragons. That xenolord is gonna get it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PhenoMoDom",
                                                            "body": "I've been working on making my team so I'm breeding Frostallion, Frostallion Noct, Jetragon, Bastigor, Jormuntide,  as well as a few pals for different drops.  Theres another base with Vixys and Orzerks.  And I forgot what's breeding at my volcano base.  I'm playing on an ROG Ally, the basic version, so I didn't want to make one base with too much in it and cause lag.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "ssobersatan",
                                                                    "body": "I'm on a laptop man, I play on medium settings most of the time, that helps.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "woodelvezop",
                                                                    "body": "Why vixys? Are you using them in a ranch or just breeding them for fun?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PhenoMoDom",
                                                                            "body": "They're gonna go in a ranch.  I figured it can't hurt to have them digging up goodies.  And I won't have to worry about IVs for them",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "woodelvezop",
                                                                                    "body": "What do they dig up that has value besides bones? I'm not trying to throw shade or anything I'm just genuinely curious if they can dig up stuff not listed on the wikis",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JustARegularDude3",
            "body": "https://preview.redd.it/vwn12s2pkepe1.png?width=2171&format=png&auto=webp&s=915078785ae2ade478416a72e4d7af32806ff264",
            "score": 10,
            "replies": [
                {
                    "author": "ssobersatan",
                    "body": "It works????",
                    "score": 5,
                    "replies": [
                        {
                            "author": "BobGootemer",
                            "body": "Yup",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "GhenghisK",
                                    "body": "Isn't retrieving the eggs a royal pain in the ass?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "JustARegularDude3",
                                            "body": "You get used to it, I use a jet dragon to just go up and down so yeah",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "CommodoreFresh",
                                                    "body": "Croajiro or tarantriss are better for this imo.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JustARegularDude3",
                            "body": "Yup",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "g-portal",
                    "body": "Hahaha would never come to that idea :D",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "NoStatement5652",
                    "body": "How painful is it to grabs the eggs at the bottom when all the pals are there? That’s the only reason I have delayed myself from doing this. I will eventually",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Beno169",
                    "body": "Is that an Eiffel Tower?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beno169",
            "body": "https://preview.redd.it/8284feanfgpe1.png?width=400&format=png&auto=webp&s=5612d5c51a2d14da81e4d231ae49af5d390302df",
            "score": 5,
            "replies": []
        },
        {
            "author": "_Vard_",
            "body": "The breeding pens do not need to be 100% inside the circle, just their Center point, so you can scoot them further back to have more room in the middle\n\nAnd I recommend eight breeding pens, because it’s very easy to split huge stacks of cake eight ways \n\nAnd you might want a couple pals for other jobs, like powering generators, or maybe you want to keep Dr. Brawn at that base",
            "score": 3,
            "replies": []
        },
        {
            "author": "greenhawk00",
            "body": "Amateur, you need at least 3 full floors of those ;)\n\nBut honestly, if you build a base always make a foundation so you easily could add another floor to your base. I made May breeding base self sufficient with a cake/food base in the first floor and a breeding station in the 2-3 floor",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mizumii25",
            "body": "I-I.... Y-You.... What? Why?! Part of me is annoyed, part is wildly impressed, and the remaining part i question why clock facing type instead of having all of them facing the center of the base.\n\nI will for sure say that the impressed part is the strongest of them all. Honestly, this is genius though I've personally never understood the need to so many breeding stations.",
            "score": 2,
            "replies": [
                {
                    "author": "ssobersatan",
                    "body": "It's for xenolord man, that monster is not easy to beat! And as for the alignment, this was the only way I could fit so many of em within one base and I have never gone multiple stories in palworld, feels like the this games pathing never works well enough for that!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Mizumii25",
                            "body": "Geezes. I'm already terrified of fighting X e nolord! Ive only taken down Bella with random Jormuntidr Ingis",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ssobersatan",
                                    "body": "Both bellanoirs are fairly easy, the overgrown purple flame dog is fairly tough, but the xenolord is overpowered for no reason!\nBy the way, I have not even touched the  ultra slabs🤣",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "3c03s",
                                            "body": "https://preview.redd.it/io27f16kchpe1.jpeg?width=474&format=pjpg&auto=webp&s=8b30ffd5902c0d64398d1bc03d04ce8a1102e444",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dreamy_Peaches",
                    "body": "When you’re working on a couple things at once you can fill those pens easily. When I was breeding 2 perfect species for blazamut ryu ultra I had those pens filled and kept swapping.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Mizumii25",
                            "body": "Geezes! Whatd u use/breed?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dreamy_Peaches",
                                    "body": "For Ryu Ultra I had jormuntide and knocklems breeding to get perfect stats and perfect IVs. Since Ryu changes from fire to electric in phase two, you swap out the jormuntides with the ground pals to finish him. Condensing 20 of each pal type required a lot of pens. I also had Frostallions and astagons going for xenolord. Same deal, perfect breeding then condensing. I prefer to get things done quickly so the more pens the faster. When I am breeding for one perfect pal like one I will ride, I’ll still use quite a few pens for better chances and spare pens are used for breeding and grinding. I keep philanthropist pairs for things like Anubis for pal souls and mammorests for meat to make curry battle food.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": []
        },
        {
            "author": "RikkuEcRud",
            "body": "Bed type doesn't matter since Pals don't use San for breeding and they don't even leave the pen to sleep. I like to hide Straw Pal Beds in the straw piles in the Breeding Pens, since while they still won't physically use them, it keeps them hidden and out of the way.\n\nI'd also put one or two more Disassemblers, all next to each other, so if you mass breed something to butcher you can just fill one and move to the next. Pretty sure 3 is enough to refill the first by the time the last is full.\n\nI also might replace Azurmane with a Generator Pal with Transport. Collecting the ground clutter doesn't give base Pals XP, so with a Transport Pal and a chest you'll get an extra small little stream of random items.  Personally I put my breeding base at a Skill Fruit Tree so I would get Skill Fruit in the trickle of bonus loot.\n\nIt might also be good to add a Statue of Power and the Pal Dressing Facility as well, maybe make some storage at this base be where you store your Training Manuals, Training Crystals, IV fruit, Skill Fruit, Applied Technique manuals and any Pal Extracts you have. Make it so all the resources you need to push a Pal from freshly hatched to \"perfect\" are all at this one base.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Opinion-Fantastic",
            "body": "What do you do for a base or bases that make the cakes my current problem is cakes take a insane amount of time to make it particularly do to research that I'm working on kinda I'm doing planting/watering rn then kindling but for the base I currently have for breeding it's all done at the same one and working pals will eat the resources for the cakes and currently I don't have a set base specifically for salads and even then I don't know what to do cause if I make one I don't know if I would be able to make one or two and have them feed all my bases currently just the main base and the breeding one",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tharuzan001",
            "body": "Why the beds? Why the feed box? \n\nWhy the spas? \n\nWhen pals are in the breeding pens breeding, they don't need food and don't lose sanity and just sleep there. \n\nYou can even set it to max work speed at the monitoring station so they run to the breeding pen faster and start not needing to be maintained.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accurate-End-5695",
            "body": "You can stack breeding pens. Without even adding another floor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Vard_",
            "body": "Also you could hide the beds in the hay",
            "score": 1,
            "replies": []
        },
        {
            "author": "Merdapura",
            "body": "I've been converted to stacking breeding pens. A single stack can still be looted from the ground and saves up SO MUCH space",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheAlmightyDun",
            "body": "You can build the pens with like 30% of the pen outside the circle and they still function perfectly. Frees up a ton more space in the middle for incubators and can probably get another couple pens in the perimeter as well. While placing just move out until you can't place it then pull it in a tiny bit. Having the back part outside the circle doesn't inhibit their ability to function at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Equivalent_Meaning26",
            "body": "Your going to need farms so you can get milk, eggs, honey.  You will also need wheat farm and a mill.  And if you want you can add berries to the farm or make a field for that too.",
            "score": 1,
            "replies": [
                {
                    "author": "Equivalent_Meaning26",
                    "body": "Oh! And of course a food bin for the farm pals",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheOneHarman",
            "body": "You don't need spa",
            "score": 1,
            "replies": []
        },
        {
            "author": "ApricotLivid",
            "body": "Mine is a \"tower\" with 1 pen per floor and the floors are not enclosed so I tarantress hook from floor to floor",
            "score": 1,
            "replies": []
        },
        {
            "author": "prismstein",
            "body": "learn to stack\n\nalso, you don't need hot springs or beds for breeding, you can ignore the angry red words in the top right corner",
            "score": -1,
            "replies": [
                {
                    "author": "PhenoMoDom",
                    "body": "But that would be mean to the poor pals.  I find it very hard to treat them badly.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ssobersatan",
                            "body": "When they run out of food, they follow me around with their sad eyes, that shit made me remember a few things!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "prismstein",
                            "body": "aww that's so cute\n\nthe cake makes them full and SAN at 100%, and they sleep at the straw piles in the breeding pen, so you can put the green beds there and you can see them sleep on it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PhenoMoDom",
                                    "body": "I also have other pals working at the base, every one of my bases has crops, so I never have to worry about them running out of food and to help with cake production.  I like to think of Palworld as me and my pals working together as equals.  That's my headcannon at least.  It's also why I hid the pal disassembly machine from them",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "prismstein",
                                            "body": ">It's also why I hid the pal disassembly machine from them\n\nbut the blender is okay? haha  \njust teasing, I like how you think of your pals\n\n  \nAlso, if you don't know yet, food don't expire when stored in the Guild Chest. I'm feeding my oil extractor base with salads stored inside there.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PhenoMoDom",
                                                    "body": "Most of my guild storage is filled with the stuff I need to build everything.  And I have a few spaces left for future items.  But I've been doing a lot of base building and upgrading so I needed most materials to be available as soon as I put down a pal box and guild chest.   But I did know that food stayed good in the guild chest. Now that I think of it I could put the super meals that boost stats in there to save them.  I've just gotten strong enough to attack the level 55 oil rig but still have some room for growth which is why I'm breeding.  I'll need to look at food and how many food buffs can stack too.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "prismstein",
                                                            "body": "only 1 food buff active at any time",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dreamy_Peaches",
                                    "body": "Do you have electricity going for the big incubator? I also have the pal disassembly line at the breeding base that needs electricity. It’s an all in one pal making stop shop and I have an electric pal on duty who needs those things.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ssobersatan",
                                    "body": "Yeah! Cake does give me 100% SAN! But what about food? They don't need food?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ssobersatan",
                    "body": "Fair point!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ssobersatan",
                    "body": "Stack? Like vertically? No thanks! Collecting eggs is already a pain in the ass!!",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}