{
    "title": "hololive OFFICIAL CARD GAME English Version Coming in 2025!",
    "author": "hololive",
    "subreddit": "Hololive",
    "rank": 1,
    "score": 2286,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 156,
    "url": "https://i.redd.it/bslbt2t0xfke1.png",
    "id": "1iukz6z",
    "selftext": "",
    "comments": [
        {
            "author": "hololive",
            "body": "We’ve got some exciting news to share!\n\nThe **hololive OFFICIAL CARD GAME** is getting an English version, and it’s set to launch in **2025**!\n\nThe Japanese version has already been a hit, and now it’s time for TCG players and hololive fans around the world to experience the magic for themselves. Whether you’ve been waiting for this or just discovered the game, get ready to dive into the world of hololive like never before!\n\n**Follow our official X (Twitter) account for all the latest updates and announcements:**\n\n [@hololive\\_OCG\\_EN](https://x.com/hololive_OCG_EN)",
            "score": 498,
            "replies": [
                {
                    "author": "UnstoppablePhoenix",
                    "body": "LET'S FUCKING GOOOOOOOOOOO",
                    "score": 130,
                    "replies": []
                },
                {
                    "author": "Mad_Kitten",
                    "body": "NICE  \nIs there any plans for a digital version (Like Master Duel) in development?",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Twilight1234567890",
                    "body": "Your announcements are goated. I literally read it in Yagoo's voice.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Asleep_Gate_2341",
                    "body": "MBisonYes.jpg!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "stroodlepup_official",
                    "body": "YES!!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "meisterbabylon",
            "body": "I tried convincing my LGS to carry the product and hold tournaments but language was the main barrier.\n\nThis changes everything!",
            "score": 159,
            "replies": []
        },
        {
            "author": "Ocelot-95",
            "body": "It's time to...",
            "score": 138,
            "replies": [
                {
                    "author": "Far-Cheek5909",
                    "body": "JDON",
                    "score": 138,
                    "replies": [
                        {
                            "author": "sylpher250",
                            "body": "MY",
                            "score": 99,
                            "replies": [
                                {
                                    "author": "NoClimate5255",
                                    "body": "SOUL!!! *kneeling while shouting to the sky*",
                                    "score": 88,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ok_Substance5632",
                            "body": "J-J-J...JJJJJJJJJJJJJJJJJJJJ\n\n#DON!!!",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "pastadoc",
                                    "body": "Don don",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MaestroOfTime",
                            "body": "Will that be Miko's, Kaela's or Bae's attack?...",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "shash614",
                                    "body": "yes",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "circadiankruger",
                    "body": "See it go out of stock in seconds",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Local-Scroller",
            "body": "The money is being printed as we speak",
            "score": 62,
            "replies": []
        },
        {
            "author": "tturboman",
            "body": "Please print a bunch, flood the market. I don't want a Pokémon tcg situation.",
            "score": 65,
            "replies": [
                {
                    "author": "Gyossaits",
                    "body": "Not good enough. Make a digital version on Steam. Do it as Tabletop Simulator DLC if you have to.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "aznfanta",
                            "body": "Honestly, they should pull a master duel. It's probably the smoothest one, but I do want a free online pack with every physical pack like pokemon.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Nejnop",
                            "body": "There's HoloDelta already. Maybe they can make that official?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LushenZener",
                    "body": "Pokemon TCG, by and large, is USUALLY one of the more accessible TCGs. The demands amid the scalpers and collectors is just past the point of insanity.\n\nBandai TCG players know it can get so much worse.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "profdeadpool",
                            "body": "It's accessible if you buy singles, but not if you want to open packs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zilveari",
                    "body": "It's being handled by Bushiroad.  And Bushi printed the everliving CRAP out of Hololive in Weiss Schwarz.  Hololive sets have had numerous reprints in both JP and EN in Weiss.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CannonGerbil",
            "body": "OH NO MY WALLET",
            "score": 92,
            "replies": [
                {
                    "author": "Snakescipio",
                    "body": "MY FUCKING WALLET",
                    "score": 46,
                    "replies": [
                        {
                            "author": "bekiddingmei",
                            "body": "I hope you find it.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SoftCatMonster",
            "body": "Oh god they’re coming for me. They’re coming for ALL OF US.",
            "score": 42,
            "replies": []
        },
        {
            "author": "RazzleDazzle124",
            "body": "FUCK I ALREADY SPENT LIKE 300 DOLLARS ON THE JP VERSION",
            "score": 80,
            "replies": [
                {
                    "author": "Telefragg",
                    "body": "Eh, I've seen MTG players playing decks with cards in 3-5 different languages. It should be fine, this game will be played mostly by weebs anyway.",
                    "score": 72,
                    "replies": [
                        {
                            "author": "cocofan4life",
                            "body": "MTG tournament rules specifically allows any languange to be used in them.\n\nOther card games doesnt allow that usually. So you cant join in an event if you mix your cards.",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "Raagentreg",
                                    "body": "I know for Pokémon's cases it's because they have different cardbacks and weight to cards between JP/English.  \n\n(Except even then, you can't use EU language cards in USA tournaments, so even that makes no sense)",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "ms666slayer",
                                            "body": "You can use EU language cards in USA american tournaments i have done it, but you need to have the official translation at hand if someone ask you, having a direct link to the card in Yugioh DB is the best one you can do, but also having the card in english stored outside of your deck box to show when needed also works, but also that rule is almost never enfoced.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "LiveTwinReaction",
                                            "body": "For Yugioh they don't allow it just because they want you to buy the TCG sets that suck compared to the insane OCG sets that make cards super cheap. Almost every OCG card is cheap af while TCG cards almost always have a few $100 staples every set",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "ms666slayer",
                                            "body": "Also in Yu-Gi-Oh OCG cards are a little bit thickier than TCG so they can be easily tell aorta by experience players.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "groynin",
                                    "body": "I would be baffled if Hololive didn't allow Japanese cards to be used in whatever type of official play they end up having.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Shadyshade84",
                                            "body": "Like people have said, it'll likely depend on whether or not they use the exact same back, size, cardstock, etc for both releases. (There's no real reason they wouldn't, but it's not like no company has ever made random changes to a product before, so who knows?)",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "cheese61292",
                                                    "body": "To be fair to other companies; they're sometimes at the mercy of economies of scale and what local printers offer. Even normal playing cards very in composition between states in the US sometimes.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Zilveari",
                                                    "body": "It's Bushiroad, the card stock should be the exact same.  Though the quality of printing can vary between JP and EN.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LurkingMastermind09",
                    "body": "Why would you do that?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zilveari",
                    "body": "As a Bushiroad game there should be some support for JP outside of Japan, though it might not be OFFICIAL support.  Like they won't try to make it illegal to play at locals or anything.  For example many Weiss Schwarz stores allow both EN and JP cards to be played as long as they pay attention to each language's ban list.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Magicannon",
            "body": "I wonder how it'll be presented. Assuming the JP version gets another expansion, does the EN version get printed as a collection of two to three sets or will it be playing catch up?\n\nHopefully my MtG-addled mind will be able to wrap my head around the gameplay for an Ina deck at the least. I don't think I'll be able to get far with my friend group, but perhaps some LGSs in my range will support it!",
            "score": 28,
            "replies": [
                {
                    "author": "WintersLex",
                    "body": "yeah this has always been my biggest question. collated sets or time delayed?\n\nalso how will merch set promo cards work now",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Electric_Spark",
                            "body": "Bushiroad never does simultaneous releases, I would expect the English version to be about 3 months behind the JP version unless Cover decides to lean on them to catch up.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Tehbeefer",
                                    "body": "JP OCG launched last September, so that implies some kind of catchup.  Otherwise we're looking at 6-12 months behind JP (fine by me).",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "machineronii",
                    "body": "Most likely it would be like Pokemon or Yugioh were you have the EN format and the JP format who is 1-2 editions ahead of you",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Raagentreg",
                            "body": "I hate that you're probably right, the main reason I'm burnt out on Pokémon right now is because I wanna play post-rotation with all the shiny new cards that JP have.  \n\nIf they can sync up the products, that would be unbelievably GOATed.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "machineronii",
                                    "body": "The funny thing is that most likely is that I will drop Pokemon to go full HoloTCG and make a deck of each of the blue womans",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Apollo9975",
                    "body": "Go full chaos and only print cards in the language corresponding to each talent’s branch. Decks will consist of cards in English, Indonesian, and Japanese. ",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "RandomSiba",
            "body": "This is basically printing money, especially for double dipper like me....",
            "score": 20,
            "replies": []
        },
        {
            "author": "Nzash",
            "body": "I wonder how they will handle special promo cards and birthday merch promos in the future\n\n\nThe cards that already exist will not change of course but for anything released after it...",
            "score": 13,
            "replies": [
                {
                    "author": "TLKv3",
                    "body": "I imagine they'll just give the EN BDay Promos with the next Holomem's Bday Gift Sets.\n\nSo for example Reine's next set will have a new JP Bday Oshi and then the old and new Bday Oshi in English.\n\nThat way it catches EN players up by buying it and JP who buy it can get some extra EN cards as a bonus.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "jirka642",
                    "body": "Easiest would be: HoloJP -> JP cards, HoloEN -> EN cards  \nOr they could just sell two different variants of the birthday merch.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Pilot-Kon-Peki",
                            "body": "HoloEN already has JP birthday cards though. I think either they will just mix those cards into the sets, or EN version will simply not get those cards.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kreceir",
            "body": "Great News!",
            "score": 36,
            "replies": [
                {
                    "author": "KoekoReaps",
                    "body": "The Dacia Sanderro!",
                    "score": 19,
                    "replies": [
                        {
                            "author": "MadAsTheHatters",
                            "body": "r/UnexpectedJamesMay",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MoreDoor2915",
            "body": "Cant wait to be completely unable to buy them due to constantly being out of stock",
            "score": 11,
            "replies": [
                {
                    "author": "Zilveari",
                    "body": "Bushiroad doesn't do forced supply issues like Bandai.  These days they flood the market with Weiss Schwarz.  Hololive keeps getting reprints in Weiss making it easy to find product.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iHateLampSoMuch",
            "body": "Jp for collection purposes and EN for battle!!!!",
            "score": 19,
            "replies": []
        },
        {
            "author": "dcdfvr",
            "body": "now the real question is will the special promo cards from merch now be in EN as well since i would love to use those cards",
            "score": 7,
            "replies": []
        },
        {
            "author": "Questionable_bowel",
            "body": "HELL YEAH BABY, LEARNING SOME COMBOS AND COMBINATIONS HOPING IT WILL GO ENGLISH SOON WAS NOT IN VAIN!",
            "score": 6,
            "replies": []
        },
        {
            "author": "TheDotAGuy15",
            "body": "So I’m assuming this will be previewed and prereleased at AX, kinda like the Weiss Schwarz HOL sets. That would be hype!",
            "score": 5,
            "replies": []
        },
        {
            "author": "protomanbot",
            "body": "Is the interest in the cards mostly as collectibles or from people who actually play with it?",
            "score": 3,
            "replies": [
                {
                    "author": "matlarcost",
                    "body": "It is an actual game rather than just a collectible. There has apparently been relatively large tournaments in Japan. Whether it builds a niche outside of Japan, we would have to see.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "ms666slayer",
                            "body": "Also we need to be exceptical with the JP succes,. not because there aren't big tournaments but more on the we don't know if this is just the initial hype number and then it will die out like a lot of games, i remember that Kaijudo was really big at the beggining and then died which it concided when they aded rotation to the game, lets see if the game survives the 2 year curse.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thevictor390",
                    "body": "A question I asked myself a lot as what felt like the only 10 year old in my area who actually wanted to play with Pokemon cards in the 90s.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cocofan4life",
                    "body": "The game is okay but i mainly collect for now",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Tehbeefer",
                    "body": "I'm guessing collectibles, but most of the whales will also play. It sounds like they've put at least some effort into making it a fun playable game.\n\nAnd you can bet this means a steady scene of people playing at conventions too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Anagittigana",
            "body": "Wow! Huge!",
            "score": 3,
            "replies": []
        },
        {
            "author": "SuperSoaker300",
            "body": "Honestly, I want to like the game but I can't get into it. Will probably keep collecting it.  \n  \nFor people curious about the game, it shares a lot of similarities with the Pokemon TCG. If you enjoy that, you'll probably enjoy this too.",
            "score": 4,
            "replies": [
                {
                    "author": "cheery-cheesecake",
                    "body": "Ah, this is what I was wondering. Might buy some for collecting purposes, but if it's like Pokemon they'd have to pay me to play it. ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Helmite",
            "body": "Nice. Was wondering when the news on this would drop.",
            "score": 10,
            "replies": []
        },
        {
            "author": "GuardianLettuce",
            "body": "Now we wait for the day and month. Unless it drops tomorrow...?",
            "score": 3,
            "replies": []
        },
        {
            "author": "QuantumDrill",
            "body": "Looks at my JP booster pack box. Good thing I stopped at the one box.",
            "score": 3,
            "replies": []
        },
        {
            "author": "IzacLocke",
            "body": "Hopefully they try to catch us up to the Japanese version.  I'll likely buy stuff anyways but it really does suck being several months behind any Japanese game I get into.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LordVatek",
            "body": "Between Final Fantasy MtG, the Gundam Card Game, and this, I am going to be wasting a lot of money on cardboard this year.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Senorpapell",
            "body": "Wooooooo",
            "score": 2,
            "replies": []
        },
        {
            "author": "CaiusLightning",
            "body": "“Nooo!!!!!”. You hear that it’s the sound of my wallet crying out in fear, as if it’s about to be smothered.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fearless-Sea996",
            "body": "NO MY FUCKIN WALLET PLEASE",
            "score": 2,
            "replies": []
        },
        {
            "author": "loki_magikill",
            "body": "This is the first time I'm willing to invest into a TCG",
            "score": 2,
            "replies": []
        },
        {
            "author": "Important_Year4583",
            "body": "As a former MTG player who escaped that hellhole years ago, this angers me\n\n\\*Unzips wallet\\*",
            "score": 2,
            "replies": []
        },
        {
            "author": "Goukenslay",
            "body": "Welp i already bought a bunch of them in JP",
            "score": 2,
            "replies": []
        },
        {
            "author": "Suzuru",
            "body": "If Jdon my soul make it way into the TCG...",
            "score": 2,
            "replies": []
        },
        {
            "author": "almozayaf",
            "body": "It time to d-d-d-duuuuuoool",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThatGuyYouMightNo",
            "body": "I wonder, depending on when this is released, if any EN members (specifically FuwaMoco) who are getting exclusive cards made for merch sets will get their cards changed to English instead of Japanese.",
            "score": 2,
            "replies": []
        },
        {
            "author": "IJustReadEverything",
            "body": "Guess I gotta learn how to play. Or should I just keep waiting to see if they make a game/app like Master Duel?",
            "score": 1,
            "replies": [
                {
                    "author": "thevictor390",
                    "body": "I would not hold your breath on an app, that would be cool but there is zero sign of that happening right now so even if it does, it would be really far off",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sainou",
            "body": "Man I am about to make a bad financial decicion when this comes out...",
            "score": 1,
            "replies": []
        },
        {
            "author": "VerkanoVanos",
            "body": "Byby money",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlveinFencer",
            "body": "Excellent news.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WinLoseRatio",
            "body": "Awesome news!\nTried it with a few friends and had a lot of fun",
            "score": 1,
            "replies": []
        },
        {
            "author": "Meep_starsky_104",
            "body": "I hope i’m fast enough to get it, it goes out of stock so quick most of the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zyx-Wvu",
            "body": "Ah yes, the original gacha.\n\nCardboard Crack.",
            "score": 1,
            "replies": []
        },
        {
            "author": "APatheticPoetic",
            "body": "Man they're about to print a whole other Yagoomillion dollars and have to revise their year's projections...  Again...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deyotaku",
            "body": "Yippee!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChaosBreakerKai",
            "body": "YEAAAAAAAA",
            "score": 1,
            "replies": []
        },
        {
            "author": "DradelLait",
            "body": "I don't know about the cards but if they're affordable I'll probably at least get some sleeves",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lies_Under",
            "body": "My wallet will never recover from this",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaiKageRyu",
            "body": "Woohoo Money goes brrr!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hydra_Tyrant",
            "body": "Oh no....my poor wallet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mkotosan",
            "body": "Hope there's enough stock to handle demand",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ember-Neo",
            "body": "LETS BEEPING GOOOOOOOOOOOOOO!!!!!!\n\n\nTime to start saving money to buy a box when it releases here in SEA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flying-Lion-Dude",
            "body": "Oh nice! Now I'll now what the cards do :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "YuzuKaZe",
            "body": "Reading about English release: let's gooo that's what we are waiting for\nReading how it's distributed: oh NVM",
            "score": 1,
            "replies": []
        },
        {
            "author": "PowerlinxJetfire",
            "body": "My body is ready\n\nMy wallet is not",
            "score": 1,
            "replies": []
        },
        {
            "author": "cmalfet",
            "body": "YA\n\nBE\n\nAnd here I thought it would be closer to 2026 before they started in English, though 2025 could still be the end of the year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "icedlatte_3",
            "body": "There goes my plans to save up for retirement",
            "score": 1,
            "replies": []
        },
        {
            "author": "MisterRai",
            "body": "Let's gooooo",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ewhaz",
            "body": "Great... Verily",
            "score": 1,
            "replies": []
        },
        {
            "author": "SufficientSong263",
            "body": "For the love of my wallet, please realese at the end of the year, June/July is already killing me with the Gundam release and the Final Fantasy Magic Set.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Korben_Kairans",
            "body": "Man... Having no way to purcashe the merch does hurt sometimes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Genos_Senpai",
            "body": "Oh god now I need to gamble for the English signed Suisei card to complete the collection 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "OliverPeregrine",
            "body": "YIPEEEEEE!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForteEXEMaster",
            "body": "Please scalpers stay away",
            "score": 1,
            "replies": []
        },
        {
            "author": "xShotgunWitch",
            "body": "ah yes i cant wait for it to be completely scalped off the shelves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarklyDreamingEva",
            "body": "Was there a mention to which quarter of 2025 it’ll arrive in?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leeroy42",
            "body": "I already play MTG and Pokémon. My wallet is crying rn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CapeMike",
            "body": "As long as they'll be available in most comic stores, I'll go in for some cards..if only to enjoy the artwork!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tehbeefer",
            "body": "Oh, this year even, nice!!  I guess I'd better start budgeting for it...",
            "score": 1,
            "replies": []
        },
        {
            "author": "redditfanfan00",
            "body": "great news!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Speederkyle",
            "body": "Mobile card game game or an actual card game with real cards only?",
            "score": 1,
            "replies": [
                {
                    "author": "GHitoshura",
                    "body": "Physical TCG, already been out in Japan for some months",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "avocadorancher",
            "body": "Yes!! Hopefully they do a large run so they’re widely available. I still can’t get the JP cards shipped to Canada for a decent price.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Opening_Teaching_997",
            "body": "However much you plan to print, double it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clavilenyo",
            "body": "Yeah, I spend 200 euro on that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eiruyz",
            "body": "Finally!! Promise Deck let's goo",
            "score": 1,
            "replies": []
        },
        {
            "author": "CirculaPhobia",
            "body": "YIPPEE!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SilverScribe15",
            "body": "Feels like theres a dozen different vtuber card games in the works these days.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Demonologist013",
            "body": "I was already thinking about quitting mtg I wonder if it has a draft format",
            "score": 1,
            "replies": []
        },
        {
            "author": "RafitaG22_",
            "body": "Nooooo my poor wallet cant take it anymore",
            "score": 1,
            "replies": []
        },
        {
            "author": "GHitoshura",
            "body": "I'm happy but I just know this is going to be expensive as all hell where I live",
            "score": 1,
            "replies": []
        },
        {
            "author": "Akagi20",
            "body": "Gotta build my Nerissa deck",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Firefighter-1416",
            "body": "Haven't been serious about any TCG in like a decade but now with all the Yugioh streams and then this I guess Hololive is bringing me back in",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ecthelion30",
            "body": "Finaly we get a confirmation!!! I was so tempted to buy the JP version , but now ill wait a bit more! Sorry wallet, you are going to suffer !\n\n\n\n\nI MUST HAVE THE SUISEI SIGNED CARD",
            "score": 1,
            "replies": []
        },
        {
            "author": "alphonse03",
            "body": "Hope the prices are about the same than the JP ones. I might get a box or two of booster packs depending on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "projectmars",
            "body": "My Wallet...",
            "score": 1,
            "replies": []
        },
        {
            "author": "CamKoudo",
            "body": "OH HECK YEAH!!!!!! FINALLY THE REST OF US GET TO JOIN THE FUN!!! 🙌🙌🙌🙌",
            "score": 1,
            "replies": []
        },
        {
            "author": "D4NG3RD34N",
            "body": "I'm gonna get them and do a eulogy for my wallet",
            "score": 1,
            "replies": []
        },
        {
            "author": "Enohpiris",
            "body": "Finally!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Justa_dude_dude",
            "body": "Where can we preorder the product from?",
            "score": 1,
            "replies": [
                {
                    "author": "KiritoOtaku023",
                    "body": "Lumius\n\nhttps://lumiusinc.com/collections/new-arrivals/products/pre-order-hololive-official-card-game-starter-cheer-set-english-edition-trial-deck",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Justa_dude_dude",
                            "body": "Thanks, I’m not familiar with trial decks? I ordered 2 though! Do they make anything similar to booster boxes like Pokemon or battle decks/collector boxes like Magic? Or is this it?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KiritoOtaku023",
                                    "body": "I believe that they do - but I don’t think they have them in stock quite yet. As soon as they add get them in stock I’m sure they will post them! If you take a look at the Japanese version that’s been out for a while - it will give you a roadmap for what is coming. I think all English decks and boosters are about 6 months behind the Japanese sets.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Justa_dude_dude",
                                            "body": "Ok thanks for the help, appreciate it!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "KiritoOtaku023",
                                    "body": "When I say “in stock” I mean that the booster boxes are not yet available for pre-order.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "doublen1010",
            "body": "I have a question. Will the game be able to download on Android and iOS in the future?",
            "score": 1,
            "replies": [
                {
                    "author": "Zeslodonisch",
                    "body": "The game's not even an OCG to begin with.\nWe're probably not seeing an online version for quite some time. That is *if* we're even getting one",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sidescrollerdef",
            "body": "I'll have to study up for the judge exam.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zaerick-TM",
            "body": "Fuck my wallet...",
            "score": 1,
            "replies": []
        },
        {
            "author": "koru-id",
            "body": "I don’t usually play card game but it’s going to be hard to resist this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zilveari",
            "body": "I think I'll stick to Weiss Schwarz with my Suisei waifu deck, Shuba waifu deck, CapSule  (Suisei/Calli) deck, Calli Gura deck, etc lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "KiritoOtaku023",
            "body": "Already pre-ordered mine from Lumius!",
            "score": 1,
            "replies": []
        },
        {
            "author": "goldfirestorm3",
            "body": "Despite that, I'll keep sticking with the JP version. As always",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoNotAskForIt",
            "body": "Wake me up when we get a Stars expansion in 2027.",
            "score": 0,
            "replies": []
        }
    ]
}