{
    "title": "Fuwamoco going on hiatus \"for a bit\"",
    "author": "PseudoRandomPerson",
    "subreddit": "Hololive",
    "rank": 12,
    "score": 2870,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 82,
    "url": "https://x.com/fuwamoco_en/status/1901855598960103581",
    "id": "1je0tn2",
    "selftext": "",
    "comments": [
        {
            "author": "Zipperumpazoo",
            "body": "The illness came really at an unfortunate time, they had so much to do the last week before the break\n\nFortunately they managed to release [that beatiful cover in english](https://youtu.be/NEhHCVaXoDU?si=m0h3o_bm1kvnUI5w) and we got the adorable [Mococo Vs door](https://www.youtube.com/live/Sxx4UW3XKnc?si=NtI9t5E8OYMuyHl2) solo stream\n\nBau bau",
            "score": 542,
            "replies": [
                {
                    "author": "avelineaurora",
                    "body": "Why are you suggesting illness? They're doing irl things.",
                    "score": -49,
                    "replies": [
                        {
                            "author": "KusozakoPrime",
                            "body": "I think they meant them needing to take time off this past week because of them being sick.",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "Zipperumpazoo",
                            "body": "They got sick right after the fes and had to cancel the whole last week schedule which was right before this break",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "avelineaurora",
                                    "body": "Ahhh, TIL.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PseudoRandomPerson",
            "body": "Sounds like they have IRL stuff that needs doing:\n\n> We’re going to be away in the Makai for a bit to take care of important demon dog duties! 🐾 We wish it didn’t have to be right now, but this is the only time we can get these important tasks done… 💦\n\n> We’ll be back + ready for some serious fun soon!! BAU BAUー！！🐾🩵🩷",
            "score": 1372,
            "replies": [
                {
                    "author": "Fabulous_Ad_9111",
                    "body": "Why are their phrasing just so adorable?",
                    "score": 515,
                    "replies": [
                        {
                            "author": "PandaGrill",
                            "body": "They are Fuwamoco, being adorable is just in their nature",
                            "score": 412,
                            "replies": []
                        },
                        {
                            "author": "IRefuseThisNonsense",
                            "body": "They live and breathe the kayfabe. \n\nIn fact...have they ever broken kayfabe?! Are the Bau Baus the Undertaker of Hololive maintaining kayfabe?! Someone quick! Draw them as gremlins standing on each other's shoulders wearing the Undertaker's coat and hat.",
                            "score": 220,
                            "replies": [
                                {
                                    "author": "megadongs",
                                    "body": "Early on Mococo was telling a story about when Fuwawa saw a cute dog IRL and started bau bau-ing at it, and Mococo said to cut it out before they get exposed. As far as I know this is the only admission that they aren't actually demon dogs who say \"bau bau\" normally.",
                                    "score": 118,
                                    "replies": []
                                },
                                {
                                    "author": "DoNotAskForIt",
                                    "body": "But which members of the shield would each be?",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "_Pyxyty",
                                            "body": "I'm not sure but all I know is Bijou is Seth Rollins whacking one of 'em in the back with a chair",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "NebbyOutOfTheBag",
                                                    "body": "Fairly certain this means that Rissa is Reigns and Shiori is Ambrose.\n\nThe Bau Baus can be the logo.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "zeel2314",
                                    "body": "Other than the Bau Baus, Liz also does a good job keeping up kayfabe, and so does CC. but Fuwamoco does such a good job with their characters you would expect them to be that way irl too.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "JediGuyB",
                                    "body": "It's interesting how they really keep the persona most all the time  when pretty much the rest of EN is like \"Oh yeah, I'm a X\" as if they forgot for a second when telling an experience or something.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Hp22h",
                                            "body": "Yeah, it's real noticeable for EN cause of how much thought was put into the 'lore'. Like Council's debut had multiple PVs and a Cube, hyping them up as world-altering gods, all to showcase 5 of the dorkiest girls we'd seen yet.\n\nNotably, they scaled back for Advent and Justice. I imagine even FuwaMoco would have been hard pressed to kayfabe twin gods or something.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "JediGuyB",
                                                    "body": "It makes sense. Some lore is good to have, but not point in doing all this deep cut lore stuff only for the girls to be just a group of cute goofy goobers where the most common \"lore\" stuff is them being like \"back when I was 10, uh, 10,000 years old...\"",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "DaFatGuy123",
                                                    "body": "Tbf, that lore got us some of the greatest fanworks we’ve seen yet, like Myth bad ending",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TianDogg",
                                    "body": "Are they gonna have an \"American Badass\" phase?",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "IRefuseThisNonsense",
                                            "body": "American Baubauss",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Orthien",
                                    "body": "As far as I know they have never broken it to the point where I wonder if they sometimes forget to use their secret identity voices when alone.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "x_Advent_Cirno_x",
                            "body": "They are adorableness incarnate. Loveable most supreme. The final shape of cuteness",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "terrexchia",
                                    "body": "I knew it, their cuteness is paracausal",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "International_Map812",
                    "body": "My Touhou rotted brain is wondering if they are familiar with the PC98 era",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Tehbeefer",
                            "body": "The answer is yes, give me a few minutes.\n\nedit: https://www.youtube.com/live/IXO0rnPggDo?feature=shared&t=3490\n\nI don't think they have one, but I seem to remember them talking about the graphics before? IDK about Touhou specifically, but you can bet they **at least** know touhou 1-5 exist on it.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Swiindle",
                                    "body": "That's seriously impressive that you can find the exact quote from a 2 hour stream 5 months ago...",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Tehbeefer",
                                            "body": "I just looked on Twitter and saw [a screencap](https://x.com/tres_imas/status/1844360984829493288) of the Patra collab, + timestamp in the comments. Magic!",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "SuperSpy-",
                                                    "body": "Timestampers are one of the unsung heroes of this community.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nickname10707173",
            "body": "Ruffians would feel like it has been 10 years after Fuwamoco comes back for a week of absent.",
            "score": 258,
            "replies": [
                {
                    "author": "Ok_Substance5632",
                    "body": "Just to be sure\n\nThe 10 years are in human years",
                    "score": 80,
                    "replies": []
                },
                {
                    "author": "5urr3aL",
                    "body": "Now they shall know how Pebbles felt",
                    "score": 23,
                    "replies": [
                        {
                            "author": "NebbyOutOfTheBag",
                            "body": "And the Saplings before them.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "MagnusBaechus",
                            "body": "that one clipper playing biboo\"s brainrot song for the entire duration of biboo\"s absence was a beacon to pebbles in their time of hardship",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DrPibIsBack",
                    "body": "Average dog experience.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "mrgmzc",
                    "body": "I miss them the moment the stream ends",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "angelicclock",
                    "body": "Like that time takodachis turned into dried octopus strips due to weeks of Ina’s absence.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Recidivous",
            "body": "Frankly, I think most talents should consider going on vacation after Fes anyway before things start picking up again.",
            "score": 747,
            "replies": [
                {
                    "author": "HPWiz",
                    "body": "Just to clarify, FUWAMOCO mentioned that this is [not a vacation](https://www.youtube.com/live/Sxx4UW3XKnc?t=10900), they'll be busy with other obligations.",
                    "score": 269,
                    "replies": [
                        {
                            "author": "triforce777",
                            "body": "Realistically they have some sort of minor family obligation but it's funnier to imagine its like they have to testify in court",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Astral-Wind",
                                    "body": "The real reason Baelz hasn’t done any ace attorney recently.",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "SoylentVerdigris",
                                    "body": "My money would be on visa renewal. If they're not permanent residents of Japan, they'll have to go home periodically to renew.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "shiawase198",
                                            "body": "If they're just renewing their visa, I don't think they need to leave the country. I think they would only need to do that if they were initially on a tourist visa which they weren't.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "undercoveryankee",
                                                    "body": "My rule of thumb is “the immigration process is always going to demand more from you than you think”. I wouldn’t be surprised at all if renewing a one-year work visa counts as a status change that needs a consulate trip.",
                                                    "score": 10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SoylentVerdigris",
                                                    "body": "I've followed a surprising number of people living in a different country on a work visa, even before Hololive existed and many of them had to take a couple weeks every year or every few years to go home and renew visas.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PearMcGore",
                    "body": "Timesmith living their life...",
                    "score": 378,
                    "replies": [
                        {
                            "author": "MadAsTheHatters",
                            "body": "Mane-chan: You have all the time in the world to go on holiday \n\nKaela, grabbing Kronii: _Got it_",
                            "score": 266,
                            "replies": []
                        },
                        {
                            "author": "Recidivous",
                            "body": "Their honeymoon is going strong before having to return to take care of their kid (Biboo)",
                            "score": 143,
                            "replies": [
                                {
                                    "author": "TehAsianator",
                                    "body": "Now does dad still have partial biboo custody, or has full custody transferred to timesmith?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NakedWokePeople",
                            "body": "Random Tangent: I just love that pairing name. *Timesmith.* I keep picturing this high fantasy deity hammering away at \"the timeline,\" each hit extending it and expanding into other branches.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Hp22h",
                                    "body": "Now I'm picturing Kaela smacking Kronii til her legs get longer.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Chukonoku",
                            "body": "Kaela's manager been able to sleep for once.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Hp22h",
                            "body": "Honeymoon in Bali..!",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ShogunHaruki19",
                    "body": "Yeah... they needed the rest",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "crunxzu",
                    "body": "With all the sickness going around I was thinking Cover should just make it a “holiday”. Open the door for reruns or zatsu streams for those that wanna yap about the events while giving some room for those that are sick or burned out (looking at you Ms Mori Calliope) and/or just time to hang out with their friends",
                    "score": 43,
                    "replies": [
                        {
                            "author": "bombader",
                            "body": "The members themselves don't have to stream if they don't want to, and its not where most of the Holo veterans get their money either. If they had to stream, Gura would be streaming more.\n\nThe stuff that's hard to reschedule or cancel is likely the actual money makers, that requires recordings or coordination that costs money if the date is pushed or canceled.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "Tehbeefer",
                                    "body": "I just want to mention this because I've seen this view mentioned several times in the past few days, but superchats are [absolutely](https://www.youtube.com/live/T7wTpydoZyM?feature=shared&t=440) a major source of income for many/most *members* (not Cover, Cover has done an excellent job of diversifying it's revenue as seen from the quarterly reports).\n\nAgreed 100% re: members needing to stream.  Once a member has debuted, there's zero incentive to mandate some sort of streaming quota, the IP assets are de facto locked to a particular contractor. So brand loyalty trumps content output, especially with streaming ad revenue being an afterthought.\n\n> stuff that's hard to reschedule\n\nThis also has cascading effects, not only do we not want to irritate the sponsors, but rescheduling for later pushes something *else* out of the schedule, which also needs to be rescheduled and ticks off someone else, etc. etc. etc. Huge pain, hence why they push themselves so hard to stay on schedule, even why they shouldn't.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "protomanbot",
                                            "body": "I think it was Bae who mentioned recently (in her post fes zatsu?) when asked what's the best way to support them, she mentioned memberships and merch. When asked about super chats she went silent for a second before just saying that all support is appreciated, even just being there.\n\nI guess like Kiara says it's a big it depends. I think memberships have been mentioned elsewhere as the most steady source. I'm surprised Kiara was so candid there, Bae backtracked pretty fast when she realized what she was saying.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TehAsianator",
                            "body": "Deadbeats are the only ones saying to our oshi, \"Please, for the love of god, take a damn hiatus.  We'll still be here in a month or two.\"",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Chukonoku",
                            "body": "The problem is almost always the actual talents wanting to take a break.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chaoswind2",
                    "body": "I think they should coordinate vacation times to happen in groups so holes can be more easily plugged... Holo can't keep counting on Biboo to be a stream machine, at one point or another she will have to take a rest and there will be a need for others to cover the void otherwise people will break off the habit of looking up Holo streams during their down time. ",
                    "score": -8,
                    "replies": [
                        {
                            "author": "saynay",
                            "body": "This one is not a vacation. Sounded more like a family obligation, and possibly not a happy one (although, that might have just been them being unhappy they could not not stream for a week or so).",
                            "score": 32,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aradraugfea",
            "body": "Awww, I’ll miss them, and just when FWMC morning was supposed to start back up.\n\nHope they’re feeling better and have a good break.\n\nAlso, who does the art for these updates?  It’s cute as hell.",
            "score": 53,
            "replies": [
                {
                    "author": "HPWiz",
                    "body": "Mococo is feeling a bit better now but she's also still a bit sick. Fuwawa though was hit a lot harder with sickness and [her voice still hasn't recovered](https://www.youtube.com/live/Sxx4UW3XKnc?t=10818)... And as I mentioned in another comment this sadly won't really be a break or vacation for them, they'll still be busy with things. Hopefully the two of them will be fully recovered soon.\n\nAs for the art, it was drawn by 냥묘(snowmya) ([Twitter Link](https://twitter.com/nyangnyang3580), [Pixiv Link](https://www.pixiv.net/en/users/14457681)) for when they moved to Japan last year. Here are the original [Twitter](https://twitter.com/nyangnyang3580/status/1763998127814857028) and [Pixiv](https://www.pixiv.net/en/artworks/116572034) links for the artwork.",
                    "score": 30,
                    "replies": []
                }
            ]
        },
        {
            "author": "wikowiko33",
            "body": "Im more surprised more holomems havent gone on break as they usually do after fes. \n\nMococo needs to spend some time alone after today's stream.",
            "score": 50,
            "replies": []
        },
        {
            "author": "SidorioExile",
            "body": "Demon doggos gotta do them taxes 🤓",
            "score": 24,
            "replies": []
        },
        {
            "author": "shade0180",
            "body": "Makai is underworld so they basically went home. Important duties might involve their parent/grandparents. or family so yea they're probably on vacation.",
            "score": 49,
            "replies": [
                {
                    "author": "lumine99",
                    "body": "Yeah, my first thoughts would be either visa, taxes, or family.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "Fun-Incident-8238",
                            "body": "Probably visa, need to extend it there which will probably last 3-5 years",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Ralod",
                                    "body": "My thinking as well. Japan is very strict about the visa situation. Look at what happened to Ina back in december.",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "Aurigarion",
                                    "body": "This is a common misconception, but you can apply for a visa extension while staying in Japan. You don't *need* to go home to do that. (Technically the Japan-Makai visa treaty could be different but that's unlikely.)\n\nIna doesn't live there, so she needs to pre-apply for a short-term working visa before she goes. The twins are there on a longer-term visa, which can be extended by visiting the immigration office and submitting some paperwork.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "overkill373",
            "body": "Damn that solo horror stream really got to mococo",
            "score": 29,
            "replies": [
                {
                    "author": "zeel2314",
                    "body": "She's travelling to Rome to hire an experienced priest",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Windfade",
            "body": "Can't marry your sibling in Japan, ya know.",
            "score": 69,
            "replies": [
                {
                    "author": "RedTygershark",
                    "body": "*Fuwawa will remember this...*",
                    "score": 43,
                    "replies": []
                }
            ]
        },
        {
            "author": "gadman85",
            "body": "I hope they'll be okay and get it finished quickly.",
            "score": 27,
            "replies": []
        },
        {
            "author": "-Drunken_Jedi-",
            "body": "Those girls deserve a rest. I’m not up to date at all with hololive happenings now but those girls have been running at 110% since they debuted. They deserve some rest 🥰",
            "score": 8,
            "replies": []
        },
        {
            "author": "UsurpDz",
            "body": "What is Makai?",
            "score": 4,
            "replies": [
                {
                    "author": "Whooshless",
                    "body": "Short answer: Underworld.\n\nLong answer: They're supposed to be Cerberus (Fuwawa, Mococo, and Pero as the three heads of the dog) guarding the entrance to Hades. They translate that to Japanese as \"makai no banken\" or \"watchdogs of the demon world\", so makai could be any of: Demon World, Underworld, Hell, Hades.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Tehbeefer",
                    "body": "It's the place where demon-guard dogs (like FUWAMOCO) come from.  From my understanding, you can think of it like a fantasy plane of existence.*\n\n*[Jisho](https://jisho.org/search/makai) translates it as \"demon world\", but maybe be wary of viewing that translation through the lens of Abrahimic religious traditions.  AFAIK it's not really seen that way in Japan, and the former perspective seems to be how \"Makai\" is used in Japanes pop culture works [like Touhou.](https://en.touhouwiki.net/wiki/Makai)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SelfDepricator",
            "body": "Damn dog catches making trouble for our lovable demon dogs!",
            "score": 2,
            "replies": []
        },
        {
            "author": "redditfanfan00",
            "body": "hope fuwamoco will be alright!",
            "score": 1,
            "replies": []
        },
        {
            "author": "a_modal_citizen",
            "body": "Hopefully their tasks don't run them too ragged after just being sick.  Ganbatte, bau baus!",
            "score": 1,
            "replies": []
        }
    ]
}