{
    "title": "The stage is her Domain after all (๑╹ᆺ╹)ぬんぬん",
    "author": "tanvoltz",
    "subreddit": "Hololive",
    "rank": 13,
    "score": 2294,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 41,
    "url": "https://i.redd.it/do0ipitgbfpe1.png",
    "id": "1je1mnq",
    "selftext": "",
    "comments": [
        {
            "author": "tanvoltz",
            "body": "Watching Sora's performance is quite dangerous it seems ( ´•д•\\` ) \n\nAccording to [Sora](https://www.youtube.com/watch?v=PR0QJ3bTRfc) after the concert, she saw some Female Hololive fans refer to her as \"Tatan Gari no Sora\" which according to some translations I have seen \" Tatan Gari\" means an idol who deliberately steals fans from other idols, usually in the same group.\n\nSora who wasn't the most in tune with the slang was quite surprised and scared by the new nickname she had just acquired. \n\nBut Sora's performance just hits differently, she quite literally is a different beast whenever she performs on stage. Her concert director told her that Sora has a different aura to her that has the ability to draw people in and that she is the best at making the people who are watching fall for her when she performs on stage. \n\nBut if you don't believe him and think he is biased look no further than [Suisei ](https://www.youtube.com/watch?v=_HG86Y5t19Y)who straight up just gasses up Sora's Fes performance event calling Sora the Final Boss, and saying that only Sora can elevate a song that on a technical level is lower on the emotional scale, to go above and beyond and make you feel the Orthodox  Idol energy. \n\nSo if you haven't seen Sora perform on stage yet, I highly recommend giving it a look and Join us\n\nBecome one with the Soratomo (๑╹ᆺ╹๑)ぬんぬん",
            "score": 461,
            "replies": [
                {
                    "author": "IncompetentPolitican",
                    "body": "Maybe its because I am not so deep into the \"idol Culture\" but that Nickname sounds kinda rude. Sure its a compliment but the \"deliberately \" makes it rude.",
                    "score": 219,
                    "replies": [
                        {
                            "author": "Morenauer",
                            "body": "Yeah, it rubbed me the wrong way, but I'm sure it's me that is not getting the joke, tbh.",
                            "score": 130,
                            "replies": [
                                {
                                    "author": "tanvoltz",
                                    "body": "Don’t worry you’re not the only one, according to what I have researched the term was originally used by female fans of a boy idol group (hence why female fans are using it) \n\nBut the term is niche/some people might have not heard it because a lot of fans also think it’s pretty rude to say so it’s not use often",
                                    "score": 120,
                                    "replies": [
                                        {
                                            "author": "PumpJack_McGee",
                                            "body": "Yeah, I wouldn't take these terms too seriously. That's slang, after all.\n\nWhen we say someone's \"killing it\", or \"slaying\", we don't mean they're actually committing murder. \"Bitch\" is usually an insult, but that's instantly flipped if precluded with a \"Yass\".",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "AnnonymousRedditor28",
                                    "body": "I think what they are saying is that Sora has a stage presence that gets everyone to have all eyes on her (albeit, they put it in a not so eloquent way in my opinion).\n\nWhich if they meant it as a compliment and not as an insult, they are certainly correct.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Morenauer",
                                            "body": "I imagine it is so, yes.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fishman465",
                    "body": "That makes her gains sound so undeserved, which is anything but the case. I'm glad to hear it happen as typically people notice flashy things or stunts over solid performances >!(This is why I don't hold my breath on HoloFes gaining Aki any subs)!<\n\nOn Holo*27, Sora's rendition of I think Ai Kobato IV had my heart racing. That performance has me give Extra stages a chance despite seeming popularity affairs.\n\nSora sings with her heart, even with as many songs as she makes, which is something as heart/soul is something that is typically spread thin in such a case.\n\nI wonder how many of Suisei's fans would listen.\n\nI would say there isn't any intentional fan stealing in Hololive.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "tanvoltz",
                            "body": "Yeah Soda wasn’t the biggest fan of the nickname either so it’s probably not gonna stick around. \n\nSora wouldn’t really like the idea of stealing fans either, in fact she actively encourages her fans to go and support everyone, which is very nice of her.\n\nSora’s performance in a live concert setting has always been captivating, she just naturally knows how to work up the crowd.",
                            "score": 40,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AnnonymousRedditor28",
                    "body": "Assuming those female fans aren't just being rude to the OG (A-Chan and Ankimo will surely take care of them if they are), Sora really does have a stage aura that \"steals fans\" as they put it. \n\nBut I much prefer to describe it as Sora having a stage aura that can command your attention without having a strong authoritative tone to her. In fact, she has the opposite. She commands our attention unwittingly with her warm and gentle tone.\n\nTo give a personal example, her performance of Lucky Seventh Whistle got me tearing up immediately. That is thanks to how she brought the lyrics of the song to life with her vocals and the energy she gave to the choreography.\n\nThe choreography was pretty simple compared to her other songs (not helped by the fact she was singing in the center stage) and the lyrics of the song are admittedly kinda basic in terms of depth. The only factors that add depth to the lyrics are the clever marriage wordplays that were also interwoven in the choreography and the background of the song which is the fact that it is a celebratory song for her 7th Anniversary.\n\nBut her performance of this song in 6th Fes despite these limitations was just beyond phenomenal. She gave so much life and soul to the lyrics and choreography that you really feel she means every word sung in the song and action she does in the choreography. She is truly an idol like no other. A star that only appears once in a lifetime.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "tanvoltz",
                            "body": "It's hard to articulate how special Sora feels on stage. She just has the ability to project and amplify emotion in her performance, especially if she is doing it live in front of her fans. \n\nShe is somehow able to communicate her emotions of how happy, glad, and proud she is to be performing for us.  \n\n She just has a phenomenal stage presence the best in the company in my opinion (although I am admittedly biased). \n\nAnd at least for FES (or the 'climax song\" for her performance), she does what I call a Mid song speech, she somehow always finds a way to fit a declaration of love to the fans in her between her performances that gives you an additional gut punch in the feels on top of her phenomenal show.  \n\nShe may be simple, she isn't the best dancer or singer, but damn it, she is the best idol.(๑╹ᆺ╹)ぬんぬん",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "AnnonymousRedditor28",
                                    "body": "I agree with you wholeheartedly on your statement that Sora has the best stage presence in the company (admittedly, I am also biased as well lol).\n\nIt really is hard to articulate how special Sora feels on stage. But once you see it, you immediately get it. This girl was just born to be a star that shines so brightly on stage.\n\nAnd yeah, she really has an eloquent way of expressing her thoughts and feelings to all of her fans. She knows what to say and how to say it in a way that delivers the most impact. I also love her mid-song speeches as you call it. It's really nice and cute how much this humble idol wants to tell us that she loves us with all her heart.\n\nShe is truly the best idol any fan could ever ask for (๑╹ᆺ╹)ぬんぬん.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "timonten",
                    "body": "> feel the orthodox idol energy.\n\nThat explains why I feel so energetic/ gun-ho / patriotic whenever I listen to Sora's songs .",
                    "score": 13,
                    "replies": [
                        {
                            "author": "AnnonymousRedditor28",
                            "body": "Sora's songs are the ultimate motivation booster as expected of an orthodox idol!",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "timonten",
                                    "body": "Tbh , I play Helldivers2 and usually listen to \" step and go \" , and that makes me to use the portable hellbomb all the time . Still remember once where our extraction point was crawling with enemies and , while listening towards the end of the song , charged into the fray with the hellbomb armed . Just as the song ended , the bomb went off , killing me and 50-60 enemies while my allies managed to extract.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "exec-nyan",
                    "body": "Have only seen a few of Sora's streams, but I really liked her Karaoke after the fes. What a beautiful voice! I should watch the fes when the Blu-ray comes out.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Rated_Oni",
                            "body": "Believe me, only hearing her sing is not the full power of Sora, she shines the brightest when she is on stage, when even Suisei tells you she is left in awe, you know there is something special about Soda-chan.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "asunatsu",
                    "body": "She has Momo's drawing eyes",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "speedmincer",
                    "body": "I watch a lot of hololive talents, but there's a reason why Sora is the only one I went out of my way to buy her merch (๑╹ᆺ╹)\n[Listen to her music](https://youtu.be/G5Y4lDRHDrc)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "DeadSoulZzz",
                    "body": "Do you have any recommendation? \nI love the Holo streams and clips but I never glimpsed in their idol activities",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "_supervitality",
            "body": "Them: \"Stealing your fans\"\n\nMe: They are returning to the original source.",
            "score": 133,
            "replies": [
                {
                    "author": "AnnonymousRedditor28",
                    "body": "Remember folks, all fan mascots evolved from a Nun-Nun [as shown here:](https://www.reddit.com/r/Hololive/comments/v20gsr/how_to_make_boros/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)\n\nAnd all fan mascots will evolve back into a Nun-Nun as part of an evolutionary process called *Nun-Nunlization*.",
                    "score": 51,
                    "replies": [
                        {
                            "author": "teaboi05",
                            "body": "Pebbles are thrown into grape juice and slapped with googly eyes\n\nOtomos are iron men of Nun-Nun in green costume. Since CC has Sora figure in her PC case + is getting very close to Sora, I'm sure we are Nun-Nuns",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Luningor",
                            "body": "Holy moderation ALL comments are deleted wtf",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Luningor",
                            "body": "Holy moderation ALL comments are deleted wtf",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Boneary",
                    "body": "OR perhaps cutting out the middle man, in a way.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnnonymousRedditor28",
            "body": "Huh, that is another addition to [the list of similarities Sora has to Hoshino Ai.](https://www.reddit.com/r/Hololive/comments/13sdsf8/sora_chan_is_certainly_looking_like_a_certain_idol/)\n\n...__*Wait a minute-*__",
            "score": 49,
            "replies": [
                {
                    "author": "Fireboy759",
                    "body": "DO *NOT* LET HER COVER IDOL!",
                    "score": 21,
                    "replies": [
                        {
                            "author": "AnnonymousRedditor28",
                            "body": "If you count her karaoke streams, [it's already too late...](https://youtu.be/XoYN42fm2pg?si=CJ46OjEv7NBtsGkY)\n\n[She also sang it last new year countdown stream as well...](https://www.youtube.com/live/DzP0jXgOC4I?si=lnZ91_x7O1uXLKHQ&t=46m54s)",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Fireboy759",
                                    "body": "[My honest reaction](https://youtu.be/xseViI5d3_A?si=VxbFcA8N0_v_oExM)",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "AnnonymousRedditor28",
                                            "body": "Dude, I just realized something.\n\nSora's heart pose in the image? [It's very reminiscent of this heart pose by Ai in the anime:](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTIjhIgBw40vxnecCp0wcdsF4IpkFpFpUT9ubyXmbBfmqkzUAnJ_LImd_dR&s=10)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SnooCapers5958",
            "body": "I haven't seen her Holofes 6 performance yet, but Sora performing \"Step and Go\" back in Holofes 3 is still one of my favorite Holo performances of all time. Her power level just seems to exponentially increase when in 3D.",
            "score": 31,
            "replies": []
        },
        {
            "author": "CipherWrites",
            "body": "That heart sign is the sign for her Domain Expansion",
            "score": 11,
            "replies": []
        },
        {
            "author": "gdklrhznjekanxb",
            "body": "While I don't like the language used, I'll take it in good faith that they are just using the best language they know to describe the experience they had. Because the Hololive Idol Tokino Sora is an Experience™. You just have to be there.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Holoshrimp101",
            "body": "What in the Ai Hoshino Post is this? \n\nJoke aside, I 100% agree, like I'm more into en but Sora just got that \"Air\" of power",
            "score": 7,
            "replies": []
        },
        {
            "author": "Cybasura",
            "body": "How on earth does one \"steal\" fans anyways?\n\nFans are all humans, surely humans are allowed to make their own choice whereby someone was good enough to want to become a fan of\n\nThis is absolutely a trigger nickname, like someone who deliberately actually has an issue with the person whom he's targetting - which in this case, is Sora. There's no way this nickname would ever sound nice in any context ever\n\nIn the words of Kaela - GSH",
            "score": 5,
            "replies": []
        },
        {
            "author": "xdamm777",
            "body": "Her performance was absolutely insane this fes.\n\nPretty much all of the girls showed clear improvements over their past performances in dance, choreography and singing prowess but Sora… she’s just clearly on a whole other level and giving last boss vibes.\n\nAbsolutely loved how they gave her a solo stage and she hyped up the crowd!",
            "score": 4,
            "replies": []
        },
        {
            "author": "speedmincer",
            "body": "( ˇωˇ )ソラァ\n( ᴗω• )\n(๑╹ᆺ╹)ぬんぬん",
            "score": 3,
            "replies": []
        },
        {
            "author": "SchemeLopsided5276",
            "body": "When you're a hololive fan, being \"robbed\" means adding another oshi to your supposedly \"select\" list lol\n\nJokes aside, I'm on the edge of my seat watching some of their performances, I'm left speechless by the voices of some others, and I get emotional very easily in general, but man, Sora's energy on stage is still the only one that makes me think: \"Wow, so this is how an idol fan feels!\"\n\nSora was truly born to shine on stage, I couldn't be a happier Soratomo.",
            "score": 2,
            "replies": []
        },
        {
            "author": "redditfanfan00",
            "body": "sora-chan is the daisenpai of hololive, and an incredble idol too. of course sora-chan would be able to effortlessly steal fans from other holomems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CupOfHotTeaa",
            "body": "wtf happened in this comment section",
            "score": 1,
            "replies": []
        }
    ]
}