{
    "title": "League gave me another reason to never surrender last night",
    "author": "LindadeMol_",
    "subreddit": "leagueoflegends",
    "rank": 14,
    "score": 214,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 46,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/1jdyncm/league_gave_me_another_reason_to_never_surrender/",
    "id": "1jdyncm",
    "selftext": "I was playing ranked solo/duo and it looked very bad, we were behind in all lanes, kills, drakes and stuff. So then our ADC who was 2/8/2 decided to leave, we wanted to surrender but 2 people vote no.\n\nEverything went dogshit and then shortly after our adc dipped, suddenly the screen went to the nexus and it said we won, the enemy team had surrendered.\n\nSo what happened? Apparently the enemy team had an afk too , their jungler dipped for just a few minutes, and they probably didn't know yet that our adc dipped as well. So they FF'ed.",
    "comments": [
        {
            "author": "MukiiBA",
            "body": "i learned this:\n\nenemy will int their leads just to show how superior of a player they are.\n\nNo game is over until nexus finisher shows, i won 7 matches so far by defending nexus from 1-3 hits and counterpushing to destroy enemy nexus.\n\nIf our adc is worse, killin enemy adc who is better will win teamfight in 60% of the time. \n\nHaving ff mentality make you lose more games because subconsciously you start making more mistakes. \n\nChasing kills more than 3 seconds can lose you important upcoming fight that can lose you the game\n\nHope this helps, if anyone else have something to add feel free to. chain :3",
            "score": 197,
            "replies": [
                {
                    "author": "APe28Comococo",
                    "body": "Not every game is winnable, but every game is throwable. Never FF.",
                    "score": 97,
                    "replies": [
                        {
                            "author": "stabidistabstab",
                            "body": "im stupid but riot thinks the enemies are just as stupid as me",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "ImaCluelessGuy",
                            "body": "So every game IS winnable cause the enemy can always throw?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "APe28Comococo",
                                    "body": "Sorta. A 100% win rate is impossible but even a game that should be un-winnable can be won if a team makes a mistake. Never FF because you will win more by not doing so.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KrillLover56",
                            "body": "Amen",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "itsmetsunnyd",
                            "body": "Some games are winnable, but I don't have the time to play for 5 hours a day. If you give me the choice of sitting through a 50min game with 2 players who refuse to try on the off chance we *might* win anyway, or 2 25min games, i'd take the 2 games every time.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "omaewamo_muted",
                    "body": "So if your adc is better, you should peel for them in the teamfights right?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "MukiiBA",
                            "body": "yes, you should, can randoms in lobby do that? probably. Will they do it? 50%50",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TopperHrly",
                    "body": "I feel like it happens often that one team get 3 kills in an invade, they start playing very cocky and aggro because they feel it's already won, and quickly give 4 kills back.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "usernameisdifficults",
                    "body": "I dont int my lead to show dominance, i just try to ego a 3v1 for fun and improvement(im a massive griefer)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Nemesis233",
                    "body": "Sivir's most underrated quality: stalling the game forever.\n\nIf she's still alive you aren't ending (unless she's 2 items at 30)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "UsualInternal2030",
                    "body": "If you can make a couple nexus defenses games become very coin flip especially if enemy team leaves you baron or drag while they are on death timers. I never risk leaving baron, but lots of teams will with advantage.  I could see doing a risky base attack if you have withdraw tho.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mking1999",
            "body": "You'll more easily remember the comebacks than the inevitable losses, despite the fact that those are far more numerous.",
            "score": 59,
            "replies": [
                {
                    "author": "AmadeusSalieri97",
                    "body": "In general, humans tend to remember much more the negative than the positive.\n\n\nSo this applies both ways, obviously you'll remember more the epic comeback than a standard 4v5 defeat, but you'll also remember much more the AFK in your team that the AFK in theirs. ",
                    "score": 15,
                    "replies": [
                        {
                            "author": "mking1999",
                            "body": "I mean, maybe the negatives will impact you more in the moment, but like... I don't think that's true at all? \n\nNostalgia's a thing for a reason. Rose tinted glasses and all that.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "FuujinSama",
                                    "body": "Dude, on one end you have nostalgic, on the other you have trauma flashbacks. Which one is a stronger memory? \n\nYou're arguing against obvious, self evident and empirically verified facts.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "AmadeusSalieri97",
                                    "body": "I'm honestly kinda surprised a single person on Earth can disagree with the fact that negative experiences are remembered more strongly than positive ones. But in case you want to learn about the topic, there's extensive research about this topic you can find with a quick google search.\n\n>Negative Events are Remembered with More Accurate Detail than Positive Events. The research comparing memory for negative and positive events has begun to reveal a fundamental influence of valence on memory accuracy. Negative information often is remembered with a greater sense of vividness than positive information. \n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC2676782/#:\\~:text=Negative%20Events%20are%20Remembered%20with,of%20vividness%20than%20positive%20information.\n\n>As outlined by Baumeister, people typically attend more to negative information than positive and weight losses more than gains\n\n[https://pmc.ncbi.nlm.nih.gov/articles/PMC9196161/](https://pmc.ncbi.nlm.nih.gov/articles/PMC9196161/)\n\n>Nostalgia's a thing for a reason. Rose tinted glasses and all that.\n\nThis which you mentioned is a different thing altogether, given two occurrences a negative and a positive one, we remember more the negative one, that's a fact. Nostalgia is a completely different thing altogether, kinda the opposite, that the things we remember, we tend to value more positevely.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Still_Reaction_5244",
                                            "body": "You are comparing a 15 min Game that ffs, with trauma that lasts for your entire life. I think there is an argument to say someone will remember his penta  easier instead of his 100th yasuo that inted his game.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "AmadeusSalieri97",
                                                    "body": ">You are comparing a 15 min Game that ffs, with trauma that lasts for your entire life\n\nMost of my league games were long-lasting traumas.\n\n/s obviously, I was gonna give a serious answer but if my previous comment wasn't clear enough, I don't know how to make it easier to understand.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bigdolton",
                                    "body": "remembering more doesnt mean not remembering at all. you can have nostalgia over things and still rmbr the bad times more",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OutblastEUW",
                    "body": "imo this is not true",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "joco930",
            "body": "AFK on both sides?  Classic league moment.\n\n...I've been having tough games lately.",
            "score": 17,
            "replies": []
        },
        {
            "author": "ieatpickleswithmilk",
            "body": "I love the late game. I love rotating for objectives. I love comboing abilities and attacking fast.\n\nI don't like sitting in queue. I don't like sitting in champ select. I don't like waiting for minions to spawn. I don't really like the laneing phase that much either tbh. \n\nI like the mid and late game when the training wheels come off and real shit starts happening. \n\nI die inside when someone says \"just go next\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pluckytoon",
            "body": "I played a game yesterday where my top and botlane went a collective 0/12 at 8min, but once jg and I got online we turned around the game and won pretty convincingly in the following 15min ! \n\nIt’s just the main character type shit",
            "score": 4,
            "replies": []
        },
        {
            "author": "kykyks",
            "body": "last time we had 10k gold lead and we were at their nexus towers but had to back cause they all respawned and we were low\n\ntop and jungle started flaming each other for some ks and about why they didnt end\n\n30s later everyone voted ff instantly, i was the only one voting no\n\nbut somehow everyone complain about adcs being whiny bitch",
            "score": 2,
            "replies": []
        },
        {
            "author": "HomelessKB",
            "body": "Yeah, I get the raa raa attitude of never surrender, but there comes a certain point where the only way to win is IF the enemy team throws, and multiple times at that. If it's at that point, ff and move on. You're not going to do anything but practice bad habits at that point. I don't care if you think your 3-8 second item power spike is going to win the game magically if we are already down 3 drags, 6 grubs, 8 turrets, ata, and they just got baron. If everyone's been running around getting hit by every skill shot all game, why do you think you're gonna stop getting hit now? If everyone has single digit vision score 20+ mins in and you're lanes are crushed up to your base, why keep at it? \n\nI'll tell you why. Because 90% of the nEvEr SuRrEnDeR crowd just want to spend as much time screeching at their team over how the game is going. The main character syndrome displayed in 9/10 of the games where people are split on ff'ing is strictly because the never surrender folks haven't gotten their fill of bitching at everyone else on the team.",
            "score": 3,
            "replies": [
                {
                    "author": "Supergohst",
                    "body": "Its just about percieved win percentages. I rarely surrender because i find an 20% chance to win still worth a try, even if i likely lose. But there are plenty people who think otherwise and would call this hostaging (as if i do it to spite them and not because i genuinely want to win)",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Funny-Control-6968",
                            "body": "But it's not a 20% chance. It's much lower if you're that far behind.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Supergohst",
                                    "body": "I was speaking in general, in the case of the above comment, unless I was still doing fine myself, i would probably surrender that one too",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Omigle_",
            "body": "Had a similar game as a support. ADC was playing like a bot, bought boots mid-game. Tried to support as much as I can, to no avail. Shifted supporting full time my toplaner who was 1.5 items ahead of ADC. We won 3 teamfights and the game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JNorJT",
            "body": "Yeah I never surrender no matter what because I’ve won games solely due to not surrendering I’ll never surrender even if I’m 0/20 and that’s a promise!",
            "score": 1,
            "replies": []
        },
        {
            "author": "feedcrank",
            "body": "As if wasting the time of three teammates wasn't  enough reason already, now you can pray for a <1% chance DC!",
            "score": 1,
            "replies": [
                {
                    "author": "Funny-Control-6968",
                    "body": "The league playerbase is getting older. Don't ff because the carry on the enemy team might get a heart attack in the middle of the match.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "UnholyDemigod",
            "body": "I swear, the 'never surrender' attitude, at least in low to mid elo, causes more losses than it does wins. Everyone knows the maxim that \"anything can happen in bronze\", and this mindset sticks in people's heads permanently, even when not in bronze, but it sticks in their heads *the wrong way*.    \nIt means the enemy can make a major fuck up, not know how to close, get outmacroed, etc. People take this to mean \"they can be outplayed\", and they completely forget that gold lead will make a shit player win a fight purely by statchecking the enemy. So they keep throwing themselves at a stronger enemy, giving them a bigger and bigger gold lead, under the impression that \"I can outplay him, anything can happen in this elo\", when all they're doing is cementing a loss.",
            "score": -14,
            "replies": [
                {
                    "author": "Midwest_of_Hell",
                    "body": "How could it possibly cause more losses. Surrendering is the alternative, and that creates 0 wins.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "UnholyDemigod",
                            "body": "Because it gives people the idea they can win any fight purely by outplaying the enemy, even when drastically outclassed. So instead of playing safe and trying to farm up to a statistical equivalence, they full send it every chance they get. They think that because \"every game is winnable\" this also means \"every *fight* is winnable\".",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Midwest_of_Hell",
                                    "body": "The “ff at 15” mindset is not to farm up. What a nonsensical take",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "UnholyDemigod",
                                            "body": "What the fuck are you talking about? What does ff@15 have to even remotely do with anything I said?",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Midwest_of_Hell",
                                                    "body": "That’s the opposite of never surrender. Farming up IS never surrender mentality.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "UnholyDemigod",
                                                            "body": "So you're not even reading my comments then? Fair enough",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fire_Pea",
                    "body": "Idk I feel like my 0/10 yasuo who keeps throwing himself at the enemy team and the 'never ff' gang are separate groups",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "cinnamoroll_glaze",
            "body": "No wayyy omg",
            "score": -1,
            "replies": []
        },
        {
            "author": "DeathandFriends",
            "body": "I hate it when people won't surrender they think of that one time it worked out and waste all our time.",
            "score": -8,
            "replies": []
        }
    ]
}