{
    "title": "Was Plo Koon a great Jedi and General?",
    "author": "Nav_Blue_Coolant",
    "subreddit": "StarWars",
    "rank": 4,
    "score": 850,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 140,
    "url": "https://i.redd.it/dvi4yhuyvfpe1.jpeg",
    "id": "1je3g9a",
    "selftext": "",
    "comments": [
        {
            "author": "Skourpi1",
            "body": "The clones liked him so much that on the side of his LAAT there was art of his face and some clone helmets that said Plo’s bros.  He was a great Jedi and a great general.",
            "score": 649,
            "replies": [
                {
                    "author": "Kn1ghtV1sta",
                    "body": "Always headcannoned that the clones who shot him down probably wound up having worse PTSD than most, due to most accounts saying he was legitimately a good dude and was known to legitimately care about the clones under his command",
                    "score": 298,
                    "replies": [
                        {
                            "author": "Skourpi1",
                            "body": "Yeah, they probably went and drowned their sorrows in alcohol or something else.  Now if he was in the ground among the clones fighting beside them, he might have survived.",
                            "score": 103,
                            "replies": [
                                {
                                    "author": "Darth_Nox501",
                                    "body": ">he might have survived.\n\nI personally don't think so. If anything, he would've been even more shocked and taken aback by the betrayal due to his connections with the clones, that they might've killed him without much of a fight.\n\nThe Clones themselves would probably hesitate a little, and officers like Wolffe would probably shed a tear similar to Rex aboard the Venator, but I think the hold of the chip would be too strong.",
                                    "score": 91,
                                    "replies": [
                                        {
                                            "author": "Skourpi1",
                                            "body": "Well, Wolfe removed his control chip.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Darth_Nox501",
                                                    "body": "After Order 66 was issued, yes. On the field, though, he would've executed it.",
                                                    "score": 45,
                                                    "replies": [
                                                        {
                                                            "author": "Skourpi1",
                                                            "body": "I don’t know if he would.  Look at everything they went through.  It would be like when Rex had his control chip removed.  He might have started out loyal to the republic but he became loyal to the Jedi when it came down to the line because the Jedi wanted to preserve the republic.",
                                                            "score": -21,
                                                            "replies": [
                                                                {
                                                                    "author": "CrossP",
                                                                    "body": "I think the problem is that the chip combined with the authority of the order made them truly believe the Jedi had somehow instantly become the enemy. His sadness over killing someone he called a friend would have been balanced out by his incredible rage that Plo Koon had betrayed the Republic. That's why compliance was so perfect, and it took a while for even experienced commanders to start doubting it.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "CrossP",
                                            "body": "Yeah. The problem being that between the chip and the order they, at least in the moment, truly believed that the Jedi had committed treason and were an *immediate* threat on the battlefield. I think the only reason Rex was even able to briefly resist was Ahsoka not technically being a Jedi rather than his personal willpower, bond of friendship, or knowledge of the chip's existence.\n\nThey weren't desperately grappling with killing their friends because they were completely confident they were fighting enemies.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "R_Ulysses_Swanson",
                                            "body": "I doubt Wolfe would have shed a tear. He blocked the messages from Ahsoka, shot at Kanan, and notified the Empire that they were there - all that despite having his chip removed.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "CowOfSteel",
                                                    "body": "I think it's also pretty clear the poor dude was PTSD'd to the Rishi Maze and back.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "insidiouskiller",
                                    "body": "Doubt it. He'd probably get gunned down the same way Aayla or Mundi did. The clones turning on the Jedi was unthinkable for them. The same was true for the clones in regards to most of the Jedi too. Sadly, they didn't have a choice on the matter.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Skourpi1",
                                            "body": "The control chips inside their head is better than them not having anything inside of their head.  Seeing as everything that we saw them go through in the clone wars and how we bonded with the clones and how much certain clones and their Jedi also bonded, it makes a lot more sense for that to be why the clones were able to take the Jedi out then the clones just saying, welp, their time is up let’s shoot this person that has been our CO the entire time and has led us through the entire war.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "insidiouskiller",
                                                    "body": "Oh you misunderstood me. I also think control chips make more sense than the alternative. I was just commenting on the tragedy of them not having a choice on whether or not they could follow this order.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Skourpi1",
                                                            "body": "It truly was tragic. What was even more sad was seeing what happened to them after the war.  They had this army of slaves that they needed to come up with something to do that some people just wanted to euthanize.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Psychonautica91",
                                            "body": "Unthinkable yes but some had such a strong connection to the force, like Yoda, that he was able to avoid death by clone.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "insidiouskiller",
                                                    "body": "Yoda had a bigger window of time to process the way the force felt before being attacked by the clones.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Psychonautica91",
                                                            "body": "My point is that Plo Koon was also very force sensitive and would have most likely felt it, if even for just a moment.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Born-Weird-8336",
                                                                    "body": "Palpatine's mistake was calling each commander and issuing the order directly. That meant that some Jedi like Yoda were able to feel what was happening through the force whereas others had no time at all. Palps should've issued the order to all commanders at once and Yoda might've been caught by surprise.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Psychonautica91",
                                                                            "body": "So it’s weird. It does show him explicitly telling Commander Cody it’s time to execute Order 66 and other commanders verbally answer the hologram “it will be done, my lord” or whatever. However, we also see that the recording “execute Order 66” is broadcast over every military frequency in certain scenes like the first episode of The Bad Batch.  \n\nBy the time Tech hears the broadcast most Generals in the field are most likely dead but we know Depa and Yoda are still alive. Who’s to say Plo couldn’t feel the same disturbance Yoda did?",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TylerHyena",
                                    "body": "Somewhat Plo-related here, in season 2 of The Bad Batch at the end of the 3rd episode, Cody and Crosshair are having a talk and it’s strongly implied that Cody regrets following the orders to kill the Jedi.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Skourpi1",
                                            "body": "I can totally see that.  The crazy thing that happened with the Jedi and the clones is that the Jedi rubbed off on the clones.  When you look at Rex and Cody and how they fight you will see that Anakin’s fight style of usually charging in headfirst with somewhat of a plan but trusting his own skills and coming up with a plan as they wen defiantly rubbed off on Rex, while Obi-Wan’s more carful let’s actually think about this and get an idea of what is going on and how we should approach this ideas rubbed off on Cody.  As the war went on, the clones became more humane because they were around other being that had humane emotions that did rub off on them and they weren’t killed off for having slight defects that the kaminoins deemed unsatisfactory.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "TylerHyena",
                                                    "body": "Which is why a lot of clones were second guessing themselves well after Order 66 and during the start of the Empire, and how they got to round up some clones who were anti-Empire. They grew to be humane after hanging out with the Jedi for so long, which was actually only 3 years when you look at it, and then had it stripped away when Order 66 was put into effect and then later started to have “what have I done” moments afterwards.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ryman9000",
                            "body": "That episode of TCW where plo is trapped in a pod with some clones and the drones are flying around cutting them open and he's desperately trying to think of a way to save them was a great episode. What a roller coaster!",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Billyb311",
                                    "body": "Clones: \"We're just clones sir, we're meant to be expendable\"\n\nPlo: \"Not to me\"\n\nLove that line",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HUNGWHITEBOI25",
            "body": "Yes\n\ndebatably the most well rounded Jedi of the time. Trusted in the force, an amazing warrior and actually CARED about his clones.",
            "score": 192,
            "replies": [
                {
                    "author": "insidiouskiller",
                    "body": "Tbf, that last part isn't unique to him. Going off of TCW, the vast majority of the Jedi Order cared about the clones, with people like Krell (referring to how he didn't care about and mistreated the clones, not the part about him betraying the order) being the exception and not the norm.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "burnside117",
                            "body": "While this is true, plo koon was an exceptional case of encouraging his troops to be individuals and actually expressed vocally that each one is important to him. Most of the others seem to have a couple of buddies made up of the cool guy inner circle, but compassion for the rank and file.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Lindvaettr",
                                    "body": "Actions speak louder than words, as well. For all the talk Jedi had for caring about the clones, we also see in TCS that the overwhelming majority of them never seem to have even considered altering their tactics from \"full frontal charge\". Just because the Jedi could deflect droid blaster bolts didn't mean clones could.\n\nMany Jedi cared about the clones in a sort of vague general way, I think, but rarely cared enough about them to be seriously bothered by their deaths or to seriously contemplate whether or not there were other, better strategies to employ that would involve less carnage.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Stlaind",
                            "body": "I think it's the combination of all of those that's the most unique. The only other one I can think of that's similar is maybe Obi-Wan, but it seems like Plo made a closer connection to his troopers. Anakin had similarly close connections but didn't really trust the force to the same extent.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "getflippped",
            "body": "He’s one of the best for sure. He wasn’t like other council members he seemed more understanding and compassionate and not stuck in doctrine of code. He also treated the clones like people who are not expendable so his clones loved him enough to spray paint him on their ships. In legends if I remember correctly he was capable of light side version of force lighting so he was powerful as well.",
            "score": 38,
            "replies": []
        },
        {
            "author": "TylerHyena",
            "body": "Based on The Clone Wars, yes. I distinctly recall in the “Malevolence” episodes that when they were stranded in an escape pod and he told his clones that they weren’t just disposable people.",
            "score": 17,
            "replies": []
        },
        {
            "author": "DoctorBeatMaker",
            "body": "EU/Legends Plo Koon was goated for being one of the only Jedi that could wield Force Lightning in the old order (Electric Judgement).",
            "score": 21,
            "replies": []
        },
        {
            "author": "SpecialPeschl",
            "body": "David Filoni thinks so",
            "score": 8,
            "replies": [
                {
                    "author": "Previous-Giraffe-962",
                    "body": "Anyone who thinks Plo Koon was not one of the more empathetic Jedi needs to watch the clone wars malevolence arc.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "LifeOnMarsden",
            "body": "Yes, and I will die on the hill that Ahsoka should have been his padawan and not Anakin's. Retroactively giving the most important character in the entire franchise a padawan who isn't mentioned or even slightly alluded to once in the movies creates a huge disconnect between TCW and the main movies and makes it hard to consider TCW truly canon in my eyes at least ",
            "score": 135,
            "replies": [
                {
                    "author": "Chris01100001",
                    "body": "Because of ROTS, they had a lot of constraints for the Clone Wars show. Basically every major character can't be harmed or have anything significant happen to them. Only characters created for the show (and Ventress) are not affected by this.\n\nAnything that happens to a hero or villain from ROTS has to be inconsequential. Giving Anakin a padawan means there's some stakes as things can happen to Ahsoka. Without her there, anything involving Anakin has no jeopardy. We know him and people he cares about like Obi-Wan and Padme can't be harmed.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "TabletopStudios",
                    "body": "True. But I do like how they showed how Ashoka and Rex were on a different mission during ROTS.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "insidiouskiller",
                            "body": "And tbh, that's more than enough for it to make sense to me.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DevuSM",
                    "body": "If you want to relate Ahsoka to the Prequels, it's the thing nobody talked about in front of Anakin because it is a extremely raw wound that they want to let scab over.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "insidiouskiller",
                    "body": "I personally can't agree. For me, showing that her and Rex were away on Mandalore was enough to justify her not being mentioned in RotS and mend that disconnect. That, and she added a lot to Anakin in TCW.\n\n\nI will say that I might be biased since she is my favorite character in Star Wars, though.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "BleydXVI",
                            "body": "I never understood the complaint either. Unless you can point to a specific instance where there is good reason to talk about her, saying \"she exists and is important\" isn't enough for me to say anything is remotely canon breaking",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "mell0_jell0",
                                    "body": "Many people who watched the first 6 movies growing up believed that the Jedi (which originally meant \"good guy\" lightsaber users) were all extinct, Kenobi and Yoda being the last to pass their knowledge to Luke. We thought that because that was the information given from the films at the time. \n\nNow, it's all wrong? Only if you watch extra kids cartoon shows, you get a whole bunch of lore and retcons to fill plotholes from the movies. With how big some of the TV show characters got, and how important they became to their causes, it seems really weird the the first few films are SO quiet about them. Not one rebel is like \"What about the Ghost crew?\" or \"Are the Inquisitors still a threat?\" - anything like that would have been best and added wonder for a while, but Lucas had no idea, just like us.\n\nThere are a few other scenarios in the stories of Star Wars that suffer in ways from retconning/revamping the lore. \n\nWe saw Maul get cut in half, and the main threat of the movie is eliminated. We'd never seen anyone survive that (it was like what Qui-gon got but 50x worse) or seen such extreme cybernetics as his rebirth (until Gen. Grev.) and he's not mentioned ever again in any trilogy despite *surviving* ruling a crime syndicate. Obiwan could have said something about Maul, and other threats from the empire/dark forces when he and Luke hang out. \n\nWe thought Luke was bringing about the Return of the Jedi, because they were extinct, but turns out there was Ezra, Sabine, Cal? (haven't played the games, probs some more lore retcons in those), and hundreds of others running around at the same time. \n\nWe thought Anakin would bring balance to the force, and never thought it would get un-balanced again.\n\nWe thought Palpatine died.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "BleydXVI",
                                            "body": "Jedi surviving order 66 has nothing to do with why Anakin's padawan was never mentioned in the movies. That never bothered me because Yoda and Obi-Wan are not omniscient and weren't always the most honest about details in those movies, but I understand the complaint there.\n\nAgain, point to a specific point where any of that should have been said. The ghost crew has zero reason to be mentioned in 4 or 5, and it seems likely that they weren't working as a singular crew by 6. The inquisitors stopped being a threat halfway through Rebels, before the OT. No reason to talk about them, especially when Vader is a much bigger concern.\n\nMaul is iffy, but take that up with Lucas. Legends also had other people survive worse injuries with the dark side, but that's also outside the movies. \n\nLike I said, limited information. The Jedi that Yoda knew of in Rebels (Kanan and Ezra) are either dead or in another galaxy, and I didn't see a tv to watch Cal in the news. Obi-Wan might've, but who knows. I understand not liking that more survived, but you're extremely exaggerating the issue with \"hundreds of others running around at the same time\". There absolutely weren't.\n\nPalpatine coming back is bad, though Legends had the same issue.\n\n\n\nSo, was this all a vent? I didn't say I don't understand people having a problem with retcons in general, just specifically Ahsoka being Anakin's padawan and not being mentioned in the movies. Most of this had nothing to do with that",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "mell0_jell0",
                                                    "body": "Ahsoka being Anakin's Padawan kinda matters imo, maybe I'm wrong lol. **Specifically**, when Luke had to fight Vader/Palpatine alone. Idk, I think Luke and Ahsoka vs Vader and Palps would have been more help to Luke than just Luke vs Vader and Palps. Again, maybe I'm wrong. I think Ahsoka showing up with the Ghost crew when Palpatine says \"the last of the rebel fleet, fading away\" or whatever to help the rebel fleet would have been.. helpful... but maybe I'm wrong.\n\nTruth is, they didn't exist yet. Idk why people can't accept that it's kinda inconsistent that they were SO important yet just never mentioned at all. Womprats get more mention. Also, I don't \"not like that other Jedi survived\", in fact i quite enjoy it. I don't like that George himself believed - and made us all believe - that Luke was the last one then went back on it like 20 years later.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "BleydXVI",
                                                            "body": "I think Ahsoka would've made things worse, actually. She couldn't beat Vader, so she definitely wouldn't be doing anything to Palpatine. And her being there would definitely change how Palpatine and Vader act. Palpatine stayed out of the fight to manipulate Luke to the dark side, and Vader would probably be a lot more angry and less receptive to Luke with Ahsoka around. She'd also have to get there somehow, since I don't think Vader would be so obliged to take her prisoner alongside Luke on Endor (which also wasn't pre-planned, so Ahsoka probably wouldn't be there anyway). \n\nThe Ghost ship could've been there, but I doubt they'd amount to much more than a cameo like in Rogue One. It's just one ship out of many.\n\nNobody is contesting that they didn't exist yet. Obviously things could gel smoother if they had at the time, but as it stands, I just don't see these things as stuff that SHOULD have happened. Could they? Yeah. But it's a big galaxy, and people already complain about recurring characters making things feel small. The last thing we need is the guy walking between Han and Leia saying \"wasn't it wild how the ghost crew defeated thrawn 4 years ago\" like he's Admiral Zhao recounting his visit to the library in The Last Airbender movie",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shmack_u",
                    "body": "I agree, but also if she was plo koons padawan, she might have likely died during order 66 like he did. Plo was a great master Jedi, very wise and honorable, but Anakin gave Ashoka the edge she needed to survive, something Plo wouldn’t have taught her, her brashness and attitude is what kept her alive imo",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Humulus5883",
                            "body": "Not wise enough to stop Palps.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TylerHyena",
                    "body": "I don’t know if I wholly agree with this.\n\nOn the one hand, Plo Koon was on the council longer and more mature than Anakin, meaning he didn’t have all the emotional issues and trauma that Anakin was carrying. But on the other hand, Anakin’s unorthodox way of doing things and getting solutions for problems is what made him a better Jedi than others thought and by extension, Ahsoka. Giving him an apprentice also added some depth to him in TCW and gave him a sort-of younger sibling at the time, something he never had, and their relationship feels just as much like that. So her being directly connected to the main character of the prequel trilogy gives us a stronger emotional connection to them than with another character. \n\nIt also makes later scenes with the two of them emotionally hit harder, specifically in the season 2 finale of Rebels when Ahsoka is dueling him as Vader on Malachor. Plus, it also hits extra hard at the end of the Fugitive Ahsoka arc in TCW when she leaves the Order and Anakin, and he was one of the few who openly stuck up for her, whereas the rest of the Council didn’t.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "terp2010",
                    "body": "True BUT Annakin was the master she needed. Master PLO was too by the book… Annakin taught her when and how to disobey orders, and in reality it’s what saved her life during Order 66. I don’t think Ahsoka’s prominence would be the same with PLO… Ahsoka and Annakin needed each other.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "eyezick_1359",
                    "body": "Exactly. TCW is fun, but it’s like well written fanfiction at best. It’s jarring that Ahsoka is such a big part of Anakin’s character, but never where it counts.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "SynCig",
                            "body": "George Lucas was heavily involved in TCW and was the one that made the decision to give Anakin a Padawan.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "eyezick_1359",
                                    "body": "Does that mean it’s infallible?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SynCig",
                                            "body": "Not at all. It just means calling it fanfiction is a weird way to criticize it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "eyezick_1359",
                                                    "body": "I’m not saying you can’t like it or that it hasn’t had an effect on you. But the movies are more important than the cartoon. And all the cartoon has done is offer more plot holes. People don’t see it that way because it’s a plot hole they like.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "SynCig",
                                                            "body": "You seem to be arguing a point I'm not even making.\n\nBut to respond to some of this:\n\nAll it did was introduce plot holes? That's simply not true. And you aren't even using plot hole correctly anyway. Ahsoka existing isn't a plot hole since they already gave us story reasons for her absence during ROTS.\n\nAnd I, along with many others, would argue that TCW was one of the biggest contributors to the rehabilitation of the PT in the fandom. It gave the clones depth that wasn't there. It helped make Anakin's fall to the Dark Side feel more earned. It gave the fans connections to a great many characters we didn't have before. There's a reason that a lot of people are asking for a similar show to exist for the ST. It did a lot of good for that era of Star Wars.\n\nBut again, I wasn't even trying to argue against your point except to say that the use of the term \"fanfiction\" doesn't make sense as a criticism of TCW (it doesn't make sense to me for a derogatory term for anything but that's a different conversation). It's cool that you don't like TCW but you are in the minority there. Which is also totally fine!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "eyezick_1359",
                                                                    "body": "Having lore justifications doesn’t save a character from being a plot hole. Why wasn’t she in OT then?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SynCig",
                                                                            "body": "Yeah I would say it does. A plot hole is something that makes the logic of the story as presented not make sense. Ahsoka existing but not being talked about in the scenes we see in the movie isn't a plot hole. It would be if we knew she was doing battles with Anakin during the events of the movie but somehow wasn't a factor otherwise. But she wasn't. She was on Mandalore at the beginning of RotS and Anakin had a lot of his own shit going on. \n\nWe know she's working with the Rebellion during events leading up to the OT and then the events of Rebels happened. What she was doing between that and Ahsoka, we don't know yet. But again, a character not being mentioned when it wasn't established that they were there isn't a plot hole. If that was the case, is it a plot hole that Shara Bey isn't shown on screen during the OT? There are plenty of characters that we know exist that don't get mentioned because they didn't exist when those movies came out but just as importantly, the story created for them makes it so they weren't relevant to those plots so they don't have to be mentioned.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DevuSM",
                                            "body": "Yeah.\n\n\nHe made the prequels and actively shepherded the clone wars.\n\n\nIt all works together.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "insidiouskiller",
                            "body": "It's exactly where it counts, though. She was given to Anakin as a padawan to help balance him, help him with the whole attachments thing. And it was having an impact... One that was more than reversed after the whole temple bombing shenanigan, and that arc furthers why Anakin is not a fan of the council.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "eyezick_1359",
                                    "body": "It’s good that you can quote the lore to me, but I’m talking about real life. The show for children, that mostly only hardcore fans are going to watch, isn’t the place to put major development for the main character. The movies are more important than anything, and there isn’t even an inkling of something so big happening in his life. If anything, it’s fan service that has created a needlessly big plot hole.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "insidiouskiller",
                                            "body": "There isn't a plot hole, though. Or at least, what you wrote before that isn't a plot hole, it's an entirely different can of worms.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "eyezick_1359",
                                                    "body": "Anakin Skywalker’s Padawan that we never see or hear about the movies isn’t a plot hole?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "insidiouskiller",
                                                            "body": "There was no good reason to mention her in RotS. The other person put it best, so I'll just quote them:\n\n\"I never understood the complaint either. Unless you can point to a specific instance where there is good reason to talk about her, saying \"she exists and is important\" isn't enough for me to say anything is remotely canon breaking\"",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "mell0_jell0",
                                                                    "body": "You keep saying \"in ROTS\" but that's not what people are talking about. Even the original comment you replied to mentioned how NOBODY talks about her in ANY movie. If she's such a big part of Anakin's story, and the stories of SW in general, then there could have been ONE line here or there throughout any of the first 6 movies. That makes it clear she was just a retcon. Good character? Sure, obviously, people are obsessed with her. Created and used to fill plotholes from the movies via separate media later on? Also yes. It is important to be able to at least recognize these things.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "insidiouskiller",
                                                                            "body": "In Phantom Menace she has been, if I recall correctly, in the Temple for a year - no reason for anyone to mention her.\n\nIn AotC, she is a promising initiate, but again, no reason why she would be mentioned by anyone.\n\nIn RotS, it would be a problem if she wasn't mentioned with no particular reason why she wouldn't be mentioned, that would be a plot hole, but we are given such a reason why she wouldn't be mentioned, and so it isn't a plot hole.\n\nIn the OT, only Yoda and Kenobi would be the only ones to talk about her for any reason, and they don't exactly have any reason to mention her.\n\nSorry, but I am inclined to disagree. Also, that's not what a retcon is. Even if it were, a retcon is not an inherently bad thing.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mell0_jell0",
                                                                                    "body": "A retcon is: a piece of new information that imposes a different interpretation on previously described events, typically used to facilitate a dramatic plot shift or account for an inconsistency.\n\nPreviously, the events were described without Ahsoka existing, Maul living, Inquisitors, etc. Those characters DO facilitate dramatic plot shifts and account for inconsistencies.\n\nThis is all true, even if you're inclined to disagree. I'm not trying to say it's a bad thing. It's just obvious Lucas had no idea what he was doing sometimes, and it helps to have teams of writers behind you later on.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "eyezick_1359",
                                                                    "body": "Well, the reason she wasn’t in the movie is because she didn’t exist. And now that she does, and isn’t around during time she should be, it *is* a plot hole. \n\nYou’re telling me, in the movie where Anakin falls to the dark side, there wouldn’t be a reason to have him interact with his Padawan? The same Padawan that people claim was there for the purpose of helping him with his struggle between light and dark. There is more to Star Wars than lightsaber fights. There is an emotional core to these movies.\n\nShe is important until the fans are okay with a plot hole, then she suddenly isn’t important. It’s classic Star Wars Fan back and forth.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "insidiouskiller",
                                                                            "body": "I am quite well aware of that.\n\nAnd it isn't a plot hole, because they explained where she was. Off in Mandalore, with no particular reason why she would be mentioned by anyone during RotS.\n\nAnd that would have been a great encounter. Unfortunately, Anakin was busy being roast chicken, and Ahsoka was busy not dying.\n\nShe is important, and has been. Unfortunately, in-universe circumstances prevented any meeting during RotS, so it's not a plot hole.\n\nIf there wasn't any reason why she wasn't present during RotS, you'd be correct and there would be a plot hole. But there IS such a reason, and thus, it is not a plot hole.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "eyezick_1359",
                                                                                    "body": "Lore reasons don’t save a character from being a plot hole. *Outside* of the story, in *real life* her addition to the narrative offers more problems than solutions.\n\nI understand that you enjoyed the story she was given, but that alone doesn’t mean anything. Anakin having a Padawan that we never see or hear about is a big fucking deal.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "insidiouskiller",
                                                                                            "body": "That's not what plot hole means. If you are gonna make a criticism, use the term properly. Outside the story is a whole other can of worms that I am not getting into, but make a plot hole those things do not, because that's not what a plot hole is.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "eyezick_1359",
                                                                                                    "body": "Anything you have to write around is a plot hole. Why wasn’t Ahsoka at any important movie event? Because she didn’t exist. Plan and simple. And now, there is story to justify her existence. They had to walk the entire narrative back to make room for her. The very definition of a plot hole.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "insidiouskiller",
                                                                                                            "body": "Yes the out of universe reason is that she doesn't exist.\n\nAs it just so happens, I also couldn't care less about the out of universe reason even if I tried my absolute best, because I, generally, do not look at stories that way.\n\nAnd there are reasons why she isn't present or mentioned in the OT and PT. That's good enough and, far as I'm concerned, not a plot hole as a result.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "eyezick_1359",
                                                                                                                    "body": "So you won’t engage with stories on the real world level, yet you know what a plot hole is more than I do. Very interesting.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "insidiouskiller",
                                                                                                                            "body": "I prefer engaging stories from an in-universe perspective far more than I do from a real-world perspective, that doesn't mean I don't do it at all. For me, so long as there is a satisfactory in-universe explanation, the out-of-universe part of things is largely irrelevant.\n\nI have said all there is to from my perspective. If there was no good explanation why she isn't mentioned or present during episodes 1-6, it'd be a plot hole, but since there is, it's not a plot hole.\n\nI suspect it's best we just agree to disagree. The way we approach stories is fundamentally different it seems, we won't agree to anything so long as that's the case.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Ramzaa_",
                                                                            "body": "I don't think you understand what a plot hole is",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "eyezick_1359",
                                                                                    "body": "No, I understand it perfectly fine. Just because people like the character and have justified it on their own doesn’t mean Ahsoka isn’t this giant wrench in the whole thing.\n\nI ask again, where is she during anything important? If she isn’t a plot hole, why didn’t she show up in OT to help at all? Because she was made after that and after *all* of the movies.\n\nPlease go show someone OT for the first time, then reveal to them at the end that this super helpful Jedi was just fucking around the whole time and no one thought to ask her to help. I’m sure that person will agree with you that since there are 7 seasons of television to catch up on, that it justifies the plot hole. Gimme a break.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Ramzaa_",
                                                                                            "body": "ROTS takes place over several days. She wasn't a part of the order. She was off doing her own thing. Why would she be brought up? There was enough going on that it makes complete sense for her to be absent. \n\nAnd regarding the OT, it's a huge fucking galaxy. One person not being present among trillions isn't a \"plot hole\"",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "eyezick_1359",
                                                                                                    "body": "*One person* is not how I would describe the Secret Apprentice of Darth Vader. Is lore important or not? Lol",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Ramzaa_",
                                                                                                            "body": "Not important enough that every single character needs to be a part of every single story beat. It doesn't work that way in the world and it doesn't have to be done that way in a fictional setting either.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DevuSM",
                                            "body": "I don't think you get it.\n\n\nClone Wars is by far the biggest volume of George Lucas' work and ideas we have.\n\n\nGo watch the Filoni interviews and his comments about Georges involvement.\n\n\nGeorge - \n\n\n\"Anakin has a Padawan.\"\n\n\nFiloni - \n\n\nNo, he doesn't.\n\n\nGeorge -\n\n\n\"Anakin has a Padawan.\"\n\n\nFor the vast majority of the show, George touched every episode 3 times.\n\n\nIn the preseason writers room, he would both pitch stories and wander among the episode outline whiteboards with a marker, editing writers' bullet points and erasing whole plot beats.\n\n\nHe also watched and gave notes after the animatic and color cuts of most of the episodes.\n\n\nGeorge was all over the Clone Wars while concurrently being the writer and director of all the prequels. \n\n\nIt was all reconciled in his mind.\n\n\nIf it isn't in yours, that's on you.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jedimobslayer",
            "body": "Definitely, great person, he cared for his clone troopers but was still highly effective on the battlefield. He really embodied Jedi teachings too, because he was immensely powerful but didn’t abuse his power in the slightest.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Reichhardt",
            "body": "No. He was the best.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Sleepinismy9to5",
            "body": "He was the best and he was even better when he had his yellow saber",
            "score": 7,
            "replies": []
        },
        {
            "author": "Severely_Abused",
            "body": "Havent done much personal research but ive heard from the community that hes one of the greatest Jedi and Generals. During Order 66 he was shot down instead of executed since he was so powerful. Atleast thats what i heard",
            "score": 20,
            "replies": [
                {
                    "author": "telking777",
                    "body": "I figured he was shot down during Order 66 simply bc he was flying at the time. Got blindsided like everyone else (save Yoda)",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Severely_Abused",
                            "body": "This is also very possible. My only recollection of Plo Koon lore comes from a youtube video a few years ago. I don’t remember the specifics only “Plo Koon much stronger than a lot of ppl know” lol",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "telking777",
                                    "body": "Yeah fair enough, apparently I remember hearing he was the only one to beat Yoda in a duel (though they were sparring—obviously Yoda wouldn’t try to kill one of his colleagues)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "insidiouskiller",
                                            "body": "I think this is info is from a game that isn't canon anymore.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "telking777",
                                                    "body": "Oh really? I figured it was from TCW or a legends comic.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ivanovic-117",
                    "body": "In the series the Clone Wars, he is very liked and respected by the clones and Ahsoka, he could've been a great master to her.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Jrocker-ame",
                            "body": "I agree he could have. But would she still be alive? I'm not so sure.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Ivanovic-117",
                                    "body": "Right, that could've shifted her character and basically location at the time of order 66 so likely not able to survive it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "insidiouskiller",
                            "body": "No doubt he would be, but her chances of surviving would go down drastically.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "the_raging_fist",
            "body": "He was to me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Chef_RoadRunner",
            "body": "He saved \"expendable\" clones (by their own admission). Not expendable to him. He is one of the greats.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Cpdio",
            "body": "Yes, next question.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kuhneel",
            "body": "His mask suddenly looks like an overcooked chicken and I can't unsee it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Psychonautica91",
            "body": "He was an *amazing* Jedi and general. He was beloved by his troops and respected as a wise and powerful Jedi. The fact that he was shot down in a starfighter during Order 66 was the biggest injustice. in my HC they did this on purpose as it would have been near impossible to get over on him otherwise. I imagine it would have been similar to Yoda on Kashyyyk, with Plo sensing their intentions well ahead of time and escaping.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MasterGameBen",
            "body": "Yea",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zanuthman",
            "body": "Can’t say whether or not he was a great general (he never seemed BAD at it) - but he was one of the best of the late Jedi Order in terms of actually being what they stood for and set out to be, genuinely great lad",
            "score": 2,
            "replies": []
        },
        {
            "author": "Superman246o1",
            "body": "Wars not make one great.",
            "score": 2,
            "replies": []
        },
        {
            "author": "New_Writer_484",
            "body": "Plo Cool",
            "score": 2,
            "replies": []
        },
        {
            "author": "Soft-Math4894",
            "body": "For me the he’s with fisto the best jedi",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChadVonDoom",
            "body": "If only he was a better pilot...",
            "score": 2,
            "replies": [
                {
                    "author": "Cpdio",
                    "body": "He was, but you can't be fully prepared to be betrayed by your most loyal troops.\nGod damn you Jag!!!!!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ChadVonDoom",
                            "body": "Dahaha Plo go boom on Cato Nemoidia",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FalseAd4246",
            "body": "He was one of the most beloved Jedi ever and a great warrior and general. Watch the Clone Wars. He is wise and powerful but restrained.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ReadJohnny",
            "body": "I'm personally glad he had the breath machine thing + goggles at all times, bc his looks are cutting close to a human with horrible burn scars. Yeah, I don't know. I like the character for his actions and attitude though.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BaldViking42",
            "body": "One of the best generals out there by far! I served with general plo in the 104th battalion we were responsible for many sepy deaths!",
            "score": 2,
            "replies": []
        },
        {
            "author": "TwistFace",
            "body": "One of the few Prequel Jedi we’re still allowed to like.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bantis_darys",
            "body": "[Yes](https://youtu.be/id1aH0A03dI?si=CVeRH0jyTT_AZqWZ)",
            "score": 1,
            "replies": []
        },
        {
            "author": "mudamuckinjedi",
            "body": "All his \"bro's\" sure thought so!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DW496",
            "body": "I don't know, but at a glance it doesn't seem like laws of natural selection applied to their species.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sour_jack",
            "body": "r/starwarscirclejerk",
            "score": 1,
            "replies": []
        },
        {
            "author": "travelingelectrician",
            "body": "Why does he have a rotisserie chicken on his face",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrkruk",
            "body": "George Washington:  \"Nobody knows.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agitated_Lychee_8133",
            "body": "Everytime I see him, \"Don't glance down for lest you stab yourself!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Former_Exam_103",
            "body": "Watch the Clone Wars. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "MacPeter93",
            "body": "Yes. Always been my favourite since Jedi power battles for the PS1 showed him with a yellow light saber",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sammisuperficial",
            "body": "Is the Shadow Virus blue?\n\nPlo Koon is the fucking man!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative-Cow-5507",
            "body": "Yeah, he really cared for his clones, treating them like actual people instead of just tools of war.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fusionsofwonder",
            "body": "He was a great Jedi and one of the Generals who didn't see clones as expendable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MASTER_L1NK",
            "body": "He was bro to the clones and they were Plo's bros 🥹",
            "score": 1,
            "replies": []
        },
        {
            "author": "tertiaryunknown",
            "body": "Plo was the model Jedi. \n\nHe wasn't judgmental, he wasn't quick to any kind of emotional response, he was rational, kind, and most of all, *compassionate.*  He was one of the few truly well adjusted, emotionally stable Jedi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pumz1895",
            "body": "He found Ashoka, my favorite Jedi/light side force user character, so yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darish_Vol",
            "body": "yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "mightlightnightkite",
            "body": "Easily one of the best for both",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grandturk-182",
            "body": "Great at getting smoked.",
            "score": 0,
            "replies": [
                {
                    "author": "telking777",
                    "body": "It was a traitorous coup, many renowned Jedi were slain in Order 66 no shame in dying during the Great Jedi Purge",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Grandturk-182",
                            "body": "Many traitorous Jedi were executed for their crimes against the Republic, you mean.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Antipasto_Action",
                    "body": "lmao got em",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AreWeNotMenOfScience",
            "body": "He sure as shit didn't do anything when Ahsoka was framed.",
            "score": 1,
            "replies": [
                {
                    "author": "insidiouskiller",
                    "body": "He was one of the three, alongside Obi-Wan and Yoda, to vote against kicking her out of the order, and the only one from the council to personally apologize.* That puts him well ahead of everyone else in the council.\n\n\n*The council as a whole apologized to Ahsoka, but this is undercut by their individual remarks (e.g Windu and this being the will of the Force).",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shreddzzz93",
            "body": "He was probably a good Jedi. But like all Jedi, he would have been a terrible general. It's the Jedi philosophy that would prevent them from actually using effective tactics to ensure victory with minimal allied casualties. \n\nWe see a lot of ground battles. We never see them using orbital assets to soften up landing zones or suppressing the enemy. They rarely utilize any starfighters or LAATs for air support during ground battles. There is a distinct lack of artillery support during offensives. At least they occasionally utilize armour to spearhead ground assaults. It's things like this that make me doubt Jedi as generals as these aren't hard military concepts to grasp or utilize.",
            "score": 1,
            "replies": [
                {
                    "author": "Jinn_Skywalker",
                    "body": "He definitely wasn’t a bad general. In fact, he was one of the best the order had. Being a veteran of the Stark Hyperspace War giving him experience as well as winning battles in the clone wars that should have ended up with him having far more casualties being greatly reduced. \n\nHonestly you sound a bit like Tarkin with what you said.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "GentPc",
                    "body": "Actually...this. There were gunships but those were lightly armed against heavy targets. You never did see starfighters used as ground support/airstrikes. And the only artillery, necessary for any ground campaign, were the SPHA-Ts seen in in AOTC and those took on more of an AAA role.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Life_Ad1637",
            "body": "War makes one not great.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OdysseusRex69",
            "body": "ALL of them sucked as generals lol\nNo strategic planning, no tactical initiatives, ALL of them employed Napoleonic tactics and just matched their troops in en masse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "berusplants",
            "body": "Not to me!",
            "score": 0,
            "replies": []
        }
    ]
}