{
    "title": "There's a lot of negative feelings regarding the disney canon, so what are some changes/inclusions that you actually liked?",
    "author": "Late-Sorbet",
    "subreddit": "StarWars",
    "rank": 7,
    "score": 266,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 396,
    "url": "https://www.reddit.com/gallery/1je6tjt",
    "id": "1je6tjt",
    "selftext": "For example: Personally I like the inclusion of phase 1 stormtrooper armor as seen in the bad batch",
    "comments": [
        {
            "author": "Broad-Importance-386",
            "body": "Jedi: Fallen Order / Survivor",
            "score": 502,
            "replies": [
                {
                    "author": "theavengerbutton",
                    "body": "These games had so much cool lore, and I'm not just talking about the Zeffo stuff, but just seeing more of the Inquisitors, getting to actually go to their fortress, seeing what the Empire was doing during this era, it was so much fun. Even getting to infiltrate an ISB base of operations was really cool.",
                    "score": 161,
                    "replies": [
                        {
                            "author": "HonestAvian18",
                            "body": "Love what they did with Jedha too. Proved it wasn't just another Tatooine copy by making it a planet with distinct and awesome flavor.\n\nOne if they few planets I actually did read about everything I scanned and investigated.",
                            "score": 92,
                            "replies": [
                                {
                                    "author": "thetinwin",
                                    "body": "Same. I found myself scanning and reading almost everything. I want even more in Jedi 3. I want to be able to live in these games and just spend hours discovering and exploring lore.",
                                    "score": 30,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EuterpeZonker",
                            "body": "I liked the rivalry between the Inquisitorious and the ISB too.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "_OngoGablogian",
                                    "body": "getting to see the inner workings and politics of the empire is one of my favorite parts of andor too",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Frege_Gottlob",
                            "body": "The only thing I can't stand is how over the top the nightsister's magic is, it's too much fantasy and will always feel out of place in Star Wars for me",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "versusgorilla",
                    "body": "I know people are gonna shit on me for having a positive opinion, but I also really liked Outlaws. I hope we get more. It's not flawless but it is a story without the Jedi or Sith, just you trying to put a crew together, playing different gangs off one another, and the Empire looking over all the criminal activity. It's a legit open world Star Wars game and it's cool just walking around and existing in the world.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "SoulRebel726",
                            "body": "I loved Outlaws. It had it's flaws and suffered a little from that stale Ubisoft formula, but it was great fun overall. I loved the characters, the story, and the locations. It always feels refreshing to me to enjoy the Star Wars universe without jedis, the force, the rebellion, etc.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "versusgorilla",
                                    "body": "Yeah. I liked that the story skirted things happening in the Galaxy, but was mostly about the criminal underworld, Imperial spy activity, and how both sides fund the war. That's exactly what a smuggler/outlaw should be interacting with throughout their story.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Frege_Gottlob",
                                    "body": "Characters and story were really generic and riskless, this was a deal-breaker for me",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EverGlow89",
                            "body": "Most people who actually played Outlaws had a really good time. It was made by Star Wars fans and it felt way more Star Wars than even the 2 Jedi games did. That's my hot take as someone who LOVES those games and beaten them both on JGM multiple times.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "versusgorilla",
                                    "body": "Yeah, I hope it ages into the love that the Jedi games get because I really think it was solid. No other SW game lets you just wander around the city listing to conversations and feeling like you're part of the universe.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Frege_Gottlob",
                                            "body": "It will not because it's a shallow open world and the devs will definitely not work anymore on it, it's basically Hogwarts Legacy in Star Wars.\n\nBoth KOTOR games let you exactly wander around the city and actually having conversations.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HereForSearchResult",
                            "body": "Honestly I fucking loved playing as Kay Vess, and adore Nix!",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "versusgorilla",
                                    "body": "As a gameplay element Nix is also very good, I'd be excited to see how a sequel can expand what he can do. It felt like they really took that element from the controls in Watch Dogs, where you can like hack enemy tech and gain an advantage. \n\nSo I'd love to see what they can accomplish with him going forward. Between Kay and Nix, and Cal and BD-8, some really good Star Wars videogame protagonists.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Poco585",
                            "body": "Were there even any actual legitimate complaints about it? All I saw were people calling it woke and mad that they didn’t think the female protagonist was a 10/10.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "NecessaryMagician150",
                                    "body": "It was buggy af when it first came out. Also, the gameplay has been tweaked a bit since but there were some really basic quality-of-life things that werent available when the game released (couldnt switch weapons or even use a ladder without dropping the heavy weapon) The forced stealth sections were also patched after release. Lastly, theres pretty much zero interactability with NPC's and stuff. So the cities look amazing but you cant actually do much. \n\nIts a solid 7/10 game, maybe even a 8/10 if you love the Star Wars universe as much as I do but at release it had some pretty noticable issues and frankly, even after patches, the gameplay loop can get boring.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "versusgorilla",
                                            "body": "The patches absolutely helped.  The forced stealth is essentially gone from the game, the gameplay is much tighter, I experienced very few bugs. I could see it getting knocked at release for those things.  \n\nI liked the interactivity with the NPCs where some would reveal job threads, but there isn't much interactivity.  I think a game like RDR2 spoiled people where you have this button to essentially say HOWDY to anyone in the world and there's everything from generic responses to mission-opening responses.  Outlaws is def not RDR2, but also not many games ARE.  I love Cyberpunk 2077 but you can't really meaningfully interact with NPCs in that game either.  People on the street are always basically just standing around idly.  \n\nUltimately, I think it's a solid 7 or 8 out of 10, like you said.  How invested you get in running jobs and whatnot is up to you, there's not much else beyond the main story to grind out, but that's fine by me.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Frege_Gottlob",
                                                    "body": "There is an inifinite gap between being RDR2 and being as static and uninteractive than Outlaws or Hogwart's Legacy",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "versusgorilla",
                                                            "body": "> There is an inifinite gap between being RDR2 and being as static and uninteractive ~~than Outlaws or Hogwart's Legacy~~ *like 98% of open world games*",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "versusgorilla",
                                    "body": "I don't know anymore, sometimes SW fans just flame opinions lol \n\nBut I liked the game a lot, had some fun characters, the plot with the droid in your crew is legit good.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Poco585",
                                            "body": "Agreed, I’m still having fun playing it.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "versusgorilla",
                                                    "body": "I won't spoil anything but I genuinely hope we get another one! I know it didn't sell great, but I hope it sold well enough for Ubi to make another. I'd love other planets and a new heist and new crew and old crew working together.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Frege_Gottlob",
                                    "body": "It's a very shallow and unreactive open world, vegetation barely react, objects barely move, you can't do any act of outlaws in cities (like shooting people, stealing vehicles, etc...), the factions system is extremly shallow and will barely matter, it's also extremly farmable making it ridiculously easy to max every faction, the finishers animations are extremly redundant and mostly simplistic, the open world is empty, the forced stealth sections are a complete mess, the story is a plain banality made to please everyone (and therefore appearing as unpersonnal and uninteresting to many), facial animations are poorly fixed, and a lot of minor details",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "SovietBear25",
                                    "body": "People will hate anything made by Ubisoft without even playing it.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "PotatoOnMars",
                                    "body": "It’s your run-of-the-mill open world Ubisoft game with a Star Wars paint job and Ubisoft is really despised right now in the gaming world.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "_OngoGablogian",
                                            "body": "it's understandable. they have a bad reputation for a reason",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Apprehensive_Ear4489",
                            "body": ">I know people are gonna shit on me for having a positive opinion, \n\nCan people seriously stop with this defensive stuff? How are you not embarassed writing this?",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "Apprehensive_Ear4489",
                            "body": ">I know people are gonna shit on me for having a positive opinion, \n\nCan people seriously stop with this defensive stuff? How are you not embarassed writing this?",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "versusgorilla",
                                    "body": "Are you not embarrassed commenting about the way other people comment???  Because according to your comment history, it's essentially all you. lol",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "_OngoGablogian",
                                    "body": "dawg all you do is shit on people in your comments. how are YOU not embarrassed?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BobTheFettt",
                    "body": "I'm gonna get flak, but I'm also really enjoying Outlaws",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Broad-Importance-386",
                            "body": "I'm enjoying it too. I haven't played an Ubisoft game since AC2 and got Outlaws after the patch, so I didn't experience all the 'its just another Ubisoft game' criticisms or the negatives from its initial release that others have. I feel their marketing focused too much on the Wanted system and not nearly enough on how huge the game is and getting to live in the Star Wars universe. I had no idea that Tatooine was even in it let alone getting to explore Mos Eisley and Jabba's Palace.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BobTheFettt",
                                    "body": "I bought it in Friday because it's 50% off and I gladly would have paid full price if I knew I was going to have this much fun. I like role playing my allegiance too. I always help out the hive when I have the chance because I feel like they deserve the help",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AppointmentMedical50",
                    "body": "Poncho!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "jradpoll",
                    "body": "Absolutely amazing games!! Really contributed to the overall lore of SW in a very positive way.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ophaus",
                    "body": "Truly fantastic games!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Azula-the-firelord",
                    "body": "A lit of good stuff, but that some wild flying animals are always conveniently placed behind the end of some platform to use. This feels more like a super mario level.\n\nAlso, 99% of the game is wall-climbing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iiZyrux",
            "body": "Rogue One and Andor",
            "score": 326,
            "replies": [
                {
                    "author": "Wolferion89",
                    "body": "Exactly. It showed Star Wars is more than just lightsabers",
                    "score": 89,
                    "replies": [
                        {
                            "author": "ResponsibleArm3300",
                            "body": "Even though the best rogue one scene was Vader slashing dudes in half",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "zamwut",
                                    "body": "I'd argue that the Space Battle above Scariff was the best scene. Hammerhead to the rescue",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "grogbast",
                                    "body": "That 30 second scene is the reason I walked away liking that movie",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "pajamajoe",
                                            "body": "You didn't find anything else compelling in the movie?",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "grogbast",
                                                    "body": "The robot was funny now that I’ve thought about it for a few more moments. After TLJ my enthusiasm for Star Wars cratered so I was pretty critical of it. Maybe unfairly so. But in honesty the Vader scene was all I remembered until I thought about this to reply to you.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Past-Information7969",
                                                            "body": "TLJ came out a year after R1.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "grogbast",
                                                                    "body": "And I saw R1 after TLJ because I heard it was supposed to be pretty good.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Past-Information7969",
                                                                            "body": "Fair enough.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "grogbast",
                                                                                    "body": "Yeah. I didn’t think TFA was very good either which is why I didn’t get around to watching them very quickly.\n\nEdit to add I’ve never watched ep9",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Past-Information7969",
                                                                                            "body": "I thought it was....ok-ish. TLJ was a shitshow and TROS was a straight-up abortion.\n\nR1 though gave me the tingles..",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ResponsibleArm3300",
                                            "body": "That is the best scene is any star wars movie. \n\nWhy didn't Disney give us full movies of that? \n\nSo much wasted potential.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "AnusiyaParadise",
                                                    "body": "Not sure the shock factor can hold up for a full feature length movie. The satisfaction is in how effortless Vader overcomes resistance, which wouldn’t work well as a full movie.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "grogbast",
                                                            "body": "I disagree. A full movie of Vader kicking in everybody’s shit while expounding on the lore and telling a story would be amazing. If you need conflict/impediments throw in a bunch of imperial officers impeding his success to showcase his disdain for them in the later movies.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ResponsibleArm3300",
                                                            "body": "Obviously they'd have to further develop some sort of plot, yes.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BLU3SKU1L",
                            "body": "Solo did alright with that too.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "BearToTheThrone",
                                    "body": "Solo gets flak but I'd watch it 1000 times before watching Rise of Skywalker again.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "UnionBlueinaDesert",
                                    "body": "Not actually a bad film, not great, but a totally good watch",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Star_Warsfan15",
                    "body": "This is mine. It’s hard to think of a world without it",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "iceguy349",
            "body": "The idea that the rebellion was a combination of different individual cells with different ideologies that slowly united into one common front with the goal of eliminating fascism from grassroots resistance to imperial authority. The movement was a mix of political idealists and extremists everywhere from Mon Mothma to Saw Gurerra. \n\nLegends is gigantic so I’m sure there’s like 50 explanations for where the rebels come from but the fact that starkiller in the force unleashed games basically built the rebel alliance as part of a conspiracy from the empire itself to destroy all its enemies in one fell swoop feels so stupid. I prefer people’s intrinsic desire for freedom and fairness motivating cooperation and the courage to take a stand over one edgy video game boy making a rebel club so he can serve them up on a silver platter for his boss.",
            "score": 210,
            "replies": [
                {
                    "author": "thatguywhosadick",
                    "body": "Damn almost like it’s an alliance of rebels",
                    "score": 77,
                    "replies": [
                        {
                            "author": "UncannyJC",
                            "body": "The fact that it's literally named Rebel Alliance but The Force Unleashed showed otherwise was stupid. Glad the new canon did not double down on it.",
                            "score": 34,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "the_tailor",
                    "body": "I completely agree. I love how Rebels laid the groundwork for this, and Andor as well.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Frege_Gottlob",
                    "body": "Wasn't it always the case?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Cloak-Trooper-051020",
                            "body": "It was before the Force Unleashed was released in 2008.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AHorseNamedPhil",
                    "body": "This is probably going to be considered a hot take, considering that game was so fun and thus extremely popular, but the story was really dumb and was a bad addition to the lore. Didn't matter that it was only legends and wasn't official canon.\n\nHaving the rebellion sort of be kickstarted by some total Mary Sue dark side practioner was some edgelord nonsense and the opposite of interesting. I loved playing the game because the gameplay was so well executed, but words can't express how much I hated the writing involved in the story. It felt like really bad fanfic and would be near the top (bottom?) of my list for worst EU content.\n\nAndor gave the rebellion a far better, more interesting, more sympathetic origin.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BurtIsAPredator123",
                    "body": "Wholesome 100",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "grimfett165",
            "body": "The Bad Batch did a good job showing us how the Clone Troopers were quickly phased out and discarded by the Empire. It appeared rushed compared to the Legends continuity, but I thought it made the Clones even more tragic characters.",
            "score": 153,
            "replies": [
                {
                    "author": "Psychonautica91",
                    "body": "And then the old homeless looking clone in Obi-Wan.. it certainly paints a tragic picture.",
                    "score": 45,
                    "replies": []
                },
                {
                    "author": "PuzzledMajor5446",
                    "body": "What happened in legends?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "grimfett165",
                            "body": "Battlefront II (2005) established that the Empire continued using Jango Fett clones as Stormtroopers until Kamino tried to rebel with their own Clone Army. Boba Fett was hired to help the Empire infiltrate Kamino and squash this rebellion. After that, the Empire started recruiting regular citizens into the Stormtrooper Corps.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "ScooterScotward",
                            "body": "In Legends iirc they continued using the Fett clones for several years, some even serving for a decade or more, but also quickly introduced several new lines of Clone soldiers from different genetic donors, and started recruiting from the population, so you had a mix like in canon, but a lot more use of Fett clones and other clones.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DoubleOhoot",
            "body": "I actually like the change in how red kyber crystals are made.  It just feels more Sith to me than a synthetic crystal.",
            "score": 245,
            "replies": [
                {
                    "author": "Moske384",
                    "body": "I also love this because they also introduced white as a saber color, which was always my favorite idea for a color. The added detail of achieving a white saber through purifying an already bleed crystal is badass as well.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "404-tech-no-logic",
                            "body": "I suppose it’s not in Cannon, but logically you could purify blue and green crystals to become white as well.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RSquared",
                            "body": "NGL I find the white saber purification very mary sue-ish. If it'd just been another color, or even a krayt dragon pearl lightsaber (per KOTOR), I wouldn't mind so much as \"my jedi character is so special she purifies evil lightsabers\".",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Themountaintoadsage",
                                    "body": "Considering the Jedi didn’t think any sith were around for 1000 years it’s understandable that we hadn’t seen any white sabers before that",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Renault_156",
                                    "body": "You can’t be serious, do you even know what “Mary Sue” means? It’s just a lightsaber color dude, sheesh.\n\nAlso, nowhere it’s stated that only Ahsoka can do it, it’s just happened to be the only one who needed to do it",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "synthecizm",
                                    "body": "I agree, I know talking bad about Ashoka as a character is like blasphemy these days…. but I’m a bit fatigued by the overabundance of her.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Darth-Purity",
                    "body": "Blood for the crystal god!",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Loud-Taste6394",
                            "body": "Technoblade?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zoodlenose",
                    "body": "Yeah the synthetic crystal just doesn’t make sense unless there is like a legion of darkside lightsaber wielders. Like why would you need synthetic anything if there is 2-6 people in the galaxy at a given time with a red lightsaber.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "versusgorilla",
                            "body": "Yeah. I didn't like it at first but I think I've come around. It's more magical and I think SW is better when the Force is more magic and less technologically explained. It's like Sith eyes turning orange, the Force being so twisted by anger and hate and rage that the color can't be anything but red.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "LordDusty",
                                    "body": "You can go too far and make the force too magical though. \n\nThe best (or worst) example of this being the nightsisters and how the witches use the force, its all green smoke and chanting. In my opinion its taken the force too far towards just another fantasy magic system. \n\nSith lightning was fine when it was the one unique visual example of using the force. For so long it was just telekinesis and more mental powers like clairvoyance and mind control but now, especially with the witches, its been pushed into a more generic 'anything goes' sort of thing which has taken away from what made the force interesting in my eyes.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "versusgorilla",
                                            "body": "You're not wrong, I think the Nightsister's green smoke is the other end of the Midichlorine scale of how the Force should be illustrated to the viewer.  I think Obi-Wan explaining the Force to Luke in ANH, and Luke explaining the Force to Rey in TLJ, are the two best instances of how we should think about it, and the creators writing for the Force should always try and go back to these explanations and see if their powers, etc tie back in with these explanations. \n\nTo bring it back to the kyber crystals, I like how they focus the lightsaber for use as a blade (technological) and give it the blade's color (technological), but that the color chosen is \"in tune\" with the person wielding the saber (magic) and that the crystal will hold it's color even if the saber is lost or missing and recovered by someone else (magic shitt) and that if a Sith or dark side user uses a saber for long enough, it will inevitably turn red (magic-ass-shit there) This feels like a good balance between tech and magic, I think that creators should always be looking for this kind of balance.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "HyliasHero",
                                            "body": "I axtually like when the Force gets weird and mystical. It sets it farther apart from the technological angle of the rest of the setting.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TsunGeneralGrievous",
                                    "body": "Personally i think star wars is best when it is s mix of both. Not one more than the other.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "versusgorilla",
                                            "body": "I like when some things are more technological than others. I like that the ships and hyperspace and how lightsabers work all feel more technological. \n\nBut then shit like how the actual kyber crystals work, how the Force works, how people actually utilize the Force, that all works best when it's kind of a mysterious magic and no one really tries to explain it too much. \n\nIt's absolutely a balance, if it gets too techie, then the explanations feel dry and scientific and it limits the things that can happen. But if they're too magical then it risks feeling like anything can happen. \n\nAll about that balance for sure",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheRomanRuler",
                            "body": "It made sense way Darth Maul did it, he somehow mediated while making it so it was infused with Dark side. Difference was minor enough that nobody else did it, but for him it was also symbolic part of the journey or something. If they made it into lore, then it could have been given bigger impact.\n\nAnother reason is that it prevented Jedi from accidentally coming across a Sith when they venture to same place to get the crystal of their own, it ensured they could remain hidden. Once they became more established they propably could have done it via numerous secret illegal subcontractors and smugglers, but early on the Sith who hid did not yet have connections and power they amassed over centuries.\n\nSymbolically it was also good. Something unnatural vs something natural, contrast between Sith and Jedi.\n\nIts actually propably what inspired the canon bleeding. And i do agree that canon bleeding is good addition, though at first i cringed a little, name did not help. But its fine now that i am used to it.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Late-Sorbet",
                    "body": "Agreed, it makes the entire existence of red lightsabers so much more rich in terms of both visual story telling and a characters previous journey if that makes sense",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Any-sao",
                    "body": "The synthetic crystal explanation was just a retcon to explain how Luke made a second, red, lightsaber without being provided a crystal back in a 1985 Star Wars comic.\n\nIt was an excellent comic anyway, though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doa-Diyer80",
            "body": "Rebels",
            "score": 72,
            "replies": []
        },
        {
            "author": "CourtofTalons",
            "body": "I really like [Lord Momin](https://starwars.fandom.com/wiki/Darth_Momin), an ancient Sith who went toe-to-toe against Vader (and nearly won).",
            "score": 15,
            "replies": [
                {
                    "author": "Code-Neo",
                    "body": "and found a way to cheat death kinda",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Traffic1319",
            "body": "I’m gonna be honest, other than the sequels, there isn’t a lot I dislike. I just finished acolyte, expecting it to be bad cause of all the hate, but I actually really dig it. I’m very optimistic about the future of Star Wars, which is not where I was after the sequels came out five years ago. I’ve been digging into the high republic books now and I’m really into them so far. Excited for Andor season 2!",
            "score": 95,
            "replies": [
                {
                    "author": "Which-Worth5641",
                    "body": "Yeah I liked most of the Acolyte episodes too. I just don't understand how it cost so ridiculously much to make.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "soulreapermagnum",
                            "body": "one reason i've heard is because they couldn't reuse a lot of props and what have you, like they can for imperial/NR era stuff. they had to make all new things.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Which-Worth5641",
                                    "body": "Even it was more well liked, there's no way they can sustain making show seasons for a streaming app that cost over $200M.  That's crazy.  The production values and actors they used weren't even A-tier.\n\nAs a general show I thought it was \"fine.\"  An interesting exploration of the Jedi in a different era.  \n\nBut for a $200M show it was severely lacking.  It should be freaking Emmy quality for that kind of money.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "batmite06NIKKE",
                    "body": "I honestly didn’t like acolyte but it wasn’t too bad honestly, what did u like most of it?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Ok-Traffic1319",
                            "body": "The lightsaber fights were cool, and honestly something I really appreciated about it were the “show, don’t tell” aspects. Like some things I noticed were in episode 1, before you find out she has a twin, it shows Osha being unable to use the force to escape the prison cell. So with no dialogue, you then know that she’s not guilty, where before you assumed she was because she looks the same as the person who killed the Jedi. In episode 3 there’s a similar thing where you see the coven of witches lying on the floor in the burning building, but not burning, so you know something is up there. Then after the big lightsaber fight in the woods the tracker guy goes back to the ship, revealing in case you missed it that it’s actually Mae on the ship and not Osha. None of that has any dialogue but it still communicates with the audience. (I just watched it so there may be more, but those are the instances that jumped out at me). That kind of stuff keeps you interested and isn’t heavy handed. Plus it had cool lightsaber fights and I really liked the villain as a character. \n\nAll that more than made up for the awkward acting of a couple of the characters and some of the bad dialogue in my mind. I don’t think it was a perfect show, but I quite liked it, and I don’t understand why it has like 1 star reviews all over the place. Like come on guys, this isn’t a one star show.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "batmite06NIKKE",
                                    "body": "Cool. I definitely loved the fights honestly",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hoodpharmacy",
                    "body": "You like acolyte? Yikes",
                    "score": -57,
                    "replies": [
                        {
                            "author": "pastalex42",
                            "body": "I’m sure the group of fans for that show is larger than any of us realize. Most people don’t actually talk about their opinions online, so there’s no way to know.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "BobTheFettt",
                                    "body": "And this guy's reaction is exactly why I don't talk about things I like. I'm what's known in the biz as \"a mark\" so I like just about anything",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "pastalex42",
                                            "body": "That’s a blessing, friend. People are gonna be weird about it in any circle but the ability to find enjoyment in most things sounds excellent to me",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "hoodpharmacy",
                                    "body": "I’m not sure how, the writing and direction was terrible on that show.",
                                    "score": -22,
                                    "replies": [
                                        {
                                            "author": "pastalex42",
                                            "body": "Oh I agree, but I also think Death Stranding is one of the worst video games made in recent memory, truly a failure on all fronts. And yet, there are people who love it. I can’t possibly comprehend that, but good for them.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "hoodpharmacy",
                                                    "body": "Yeah, I mean if you like something you shouldn’t be afraid to admit it but I guess I just have a higher standard for things like that. There’s only so much I can overlook in regards to video games, movies, and TV shows.",
                                                    "score": -17,
                                                    "replies": [
                                                        {
                                                            "author": "SZJ",
                                                            "body": "Not so much a higher standard, but a different one.  \nDifferent people prioritize different things.  \nLike, for gaming, I know people who want well over 100 frames per second, and they say they have a higher standard for gaming, but I prefer a lower frame-rate for it to be more \"cinematic\" and closer to the feel of a movie's visuals. They scoff at me playing at 30-60 frames like I'm a buffoon who doesn't appreciate true gaming. But its just my preference.\n\nFor The Acolyte, some people may not care about the bad makeup, meh sets, and the cheesy side characters. But they got super into the plight of these two sisters, and the idea of a Sith who, for once, isn't the typical evil baddie/rageaholic. Personally, I think it was rather a squandered opportunity, but I can see people focusing on other aspects than I did.",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "Ok-Traffic1319",
                                                                    "body": "Yeah basically this. \n\nLike I recognize some of characters aren’t great and some of the dialogue is wooden or awkward. But that like….doesnt take more than a point off of my rating of the show if I had to rate it",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Enceladus1701",
                                                                            "body": "I mean, some people literally ripped their faces off when they saw the color grading for the light saber reflection had changed slightly in the obi wan show. \n\nFor the rest of us, it was a fun show.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Beneficial-Lack-4333",
                                                                    "body": "Also, how many great shows have a rocky first season? I can think of plenty in the 00s. But now it's just canceled.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "BobTheFettt",
                                                            "body": "See, this sense of superiority for not liking things is exactly what's wrong with fandoms these days. You can not like something, that's totally fine. But when you go on about your \"higher standard\" it becomes belittlement, which is not okay.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TelepathicFrog",
                                            "body": "Right? My guys standards are in hell",
                                            "score": -17,
                                            "replies": [
                                                {
                                                    "author": "hoodpharmacy",
                                                    "body": "I can’t imagine half the shit that these people down voting me watch on a daily basis. They took this real personally. 😂",
                                                    "score": -10,
                                                    "replies": [
                                                        {
                                                            "author": "doctor_whahuh",
                                                            "body": "I think people are probably downvoting you for coming off as super condescending.",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Some_Consequence_572",
                                                            "body": "I hated the first four episodes of Acolyte - absolute garbage and terrible writing for both plot and character development. Master Sol was the only bright spot. Episode 5 was, in my opinion, extremely good. Finally seeing lightsabers un-nerfed was amazing. Rest of the show was okay from then on albeit corny, and the little cameo at the end actually had me excited for a season 2, because that character would be amazing to see on screen.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Enceladus1701",
                            "body": "Youre the kind of person who thinks their the majority, but youre just an obnoxious minority.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hoodpharmacy",
                                    "body": "Lmfaoooo",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Whackybiscuit",
            "body": "Doctor Aphra",
            "score": 35,
            "replies": [
                {
                    "author": "ImBackAndImAngry",
                    "body": "All of the Vader comics too for that matter.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "doctorinfinite",
                    "body": "0-0-0 has become one of my favorite characters",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Desperate-Actuator18",
            "body": "The High Republic, the founding of the Rebellion, Kyber Bleeding, Battle of Jakku and the events leading up to it, the majority of the shows, the games, Starhawks, how the Empire reacted after Endor, the comics. \n\nTake away the last two sequels and they've had a good run.",
            "score": 40,
            "replies": [
                {
                    "author": "reenactment",
                    "body": "Yea I don’t really have an issue with most of the stuff. I felt like boba obiwan and ahsoka were clunky, but overall not projects I’d completely diss. acolyte certainly felt it didn’t have a real idea of what format it wanted to be on so that was kind of bad. By I’d only call that and 8-9 as monumental swings and misses. Everything else has at least added something to the story that has enhanced it. Those 3 projects in my opinion detracted from the existing material and that’s why i view it as a negative.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Threedawg",
                            "body": "8 was only a huge miss because of 9. If they had kept going with the themes of 8 (bad guys are the giant Military industrial complex, forces users exist outside of being jedi/sith, both the jedi and sith are largely killed, the first order, new republic, and resistance are all gone and the galaxy is a bunch of independent worlds, etc) star wars could have gotten realllllly interesting",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "reenactment",
                                    "body": "I dunno. I can see where you’re coming from with 8 being a fine movie in a vacuum. But I think this is the woest part about 8. It doesn’t feel like it’s part of the Star Wars universe, at the very least it’s not part of the skywalker timeline. You could watch 8 and never seen the first 7 movies and it wouldn’t matter, heck it might enhance the movie. 8 and therefore 9 lost the plot In bad way. 7 had one redeeming quality, and that was the characters all did a good job with their roles and they all seemed to have a bit of a fun arc to see develop. 8 basically said, this is too much work and cut all but 3 of the characters out of development.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Catandogclone",
            "body": "I really like Vader’s character in canon, I’ve read a few comics featuring Vader in Legends but I didn’t enjoy him as a character in them, but instead just the action and settings he was placed in. In canon I loved the 2015 and 2017 runs, easily in my top 5 Star Wars comics of all time, Pak’s run I’m not a fan of, I read up to the start of the weird purple lightning parasite droid event (up to date) and couldn’t care less about anything happening.\n\nAn inclusion I’m glad about is that they’ve brought some Legends characters over into the ‘new’ canon, such as Durge, Thrawn and Palleon.\n\nI’ll add one thing that I’m not a fan of as it’s on my mind, there being no non force sensitive beings, it feels like it has an easy explanation to give as well, with species selective breeding midichlorines out of the blood pool, though it’s just a minor nitpick and not something I dislike entirely.",
            "score": 18,
            "replies": [
                {
                    "author": "Cloak-Trooper-051020",
                    "body": "The force is connected to all life. Therefore, all species have some force sensitivity to varying degrees. You can’t remove Midicloriens out of a species genetic structure. At best you can only limit or diminish the number, and you’d still have the abnormal high level found randomly in a minority of the species.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sabertooth767",
            "body": "Unpopular opinion, but I like the idea of red crystals being produced through a ritual to corrupt them. I think it highlights the idea of the Dark Side being a parasitic shadow of the true Force. \n\n\nThe way The Acolyte portrayed it is stupid though.",
            "score": 96,
            "replies": [
                {
                    "author": "Agitated_Insect3227",
                    "body": "I like it too for the reasons you stated. It's a perfect representation of how the Dark Side corrupts and kills anything it comes across, even a Kyber Crystal.\n\nHowever, I still really like the Sith, especially the Bane-era/Rule of Two Sith, using synthetic crystals as I find it perfectly highlights how the Sith typically don't see the Force as a living thing that coexists with life in the Star Wars Galaxy. They see it as only a nonliving weapon to harness for their pursuit of power. \n\nI would honestly love if both versions of getting red lightsabers were canon.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Sabertooth767",
                            "body": "Agreed- I don't *dislike* the idea of the synthetic crystals, it makes perfect sense during periods where the Sith were in hiding (and therefore did not have a ready supply of crystals). However, bleeding a crystal definitely seems like something they would do if given the opportunity, such as a Dark Jedi turning their own crystal or a Sith claiming the crystal of a Jedi they killed.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "insidiouskiller",
                            "body": "They could easily be. Though not for rule of two sith perhaps. \n\nBut rather, Sith War times, back when there were FAR more sith. There, the mooks could all use synthetic, and anyone more than a mere mook bleeds to get their crystals. Could even have it as a way of rising through the ranks, perhaps?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "LordDoom01",
                                    "body": "This is the only way I like Kyber Bleeding. Not as some basic ritual every recruit preforms, but done by masters as a sign of their strength. They have to kill a Jedi rival and bleed their crystal as a show of dominance. Recruits get synthetic cause the dark side is all about the easy way, hunting down a fully trained Jedi while unarmed is not easy. Meanwhile growing one in a lab is easy, even if it is inferior to real Kyber.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Guuichy_Chiclin",
                            "body": "I wish the old Legends view of Lightsabers was also canon. Where red wasn't exclusive to the dark side until the Sith order made it so. Before then, you could chose any color you wanted and still be a sith, or chose red and still be a Jedi, the colors meant nothing other than the choser likes the color.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DoubleOhoot",
                            "body": "I just prefer the idea of it being a sort of test for a dark side apprentice to have to hunt down and kill a jedi and then force their will and hatred onto the crystal as apposed to whipping it up in a lab.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jaycomZ",
                    "body": "I actually liked how it happened in the Acolyte. I don't care about lore when we can have cool moments like this",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Renault_156",
                            "body": "That moment was pretty stupid. Bleeding in canon is much cooler than “I got angry and bled the crystal while the saber is still active”",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "jaycomZ",
                                    "body": "Nuh uh",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FunFlatworm9500",
                    "body": "How? The acolyte showed it just like has been before",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Sabertooth767",
                            "body": "The Acolyte showed it as being an accident, the result of a crystal simply being in possession of a dark sider. This directly contradicts previous lore, e.g. Anakin's lightsaber is blue during his assault on the Temple.\n\nIt should be an intese, purposeful ritual, the equivalent of a Jedi building their lightsaber.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "xraig88",
                                    "body": "The Acolyte showed a few important things though. They showed it's not a mood ring and didn't just color change because she was mad. \n\n  \nOsha was physically touching the exposed crystal from that damaged lightsaber and using intense dark side emotion to murder someone close to her. She was completing the ritual, even if it was inadvertently. \n\nAnakin's saber didn't turn red during the attack on the temple because he wasn't making any sort of physical contact with the crystal.",
                                    "score": 36,
                                    "replies": []
                                },
                                {
                                    "author": "reehdus",
                                    "body": "Anakin was not touching the exposed crystal. Both Osha and Ben were.",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "TheRealKidsToday",
                                    "body": "That’s literally not what happened. First, the crystal itself was exposed to Osha’s hand and she had just realized the entire truth behind her relationship with Sol who betrayed her. While it wasn’t entirely deliberate, to reduce it to just “being an accident” and “someone being a dark sider”, is either deliberately misguided or just shows you didn’t pay attention.\n\nAnd for the Anakin point, Anakin never had the time or opportunity at that point to bleed his crystal. Plus I’m sure him coming into the temple with a blue saber would have helped with the element of surprise.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "FunFlatworm9500",
                                    "body": "Not entirely. Osha was pretty full of emotion, anger, fear, hate, etc. only then did it bleed",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "xenophon57",
                                            "body": "Of course Osha is full of emotion too if the government was defunding you and everyone on the jobsite hates you./S",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Sabertooth767",
                                            "body": "Sure, but that's just a fact about the Dark Side.",
                                            "score": -9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Dukeshire101",
                                    "body": "Dude , come on. Touch grass. Anakin was holding it with his gloved hand, and who cares",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DoubleOhoot",
                                    "body": "I'm with you, to me it should be more of a concerted effort where the dark sider forces all of their hate and dark side energy into the crystal to corrupt it and should take focus and effort.  She looked surprised it was happening in Acolyte.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Dukeshire101",
                                            "body": "Of course she looked surprised. Man, this fandom is cooked",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "DoubleOhoot",
                                                    "body": "Yeah and my point is it shouldn't be an f'ing surprise.  It should take effort and concentration to force your will onto the kyber crystal, not oh I'm mad whoops oh I guess it's red now oopsie.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Dukeshire101",
                                                            "body": "That’s not what happened. Stay off YouTube and watch the shows",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Laxien",
                    "body": "Prefer the synthetic crystals! Why? It is so Sith to scorn natural crystals (just like they are not satisfied with the natural abilities provided by the force! Nope, they go further, they use the force to produce unnatural beasts like the Terentatek or even the Dashade!) and make their own, which start out corrupted by the Dark Side and are \"more perfect\" than naturally found ones and have a chance to simply \"shatter\" an enemy lightsaber's blade (and sometimes even destroy the Jedi's crystal in the process!)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "insidiouskiller",
                    "body": "I don't think that's \"unpopular\" as much as it is \"controversial\"\n\nbut yes, I also like this for much of the same reason. Agreed that Acolyte wasn't a good portrayal, Dagan's in Jedi Survivor was better, though that's still not as good as when it was first shown in the Vader comics.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dukeshire101",
                    "body": "No it wasn’t. You all just like to complain",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "craiglet13",
                    "body": "There is just no way that Anakin’s lightsaber doesn’t turn red after killing all those younglings. Sorry, I’m not buying the whole lightsaber bleeding ritual.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "BasMaas",
                            "body": "Anakin didn't touch the crystal during order 66...",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BasMaas",
                            "body": "Anakin didn't touch the crystal during order 66 though",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BasMaas",
                            "body": "Anakin didn't touch the crystal during order 66 though",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "stickninja1015",
                            "body": "Was he trying to pour his anger and pain into the crystal?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bubblehead_ssn",
            "body": "I do like some of the stories that stepped away from the Skywalkers or Solos such as the Mandolorian and Bad Batch. Some of them were misses like the Book of Bobba Fett, but some of the best Legends stories only included Luke or the Solos as side characters or quick mentions. Specifically the Rogue Squadron books were incredibly entertaining with characters like Wedge, Corran Horn, and Silver.",
            "score": 5,
            "replies": []
        },
        {
            "author": "XenoWitcher",
            "body": "I like that Yoda originally wanted to train Leia to be a Jedi instead of Luke.",
            "score": 21,
            "replies": [
                {
                    "author": "batmite06NIKKE",
                    "body": "Makes a lot of sense they both could have been Jedi but leia wasn’t really into it, so she became the rebellion’s leader, while Luke was the Jedi, so cool.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "RedEclipse47",
            "body": "I'm going to be honest with you, when Disney bought LFL and all the rights including Star Wars I was very sceptical. Then when they closed LucasArts it felt like it was all crashing down.\n\nNow years later looking back I honestly think it's great. No things that have been introduced to Canon I have problems with. Yes, like most people I hoped that some plots in the sequel trilogy would have lead to other things and that the writing wouldn't be so all over the place.\n\nBut all other movies, Live Action shows, animated shows, have been great. Yes they also had their ups and downs but overall I like it very much.\n\nThe Mandalorian was refreshing when it first came out. Andor is a masterpeace. I'm a sucker for lore, fantasy and mysticism so Ashoka was amazing to me especially Baylan Skoll. Skeleton Crew was great fun just like Solo. I even think The Acolyte deserves a second chance as a second season. The last 3 or 4 episodes where great. Best fights perhaps in all of live action Star Wars.\n\nTo give a example of where I chose Canon above Legends is when it comes to cloning Force Users. I have always been against that idea. In Legends almost everyone got a clone at some point (over exaggerated) and it all seemed to simple. Palpatine had clones of himself. Thrawn had clones. There was a clone of luke and Jorus C'baoth that turned mad. Battlefront 3 even had 2 cloned Jedi brothers.\n\nThe Force Unleashed introduced the fact that cloning of Force Users might not even be possible or that simple at all and I'm happy the Canon adhered to this. When we finally reached that point in Canon with Palpatine wanting to clone himself to ensure his immortality it's still not possible. We get introduced to strand-casts as a sort of mid way point which I thought was really clever. Because if cloning Force Users was that simple then their shouldnt have been a reason for not having a clone army of Force Users in the first place.",
            "score": 39,
            "replies": []
        },
        {
            "author": "ryanmorris8401",
            "body": "I love these proto-stormtrooper designs. They used Ralph McQuarrie’s original designs as the inspiration and it works just perfectly. Chef’s kiss*",
            "score": 10,
            "replies": [
                {
                    "author": "EpicNerd99",
                    "body": "That's one thing I love about the animated shows is that they always use Ralph's art for beta designs or older designs and it's cool to see them bring used like that",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "bmiller218",
                    "body": "Looks even more like a German Stahlhelm",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ComprehensivePath980",
            "body": "Rogue One and Andor I actually liked in their entirety.\n\nAndor in particular did a great job making the Empire evil, powerful, and threatening.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Oceanus39",
            "body": "Hot take: I like Solo",
            "score": 5,
            "replies": []
        },
        {
            "author": "DylanDeaner",
            "body": "I am a HoF Disney Hater. But I must say, they did a pretty damn good job on the last 4 episodes of season 7 of the Clone Wars. Sensational.",
            "score": 17,
            "replies": []
        },
        {
            "author": "mmcjawa_reborn",
            "body": "I kind of like the work they have done on the Mandalorians. They are actually now my favorite faction in Star Wars, even more than Jedi, and I hope someday we get to see a stronger and more resurgent Mandalore playing a role in galactic politics.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Agitated_Insect3227",
            "body": "I **love** a lot of *stories* from the new canon (several comics, Andor, Fallen Order Series, Mandalorian, Skeleton Crew, etc.), but it's kind of hard for me to think of any actual lore/setting changes and developments that I specifically prefer over the old EU/Legends. \n\nIt more like I'm happy certain stuff and characters in the old EU/Legends is *not* a part of the new canon, such as Darth Vitiate who I've always seen as a tryhard, overpowered dull version of Sidious without any of the charm or personality that makes him a good character. \n\nI guess I generally prefer the way the clone troopers were handled in new canon. As a person who first learned about them from TCW, it was a little jarring to me how cold and ruthless they were during the first days of the Empire, such as nonchalantly gunning down surrendering soldiers during the *Dark Times* comic.",
            "score": 13,
            "replies": [
                {
                    "author": "jayL21",
                    "body": "I find the different versions of clones to be really interesting, can't say I like either one more though. \n\nPre-TCW, you had a lot more mystery around them, they acted more like Jango and always serious and to the point, who wasn't really loyal to the jedi, but the orders they were given, with most of them not even being fans of the jedi or how they lead.\n\nI still can't believe that TCW was apart of the same timeline as the republic comics and whatnot, they really don't fit together at all.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Agitated_Insect3227",
                            "body": "Yeah, when Lucas decided to make the TCW, it basically did what the new canon did to the old canon for the old Clone Wars-era stories and lore on a smaller scale. It doesn't bother me too much since TCW was the first thing I watched involving the Prequels (and Star Wars in general), but I totally understand why fans of these older stories would strongly dislike the show for the retcons.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "jayL21",
                                    "body": "Yea, I grew up with TCW, so it means a lot to me and I do love it, but man, having recently deep dived into the CWMMP, I honestly prefer a lot of things from that over TCW. The biggest thing being that it actually feels like a continuation of the movies, while TCW feels more like it's own thing.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tyrannustyrannus",
            "body": "I appreciate that life debt is not a thing anymore. Chebacca being Han's friend and partner is a better story than him being some honor-bound servant",
            "score": 8,
            "replies": []
        },
        {
            "author": "MagisterFlorus",
            "body": "I love that Sabine can use the force. The way Obi-Wan spoke about the force when I saw ANH had me convinced if I truly reached out, I could use it. I hated the idea that you needed a high midichlorian count to be able to use it. This gives us some balance between those ideas. Yes anyone can use the force but it will be much easier for some.",
            "score": 21,
            "replies": [
                {
                    "author": "Aubergine_Man1987",
                    "body": "You don't need a high midichlorian count to use the Force, a higher count just increases your natural affinity for it. Think of it like sprinting; everyone can become good at sprinting if they train enough, but some people have a genetic advantage that give them a better chance to be in the top 10 sprinters",
                    "score": 15,
                    "replies": [
                        {
                            "author": "ImBackAndImAngry",
                            "body": "Luke explains this well in one of the comics when he’s teaching a student at his academy \n\nBOY IT SURE WOULD HAVE BEEN COOL TO SEE THIS ACADEMY IN LIVE ACTION AND NOT AS A MYSTERY BOX RUINS OF BULLSHIT \n\nSorry. Lost my cool real quick there",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "batmite06NIKKE",
                                    "body": "No you’re ok, it’s valid to say that, I agree",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LucasEraFan",
                    "body": "You don't need a high midichlorian count to use The Force.\n\nThe only benefits of midichlorians are those established in Jinn's explanation to Anakin in TPM afaik.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "batmite06NIKKE",
                    "body": "I always deemed how they would always say the force is all around us so I thought anyone could use the force but most don’t try to or are cut off by certain circumstances. That’s how I see it.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Slashycent",
                    "body": ">Yes anyone can use the force but it will be much easier for some.\n\nThat's...how it's always been? \n\nEvery living thing has Midi-chlorians, lest it wouldn't be alive. \n\nAnd those enable them to tap into the force, to differing extents. \n\nI swear, if people just paid attention to what Lucas was actually portraying, much of the backlash against him wouldn't have happened.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Slashycent",
                    "body": ">Yes anyone can use the force but it will be much easier for some.\n\nThat's...how it's always been? \n\nEvery living thing has Midi-chlorians, lest it wouldn't be alive. \n\nAnd those enable them to tap into the force, to differing extents. \n\nI swear, if people just paid attention to what Lucas was actually portraying, much of the backlash against him wouldn't have happened.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "youarelookingatthis",
                    "body": "I love that it was a slow set up for her. We got a hint of it in Rebels when she learned how to use the Darksaber with Kanan, and then we finally saw it in Ahsoka. It felt like an earned journey for Sabine.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "_WillCAD_",
                    "body": "My headcanon is that the Jedi had it wrong - high midichlorian count doesn't *give* you higher affinity for the Force, it's a *byproduct* of the affinity. As in, if you connect to the Force more, your midichlorian count will be higher, because they feed on the Force and are naturally drawn to life forms with higher connection to the Force.\n\nIf that were true, then someone like Sabine, or a powerful Jedi like Obi-Wan or Windu, could actually increase their m-count over their lifespan, as their connection to the Force grew deeper and stronger with training and practice.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Slashycent",
                            "body": ">because they feed on the Force\n\nThat would make them parasites. \n\nIn canon, they're symbionts, which is much more harmonious.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LordDoom01",
            "body": "Andor, Rogue One, and Skeleton Crew. And they did a good job with the Imperial Stormtrooper designs. Phase 1 not so much, but the Shore Trooper and Range Trooper are excellent.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Statalyzer",
            "body": "In Boyega and Ridley, they duplicated the original as far as getting unknown actors who were great for the roles like Hamill and Fisher were.",
            "score": 3,
            "replies": []
        },
        {
            "author": "That-Service-2696",
            "body": "The High Republic Era",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hazelnutedays",
            "body": "Episode 9. HEAR ME OUT:  \n  \nThe Palpatine angle has been understood as undermining the original trilogy, but I think that's a misunderstanding of what happens. Palpatine returning in a clone body was never the grand sith plan, but cloning was always the contingency. And that's in-step with the prequels. The prequels are all about the fact that the sith cling to life well past its natural end. That they are unable to greet death in themselves or in others. And Palpatine specifically was very involved in cloning efforts. He also told Anakin his Tragedy of Darth Plagueis, where he gained the ability to create life (only to be killed, presumably by Palpatine). I think it would be crazy if Palpatine DIDN'T try to clone himself.\n\nAnd in the modern world, the most wealthy spend an obscene amount of money in trying to prolong their lives or stay young—and the methods seem like things the sith would cook up, whether it's weekly blood transfers from your child, surrogate parenting, or cryogenic freezing with their bodily fluids sucked out like the canopic jars of the pharaohs. One of the major themes that unites the sequel trilogy is learning to accept death, as well as change, as a natural part of life. And Palpatine is the object lesson of what happens when you cannot let yourself change and cannot let yourself die. Luke himself skates perilously close to an inability to change, but by the end of Ep. 8, he relinquishes his hold on the past, and subsequently sacrifices himself to allow the resistance to live.\n\nSo, thematically, I think Episode 9 brings some of the seeds laid in the prequel trilogy to fruition.",
            "score": 9,
            "replies": [
                {
                    "author": "JayJ9Nine",
                    "body": "My issue with 9 is it's lack of buildup with its own trilogy. Really an issue altogether, they feel like 3 completely separate types of movies, only Kylo really feels like he completed a full arc as Rey doesn't really feel like she gets to speak for herself as much. \n\nI would've preferred a reveal of Plagueis usurping one of the clones, trying to raise a new proper body to carry on in but that's just me. \n\nWhat i really hate in episode 9 is the planet busting fleet, I'm so tired of using planet busters to cause urgency when I'm just as invested in the lives of singular characters and what they go through. \n\nIn fact the force diad between Rey and Kylo was one of my favorite parts",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Hazelnutedays",
                            "body": "The focus on Rey and Kylo was great, though it was nice to get back to Finn in Ep. 9. I agree about the planet-busting fleet in 9, but I'm willing to look past it — I can only imagine what theater viewers of Ep. 6 thought when they rolled out a second, bigger death star.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nythromere",
                    "body": ">So, thematically, I think Episode 9 brings some of the seeds laid in the prequel trilogy to fruition.\n\nBy ignoring the prophecy that Anakin was susposed to destroy the Sith? I agree Palpatine fooling around with clone bodies makes sense thematically but the Sith were to be destroyed.\n\nThat is why a cloned off-shoot abomination from Palpatine similar to Snoke (who was not a Sith) works better. It still has Palpatine's hand prints but the Sith are still destroyed.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "yuei2",
                            "body": "“A prophecy misread perhaps”\n\nThe prophecy was never intended to be air tight true. Hell it’s well known the original ST GL was thinking of would have Luke fail, become embittered, and Leia be the one to fulfill the prophecy with the ST being her story.\n\nPeople put too much stock in the prophecy line when it was only ever just that, a prophecy open to interpretation that may not even be true. Which is part of what the PT was showing, the way it could be misread. Hell SW lore is at this point basically founded upon by misread/misunderstood/diverted prophecies.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zippo-shortyburner",
            "body": "Gilroy star wars",
            "score": 5,
            "replies": []
        },
        {
            "author": "duk_tAK",
            "body": "While the old EU had some gems, I felt some of the best changes actually involved removing some of the questionable expansions.  Thank goodness the Tie bow is gone.",
            "score": 5,
            "replies": []
        },
        {
            "author": "OyasumiOyasumiEyes",
            "body": "final season of clone wars",
            "score": 6,
            "replies": []
        },
        {
            "author": "Skinny_Thor",
            "body": "I like how they made Kyber crystals more intune with the Force. Just finding a random green, blue, or purple one in the wild was fun in video games, but having the force user bind themselves to the crystal and that determined the color was really cool. Also how the Sith made crystals bleed to turn them red was a cool detail.",
            "score": 5,
            "replies": []
        },
        {
            "author": "nightslayer78",
            "body": "1000% would be adding mandalorian culture. The battle at the end of the last season of The Mandalorian was what I have been waiting for as a child.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Iron_Knight7",
            "body": "Overall, I've enjoyed the new canon. Much as it is lauded, the EU really had become a mess and had spent far too long jogging in place around the Skywalkers/Solos. To me, many of it's better entries were when they were exploring side characters or delving into different corners of the universe itself. Aside from trimming a lot of fat, the new canon has had some great entries like Rebels, Bad Batch, Mandalorian, Andor and Rogue One. And as someone who has seen this franchise go through multiple ups and downs in its run, I can't bring myself to \"hate\" things like Acolyte or Ashoka or even the Sequels. Even in the days of Lucas, Star Wars had its hiccups and missteps. I may not love everything in Star Wars. But I will always love Star Wars itself.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Shenloanne",
            "body": "I like that we got 100 percent more star wars than we would have gotten under lucas.",
            "score": 4,
            "replies": []
        },
        {
            "author": "xraig88",
            "body": "There's not a single Disney Star Wars entry that I haven't found enjoyable. Are they perfect? Not even close. Was any Star Wars that came before it? Far from it. \n\nTrooper designs are peak though, there's not a single miss in Disney Star Wars trooper designs. Vader has been perfect in everything, Kenobi series, Rebels, Rogue One, Jedi video game series. Such a great use of the character. \n\nI love that they gave Ahmed Best a cool role in The Mandalorian timeline. I love that series so much, same with Andor, Rebels, The Acolyte and Skeleton Crew.\n\nThe Sequel trilogy is easily my all time favorite trilogy.",
            "score": 16,
            "replies": [
                {
                    "author": "jordanjohnston2017",
                    "body": "I think the only trooper design I vehemently hate is the purge trooper design in the Kenobi show. The helmet change was unnecessary and quite honestly it’s hideous",
                    "score": 3,
                    "replies": [
                        {
                            "author": "xraig88",
                            "body": "I love it actually. I like the original, but only because it was already an awesome clone trooper helmet. I think the new one looks great.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "jordanjohnston2017",
                                    "body": "To each their own and I respect that. It’s not like they had any real impact on the show which is unfortunate",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zoodlenose",
                    "body": "The OT is perfect you scruffy looking nerf-herder.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "xraig88",
                            "body": "I incest you look a little closer.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Late-Sorbet",
                    "body": "I love all star wars, the good and bad, no matter what I'll always adore this franchise",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "newintownv",
            "body": "The bad batch is great!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Professional_Copy197",
            "body": "I really like most of it apart from the sequels. Not a fan of how they handled Boba Fett. But beggars cant be choosers I guess. We asked for Boba. We got Boba. We didnt like it. No more Boba. World keeps on spinnin.",
            "score": 5,
            "replies": []
        },
        {
            "author": "scottwricketts",
            "body": "Chewie was dead in the EU, Disney had to make a decision to ditch everything and then start bringing stuff back.",
            "score": 4,
            "replies": []
        },
        {
            "author": "NaiRad1000",
            "body": "The Tusken Raider stuff in Book of Boba Fett",
            "score": 4,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I love the cultural additions to the Tuskens, it makes them feel much more like a people",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sure_Possession0",
            "body": "I like that Rian Johnson tried to bring back the idea that the Force isn’t reliant on special biology for use of it.",
            "score": 8,
            "replies": [
                {
                    "author": "versusgorilla",
                    "body": "It's a shame that JJ Abrams is so risk-averse, because that was the singularly best point to come out of TLJ, that Rey isn't special by birth. She's special because she decided to be a hero. \n\nLuke was special because he was the son of a great Jedi. \n\nAnakin was special because he was chosen by the Force. \n\nRey is special because when the Force presented her with a path, she chose it. The Galaxy needed a hero and she answered the call. \n\nHaving her be the daughter of a clone of Palpatine feels fucking **bad** and I can't believe they went with that.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Sure_Possession0",
                            "body": "JJ is a guy who can make good movies, but shouldn’t be left alone to mess with the bigger picture. I think he would make some cool movies set in the Star Wars universe that can flesh out the galaxy. Glorified side stories.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "versusgorilla",
                                    "body": "Yeah, he was fine for TFA but only because he wasn't going to be around to write the rest of them. He's good at setting a scene, making you interested in the world at large. \n\nBut he's creatively a coward and didn't want to take what Johnson gave him and write a real third film. He wrote a cowardly film where he un-wrote what Johnson wrote, gave creedance to some of the worst parts of the SW fandom, and made a truly bad movie to end the insanely non-cohesive trilogy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sure_Possession0",
                                            "body": "Agreed. I enjoyed TROS, but it felt like three movies in one for a different story.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jaikarr",
                    "body": "I personally don't think that the idea has been completely quashed. Yes, Rey having a 'lineage' to palpatine sort of treaded on the idea. However she is the daughter of a 'failed' clone who didn't have force abilities himself so it's not completely down to biology.\n\nFiloni appears to be pro-anyone can be a Jedi too with the events in Ahsoka so I think it will continue to be a theme.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Sure_Possession0",
                            "body": "I’m glad he is continuing that. The prequels really tarnished a lot of the potential for the Force and Jedi.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Late-Sorbet",
                    "body": "I felt that Rey being a nobody was so perfect for her story tbh",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "monkman315",
            "body": "I really like the early stormtrooper armor design, but I absolutely hate all the sequel stormtrooper armor. The proto armor looks like an obvious link between clone and classic ST armor. The sequel armor looks bland and just another thing JJ copied from the OT, like the starships.",
            "score": 4,
            "replies": [
                {
                    "author": "SZJ",
                    "body": "\"The sequel armor looks bland and just another thing JJ copied from the OT, like the starships\"\n\nShouldn't it be \"copied\" though? Like how a Mustang from 2010 looks similar to the 1975 version?  \nThey look different, sure, but you can see there is a lineage of design there.  \nNot saying it should look bland by any means, but it being \"copied\" feels like one of the things they were **supposed** to copy. Doug Chiang designed both the prequel armor and sequel armor and has done great design work for SW. I think he made it look updated but not TOO updated where it feels disconnected.\n\nMaybe the proto armor looked better since we knew the before and after, and the sequel armor doesn't have an after so it feels more out of place. I dunno.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "monkman315",
                            "body": "The sequel armor looks too \"modern\" to my eyes. The design doesn't really have the same cues as the older movies. I'm fine with them having an updated design but it still needs to feel like it comes from Star Wars and the new ones just don't to me. Nothing else is the new movies looked that way to me so the armor stood out more.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SZJ",
                                    "body": "I dunno, except for the chin balls not being there, the TFA one has the classic design elements, but simplified and a bit more sleek. To each their own, I guess. When I saw it, I thought \"stormtrooper, but from a different era\" so it worked for me. But I can totally understand if it isn't everyone's cup of tea. If everyone had the same opinion, fan discussions would be so boring, lol.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Late-Sorbet",
                    "body": "I do wish the stormtroopers looked a little better, I think the helmets look a little too goofy and don't have that intimidation the OGs had, I think if they were more like the sith trooper designs from ROS id like them a lot better",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ndmndh1016",
            "body": "Rebels is peak Star Wars. (Its not alone on the mountaintop calm down)",
            "score": 5,
            "replies": [
                {
                    "author": "JPldw",
                    "body": "Season one was slow, but the rest was pure peak, and I am so glad it is getting recognition",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vitwolpher",
            "body": "Imagine a world where Disney didn’t buy Lucasfilm and George Lucas still retires. I’m so happy to have new Star Wars in my life that I can share with my kids",
            "score": 4,
            "replies": []
        },
        {
            "author": "SullenTerror",
            "body": "I don't care if Grogu was created to sell toys, he is my baby and I love him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChanceVance",
            "body": "Baylan Skoll, probably the best depiction of a \"Dark Jedi\"",
            "score": 4,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I'm gonna miss Ray's portrayal of him, he and his apprentice were definitley the highlights of Ahsoka for me",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wat-Tambor-",
            "body": "I like the armor",
            "score": 4,
            "replies": [
                {
                    "author": "batmite06NIKKE",
                    "body": "Sith troopers from the sequels were dope as hell.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Late-Sorbet",
                            "body": "Plus their blasters",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "batmite06NIKKE",
                                    "body": "Them too, so cool",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Appropriate-Term4550",
            "body": "The Jedi games, andor, and rogue one. \n\nSome of these best Star Wars content period. Not just in the Disney era",
            "score": 3,
            "replies": []
        },
        {
            "author": "n_mcrae_1982",
            "body": "I actually have enjoyed pretty much all the Disney+ series, as well as Rogue One.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RalphMacchio404",
            "body": "Rogue One and Andor. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "xistel",
            "body": "Honestly there is a lot of good. It just usually gets overshadowed by horrific trash like the Acolyte",
            "score": 3,
            "replies": []
        },
        {
            "author": "NottingHillNapolean",
            "body": "I like the idea that the Force is accessible to anybody, as implied by the epilog of \"The Last Jedi\" and Chirrut Îmwe in \"Rogue One.\"",
            "score": 2,
            "replies": [
                {
                    "author": "Draxtonsmitz",
                    "body": "And Ahsoka.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "NottingHillNapolean",
                            "body": "Now I'm thinking an interesting series or trilogy would be an attempt to truly democratize the force, and it ends up with a lot of dark side users. It's revealed the Jedi kept Force techniques under tight wraps to keep this from happening.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sparky_321",
            "body": "Condensing how the Rebellion obtained the Death Star plans into one story, as opposed to several different ones that needed to be retconned into said plans all being fragments.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Baphomet99",
            "body": "Andor/Rogue 1, The Bad Batch, Mandalorian season 1 and most of season 2, Solo is pretty solid aside from the odd moment, and the last four episodes of Clone Wars are great.  \n\nAlthough I’m not a fan of the sequels and the new lore surrounding them, TFA was a more-or-less solid, if uninspired, start.  Just wished they’d actually planned things out and taken the opportunity to make a new Star Wars trilogy seriously.",
            "score": 3,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I think the individual sequel movies work on their own, if they allowed one director to shine with all three let it be either JJ or Rian it would've definitely felt more coherent, planning wouldve helped so much",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Baphomet99",
                            "body": "I agree.  TFA was pretty similar, at least plot wise, to ANH, but it at least left me excited to see where the story went next.  I didn't like TLJ at first, but after a re-watch I think it's fine.  It has some interesting ideas, which would have been cool if they'd been explored through a consistent trilogy, but doesn't really work imo as the second part of a three part story.  I just wish they had picked either one writer/director, or a consistent team, and had them do the whole trilogy.  \n\nI'll be honest and say I still haven't watched ROTSW.  The moment I knew Palpatine was coming back between films I lost interest.  It was the moment I realised that they had no idea what they were doing and didn't know how to follow on from TLJ properly.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ABH1979",
            "body": "Force Healing — and specifically, that the user is giving up part of their own life-force, in order to do it. It’s that “cost” that makes it work, for me.",
            "score": 3,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "Its like in full metal alchemist, nothing can be gained without something of equal value being lost or exchanged",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ABH1979",
                            "body": "Right, and to me, it works retroactively because I can see the Jedi Order knowing about the ability, but not wanting to train it. They wouldn’t want their Jedi to give up part of their own life-force to heal a random “normie”.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RynnHamHam",
            "body": "I actually really like the inhibitor chips (I guess that’s more a Filoni thing than a Disney thing). As a kid I always thought Order 66 was a sleeper agent code word so having my theory become canon felt validating. I get the appeal of all clones being aware of order 66 in old canon but the inhibitor chip makes the clones victims and adds to the tragedy. And as another pointed out, showing in the Bad Batch how they’re phased out rather quickly and discarded after their secret purpose was fulfilled really makes you feel for them. Their purpose all along was genocide. Once the genocide was done, they were thrown out.",
            "score": 4,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "The inhibitor chips is probably the best addition imo, as it makes the clone's entire story even more tragic which fits what both the Clone Wars and ROTS were going for",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hurtfulproduct",
            "body": "Disney gave us some solid additions:\n* Rebels had some top tier Star Wars Moments (Twilight of the Apprentice, Obi Wan vs Maul rematch, Jedi Night) and brought Thrawn into the main timeline\n* Andor and Rogue One were amazing non-Jedi focused stories that got into the gritty part of the universe\n* Solo was a fun heist movie that didn’t deserve the hate it got and I’m sad we likely won’t get more live action stories like it\n* Mandelorian S1&2 were very fun and entertaining with solid stories (S3 fell apart)\n* Ahsoka was very good; it could have been better (I want Zeb and more Chopper!!! Lol), but we essentially got a Rebels season 5 and getting a season 6 and I’m here for it!\n* Having a completely unique story like Skeleton Crew was awesome! It was a very fun retro feeling story and gave another unique angle on the Star Wars Universe",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dramatic-Emphasis-43",
            "body": "Um… I like a lot about new stuff. Some standouts. \n\nI like that Rebels made the Rebel alliance start as an actual consolidation of freedom fighters, not because the emperor and Vader are dumb and brought them all together as some sort of trick that went wrong. \n\nI like that the empire fell relatively quickly compared to the old canon and that their imagery and iconography was co-opted by a worse group. \n\nI like that the Jedi couldn’t just go back to being prequel Jedi in the New Republic. \n\nI like that there are more force religions, especially light side force religions. \n\nI like that Boba Fett was actually affected by him falling into the sarlacc pit and made a massive career change.",
            "score": 3,
            "replies": []
        },
        {
            "author": "_WillCAD_",
            "body": "Pretty much everything that happened in Bad Batch. It was an incredible show with a compelling story that expanded beyond the Batch themselves to examine the fate of the entire clone army after the war.",
            "score": 4,
            "replies": []
        },
        {
            "author": "NerdNuncle",
            "body": "I’m admittedly an EU fanboy, but will admit to liking the parts with what I’d consider to be effort put into them.\n\n\nCases in point including \n\nGrogu and making him a physical puppet\n\nSkoll and Hati, \n\nThe First Order as they appeared in *The Force Awakens* for actually learning from the Empire’s mistakes \n\nOperation Cinder \n\nMigs Mayfeld\n\nAhmed Best and Hayden Christensen returning \n\nExploring Obi-Wan’s PTSD from ROTS and (most of) Leia’s time with Obi-Wan\n\n*The Mandalorian* having a much better Girl Power scene than the MCU",
            "score": 2,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I love that they want to keep it consistent in terms of actors for the newer projects, like Dee Bradely Baker playing the clones outside of TCW and Temuera Morrison playing them again in Live Action",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "philanthropicide",
            "body": "The return of practical effects and awesome puppetry, the exploration of the universe, seeing different characters brought to life and given a chance to shine in live action, and the amazing Rise of the Resistance ride at Disney",
            "score": 3,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I went on Rise for the first time a few days ago it was actually so much fun",
                    "score": 3,
                    "replies": [
                        {
                            "author": "philanthropicide",
                            "body": "Man, my first time through i was blown away by the mix of practical and special effects. They just did such a great job of making it seem huge and larger than life. The actors did an awesome job of keeping us in the moment, too",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RuckFeddit980",
            "body": "Rogue One and Andor.\n\nI do enjoy Mandalorian/Boba Fett, but this is problematic because in order to canonize them, I would also have to canonize Ahsoka, Rebels, and Clone Wars, and I will never accept the resurrection of Maul into my head canon.\n\nDude got gloriously and spectacularly vivisected in TPM. Game over man.",
            "score": 2,
            "replies": []
        },
        {
            "author": "frzbr",
            "body": "Red crystals being created by “bleeding” as opposed to synthetic os really cool and befitting sith ideology and vibe in general.\n\nI’m only talking about the concept and the way it was portrayed in Vader comics, not that instant and sudden bull in Acolyte.",
            "score": 1,
            "replies": []
        },
        {
            "author": "transgaymergirl",
            "body": "bleeding kyber crystals. i think its just way more interesting than the boring legends version where theyre just artificial and thats it.\n\nthe inquisitorius. dont think i need to say much theyre just cool.\n\nvaders castle. the idea that palpatine made him live in the very place that destroyed his body and previous life so he could harness his pain and suffering is pretty great.\n\nturning ilum into starkiller base. as much as i dislike having yet another death star (and with unlimited range too), i have to admit that the idea of making it be ilum is pretty cool. \n\nhera syndulla. she cool.\n\nthe entire ghost crew actually. they all cool :).\n\nrex's little clone rebel group. i just wish it went somewhere.\n\ntwin suns. it was just the perfect end to mauls story.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KarmicPlaneswalker",
            "body": "Vader now being more powerful than Anakin is a major one. It's one of the retcon choices that actually works with his current portrayal as a nigh-unstoppable force of nature during the dark times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chewbaccashotlast",
            "body": "Rogue One and Andor were great IMO.\n\nI liked Solo too. Its weird that all the stuff that made Han Han happened in like 2 weeks and I wish they could have told a longer story - this would’ve been great as a show playing out with crime syndicates and such.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crackedtooth163",
            "body": "I like the majority, I just didn't care for the sequels or much of the acolyte. But this is star wars, you can't just dislike something. You have to hate it with every bone in your body.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iniciadomdp",
            "body": "I liked the New Republic period, and even if it felt out of place I loved the story about the amnesty officers in Coruscant.",
            "score": 1,
            "replies": []
        },
        {
            "author": "beepbeepbubblegum",
            "body": "Rogue One and the first teaser for Force Awakens. I must have watched that teaser … 100 times. I was beyond hyped and TROS absolutely killed my interest to where I don’t really watch any of the new material but I’ve heard Andor is superb.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mando_ad",
            "body": "Rebels establishing that lightsabers don't have weight, but - because that is a *lot* of energy being channeled through a very narrow emitter - they do sort of *pull* which is what makes them hard for non-Force users to control.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lord_Olga",
            "body": "Most of the things that were good were things rehashed from decanonized content and were just simply done better before so it's difficult to really find things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoNeedForNorms",
            "body": "Nearly the entirety of Rebels. RIP Kanan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SadowSon",
            "body": "Kicking out the clone troopers in favour of the conscripts.\n\nThe original lore had the clone troopers stick around and slowly get replaced by conscripts as they started dying off.\n\nKicking them out instead to completely replace the army with conscripts was a **perfect** way of showing just how little the empire cares about its people. Every action is \"justified\" in the path to \"peace\".\n\nDon't get me wrong - I love the clone troopers. They've got amazing character development. I just think it made for good story for the Empire to basically go \"yea, thanks for saving us during the war. 'Cept you're all defective so you're being made redundant\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ryuk128",
            "body": "I actually liked last Jedi. There i said it.\n\nRouge one was good \n\nI liked the Cal games \n\nMandalorian (haven’t seen series 3 , taking a long break from Star Wars, too much of it )\n\nThink Disney nails Vader every time they use him too",
            "score": 1,
            "replies": []
        },
        {
            "author": "thedarkryte",
            "body": "I know it wasn’t originally a Disney concept, but the whole idea of Ahsoka’s character arc. And also thd entirety of Rogue One is fairly good. Especially that Vader hallway scene 😍",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Kian_7567",
            "body": "There are 3 things I like about canon (regarding shows and movies): rogue one, Andor and Jedi fallen order",
            "score": 1,
            "replies": []
        },
        {
            "author": "j-b-goodman",
            "body": "It's not really a new addition but Luke's explanation of the force to Rey is such a beautiful scene, great stuff.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stickninja1015",
            "body": "Bleeding Kyler Crystals",
            "score": 1,
            "replies": []
        },
        {
            "author": "FPFP66",
            "body": "Mando S1. \n\nEverything they did with Boba in Mando S2 \n\nBen vs. Maul in Rebels (I haven’t watched Rebels in full and likely won’t, but I love everything there)\n\nGiving Ian more reps as Palpy (Rebels, Bad Batch, the Vader show, etc) before Ian eventually passes on",
            "score": 1,
            "replies": []
        },
        {
            "author": "DiscountEven4703",
            "body": "ANDOR",
            "score": 1,
            "replies": []
        },
        {
            "author": "DiscountEven4703",
            "body": "ANDOR",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded_Long_57",
            "body": "Darth vader finding out that luke is his son",
            "score": 1,
            "replies": []
        },
        {
            "author": "saucierstone",
            "body": "I love the increasing focus on dissent and corruption - obvs we got it to an extent (esp with The Clone Wars pre-Disney) but I love that we get to see how survivalist corruption is already festering in the Council in The Acolyte, and how generally unorganised a rebellion is with differing factions and beliefs (looking at you esp Saw) \n\nAlso just generally the focus on clones and their lives post-war (am a clone rebellion show believer) ✌️",
            "score": 1,
            "replies": []
        },
        {
            "author": "backyard_BUM",
            "body": "Everything but every 9 tbh. I didn’t like episode 8 as a movie but I liked Rey being a nobody and Kylo killing Snoke and becoming the main bad was awesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "Economy_Judge_5087",
            "body": "Finishing TCW and Bad Batch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loud-Taste6394",
            "body": "Bleeding lightsaber crystals is more interesting than synthetic crystals imo. Jedi: fallen order and survivor games are really good! I like canon Darth vader overall better than legends Vader. There’s a lot I do like about the mandalorian, and Grogu is a pretty cool character/idea even if I think he’s overdone. Commando droids! Cad Bane is a cool character. Leia’s rose gold lightsaber hilt design. The praetorian guard design. The first order ship designs for the most part. The sith trooper designs are awesome. I like the timing of Dooku’s fall better in canon than legends. Torn on Darth maul’s return, but think it provides an avenue for a lot of good character work for Kenobi and some drama for Sidious to clean up during the clone wars. ANDOR ANDOR ANDOR. Best piece of Star Wars media since Rogue One. Speaking of which, I love rogue one! Solo is also a cool movie even if it rushed Han’s backstory. Son of Dathomir!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hypnotic20",
            "body": "What do I like about it?  All of it.  It’s Star Wars, and I enjoy the good with the bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thin_Cellist7555",
            "body": "Andor. Yeah that's about it. \n\nI mean don't get me wrong, the acolyte is a masterpiece too, it can be used to teach young art students and aspiring directors every single piece of what not to do when telling a story or making a movie or show without exception, so I guess that's an achievement too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YoWNZKi",
            "body": "I’ll watch anything Star Wars and find something enjoyable, but as a guy who read everything in Legends as it was coming out, that was the vastly superior sequel’s and I’m not bothering with the new EU cuz it pales in comparison",
            "score": 1,
            "replies": []
        },
        {
            "author": "PADDYPOOP",
            "body": "Just about everything surrounding the Bad Batch’s show.  Also Jedi Fallen Order and Survivor were great.  I believe those games are better films than any of the actual star wars films Disney’s released.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Own_Individual_975",
            "body": "Some but none",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agreeable_Pizza93",
            "body": "I honestly just dislike the sequels and parts of Obi-Wan. Overall I think Disney has handled Star Wars about as well as George did.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Laggingduck",
            "body": "I cannot think of a single new OT trooper design I haven’t liked",
            "score": 1,
            "replies": []
        },
        {
            "author": "AHorseNamedPhil",
            "body": "Anything introduced in Rogue One and Andor.\n\nBoth are rare Star Wars wins for Disney and I'd rank both as the best live action Star Wars content since the original trilogy of films.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Epicdudewhoisepic",
            "body": "Jesus christ. \n\nClone wars season 7\n\nSome of Rebels\n\nEpisode 7 and some of 8 \n\nFUCKING ANDOR\n\nAll of bad batch\n\nKenobi aint that bad\n\nJedi fallen order and survivor\n\nBattlefront 2 was under disney\n\nIdk what else but my point is that I like some Disney era SW projects.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NikolaiOlsen",
            "body": "The content in Rebels\n\nSure,most of the show itself are targeted towards a Younger, Newer, generations of Star Wars fans, but, what happens in the show aren't just explosions for kids to look and and think of as pretty (attention sparks) but, ita a continuation and love letter for the older fans too;\n- That there's More to the galaxy than Tatooine & Skywalkers,\n- That the force works in mysterious ways,\n- That there's More jedi out there who lost and struggles in this new galaxy\n- And most importantly, we get to see old And new characters we grew up in this new era",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Dog_4118",
            "body": "I kind of like the idea that a Jedi has a spiritual and close connection to the new kyber crystal lore. But .. I don't like how it stripes them of having to craft their own. A droid just says. Here.  I think it was cool to be able to enhance the lightsaber with how well you could craft or the materials/crystals/gems used. Sad that that all went away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jonstertruck",
            "body": "The two best Star Wars books I've read are Lost Stars and Battlefront. The first is a love story and the second is a video game adaptation, and yet, for some reason, both are incredible stories with meaningful world building and good characters",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frequent-Monitor226",
            "body": "I loved all the movies and shows. Even the Holiday Special had fun things in it. I used to run Star Wars D6 and seeing planets outside of the original trilogy was always neat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PTickles",
            "body": "I've honestly enjoyed pretty much everything besides TROS, and I don't even really hate that movie that much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jedipilot24",
            "body": "The only good thing that I will say about Disney Canon is that it occasionally provides little gems that I can import into my Legends headcanon without contradicting anything.\n\n\nThings like the name of Bo and Satine's father, more precise dates for the Great Clan Wars, the title \"Mandalore the Great\" (I made him the Mandalore during the Mandalorian Excision); the First Order's TIE's are logical descendants of Zaarin's TIE Experimentals; the T-70 is a modular alternative to the XJ, the T-85 is a competitor with the E-Wing, the AT-M6 is a logical replacement for the AT-AT; Saw Guerrera was completely disavowed by the mainstream Rebel Alliance; the Children of the Watch are this weird fringe cult who interpret the Resol'nare way too literally (they're like Young Earth Creationists); Moff Gideon revived the Dark Trooper Project after the Arc Hammer was blown up and gave his allegiance to Zsinj post-Endor; Grand Admiral Savit was part of Trachta's coup attempt and so got un-personed and replaced by Il-Raz;  Savit's early \"TIE Defenders\" were actually just TIE Advanced Prototypes, Zaarin took over the project and developed the actual TIE Defender; Rae Sloane was one more incompetent admiral at Endor whose unexpected \"retreat\" order was only obeyed by her own squadron and caused still more confusion in the chain of command, ultimately resulting in command devolving onto Pellaeon; Galen Erso can easily be added to the Death Star's design team, although he--like Qwi Xux--was sequestered at Tarkin's think tank in the Maw.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xdeltax97",
            "body": "I one of the things I’ve liked is how they changed the process that red kyber crystals are made",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beazfour",
            "body": "I honestly kinda like Operation Cinder, it feels like something that perfectly fits with Palpatine’s character. One last spiteful rage against the galaxy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "not_a-replicant",
            "body": "Some of the highlights off the top of my head:\n* Spending more quality time with OT heroes than I ever expected.\n* Kylo Ren being the best Star Wars villain since Vader. \n* RO in general.\n* TLJ in general.\n* Luke’s sequel arc.\n* Luke’s ascent to the Force.\n* Excellent recasting on Han, Lando, and Chewbacca.\n* Donald Glover as Lando.\n* Rebels in general.\n* Exploring the Mandalorian culture.\n* Seeing live action Ahsoka and Rebels Crew.\n* Expanding Boba Fett’s character.\n* Andor in general.\n* Badass droids - K2, Chopper, BB8, B2, L3, and SM33.\n* Tons of new ship/costume/planet designs.\n* Some of the best lightsaber duels across all of Star Wars. \n* A great variety of music from John Williams and others.\n* Some of the best writing, acting, and directing in Star Wars.",
            "score": 1,
            "replies": []
        },
        {
            "author": "agk927",
            "body": "The mandolorian gave me a better sense for how the story goes, even though it was mosty action which I suppose isnt a bad thing either. I hate how they handled the bad batch though and story they told about the clones. force unleashed where it showed vader with the 501st was so epic",
            "score": 1,
            "replies": []
        },
        {
            "author": "pjtheman",
            "body": "Not necessarily a \"canon\" change, but i love that lightsabers actually feel like physical objects now.  They actually radiate light, and they have real weight and heft, and don't just feel like they're added in in post.\n\nRey vs Kylo Ren on Starkiller Base is pretty much the ultimate lightsaber fight imo.  I love how their lightsabers are practically the only light illuminating the scene.  I love how they actually physically interact with the environment; Kylo cuts down trees with his wild, angry swinging, the snow sizzles and evaporates when their sabers get close to the ground, etc.  It's those little details that make it feel like a real fight happening in a real place, and not a sound stage in the studio.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaSuspicsiciousFish",
            "body": "Inquisitor: rise of the red blade was almost insanely good and then the red skinned force sensitive who didn’t follow the orders of the council well WASNT a somehow surviving member of the ancient sith race",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConsciousStretch1028",
            "body": "I really liked how the First Order took Ilum and turned it into a superweapon. Yeah, the whole concept is goofy, but to me, it's like the last slap in the face to the Jedi, taking a sacred world and it's kyber, and turning it into a literal killing machine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Renolber",
            "body": "Rogue One, Andor, and the Jedi games, are among the best Star Wars content ever made.\n\nThey’re so good they don’t even need to be in the Star Wars brand. They’re just generally wonderful pieces of art and great stories.\n\nAs every Star Wars product should be - something made from passion and purpose.\n\nPart of the problem of joining Disney is how corporate, predictable and generic the brand has become. Seeing Star Wars churn out continuous slop for the sake of relevancy and merchandise sales like Pokémon or Call of Duty is completely disheartening. While Star Wars wasn’t perfect it used to be special - only released something when there was a point to it. A rare cultural event that stirred the imagination of the masses, and had something to say about the world we live in.\n\nAndor, Rogue One and Jedi are great because there is truly something they are trying to say, and they are made from a place of love. Everything else just does not carry the same purpose.",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "There's a lot of merit to which I agree, I believe part of the problem is definitely that Disney likes to meddle in these projects too closely without letting them shine, which I felt was the reason BOBF failed was because it was made to be part of the brand instead of trying something new",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "JMPHeinz57",
            "body": "Vader.\n\nIt may be because there’s less material than compared to Legends as of now, but Vader always felt kind of nerfed both emotionally and with power in the EU when compared to ancient Sith. Within the current canon, he’s treated as a monster no matter what time period he’s in, to the point that they could drop him in the High Republic era and he’d still be a menace.",
            "score": 1,
            "replies": []
        },
        {
            "author": "captain_creampuff",
            "body": "Some of the books have been pretty good and I liked the Mandalorian. I also liked The Acolyte but apparently a lot of people didn't",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I also liked the Acolyte, it wasn't the best but it was definitley entertaining and fun to me",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "astromech_dj",
            "body": "The High Republic has been phenomenal.",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I love how the Jedi look in that era",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sans_Von_Undertale69",
            "body": "The Starhawk-class Battleship [https://starwars.fandom.com/wiki/Starhawk-class_battleship](https://starwars.fandom.com/wiki/Starhawk-class_battleship)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheKocsis",
            "body": "Galaxy's edge",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arthour148",
            "body": "CW S7, Bad Batch, Andor, Rogue One, and Skeleton Crew are all great",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glove-Both",
            "body": "Season 7 of The Clone Wars and series 1 of The Mandalorian. I enjoyed the subsequent series of that, but that first was something magic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Azula-the-firelord",
            "body": "The Bad Batch, Star Wars Rebels",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rarecandy31",
            "body": "The High Republic book series, the new Thrawn trilogy book series, Andor, Rogue One, The Mandalorian, Bad Batch, Skeleton Crew",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldcretan",
            "body": "I liked Rebels and I liked seeing thrawn in it. I liked how it ended too. I liked rogue one and Andor but I think that goes without saying. The Mandalorian was good although season 3 wasn't as good as 1&2 . I think obi wan needed some time to work out all the details and probably could have spent more time in the writers room but the meat of it was good. I even think the concept of reeva was an interesting concept, what happens to a younging that escapes the Jedi purge in corsecant. You go from the gifted child to a cockroach of society marked for extermination. A child marked for extermination. How do you rebound when you have utterly failed as a man, your faith, your mentor, your student, your best friend, and everyone in your life, Obi-wan has utterly failed. And Darth Vader enforcing the emperor's will is a testament to his near total failure. It just needed someone to look over everything and say, ok but most of our target demo is 15-40yr olds who are terminally online, how will they receive this, does this make sense to them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Helix3501",
            "body": "I actually really enjoy disney canon, it has moments on par with legends peak and no moments as low as legends at its worse",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pheren",
            "body": "The final duel between maul and obi wan is the single greatest scene in the entire series.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CalamitousIntentions",
            "body": "I’m honestly more a fan of Disney canon at this point. It’s more cohesive, less randomly power-scale-y, and they’ve been pretty good about bringing in the things from Legends that were high points *and* followed Lucas’s original artistic vision for stories beyond the ot and pt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mattmandu2",
            "body": "I know I know but I enjoyed 7 and loved 8! I also enjoyed battle front 2 story line where it showed some more after the empire, not sure that counts as Disney but happened after the acquisition",
            "score": 1,
            "replies": []
        },
        {
            "author": "Danxoln",
            "body": "Rogue One\nAndor\nMandalorian\nAhsoka\nClone Wars S7\nVisions",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealTilairgan",
            "body": "I actually was gonna make a video for my YT Channel on Top 10 Good things Disney did with Star Wars but idk that video idea kinda fell out of my interest. Here are the things I came up with.\n\nRogue One/Andor, Jedi Series, both Battlefronts turned out pretty good by the end of their service despite awful launches, Skeleton Crew, The Mandalorian, Theme Parks, and probably my favorite bit was how Disney made Darth Vader scarier than he's ever been without killing any interest in him from overexposure.",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "Vader is definitely in a great spot, we could get no more content with him and i wouldn't complain, he's gotten so much and it's all pretty much been great",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RealTilairgan",
                            "body": "Every time he enters a scene, my heart rate goes up.\n\nAs it should.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "martram_",
            "body": "Im with you OP. For some reason I’ve never been a huge fan of the OG stormtrooper armor. The phase 1 bad batch stormtrooper armor though….. hoooo baby that looks so fucking good.",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "Agreed, it's very militaristic compared to the OG",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alternative-Work5715",
            "body": "I like that they’re doing things like Wookie pelts in book of boba… that’s some twisted stuff",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electricfire19",
            "body": "The vast majority of it. The Madalorian Seasons 1 and 2 are really good, Andor is great, Clone Wars Season 7 is really good, Rebels is great, Jedi Fallen Order/Survivor is great, Battlefront 2 was eventually great, most of the novels are great (Lost Stars, Bloodline, Master and Apprentice, Dark Disciple, the new Thrawn novels, The High Republic novels, etc.), and most of the comics are really good.\n\nAs far as consistently good content, there really has never been a better time to be a Star Wars fan in my opinion. We used to get a little bit more expanded universe content, but *a lot of it* ranged from mediocre to just plain bad. We've gotten a little bit less output in the modern era, but so much more of it ranges from good to great. And quality over quantity will always win in my book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "all_of_the_colors",
            "body": "Andor",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Minmus-Derp",
            "body": "Rogue One and Andor are so good",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soufflayylmao",
            "body": "I scrolled for a long time to see if anyone else mentioned it, but;\n\n\"Execute Order 66\" being a mind control activation phrase, that triggers a chip in the Clone Troopers' brain in order to force them to destroy the Jedi against their will,\n\nis WAY better than in Legends where Clones always know they would one day destroy the Jedi, or just blindly follow Palpatine's orders, depending on which interpretation you look at.\n\nNot only does it make more sense to me, and fills in a few glaring plot holes you could make with Order 66 being a pre-known thing, \nI also find it all the more tragic that the Clones have no choice in their actions, and in rare cases were only able to resist the chip's control for so long before executing the order.\n\nDefinitely their best decision to change Legends lore, maybe out of all of them, in my opinion.\n\nAlthough red kyber crystals not being synthetic is pretty cool too, been seeing that mentioned a lot here :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "XenoWitcher",
            "body": "Oh and the ISB is super cool.",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "It works ao very well, it fits entirely",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarthGipper18",
            "body": "The Thrawn Imperial Trilogy is EXCELLENT",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I need to read them so bad",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DarthGipper18",
                            "body": "Listen to the audiobooks they’re incredible",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dragonfly457",
            "body": "I absolutely love the look of the Tk-troopers, lowkey wish their look wouldve been the standard stormtrooper look",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "Agreed entirely",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SomeBoringKindOfName",
            "body": "If I bothered to think about it I probably like a lot more than I dislike. \n\n  \nthough I really didn't like those stormtrooper helmets. personal taste and all that",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I get it! Not everyone's taste",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrazyCanuckUncleBuck",
            "body": "No Yuuzhan Vong, I've just never liked them",
            "score": 1,
            "replies": []
        },
        {
            "author": "youarelookingatthis",
            "body": "\\-Giving a definitive story for how the Rebels got the Death Star plans. I'm sorry but the EU had like a dozen different stories for how the Rebels got those plans. It was absurd how convoluted that storyline was.\n\n\\-I think the High Republic stuff is very impressive. It's a timeframe that we never really saw before, and I'm impressed with how much content they've made for it.",
            "score": 1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "I think the high republic may be my second favorite era",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "skarekroe",
            "body": "The Knights of Ren as a gang of evil force users unrelated to the Sith.  Snoke as a major agent of the Dark Side also unrelated to the Sith.\n\nOf course,  they fumbled both of those balls in practice...",
            "score": 1,
            "replies": []
        },
        {
            "author": "goodness-gracious-me",
            "body": "I didn’t read any of the now Legends books, so I didn’t have any expectations about what Disney would do to the Star Wars canon. I didn’t commit Han Solo’s Legends story to mind, nor did I learn anything about Luke’s Legends efforts to rebuild the Jedi. As a result of my not reading, and memorizing, and arguing in forums about book minutiae I personally don’t think Disney has done anything negative to the Star Wars canon. \n\nDisney has definitely made some terrible movies and series, with iffy acting, storytelling, and directing. To say Disney did anything negative to the canon, except possibly subvert expectations of  Legends fans, is unfair. Disney CREATED the Star Wars canon when they bought it. \n\nTo directly answer your question, the part of the  Disney I really think they did a great job on was Rebels. That show was fabulous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nothinkonlygrow",
            "body": "Across the board, Disneys new canon has been more good than bad.\n\nThe sequels: messy, disorganized, needed clear direction, but overall had some really cool ideas that never got the love they deserved. Stellar performances across the board.\n\nThe mandalorian: fantastic pretty much the whole way through, season 3 fell off a little bit but it was still strong in my opinion.\n\nBook of boba: could’ve done with being titled “the Mandalorian: the book of boba fett” pacing was pretty off, and the tusken segments could’ve been their own episodes.\n\nKenobi: more hate than it deserves, every actor did a fantastic job, the script was good, direction was solid. And it told a fantastic story that I never thought we’d get.\n\nAndor: I don’t even need to say anything for this, but I will. This show is a work of art, arguably the best piece of on-screen Star Wars media we’ve ever gotten. Every second is absolute gold, and there isn’t a single thing that they could’ve done better if you ask me.\n\nThe bad batch: lovable characters, brilliant story. What some people said was filler was just the show giving us more time to breath and know the characters, see them grow and change. It’s also visually the best that animated Star Wars has ever looked.\n\nTales of the Jedi/empire: Jedi was fantastic, but I don’t love that they kinda retconned the ahsoka book. I prefer to look at it as an abridged retelling of that story, because the book is wonderful. Empire admittedly falls a bit flat for me, it was cool seeing more of dathomir, and I liked what they did with Bariss, but i couldn’t get as invested in Morgan’s story.\n\nSkeleton crew: fucking brilliant, a fun, light hearted adventure that stands alone while still adding to the worldbuilding, lovable characters, fun action and soundtracks, and the Jedi feel magical without even really making an appearance. It’s also got one of my favorite one-off antagonists, I hope they get a season 2.\n\nRebels: people tend to forget this is Disney Star Wars. But I love rebels, it starts off rough, but it only ever really gets better. The main cast is amazing, and i am a ride or die fan of the best pilot in the galaxy, Hera Syndulla.\n\nThe high republic: my favorite era of Star Wars, and the 5 (soon to be 6) main Y/A novels are my favorite pieces of Star Wars media, the Nihil are my favorite enemy faction, and Ro is my favorite villain in Star Wars without contest. I could write a book on its own about how good this shit is. If you haven’t read it, please do. I personally recommend the audiobooks narrated by Marc Thompson, that man has a voice that could melt god.\n\nThe acolyte: needed more time to grow. I personally loved it, but I think ||killing off most of the best characters|| kinda shot the show in the foot. I think they could’ve put some of that off until a season 2, and it’s a shame we’ll never get to know more about what was gonna happen. Additionally, the show getting canned doesn’t speak well for the future of on screen high republic/old republic content. So if y’all wanted Keanu as Revan, you may have to wait a good while longer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lt-Corvin_709",
            "body": "Rogue one was a perfect prequel to the OT",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImBatman5500",
            "body": "Bleeding kyber crystals is metal as hell",
            "score": 0,
            "replies": []
        },
        {
            "author": "KhorneFlakes01",
            "body": "To me at this point. Kathleen's trilogy and most of her shows are non cannon. I truly only liked rogue one, Mando season 1 & 2 and bad batch. Everything else has been a tired formula of hers that has really downgraded the quality of the universe.",
            "score": 0,
            "replies": []
        },
        {
            "author": "7thFleetTraveller",
            "body": "The canonization of Thrawn. Rebels was already awesome, but even more we got all the new books by Timothy Zahn which he would have never written without the new contract. The Chiss Ascendancy books especially were all I could ever hope for. And I still want more.",
            "score": -1,
            "replies": [
                {
                    "author": "Playful_Letter_2632",
                    "body": "While Zahn does a good job in the Canon novels, Thrawn’s onscreen appearance is a massive disappointment. He’s so much better in Heir to the Empire. Like most things, Legends better",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Laxien",
            "body": "Sadly there's nothing IMHO.\n\nI mean I tried...I watched 3 of their movies at the cinema ('The Farce Awakens', 'The Lost Jedi' and 'Rogue One' - and sadly the retcon (no Bothan-Spy-Network? Retcon!) is the best of them and that sickens me!), saw some of the 'Bad Batch' (prefer the first few seasons of Clone Wars to that...don't like the characters much, especially the female clone - bah!) and 'Andor' (a few episodes, which were so utterly boring that I would rather watch paint dry!)...but sadly there is nothing and I want the EU back and games like KOTOR - not 'Fallen Order' (tried that, but the fact that the character is so weak/bad ruins the whole immersion for me! Seriously, Ahsoka was YOUNGER than Cal Cestis is and she still was better trained and more effective in a fight, same for Baris Offee (sure she turned traitor, but before that she was an effective combatant in the order!))\n\nSome might say that the Mando show is good, but frankly the very fact that I know they destroyed the Darksaber and basically gave that green thing free reign to even do despicable things like eating some of those eggs from that dying species? Yeah, nope! Just nope! They also put too much emphasize on Stupid-Katan (Bo-Katan!)...seriously, that woman was a terrorist, who would have probably killed her sister if she thought it would restore Mandalor to the warrior culture it truly is deep down!\n\nThey also turned Obi-Wan (note: I never much cared for the character, especially since Lucas turned him into an asshole in Episode III - yes, I know he couldn't actually kill Anakin, but he should have been allowed to make the attempt by the script! Hell, have Palpatine show up right when Obi-Wan tries to finally kill Anakin! That way it's realistic that he runs, instead of finishing it - especially if the Emperor tells him that he has driven off Master Yoda, so Obi-Wan knows he doesn't stand a chance!) into a total idiot.\n\nNot that stuff like Hyperspace-Ramming - which makes all capital ships and they Deathstar and Starkiller Base a LIABILITY! Take this here asteroid, add a droid-brain (or an astromech!), a power-generator and a hyperdrive and you have a capital ship killer! Seriously, they didn't think this through...they didn't think the sequels through at all, they had two bad directors and a boss who wanted a feminist message sent and who basically doesn't care for the franchise (other than as a vehicle for her hatred for men!)...one of them always wants to \"subvert expectations\" (basically he wants to write bad movies and then tells you it's your fault if you wanted a good story!) and the other puts PEW-PEW over story (look at what he did to STAR TREK! A show that asked the big questions - he turned it into bad action flicks, with tons of pew-pew and no big questions at all...hell, he also broke Star Trek science with this Red-Matter-Junk!) - helped anything/did Disney Wars any favours! Hell, how can a troop of remnants (the First Order - which is frankly Imperial Remnant under another name, just like \"the Resistance\" is just the Rebellion basically (old wine in new skin!)) build Starkiller Base? How are lasers suddenly going past lightspeed? How can you see planets being obliterated in star systems hundreds or thousands of lightyears away in real time? What use is Starkiller Base once it has consumed it's star and thus can't fire it's weapon anymore? Seriously, the Deathstar was logical compared to this! Hell, why build this if Palpi has a fleet of Star Destroyers stashed, that ALL HAVE SUPERLASER?\n\nTHE SEQUELS MAKE NO SENSE! THEY ARE GARBAGE!",
            "score": -1,
            "replies": []
        },
        {
            "author": "CaptainA1917",
            "body": "None of it.  Literally none.\nThe so-called “sequel trilogy” has NOTHING of value and is not canon.",
            "score": -1,
            "replies": [
                {
                    "author": "Late-Sorbet",
                    "body": "This is incredibly silly and childish to consider the past 10+ years as \"not canon\" when we've gotten plenty of great content down the years",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CaptainA1917",
                            "body": "Was it “silly and childish” for Disney to make the previous 30 years of EU content “not canon?”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Late-Sorbet",
                                    "body": "To make a more coherent timeline that isn't primarily in a book series, no",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jayL21",
            "body": "As much as I love the design of the TK's, I personally prefer the phase 3 clone armor from TFU more.\n\nThe obvious answers would have to be Rogue one and Andor, the way the death star plans were handled and how it and rebels shows the rebellion coming together.\n\nAlso the way Vader finds out the name of the pilot who destroyed the death star.",
            "score": 0,
            "replies": []
        },
        {
            "author": "notyou-justme",
            "body": "I like that they used Yoda and Luke to do away with the concept of the Jedi as we knew them from the OT and PT. They’re probably the two most trusted Force using figures, and the two who did the most to introduce us to what being a Jedi meant (Obi-Wan’s tutelage for Luke AND the viewers was meaningful but perfunctory), so it’s fitting for them to decide that it’s time to end that tradition. Disney screwed up the story in so many other ways (don’t get me wrong, I still like the sequel trilogy) that I could see them using some random new character or thing to drive that narrative; probably in the name of increased marketing and merchandising. Letting it be Luke and Yoda was classy, and I liked the way they did it as well. With one more lesson and admonishment from Yoda to Luke, and then Luke showing how powerful he was with the projection to Crait, plus the sacrifice he made in doing so.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Bworm98",
            "body": "The modern Death Troopers are a lot cooler than just plain zombie stormtroopers.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ulfric_stormcloack",
            "body": "The late clone wars seasons",
            "score": 0,
            "replies": []
        },
        {
            "author": "The_Creeper_Man",
            "body": "The stuff with ilum was pretty cool",
            "score": 0,
            "replies": []
        },
        {
            "author": "LucasEraFan",
            "body": "I liked some of the controversial ideas in the ST despite not really enjoying the details or execution. I'm glad that Leia using and teaching The Force was included. Lucas adopted kids, and many families have issues, so Rey's rejection of her lineage and apparent adoption by the Skywalker family were respectable per se. I wish it had been Allana Solo, but whatever.\n\nI also enjoyed Mando 1&2 well enough and the first 3 episodes of Andor, but where those stories lead is the ST, and that's not my Star Wars.",
            "score": 0,
            "replies": []
        },
        {
            "author": "RadiantHC",
            "body": "Honestly I prefer the idea of chips. The way I see it there are three ways to do it\n\n1. The clones just choosing to follow order 66 of their own free will\n\n2. The clones knew of the order before hand\n\n3. Some form of brainwashing/mind control\n\n1 just doesn't make sense. Especially with how much development the clones and droids are doing it. 2 doesn't make sense either. All it would take is one clone for the entire plan to be ruined. 3 however fits Palpatine's character much better and allows the clones to be developed. I could never see someone like Rex or Cody willingly turning on their generals.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Haravikk",
            "body": "A lot of the content around the fall of the Republic, rise of the Empire and the rebellion has been good – finishing Clone Wars, Bad Batch, Andor and Rogue One are all great. Rebels was also generally solid.",
            "score": 0,
            "replies": []
        },
        {
            "author": "FalseAd4246",
            "body": "Season 7 of Clone Wars, All of Bad Batch, Ahsoka, Mando, and Book of Fett are all great.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Polyxeno",
            "body": "In Rogue One, I thought the droid was anusing, and I liked that main characters died. Some of the action was good too.\n\nI liked Rey scavenging inside a wrecked Star Destroyer in TFA.\n\nOutside Andor, I am not thinking of anything else I liked.",
            "score": 0,
            "replies": []
        },
        {
            "author": "The-Minmus-Derp",
            "body": "Rogue One and Andor are so good",
            "score": 0,
            "replies": []
        },
        {
            "author": "CombinationLivid8284",
            "body": "I really really liked how Ashoka made it clear anyone could learn the force with enough discipline and effort.",
            "score": 0,
            "replies": []
        },
        {
            "author": "SkeleHoes",
            "body": "The fact that Bill Burr’s character got so much development off a plot point from SW Battlefront 2 makes it all worth it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "richardrasmus",
            "body": "Unsure if this was pre Disney or not but I like female Mando helmets visors being more like Corinthian helmets",
            "score": 0,
            "replies": []
        },
        {
            "author": "richardrasmus",
            "body": "Unsure if this was pre Disney or not but I like female Mando helmets visors being more like Corinthian helmets",
            "score": 0,
            "replies": []
        },
        {
            "author": "hovering_death",
            "body": "Shows more uses of the Force (Horrible how quickly some learn the force) but always disliked how \"weak\" the force was in the movies\n\nI loved Rogue One and Mando",
            "score": 0,
            "replies": []
        },
        {
            "author": "TheCasualPrince8",
            "body": "Bleeding Lightsaber crystals. People forget that that wasn't a thing in Legends. In Legends, red lightsaber crystals were literally just synthetic crystals. The whole 'bleeding' process is way cooler of an explanation.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Spyhop",
            "body": "I find most of the negativity directed at the sequel trilogy. Most of the rest of what's been produced under Disney has ranged from ok to fantastic IMO. Standouts for me are Rogue One/Andor, Rebels, Conclusion of Clone Wars, Skeleton Crew, Mandalorian.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Cloak-Trooper-051020",
            "body": "I like that the Death Star started as a Republic super weapon rather than a separatist. Regardless of its destructive power, it seems weird that the Empire would continue the development of a Separatist battlestation still under construction following the Clone Wars. There would be significant opposition within the military to justify it, as opposed to building it from scratch themselves. (Source: Catalyst)\n\nI also like Thrawn’s rise through the Navy. Having him receive 19 years of private training only to go from Captain to Grand Admiral in the 4 years during the original trilogy seemed a bit odd. Seeing him rise through the regular forces over 16 years was a much better development and build credence to the Empire accepting him as Warlord following Endor, giving his established history. (Source: Thrawn novel)",
            "score": 0,
            "replies": []
        },
        {
            "author": "HyliasHero",
            "body": "Thr animated shows in general, most of the live-action shows, most of the movies, most of the books, and most of the games. I've honestly been eating pretty good with Disney Star Wars. There are definitely some misses here or there (Rise of Skywalker, Book of Boba Fett, Star Wars Hunters, and the Aftermath trilogy come to mind), but I've generally enjoyed most things that have been released.",
            "score": 0,
            "replies": []
        },
        {
            "author": "voiceofreason467",
            "body": "The first season of Ahsoka and Andor are pretty good additions.",
            "score": 0,
            "replies": []
        },
        {
            "author": "CalligrapherOther510",
            "body": "None I hate the disney canon and legends will always be my canon.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Bonecrusher1973",
            "body": "It's still Lucasfilm who made those changes, Disney only owns Lucasfilm and co-produces and releases Lucasfilm productions in theaters and/or Disney+",
            "score": -4,
            "replies": []
        },
        {
            "author": "NecessaryMagician150",
            "body": "I really enjoyed the Obi-Wan show, Andor, Bad Batch, the first 2 seasons of Mandalorian, the Jedi games, and The Acolyte. The Darth Vader comics are great too. Only read the first High Republic novel so far but I loved it so cant wait to read more! \n\nI know disney really dropped the ball on the movies but people complain way too much. Star Wars fans have been eating good but you would never know that from the internet lol\n\nAlso, not \"canon\" in that way but the Lego Skywalker Saga game was great, a must-play for fans!",
            "score": -1,
            "replies": []
        },
        {
            "author": "Neversummerdrew76",
            "body": "I have liked everything except the change in the lore surrounding Kyber Crystals.  The whole “bleeding” thing I can’t stand.  Other than that, I think I love everything else.  (Except for Palpatine returning.  It should have been Plagueis.)",
            "score": -1,
            "replies": []
        }
    ]
}