{
    "title": "Bi-Weekly Discussion Thread - (January 19)",
    "author": "AutoModerator",
    "subreddit": "communism",
    "rank": 54,
    "score": 13,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 60,
    "url": "https://www.reddit.com/r/communism/comments/1i4l3zj/biweekly_discussion_thread_january_19/",
    "id": "1i4l3zj",
    "selftext": "We made this because Reddit's algorithm prioritises headlines and current events and doesn't allow for deeper, extended discussion - depending on how it goes for the first four or five times it'll be dropped or continued.\n\nSuggestions for things you might want to comment here (this is a work in progress and we'll change this over time):\n\n* Articles and quotes you want to see discussed\n* 'Slow' events - long-term trends, org updates, things that didn't happen recently\n* 'Fluff' posts that we usually discourage elsewhere - e.g \"How are you feeling today?\"\n* Discussions continued from other posts once the original post gets buried\n* Questions that are too advanced, complicated or obscure for r/communism101\n\nMods will sometimes sticky things they think are particularly important.\n\nNormal subreddit rules apply!\n\n[ Previous Bi-Weekly Discussion Threads may be found here https://old.reddit.com/r/communism/search?sort=new&restrict_sr=on&q=flair%3AWDT ]",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokeuptheweed9",
            "body": "A wise approach is to not form an opinion on events until they have lost priority for the algorithm. But I'm not that wise. I feel like this new Chinese Deepseek AI is a turning point where Dengism is now becoming liberal common sense. I was wondering what would emerge from Trump's second term now that Sanders social fascism is non-existent and it appears the idea that America is useless in every way whereas China is a perfectly harmonious, meritocratic, and efficient society is too compelling. Coupled with the recent fantasies of young liberals going onto Chinese social media apps after the banning of tiktok and being \"deprogrammed\" through communication with Chinese people, older anti-communism no longer works (I'm thinking of the crude attempt to ban \"CCP propaganda\" on r/antiwork, although it's hard to tell how much of this is a genuine reaction by the user base and how much is competing brigades) and it no longer requires taking a position on \"Marxism-Leninism\" to decide that China is the technocratic dream of liberalism deferred in the US.\n\nI never thought I would see the day where Michael Roberts is reposting Moon of Alabama articles on Facebook or the only counter to China's technical accomplishment is \"AI sucks anyway\" rather than a serious engagement with the AI global value chain. There was a period in the late 2010s when a bunch of really good works came out about imperialism and China and they invigorated me for a few years. Now there's nothing and I lack the discipline to not have an opinion on issues that older works do not explain in an obvious way. Whatever delaying effect support for Russian fascism had on making Dengism repulsive has waned, the desire to stick it to Trump by predicting his inevitable humiliation by the genius of Xi Jinping is just too tempting.\n\nAnyway, the good news is if the Western \"left\" is capitulating, the seeming one man effort to translate Chinese Maoist works on bannedthought has created a good list of things to read. I think that's the only thing to do.",
            "score": 38,
            "replies": [
                {
                    "author": "DashtheRed",
                    "body": "When you said that the ACP was the future of the \"left\" (not a good thing) in a previous thread, I took it to mean that they (or at least their \"patriotic socialism\" logic) would come to overtake \"C\"PUSA or PSL or DSA etc, and become the main amerikan organization for \"socialism.\" Which all seemed straightforward, but now I'm wondering if that was an underestimation, and there might be a place for Dengism/PatSocs in mainstream amerikan politics (also not a good thing)? And the ACP, or whatever emerges, could end up being a problem that goes beyond just people who call themselves socialist.  Though I'm a bit skeptical -- with the rising German Empire in the build up to WW1 as the main rival to Britain, there was never a pro-Kaiser or German-sympathetic faction which manifested in England, wishing for them to become more like the industrial marvel that was Germany (even Kautsky's logic didn't find support there, the British members of the Second International sided with the Entente).  Though there was plenty of amerikan support for Germany.  But then again, British nationalism was still young and fresh and \"healthy\" in the run up to the war, where amerikan nationalism today has become a rotting self-parody, (except to fascists, who envision themselves as the restoration), and now that Trump is back, amerikan liberals are ashamed, and all their attempts to reclaim amerikan patriotism backfired, as was expected.\n\nedit: there was no edit, just accidently pressed save",
                    "score": 17,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "While the pro-Russia, anti-China far right exists on the fringes of the Republican party, it has some influence as thought leaders and organizing the shock troops of fascism. The Democrats have so far resisted attempts to create a pro-China, anti-Russia equivalent (in favor of peace, free trade, and liberal factions in the CCP), although this position is equally as logical as the former. Instead, the Democrats continue to present themselves as the party of order and Dengism can take the form of broad \"anti-imperialism\" which avoids the question of Russia. Can this survive another Trump term, now without any central figure of \"resistance?\" I am mostly wondering what form social fascism will take now that every previous form has withered away, though perhaps I am overestimating Dengism given it is a mere copy of fascist discourse applied \"ironically\" (e.g.\"what if we called the right cucks?\"). For all that I find interesting about the ACP as a phenomenon, it's notable that the actual people involved are all losers.\n\nIf this position develops, calling it \"Marxism\" is probably a bridge too far for US liberalism (although it's possible in countries with surviving communist parties of some influence) so I doubt the ACP would survive the transition. You're right about how far this can go though, Biden is probably the closest we'll get to trying to create an American equivalent to Chinese state subsidies for industry and it was a pathetic failure. As it disappears so will the usefulness of propaganda about the \"Green New Deal\" and the \"most pro-labor president\" and such. Again, I'm just not sure what will replace it. \n\nYour historical point is well taken but there is unfortunately an equivalent: the fascination of European communists with America. Because the US lacked a feudal past, it was seen as the purest, most vital expression of capitalism and bourgeois democracy and the Frankfurt school is just one example of European Marxism falling victim to these illusions. For those of us who've had to rescue the concept of settler-colonialism from obscurity and insist on the black national thesis, this whole lineage of thought was flawed. Settler-colonialism and slavery are not better than feudalism, they are merely different, and this is one of the fundamental problems with applying the term \"fascism\" to the US (or rather why the US never quite seems to be fascist given the notable features come out of German, Italian, and Japanese feudalism). The same relationship exists today towards China as the perfect form of capitalism because its socialist revolution purged it of all pre-capitalist vestiges, up to private land ownership, parliamentary democracy, and market anarchy. In reality capitalism lacks basic legitimacy in China so all that exists is naked corruption at the everyday level and a weak ideology of \"growth\" to support the status quo. But that doesn't impact fantasies, even if you visit China you're going to see a functional East Asian capitalism in the major cities (that, luckily for you, throw jobs at English speakers and under qualified foreigners), not the reality of Chinese life for the large majority in minor cities and the countryside where petty local government, rich bourgeois princelings, and mafia enforcers rule.\n\nE: I see u/Far_Permission_8659 already said what I wanted to say but better. Still, there is more to say on this subject since, as they imply, the conflation of sympathy with Vietnam and \"the left\" is taken for granted but highly suspect. It was Noam Chomsky who pointed out that the end of the war came largely from business factions (not to deny the primary role of Vietnamese resistance, only the role of the Western social democratic movement as a component of it). In fact the timelines don't really add up, anti-war politics became a central element only in 1968 when it was clear the war was lost and were mostly a reaction to the pointless escalation of Nixon in Cambodia and his betrayal of the promise to end the war (made for the bourgeoisie, not student protestors). Communists were obviously enchanted by opportunity and saw in this a broad social movement that could make revolution. But when it didn't happen there was no self-reflection, just nostalgia or delusion. There simply never was an engagement with the history of American right-wing anti-imperialism and settler-colonialism, European concepts were simply transplanted.\n\nSimilarly, the contemporary \"anti-imperialist\" movement only came into existence beyond the fringes after what it was opposing had already passed. Nearly all of its figures were in favor of Obama-era imperialism (including in Syria and Libya, you can go back and find their tweets) and are really a post-Trump phenomenon, parasitically dependent on right wing American isolationism. But unlike in the past, the right is much stronger (or at least more politically creative), if Moon of Alabama is a thought leader of Dengism, that is because they also rant about \"DEI,\" taking the final step towards ideological consistency with their class interest. On the other hand Michael Roberts convinces no one, not even his own comment section, and has stopped even putting in the Trotskyist cynicism at the end of his posts that for all it's success, China is not socialist because it lacks democracy or whatever. His comment section has fully bought into neo-Confucian Orientalism about the provincialism of such ideas (regardless of what you thought about the useless debates about the Grundrisse that used to be there, sometimes these were great debates between real scholars like John Smith - now it's worse than reddit).",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "CoconutCrab115",
                                    "body": ">Settler-colonialism and slavery are not better than feudalism, they are merely different, and this is one of the fundamental problems with applying the term \"fascism\" to the US (or rather why the US never quite seems to be fascist given the notable features come out of German, Italian, and Japanese feudalism).\n\nNot trying to sidetrack, but can you elaborate on this? I know the late development states of Germany, Japan, Italy (to an extent Thailand and Romania too) are the original fascist states for a reason. But other than the Junker class in Germany and lack of land reform in Japan, what features come out of these states Feudalisms?",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Far_Permission_8659",
                            "body": "It probably helps to view the distinctions between Britain as a bourgeoisified nation (Ireland excluded of course, which has an interesting history worth covering here, though one I am unequipped to do) and the Amerikan prison-house. Euro-Amerika has often leveraged its oppressed nations as tools in intranational struggle then discards them when they aren’t of use. This is the basis for much of settler politics, from Bacon’s Rebellion to Antifa.\n\nThe same is true to international enemies. There was tremendous sympathy for Vietnam, for example, in leveraging for anti-draft movements but this was in part limited by the actual radicality of the CPV and PAVN as revolutionary communists. More recently many national bourgeoisie bolstered United Russia as an international ally because of their fight against the finance capital-backed war in the Donbas and the similarities between Amerikan white supremacy and Russian chauvinism (the latter being a direct progeny of the former, in its modern form anyway). \n\nIt’s hard to imagine a Rosenberg or John Brown among these social fascists so I’m not sure how entrenched this rhetoric is once it’s clear Xi will not punish their enemies.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "> More recently many national bourgeoisie bolstered United Russia as an international ally because of their fight against the finance capital-backed war in the Donbas and the similarities between Amerikan white supremacy and Russian chauvinism (the latter being a direct progeny of the former, in its modern form anyway).\n\n\nYou mean amerikan natbourg? Sorry for the tangential question but does amerika even have a national bourgeoisie, and how is it defined then if not by an antagonistic relation to imperialism?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Drevil335",
                                            "body": "The Amerikan national bourgeoisie *is* the US imperialist bourgeoisie, since the development of a robust domestic market (the class interest of the national bourgeoisie) is a prerequisite for the development of imperialism in the first place (and imperialism, through creating a mass labor-aristocracy, only expands that market further).\n\nRegarding the oppressed nations, I have seen it argued that, at least in the 60s-80s, there was a New Afrikan national bourgeoisie that was a major source of reformism and \"integration\" in the New Afrikan liberation movement; I'm not entirely sure what precise strata this is referring to, and in any case I suspect that it has since lost its \"national\" character, becoming a comprador bourgeois class (though this definitely existed in the 60s as well; for instance, New Afrikan drug kingpins whose massive profits came from the national oppression of their own people), or even just integrating into the Euro-Amerikan imperialist bourgeosie, instead.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Far_Permission_8659",
                                            "body": "As /u/Drevil335 mentioned, it’s a bit difficult to describe this stratum as a distinct class given the obvious interrelation between the surplus value generated by finance capital which bolsters a national bourgeois, predominantly Euro-Amerikan “middle class”. This stratum has many reasons to attempt protectionist measures in order to safeguard any global competition (much of Euro-Amerikan industry is deliberately archaic in order to sustain a settler base) which would outcompete these “local businesses”.\n\nOn a more broad level, this direction of a convergence between natbourg nativism and social fascist “autarky” was predicted by [MIM](https://www.prisoncensorship.info/archive/etext/mt/imp97/imp97c3.html) quite incisively.\n\n>In any case, the U.$. government’s extra anti-communist fear of economic planning places it at a disadvantage relative to Japan, Europe and state-capitalist China which are more willing to use planning for bourgeois ends. “In the economy that grew the fastest in Europe in the 1980s, that of Spain, government-owned firms produce at least half of the GDP. In France and Italy the state sector accounts for one-third of GNP.” (150) Whether the United $tates can avoid taking up an “industrial policy” and “managed trade” if Europe and Japan decide to go forward is difficult to say. For ideological reasons, the United $tates may continue to put forward that the ownership of profits is what matters, not where the workers are employed. If foreign imperialists own a large share of the U.$. economy, such a position may not even hurt the labor aristocracy. On the other hand, the pattern of not caring about history and statistics in trade allows the U.$. administration the flexibility to change policy. U.$. practice has been to bring in a succession of know-nothings to head trade policy, as if to underscore that there is no science of trade. When one official threatened government subsidies to match Airbus subsidies in Europe, no one believed him, because of U.$. individualism.(151) However, a change of administration and faces could conceivably change that.\n\n…\n\n>Of particular concern to MIM in the United $tates is the possibility of a national socialist movement led wittingly or unwittingly by the likes of Pat Choate, the CP-USA and the social-democrats of the DSA ilk. Choate admits that the United $tates does all the things Japan does abroad and also admits that U.$. politicians can be bought by anyone, not just the Japanese. For this reason, he spends 99 percent of his time bashing Japan, and 1 percent of his time admitting the flaws of capitalism and U.$. imperialism in particular.(153) He claims to be in favor of removing all influence-peddling, not just Japan’s. Under the pressure of Japanese competition, Choate even admits something we communists have been saying about imperialist investment for decades, except he applies it not to a colony but to the United $tates! “Of the 677,000 jobs that foreign investors claim to have created in 1988, only 34,000–a mere 5 percent—were created by the establishment of new foreign-owned operations in the United States. The other 95 percent were made up of existing jobs in U.S. companies that were taken over by foreign investors.”(154) We want to know where was Choate all these years when that needed to be said about U.$. investment in the Third World.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "urbaseddad",
                                                    "body": "Very interesting. \n\n\n> This stratum has many reasons to attempt protectionist measures in order to safeguard any global competition (much of Euro-Amerikan industry is deliberately archaic in order to sustain a settler base) \n\n\nDoes this explain Trumpism and the backwardness of his base? (I hope I'm not inadvertently promoting the Democrat position but it seems to me like Trumpism is indeed more backward than the Democrats — though they both still require genocide and imperialism.)\n\n\nI'm still confused by your use of natbourg though because I thought the existence of this class was exclusive to semi-colonial countries. If as you and u/Drevil335 mentioned it's difficult to separate them why even call them natbourg? What's the usefulness of the term here?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Far_Permission_8659",
                                                            "body": ">Does this explain Trumpism and the backwardness of his base.\n\nWhile his base is absolutely backwards which shows in the rhetoric, I think Trumpism is the most advanced stage of neoliberalism. The modern tariff regimen is basically a version of the sanctions regime that the Biden presidency used, except under a coat of nativism and consequent push for reindustrialization (which is a legacy of Sanderism). Even the government remodeling is just the austerity regime pointed inward.\n\n>Why even call them natbourg? What’s the usefulness of the term here?\n\nI think there’s a significant difference in political manifestation between Amerikan companies that work predominantly within their borders (that is, Euro-Amerika), those who predominantly export capital to internal colonies, and those who export capital outside of the broad Amerikan borders. You’re correct that these aren’t really differences in relation to production (all of the above strata are completely reliant on imperialism to exist as such), but the apportioning of surplus value is a significant and often primary contradiction within Euro-Amerika that necessitates differentiating these groups.\n\nAs the rate of profit declines, accelerated by global competition, this has severe effects on the ability for all of these groups to sustain themselves and they look to the others to jettison. The Euro-Amerikan petty bourgeoisie and “national bourgeoisie” are especially precarious in this relationship due to their pronounced inefficiency and cost. Not only does this make them highly dependent on government loans and subsidies, but they are also especially susceptible to [crises of finance capital](https://www.sciencedirect.com/science/article/pii/S0378426622002709).\n\nI’m happy to change the term to describe this, though, since you’re right that this is distinct from the traditional national bourgeoisie. Maybe it would be better to say the national imperialist bourgeoisie, although I’m open to suggestions.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rich_Swim1145",
                    "body": "There's no good reason for me to believe that Dengism will become common sense in American liberalism. In fact, American liberal opinion before Trump's fame had much more pro-China “rise of Asia” “perfectly harmonized bureaucratic state of meritocracy” rhetoric.\n\nAnd you're too convinced that ideological shifts need to follow logic, evidence, emotion or reason rather than the economic needs of the ruling class. While there are more of these reasons to believe in Dengism now, it is precisely for this reason that it is all the more necessary for the ruling class of U.S. imperialism to get their liberal cultural elite servants to oppose this. Consider that currently American liberals are already competing with American conservatives over who is better able to oppose China, rather than advocating compromise with China as they did 10 years ago.\n\nOf course, anything can happen, it's just a matter of odds. But the idea that some form of victory by Xi over Trump is enough to make American liberals change their views, or that the main obstacle to American liberal support for Xi is Putin rather than the confrontation between imperialism and the relative decline of the United States itself, is clearly unfounded, idealist and unlikely to be correct.\n\nAnd as a Maoist, I don't think that such a “capitulation” would be a bad thing for the if it did happen, because it would increase the pool of potentially effective recruits. Dengists are actually more likely to be recruited as Maoists than liberals in general. Of course, I'm not a party management bureaucrat, so this is none of my business.\n\nAnd as an data science practitioner myself, I don't think the “AI value chain” exists or matters, or that there is somewhat “Xi Jinping's genius”. From the beginning, these narratives have been nothing more than a hoax designed to inflate the price of US tech stocks. The only “problem” that has arisen so far is that some Chinese startups are actually serious about developing real products like DeepSeek, accidentally shattering the illusion many Computer engineers has found from the beginning.\n\nIn any case, even if the industry does make as much sense as the layman thinks it does, the U.S. can always treat China the same way it treats Chinese electric cars and solar panels, or the Chinese AI industry the same way the U.S. treats TikTok or China treats Google, and so the problem is once again simplified to the likelihood of imperialist wars instead of the liberal intellectual elites who always follow their masters of finance capital and change their meaningless color",
                    "score": -7,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": ">And as a Maoist, I don't think that such a “capitulation” would be a bad thing for the if it did happen, because it would increase the pool of potentially effective recruits. Dengists are actually more likely to be recruited as Maoists than liberals in general\n\nI've found it to be the opposite case, where young liberals who are naturally attracted to revolutionary movements slowly purge themselves of such feelings as they are forced to choose between Chinese imperialism and third world revolutionary movements that resist it. You may respond that most Dengists are too ignorant to have an opinion on the revolution in the Philippines but you're just proposing the same liberal cynicism where people are just blank slates to be manipulated into your position. Even the term Maoist has become suspect as Dengists try to colonize it, I do not necessarily trust your claim to it.\n\n>American liberal opinion before Trump's fame had much more pro-China “rise of Asia” “perfectly harmonized bureaucratic state of meritocracy” rhetoric.\n\nI don't think that's true at all, China was understood in those terms as on the path to \"democracy\" based on the experience of the late Soviet Union and China's embrace of free trade had no place in the anti-globalisation left. Where are you getting this from?\n\nThe rest of your post is confused, sorry. We're discussing a fraction of liberalism, known as Dengism, which is finally making inroads into mainstream discourse. No one is arguing that mainstream liberal politicians will start advocating for Chinese capitalism, that's absurd. The issue is whether resistance within the terms of liberalism, i.e. social fascism, takes the form of Dengism.\n\nAs for the AI value chain, that AI is largely a parlor trick that's been revealed to have a rotten foundation is true, as is the inflation of stock prices in a bubble. But this does not mean the purpose was to inflate stock prices, that's not a cause. The purpose was to find a commercial application for the West's very real monopolistic advantage in semiconductors. That this attempt failed only makes the need for a real application more desperate. While you're right this will lead to imperialist wars as the defense of last resort, this is not a simple problem except in the crude sense of politics only caring about events. But again, you're being cynical, we are human beings with scientific curiosity about how the industry actually works and the nature of technology and this is important to predicting when inter-imperialist war will occur and what form it will take. It's not sufficient to dismiss every particularity as just a superficial manifestation towards the same underlying endpoint even if it's abstractly the case.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "IncompetentFoliage",
                                    "body": ">Even the term Maoist has become suspect as Dengists try to colonize it, I do not necessarily trust your claim to it.\n\n\nCase in point, several of the people who responded to this post you mentioned\n\n\nhttps://www.reddit.com/r/Socialism_101/comments/1iekbl4/how_many_nice_things_can_we_have_and_what_point/\n\n\nidentify as Maoist or anti-revisionist, even though their responses are carbon copies of the others.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "smokeuptheweed9",
                                            "body": "I've seen a lot of them here recently. There was a brief attempt to turn \"Maoist\" into a slur and elevate \"Mao Zedong thought\" as something only those in-the-know know (like using CPC instead of CCP) but, like all liberalism, Dengism is merely parasitic on Marxism (and fascism which is itself parasitic on Marxism). So instead Maoism itself is being appropriated and diluted, presumably so that its real history can be consumed, chewed up, and spit out.",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Rich_Swim1145",
                                    "body": "I don't find young liberals any more “naturally” attracted to revolutionary movements. And it is clear that Dengists do take a position and are not ignorant, but know something that is completely wrong. You don't seem to know what I believe. \n\nDespite the fact that I'm not actually a former Dengist myself, and have instead been an permanent opponent of them, I've seen more ex-conservatives than ex-liberals among people who call themselves Maoists. That's not much of a valid sample, of course. Still, even if you think that Dengists are just a form of liberalism, they are clearly a form of liberalism closer to Maoism. \n\nIt's also not “liberal” to believe that people can be manipulated into various positions and liberal culture elites change their ideas based on what their bourgeoisie masters want. That's exactly what Marxism is, and that's one of the reasons why the economic base determines the superstructure and \"the ideas of the ruling class are, in any age, the ruling ideas\"\n\nBtw, there's really nothing wrong with being cynical though, it's just being realistic and critical of the world. And it's true that you don't need to trust anyone's statements about their position, because people are basically incapable of even recognizing their own positions, but you seem to lack self-awareness about that.\n\nYou probably don't have empirical knowledge of liberal rhetoric prior to 2015/2016/2018 when there was much more brag about China (especially before Xi) and I was talking about liberals, not leftists. Also, leaving aside for a moment that your inability to understand and accept doesn't mean I'm confused in my conversation, what I'm saying is that what you consider to be part of the Dengist talking points were actually more popular before. And, its almost unlikely that if it changes, it will happen in the form and for the reasons you stated.\n\nIncidentally, liberalism is not quite the same as socio-fascism, since the mainstream wing of it doesn't even have the pretense of the “social” part of it. Socio-fascist is the correct description of Sanders and his fans, but the mainstream of the Democratic Party is basically just Hindenburg and Schacht, not SPD.\n\nOnce again, you're mistakenly assuming that there are real large-scale sales of AI-related hardware, while assuming that I'm just criticizing the software part of it as unreliable. If you look at the financial statements, you will see that this “gold rush” only exists on the financial statements of NVDA and SMCI. The latter has been proven to be largely false, while the former is more optimistic than the latter. It's just financial fakery and manipulation, and there aren't even many real hardware deals. In short, the triumph of DeepSeek's not-so-smart approach likely comes basically from the fact that they actually tried genuinely to develop anything real in the midst of a massive scam.\n\nAnd not to mention that “curiosity” is not part of any non-existent “human nature”, the result of my curiosity and research inspired by NVDA fans is to point out that it doesn't make sense. So much so that it doesn't even affect the relative specifics of imperialist warfare you mentioned - and it's actually inherently hard to predict those details so I just ignored that.\n\n\nEdit: typos",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "smokeuptheweed9",
                                            "body": "I'm really not interested, sorry. Please don't post here in the future, this place is a safe haven from r/ShitLiberalsSay, r/thedeprogram, r/MovingToNorthKorea, it's not the \"Maoist\" equivalent.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "Rich_Swim1145",
                                                    "body": "I don't know about your sectarian disputes, but it's nice to see you admit that you're not interested in actually answering questions and have to resort to exclusion.\n\nAlso, I don't know what you call “Maoist equivalents”, after all I don't even know of any subreddit that could be called “Maoist”. \n\nAnd, I never thought there was a similarity (let alone any “equivalence”) between those subs. I just responded to posts I saw and was interested in, not really sure what you meant.\n\nI did get disagreed with for criticizing China a few times on r/shitliberalsays, but that's not surprising considering the relatively large number of Dengists. It's just a similar feeling to when I criticized weird hamburger-loving “ML” on Twitter earlier.\n\nEdit: In fact, I'd like to add that your view that people can not be always and easily manipulated into believing a lot of things as the ruling class want, or that liberal cultural elites rely primarily on reason/evidence/logic to change their views, is very very very very liberal indeed.\n\nEdit2: I first learned that value for Maoism/Socialism/Communism was defined by whether or not I knew about some colony of self-proclaimed Maoists on reddit (despite the apparent existence of non-web-based social channels and many other social media with more users) and that these same people simultaneously claimed that other people were setting the bar of meaninglessness for Maoism \"The difference between CPC and CCP is meaningless, full stop! Ridiculous distinction. Bur you're worthless if you don't know that our cliques constrained in certain parts of a certain social media which is not so popular\"\n\nEdit3: The latest anti-theory dropped: Communism is wen no GSG and ignorance/meaninglessness is wen I am not able (or don't want) to understand \n\nEdit 4: Yes, it's very proud to be only able to say “no” after being refuted by evidence, and it must not be liberal and fascist-style ableism, anti-intellectualism, and idealism that theory, evidence, and logic represent a breakdown, and that the breakdown represents error and patheticness and no need to talk about any of the facts because people can do and actually do name-callings.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "PrivatizeDeez",
                                                            "body": "Funny as hell too because there's not a single question in either of your ridiculous screeds. You didn't deserve the response you got -\n\nYour language presents itself as 'learned' but it is impossible to piece together anything cogent. It's like the gamification of leftist debate bros - unsurprising that you're ostensibly addicted to video games that roleplay political economy.",
                                                            "score": 14,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Flamez_007",
                                                            "body": "I just watched a Dengist have a mental breakdown because Smokes said no. This is so sad.",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "Communist-Mage",
                                                                    "body": "I have to admit I enjoyed seeing Edit… Edit2… Edit3…",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "smokeuptheweed9",
                                                            "body": ">after all I don't even know of any subreddit that could be called “Maoist”. \n\nI know you don't know. That's why you are not of value to this community.",
                                                            "score": 11,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MajesticTree954",
            "body": "MIM(P) responded to my post:\n\n>u/MajesticTree954 on reddit.com: “MIMP’s ULK is pretty good, because of a relatively more advanced political line, but is also stunted in my view because of the line of a decentralized cell-structure. When you have an ideological leadership, but that leadership insists that it is purely educational, purely to help facilitate discussion for others (as MIMP believes) you’re relying on spontaneity and now acknowledging the importance of your own leadership.”\n\n>Wiawimawo of MIM(Prisons) responds: MIM(Prisons) has never claimed that it is a purely educational organization, and it is an insult to the years of hard work of our comrades to claim that is our position. Please do quote us next time you want to put words in our mouths. You can see how we define ourselves by reading What is MIM(Prisons)?. You can see our list of campaigns for some of the things we do that aren’t education programs, and these appear in every issue of ULK that this poster claims is “pretty good.”\n\n>People want to blame the lack of revolutionary activity in the United $tates on MIM’s resolution on cell structure of 2005. As if our organization would somehow be bigger now without it.\n\n>Education is foundational to our mission. That is how we build cadre and mass leaders. You can say our campaigns are pathetic if you want, but you can’t say we don’t do them. You can say our serve the people programs are meager, but you can’t say they’re all educational. You can say our strategy is wrong, but you can’t say our comrades haven’t spent 1000s of hours agitating around censorship and torture in prisons, attending events, putting on events, building with other organizations, etc.\n\n>We are very proud of the fact that MIM(Prisons) still exists, and is once again growing, after the setbacks we faced. You know who doesn’t still exist? the majority of the other organizations we’ve allied with over the years. Yet it’s our fault the movement is so weak? What do our critics think it takes to build a party? Critics need to step the fuck up, instead of telling other people to form a party.\n\n>i’m not special, i’m just consistent.\n\nHere’s what I was drawing from when I made the initial comment, from their fundamental political line:\n\n>“MIM(Prisons) considers itself a part of the MIM, which is currently without a center. We uphold the need for a vanguard party to seize power and build so- cialism, but do not fill that role ourselves. It is possible that MIM(Prisons) will spawn the vanguard party when the time is appropriate for such a centralized or- ganization.”\n\n>“Our principal task is to maintain the prison ministry as a source of educational and agitational material and as a central coordinating body for the anti-imperialist prison movement.”\n\nWas I being uncharitable? I’ll readily admit, after posting here, I’ve learnt how little I know about party building - what does underground/aboveground mean in the context of the internet? What is the organizational role of a newspaper, who should a newspaper communicate with and what should it talk about? - Either way, I wish they could’ve used this as an excuse for a productive discussion on party building and what they see as an “appropriate time” for it instead of this pragmatism about how any hours they’ve spent doing things.",
            "score": 19,
            "replies": [
                {
                    "author": "Autrevml1936",
                    "body": "> Either way, I wish they could’ve used this as an excuse for a productive discussion on party building and what they see as an “appropriate time” for it instead of this pragmatism about how any hours they’ve spent doing things.\n\n\nYeah the response is actually disappointing from MIM(Prisons) as this:\n\n\n> You can say our campaigns are pathetic if you want, but you can’t say we don’t do them. You can say our serve the people programs are meager, but you can’t say they’re all educational. You can say our strategy is wrong, but you can’t say our comrades haven’t spent 1000s of hours agitating around censorship and torture in prisons, attending events, putting on events, building with other organizations, etc.\n\n\nIs something that could have easily come from the \"Just do something\" Petite Bourgeois \"Leftists\" that have developed. It is a matter of whether the Practice is correct Politically not about saying it is \"Pathetic\". After ~20 Year's of MIM(Prisons) cell structure what has been learned from this and *is it still correct in today's conditions*?\n\n\nI hope they investigate, reconsider your critique, reevaluate this response, and write something better.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "PretentiousnPretty",
                            "body": "Whilst MIM(P)'s response detracts away from reflective criticism, I really think it would have helped if OP gave a specific observation at first (like they did above) and then question, rather than say that the organization is \"purely educational, purely to help facilitate discussion for others (as MIM(P) believes.\n\nSubjectively it's pretty hard to accept criticism when you don't agree with the basis of criticism, ie it's easy to say \"that's not what I believe; that's not what I said...\" and then defend your words, rather than respond to the substance of the criticism\n\nWithout tone policing, I really think if that there were not any conclusions made or claims about beliefs, just the specific quote and then questioning, criticism/self-criticism would then blossom more fully.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "MajesticTree954",
                                    "body": "I agree, that's my bad, I either should've left that part out or included the quotes from the FPL. It was just one idea in a post with a dozen other partially formed ideas. \n\nI'm always surprised to see MIM(P) respond to posts here on their website because most organizations completely ignore individuals on social media. It's only helpful responding if that individual brings up a point that an org can use to productively build upon. Maybe they see it as slander detrimental to recruitment? I don't know.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vomit_blues",
                    "body": "The quote from MIM(P) seems fine to me, so your original critique is confusing, no matter the legitimacy or lack thereof in MIM(P)’s response.\n> This puts the internal problems of party organization in a new perspective as well. Both the old idea – held by Kautsky among others – that organization was the precondition of revolutionary action, and that of Rosa Luxemburg that it is a product of the revolutionary mass movement, appear one-sided and undialectical. Because it is the party’s function to prepare the revolution, it is – simultaneously and equally – both producer and product, both precondition and result of the revolutionary mass movement. For the party’s conscious activity is based on clear recognition of the objective inevitability of the economic process; it’s strict organizational exclusiveness is in constant fruitful interaction with the instinctive struggles and sufferings of the masses. Rosa Luxemburg sometimes came near an appreciation of this element of interaction, but she ignored the conscious and active element in it. That is why she was incapable of understanding the vital point of the Leninist party concept – the party’s preparatory role – and why she was bound grossly to misinterpret all the organizational principles which followed from it. The revolutionary situation itself can naturally not be a product of party activity. The party’s role is to foresee the trajectory of the objective economic forces and to forecast what the appropriate actions of the working class must be in the situation so created. In keeping with this foresight, it must do as much as possible to prepare the proletarian masses intellectually, materially, and organizationally both for what lies ahead and how their interests relate to it. However, the actual events themselves and the situations which subsequently arise from them are a result of the economic forces of capitalist production, working themselves out blindly and according to their own natural laws -though not, even then, with mechanistic fatality.\n\n…\n\n> The immense demands which Lenin’s concept of party organization made upon professional revolutionaries were not in themselves Utopian, nor did they naturally have much connection with the superficiality of ordinary life. They were not concerned with the immediate facts; they went beyond mere empiricism. Lenin’s concept of organization is in itself dialectical: it is both a product of and a conscious contributor to, historical development in so far as it, too, is simultaneously product and producer of itself Men themselves build a party. A high degree of class-consciousness and devotion is required in order to want and to be capable of working in a party organization at all. However, only by being so organized and by working through a party can men become real professional revolutionaries.\n\nhttps://www.marxists.org/archive/lukacs/works/1924/lenin/ch03.htm\n\nMIM(P) deciding to declare themselves the vanguard party and organize as such won’t build a revolution from thin air. They also don’t use the lack of revolution as an excuse to do nothing at all. They see themselves as taking a shape appropriate to the current situation, from which a vanguard may arise with a change in conditions.\n\nSo I think your critique needs to go further than pointing to the form without explaining further why you think their justification for that form is incorrect. I think if they could just change into a vanguard party and suddenly solve their problems, they would have.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "HappyHandel",
            "body": "Well it happened, Luigi Mangione finally \"inspired\" somebody and it was a neo-Nazi school shooter in Nashville. I know we were discussing this media spectacle in this sub before but didn't some of you say this would be a precursor to increased fascist violence?",
            "score": 17,
            "replies": [
                {
                    "author": "Particular-Hunter586",
                    "body": "As awful as it is, this shooting (perpetrated by someone claiming himself to be a child of BHIs, radicalized by Nick Fuentes and idolizing Mangione) and the other most recent one (perpetrated by a trans-exclusionary radical feminist, radicalized by an account called Radfem Hitler) go to demonstrate a point that has been discussed somewhat frequently on this sub - that there's no use making a false distinction between \"online\" and \"real life\".",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "cyberwitchtechnobtch",
                    "body": "[https://www.reddit.com/r/communism/comments/1h95w8v/comment/m1fc79a/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/communism/comments/1h95w8v/comment/m1fc79a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nYes. Though the inspiration isn't exactly direct in the recent shooter's \"manifesto\" but again the only immediate group primed to engage in armed, political violence are lone-wolf fascist shooters. This is just initial observation, but there is a notable trend in the labor aristocracy of oppressed nations joining the ranks of fascists as seen with \"Latino\" white supremacists as well as black neo-Nazis like the Nashville one. It's not a new one but I do worry if it will increase this year alongside the legal changes Trump is trying to fire off against migrants, women, queer folk, etc.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "HappyHandel",
                            "body": ">Though the inspiration isn't exactly direct in the recent shooter's \"manifesto\" \n\n\nIs it not? He namedropped Mangione as an inspiration in his racist rambling manifesto.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "cyberwitchtechnobtch",
                                    "body": "I didn't catch it in the news reports I skimmed or the repost of it on twitter must've left some of it out.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vomit_blues",
            "body": "While looking at the sidebar of the subreddit and digging through a website that’s now a dead link, I found an archived page with a ton of selections from the works of Sakai. It’s worth being preserved in some form, even though it’s gone.\n\nhttps://web.archive.org/web/20200701160930/http://www.readmarxeveryday.org/sakai/index.html",
            "score": 10,
            "replies": []
        },
        {
            "author": "CoconutCrab115",
            "body": "Does anyone know any sources on Xinjiang back in the 1930s, led by Sheng Shicai? Has very little discussion or Anti-Revisionist material on it",
            "score": 8,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "Would be interested too. From what little I have seen from some bourgeois sources and from Stalin he seemed like an opportunist who vacillated from leftism to rightism, and obviously he eventually came to anti-communism.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "mitherium293",
            "body": "Are there any resources on Palestinian resistance movements involving Palestinians from the occupied interior (not West Bank/Gaza)? Beyond individual acts of resistance? Any from PFLP or DFLP?\n\nOr have resistance movements deemed them too difficult/too costly to organize at this time?",
            "score": 9,
            "replies": []
        },
        {
            "author": "Sea_Till9977",
            "body": "pinging u/NobodyOwnsLand\n\nI read your latest zine by chance and saw the section on Luigi Mangione. I don't like how his alleged assassination was represented, with the section opening with \"his politics were far from perfect\". At least to me, it sounds like the problem with him exists on a spectrum of 'bad v good' rather than a fundamental issue of social fascist labour aristocrat politics.\n\nOf course, I don't care about the death of a dickhead capitalist CEO pig, but I want to ask you what your organisation's stance on Mangione and the class character of his politics? I'm asking in case I have misunderstood your stance.",
            "score": 16,
            "replies": [
                {
                    "author": "NobodyOwnsLand",
                    "body": "Ultimately Luigi Mangione's alleged actions represent the most \"radical\" possible expression of US labor aristocrat politics. We stated his politics aren't perfect to express in basic (maybe too basic) language that we do not view him as a revolutionary, even if we don't disapprove of the killing of a CEO and believe Mangione deserves to walk free regardless of \"guilt\". He's not some \"Robin Hood\" esque hero, but there is something of an opportunity for genuine revolutionaries in the fact that his (alleged) actions and ensuing manhunt have served to demonstrate to sections of the working class which could serve as the base of a genuine revolutionary movement (the nationally oppressed, diaspora communities, the lumpen, etc.) that revolutionary armed struggle is a possibility. \n\nThe class outlook of Mangione led to him eschewing collective struggle and he avoided carrying out this action with others in a way that could build a larger offensive and strike greater terror in the bourgeois classes (and enable his escape to boot). Instead he (allegedly) worked alone in a lone wolf attack against one CEO who was immediately replaced, with other CEOs quickly pivoting to protect themselves. Letting his words speak for themselves and showcase this outlook should be a first step. Then, struggling with workers who view him positively, explaining the class character of his actions and what a principled proletarian offensive could look like that builds off of what people view as successes and failures in his (alleged) actions, seems to us to be the logical next step with regards to how we relate to this.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "DaalKulak",
                            "body": "\\> have served to demonstrate to sections of the working class which could serve as the base of a genuine revolutionary movement\n\nI'll take this a bit further than u/cyberwitchtechnobtch and u/Sea_Till9977, the reaction to Luigi Mangione's actions are by in large representative of the rising social fascist and fascist trends in imperialist countries. I don't even think the charge of adventurism or terrorism can be applied meaningfully, because Mangione and their sympathizers do not want to expand healthcare to the oppressed of the world but just within the U$.\n\nThere is nothing positive to glean from this action beyond acknowledging some innovative methods used that can be replicated and rising the social fascism and fascism. The shift in focus away from the character of these sympathies toward armed struggle in the abstract tails behind social fascist demands and organization(which opportunist strands of oppressed communities within the U$ support). The Palestinian resistance, rightly, does not praise or rely on \"left\" and right opposition within the Zionist entity to draw lessons for their struggle despite their successful sabotage(which ironically comes from the right far more). In the U$, this should apply even more given how this country is the strongest imperialist power in the world with a vast petty-bourgeois that extends into nationally oppressed communities. Even the 2020 Uprisings, arguably the one of the most radical outbursts in recent times, had severe problems due to the class character of it's resistance and leadership... how can Mangione and their sympathizers be not only not be characterized as social fascist/fascist but discussed more \"extensively\" than the 2020 Uprisings for lessons to glean and to monopolize on some perceived \"radical energies\"?\n\nFrom my view, communists should not be celebrating this or criticizing this as if there was a just problem amongst fellow \"anti-capitalists\", but looking at how to combat the rising social fascist and fascist movements. The healthcare system within the U$, despite it's severe inefficiency, is one of the best and most segregated in the entire world. A revolutionary program would tackle the massive healthcare disparity globally caused by imperialism and of some classes/sections of nationally oppressed communities here. In the short to medium term, this would threaten and reduce the quality of healthcare for the vast majority of the U$. There is no way to reconcile this demand \"universal\" healthcare and the struggle against capitalism-imperialism, any attempt to do so is social-fascist.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Sea_Till9977",
                                    "body": "That is essentially my problem as well, people painting this as only an issue of 'it wasn't collective action but..\". It was not a quantitative issue but the qualitative nature of Mangione's action. Mangione isn't some socialist during pre-socialist Russia doing isolated terror attacks. It's a social fascist who 'respects what the Feds do' and any political faction can attach themselves to him if they want. That's why Amerikans were chatting about 'left right working class unity'",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "DaalKulak",
                                            "body": "Yeah. I am overall confused about u/NobodyOwnsLand's political line because it seems like there are many zines, statements, etc... with the guiding principles, but it seems a bit unclear. The biggest confusion I have is the use of working-class, racialized. and queer as categories without much further analysis/elaboration. How will something like the assassination of the CEO be understood with clarity here?\n\nI hope that there can be some dialogue/clarification around this. Since I have skepticism about tenant organizing without clear political leadership or direction, especially if the \"working-class\" within the U$ isn't clearly understood(as I'd argue the majority are really a section of the petty-bourgeois). The misunderstandings and confusion here can easily lend itself into organizing on a social-fascist basis.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "NobodyOwnsLand",
                                                    "body": ">How will something like the assassination of the CEO be understood with clarity here? [...] The misunderstandings and confusion here can easily lend itself into organizing on a social-fascist basis.\n\nReading the criticisms that have been posted so far, I'll be upfront in saying that this is a very fair question to ask, one which what we've published so far has been insufficient in answering. Issue 3 was published on a much shorter timetable than the previous two regular issues. In hindsight, we should have given it more breathing room and included the planned elaboration and critique of Mangione's manifesto up-front.\n\n>The biggest confusion I have is the use of working-class, racialized. and queer as categories without much further analysis/elaboration.\n\nPart of this is because we simply haven't existed very long. Our understanding of \"working class\" is as a descriptor of people with a particular relation to production, specifically those who subsist by selling their labor to the bourgeois classes (venture capitalists, landlords, petty bourgeoisie, etc.). Though this relationship broadly describes all workers, not all workers equally experience the antagonism with the bourgeoisie inherent to that relationship due to the objective economic realities of imperialism compounded with material advantages and disadvantages produced by racialization and other processes by which economic subjugation and unequal exchange were given the guise of \"natural\" codified hierarchies. In the US this has produced a massive labor aristocracy and petty bourgeoisie fiercely loyal to the settler project.\n\nTo expand on racialization and other similar processes: in the case of race, a fundamentally *economic* relationship (colonization and enslavement) that finances the quality of life which Euro-America enjoys is *naturalized as race* by the bourgeois classes and the labor aristocracy. Likewise in the case of gender, the systematic confiscation of women's property and their enduring political and economic disenfranchisement was naturalized first on religious grounds and then \"scientifically\" as modern \"scientific\" sexism. A key difference between these categories is that class describes an objective condition that deeply affects the subjectivity of each individual, while things like \"identity\" (race, gender, etc.) describe a subjectivity that both affects and is affected by that objective condition. In this way, we have to reject the idea pushed by some \"communists\" that race, gender, even nation are \"distractions\" or simply illusions cast to mask the \"real problem\". Quite the opposite, they are expressions of class and class struggle stamped with the brand of the classes that molded them to suit their needs. The particularities of these must be grasped to have any real understanding of class and class struggle anywhere, let alone in the US, and likewise understanding the class struggle here gives us the means to more deeply understand these particularities. \n\n>I hope that there can be some dialogue/clarification around this. Since I have skepticism about tenant organizing without clear political leadership or direction[...]\n\nWe very much welcome dialogue on this, and hope to see other Maoists engage with this in practice as well. It's our understanding that we aren't the only Maoists involved in tenant organizing, with folks in the Omaha Tenant Union also claiming to be MLM. To be clear: we do not view tenant organizing as some untapped magic bullet which will bring us revolution. The sad reality that we have firsthand experience with is that economism remains rife within the movement, and we will have more to report soon on traitorous union leadership where we're at. However, we maintain that\n\n>the present role of Maoists in the tenant movement [is] learning from the practices shown to be successful by these unions (linking up with the tenant masses in the process), uniting with communist tenant leadership (which exists at every level of TUF) in order to advance the land struggle along revolutionary lines, and struggling against elements which seek to de-politicize the struggle and divert these unions back into advocacy and aid work.\n\nAdvancing the land struggle in this instance doesn't simply mean the formal ownership of housing by all tenants. It means the organization of complexes primarily occupied by the nationally oppressed into a network of semi-independent communal structures which can act as militant base areas for increasingly advanced struggle in the cities. Regardless of formal legal ownership (though we aren't in principle opposed to this *where possible in the short term*) these tenants can *de facto* control and utilize it towards revolutionary ends. This isn't a concept unique to us, the BLA elaborated on this previously to some extent in their Study Guide.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "DaalKulak",
                                                            "body": "Reddit censored my reply, so here's a document:\n\n[https://pastebin.com/ZiBNzuub](https://pastebin.com/ZiBNzuub)\n\nIf you can't access it or prefer another way, i can PM it to you or something similar(even email your organization).",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "NobodyOwnsLand",
                                                                    "body": "I can read your reply and I appreciate it! I don't have time in the moment to do a fully reply but just to quickly clarify something:\n\n>I think there should be far more serious consideration put toward consolidating a revolutionary organization with a clear revolutionary political-ideological line so that tenant organizing, and organizing in general, are following a clear strategic line.\n\nWe agree, and the formation of such an organization is an ongoing effort that we'll have more to say about in the coming months. The advancing struggle to form a revolutionary party is what precipitated the aforementioned actions I alluded to by traitorous union leadership.\n\n>it sounds like the practice so far has been tailist and economist\n\nYes. This is something we're trying to correct and overcome.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DaalKulak",
                                                                            "body": "I'll wait for your reply and practice in the next few months then. \n\n>the formation of such an organization is an ongoing effort that we'll have more to say about in the coming months\n\nThe main thing is that this will have to require fundamentally changing/reevaluated a lot of what is already established already. Since moving from being an organization which is tailist and economist, effectively empowering social fascism, to a revolutionary one requires serious rectification.",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cyberwitchtechnobtch",
                            "body": "I think you're being too mechanical and too generous with your analysis. Sure, the possibility was there for making some more potent point about Mangione and the labor aristocracy to a vague group of workers but the moment has passed and has simply been absorbed into the noise of spectacles. I don't think propagandizing about armed struggle is the right approach. It's not inherently wrong but also there's no clear, concrete path to draw from a lone assassin labor aristocrat to proletarian armed struggle other than two both superficially involve violence - one does not necessitate the other. I think the more pressing phenomenon to observe is how social fascists and fascists were brought together around a populist anti-capitalist antagonism (and one that manifested in armed, non-proletarian violence). That would be a more pressing point to highlight in a conversation as it gives a clearer picture of the broader circumstances in which the assassination occurred. Not to say you can't do what you said above, but it seems you're trying to cobble together proletarian politics out of a current event.\n\nAs for the zine it would have been better to present a critique of the manifesto to follow it so the politics mentioned above can be criticized more clearly and explicitly. Perhaps you may already have plans for this in a coming release.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "vomit_blues",
            "body": "Interesting piece of bourgeois academia on the trial of Smirnov. I haven’t read the larger book it’s part of, but it’s referring to recently declassified Soviet documents to evaluate his trial (and others within the period of the “Purges”) as legitimate.\n\nhttps://www.academia.edu/122880451/Wrestling_with_Aspects_of_Interwar_Stalinism\n\nWould be interested in any further sources evaluating the period in this light, since the best I’ve read tend to be more blatantly anti-communist, like Goldman.",
            "score": 6,
            "replies": [
                {
                    "author": "Apersonwithname",
                    "body": ">“Put bluntly, do we take the word of Sedov and Trotsky, who we know lied about Olberg, or that of Iagoda, Vyshinskii, and Stalin, whose policies destroyed so many lives? It is a most uncomfortable position in which to ﬁnd ourselves.”\n\n> Put bluntly, do we attempt to cope with the blatant lies we have spent our careers inadvertently proving to be lies, or meekly accept communism as true while shackled forever in a mental jail cell?\n\nIt must be excruciating to sustain such intensive ideological contradiction. I certainly do not envy the upside down headspace of the Getty/Chase types.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Otelo_",
            "body": "I'm having a little doubt about something in Capital. On Note 16, Marx says:\n\n>In order to prove that labour alone is that all-sufficient and real measure, by which at all times the value of all commodities can be estimated and compared, Adam Smith says, “Equal quantities of labour must at all times and in all places have the same value for the labourer. In his normal state of health, strength, and activity, and with the average degree of skill that he may possess, he must always give up the same portion of his rest, his freedom, and his happiness.” (“Wealth of Nations,” b. I. ch. V.) On the one hand Adam Smith here (but not everywhere) confuses the determination of value by means of the quantity of labour expended in the production of commodities, with the determination of the values of commodities by means of the value of labour, and seeks in consequence to prove that equal quantities of labour have always the same value. On the other hand he has a presentiment, that labour, so far as it manifests itself in the value of commodities, counts only as expenditure of labour power, but he treats this expenditure as the mere sacrifice of rest, freedom, and happiness, not as at the same time the normal activity of living beings. But then, he has the modern wage-labourer in his eye.\n\nhttps://www.marxists.org/archive/marx/works/1867-c1/ch01.htm#16\n\nWhat does it mean that Adam Smith confuses \"the determination of value by means of the quantity of labour expended in the production of commodities, with the determination of the values of commodities by means of the value of labour\"?\n\nDoes this mean that Adam Smith confuses the value of labour with the value of labour-power? Does this mean that he does not consider the possibility that not all the labour is equally useful? Is it because labour as a measure of value is not something ahistorical, in the sense that this is only true about the production of commodities?\n\nI'm really not understanding the difference between the two things Marx said. I know its supposedly \"just a note,\" but I've seen people warning to the importance of Marx's quotes so I'm trying to pay attention to them.",
            "score": 6,
            "replies": [
                {
                    "author": "IncompetentFoliage",
                    "body": ">Adam Smith constantly confuses the determination of the value of commodities by the labour-time contained in them with the determination of their value by the value of labour; he is often inconsistent in the details of his exposition and he mistakes the objective equalisation of unequal quantities of labour forcibly brought about by the social process for the subjective equality of the labours of individuals.\n\n\nhttps://www.marxists.org/archive/marx/works/1859/critique-pol-economy/ch01a.htm\n\n\n>In the first part of this work [here I believe Marx is referencing the footnote you quoted], when dealing with the analysis of the commodity, I have already pointed out Adam Smith’s inconsistency in his treatment of how exchange-value is determined. In particular, [I have shown] how he sometimes confuses, and at other times substitutes, the determination of the value of *commodities* by the quantity of labour required for their production, with its determination by the quantity of living labour with which commodities can be bought, or, what is the same thing, the quantity of commodities with which a definite quantity of living labour can be bought. Here he makes the *exchange-value* of labour the measure for the value of commodities. In fact, he makes *wages* the measure; for wages are equal to the quantity of commodities bought with a definite quantity of living labour, or to the quantity of labour that can be bought by a definite quantity of commodities. The value of labour, or rather of labour-power, changes, like that of any other commodity, and is in no way specifically different from the value of other commodities. Here value is made the measuring rod and the basis for the explanation of value—so we have a vicious circle.\n\n\n>...\n\n\n>But as Adam Smith quite correctly takes as his starting-point the commodity and the exchange of commodities, and thus the producers initially confront each other only as possessors of commodities, sellers of commodities and buyers of commodities, he therefore discovers (so it seems to him) that in the exchange between capital and wage-labour, ||246| materialised labour and living labour, the general law at once ceases to apply, and commodities (for labour too is a commodity in so far as it is bought and sold) do not exchange in proportion to the quantities of labour which they represent. Hence he concludes that labour-time is no longer the immanent measure which regulates the exchange-value of commodities, from the moment when the conditions of labour confront the wage-labourer in the form of landed property and capital. He should on the contrary, as Ricardo rightly points out, have drawn the opposite conclusion, that the expressions “quantity of labour” and “value of labour” are now no longer identical, and that therefore the relative value of commodities, although determined by the labour-time contained in them, is not determined by the value of labour, since that was only correct so long as the latter expression remained identical with the former. Later on, when we deal with Malthus, we can show how wrong and absurd it would be, even when the labourer appropriated his own product, i.e., the value of his own product, to make this value or the value of labour the measure of value, in the same sense in which labour-time or labour itself is the measure of value and the value-creating element. For even in that case the labour which can be bought with a commodity cannot serve as a measure in the same sense as the labour contained in it. One would be merely an index to the other.\n\n\nhttps://www.marxists.org/archive/marx/works/1863/theories-surplus-value/ch03.htm",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Otelo_",
                            "body": "Thank you very much! So, if I understood correctly, Adam Smith, by \"making wages the measure; for wages are equal to the quantity of commodities bought with a definite quantity of living labour\", [from the first quote you linked], does not take into consideration the part of value which is contained into a commodity but which does not go to the producer (in the form of a wage), that is, the surplus value which goes to the capitalist?\n\nAnother paragraph from your second link [the one before the second paragraph you quoted] makes me think like this:\n\n>But in all modes of production—and particularly in the capitalist mode of production —in which the material conditions of labour belong to one or several classes, while on the other hand nothing but labour-power belongs to another class, the working class, what takes place is the opposite of this.  The product or the value of the product of labour does not belong to the labourer.  A definite quantity of living labour does not command the same quantity of materialised labour, or a definite quantity of labour materialised in a commodity commands a greater quantity of living labour than is contained in the commodity itself.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "IncompetentFoliage",
                                    "body": ">So, if I understood correctly, Adam Smith, by \"making wages the measure; for wages are equal to the quantity of commodities bought with a definite quantity of living labour\", [from the first quote you linked], does not take into consideration the part of value which is contained into a commodity but which does not go to the producer (in the form of a wage), that is, the surplus value which goes to the capitalist?\n\n\nYes, you were on the right track when you asked\n\n\n>Does this mean that Adam Smith confuses the value of labour with the value of labour-power?\n\n\nAs for this\n\n\n>Is it because labour as a measure of value is not something ahistorical, in the sense that this is only true about the production of commodities?\n\n\nSmith *attempts* to make the value commanded by living labour (which he wrongly thinks is the same thing as the quantity of living labour) the transhistorical measure of value but realizes it doesn't work and ends up abandoning his labour theory of value. As Anikin puts it in *A Science in Its Youth* (which is a great introduction to the history of political economy),\n\n\n>As Engels wrote, in Smith we find “not only two but even three, and strictly speaking even four sharply contrary opinions on value, running quite jollily side by side and intermingled”. Evidently the main cause for this is that Smith could not find sufficiently logical links between the labour theory of value as it was developed at that time and recorded by him, and the complex concrete processes of capitalist economy. He therefore began to modify and adapt his initial conception.\n\n\n>Firstly, alongside value, which is determined by the quantity of necessary labour contained in a commodity (first and main view), he introduced a second concept in which value is determined by the quantity of labour which can purchase the given commodity. In a simple commodity economy, where there is no hired labour and commodity producers are working with means of production which belong to them, this is one and the same in terms of magnitude. A weaver, for example, exchanges a piece of cloth for a pair of boots. One might say that the piece of cloth is worth a pair of boots, or that it is worth the labour of the bootmaker for the time it took him to make the boots. But quantitative coincidence is not proof of identity, for the value of a given commodity may be quantitatively determined in one way only — in the known quantity of the other commodity.\n\n\n>Smith completely lost the ground under his feet when he tried to apply this, his second interpretation of value to capitalist production. If a bootmaker works for a capitalist, the value of the boots made by him and the “value of his labour”, that which he receives for his labour, are entirely different things. This means that the employer who buys the worker’s labour (he is in fact buying labour power, the ability to labour, as Marx proved) receives more value than he pays for this labour.\n\n\n>Smith could not explain this phenomenon from the standpoint of the labour theory of value and wrongly concluded that value was determined by labour only in the “rude state of society”, where there were no capitalists or hired workers, i.e., to use Marxist terminology, in a simple commodi ty economy. For the conditions of capitalism Smith constructed a third version of the theory of value: he decided that the value of a commodity was simply composed of costs, including workers’ wages and the capitalist’s profit (land rent as well in certain branches). He was also reassured by the fact that this theory of value seemed to explain the phenomenon of average profit on capital, “natural rates of... profit”, as he put it. Smith simply equated value with the price of production, not seeing the complicated intermediate links between them.\n\n\n>This was “theory of prices set by production costs” which was to play an important role in the following century. Here Smith adopted the practical standpoint of the capitalist who thinks that the price of his commodity is determined mainly by costs and average profit, and also by supply and demand at any given moment. This concept of value offered great scope for depicting labour, capital and landed property as equivalent creators of value. Say and other economists who sought to use political economy to defend the interests of capitalists and landowners, soon deduced this from Smith.\n\n\nhttps://archive.org/details/ascienceinitsyouth/page/207/mode/1up\n\n\nIn *A Contribution to the Critique of Political Economy*, Marx says\n\n\n>Although Adam Smith determines the value of commodities by the labour-time contained in them, he then nevertheless transfers this determination of value in actual fact to pre-Smithian times. In other words, what he regards as true when considering simple commodities becomes confused as soon as he examines the higher and more complex forms of capital, wage-labour, rent, etc. He expresses this in the following way: the value of commodities was measured by labour-time in the paradise lost of the bourgeoisie, where people did not confront one another as capitalists, wage-labourers, landowners, tenant farmers, usurers, and so on, but simply as persons who produced commodities and exchanged them.\n\n\n[I think my comment is too long to post, so I'm going to make the rest a second comment.]",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "IncompetentFoliage",
                                            "body": "And he expands on this point in *Theories of Surplus Value*:\n\n\n>It is Adam Smith’s great merit that it is just in the chapters of Book I (chapters VI, VII, VIII) where he passes from simple commodity exchange and its law of value to exchange between materialised and living labour, to exchange between capital and wage-labour, to the consideration of profit and rent in general—in short, to the origin of surplus-value—that he feels some flaw has emerged. He senses that somehow—whatever the cause may be, and he does not grasp what it is—in the actual result the law is suspended: more labour is exchanged for less labour (from the labourer’s standpoint), less labour is exchanged for more labour (from the capitalist’s standpoint). His merit is that he emphasises—and it obviously perplexes him—that with the accumulation of capital and the appearance of property in land—that is, when the conditions of labour assume an independent existence over against labour itself—something new occurs, apparently (and actually, in the result) the law of value changes into its opposite. It is his theoretical strength that he feels and stresses this contradiction, just as it is his theoretical weakness that the contradiction shakes his confidence in the general law, even for simple commodity exchange; that he does not perceive how this contradiction arises, through labour-power itself becoming a commodity, and that in the case of this specific commodity its use-value—which therefore has nothing to do with its exchange-value—is precisely the energy which creates exchange-value. Ricardo is ahead of Adam Smith in that these apparent contradictions—in their result real contradictions—do not confuse him. But he is behind Adam Smith in that he does not even suspect that this presents a problem, and therefore the specific development which the law of value undergoes with the formation of capital does not for a moment puzzle him or even attract his attention. We shall see later how what was a stroke of genius with Adam Smith becomes reactionary with Malthus as against Ricardo’s standpoint.\n\n\nOn the other hand, this\n\n\n>Does this mean that he does not consider the possibility that not all the labour is equally useful?\n\n\nconfuses concrete and abstract labour and leads towards the subjective theory of value. What does “equally useful” mean? How is this determined? Of course, there is no objective answer, which means we wind up at idealism (Lenin occasionally referred to idealism as “subjectivism”).",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Otelo_",
                                                    "body": "Thank you very much again. The point about Smith having several definitions for value reminded me of something Engels said in Anti-Duhring*:\n\n>In Adam Smith, however, we can find not only “traces” of “contrary views” on the concept of value, not only two but even three, and strictly speaking even four sharply contrary opinions on value, running quite comfortably side by side and intermingled. But what is quite natural in a writer who is laying the foundations of political economy and is necessarily feeling his way, experimenting and struggling with a chaos of ideas which are only just taking shape, may seem strange in a writer [Duhring] who is surveying and summarising more than a hundred and fifty years of investigation whose results have already passed in part from books into the consciousness of the generality.\n\nhttps://www.marxists.org/archive/marx/works/1877/anti-duhring/ch22.htm\n\nEngels actually praised Smith, because he was a precursor, and criticized Duhring, for making the same mistakes as Smith 150 years later.\n\nI think I understand now. About this last part:\n\n>confuses concrete and abstract labour and leads towards the subjective theory of value. What does “equally useful” mean? How is this determined? Of course, there is no objective answer, which means we wind up at idealism (Lenin occasionally referred to idealism as “subjectivism”).\n\nYes, I'll admit I probably used an expression in the wrong way. What I meant, when speaking about not all labour being equally useful, was that there is only value in labour that produces a use value. So labour that does not  produce a use value is \"useless\" (these are probably not the correct terms to say this).Marx had already touched this subject, but I said that having in mind precisely something from Anti-Duhring too:\n\n>It is simply wrong to say that the dimensions in which anyone invests his energies in anything (to keep to the bombastic style) is the immediate determining cause of value and of the magnitude of value. In the first place, it depends on what thing the energy is put into, and secondly, how the energy is put into it. If someone makes a thing which has no use-value for other people, his whole energy does not produce an atom of value; and if he is stiff-necked enough to produce by hand an object which a machine produces twenty times cheaper, nineteen-twentieths of the energy he put into it produces neither value in general nor any particular magnitude of value.\n\nhttps://www.marxists.org/archive/marx/works/1877/anti-duhring/ch17.htm\n\nE: * lol, I noticed now that this was precisely the Engels expression that Anikin was referring to in the quote you used.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "IncompetentFoliage",
                                                            "body": "Yeah, that first quote is what Anikin was quoting, the translation is just a bit different.\n\n\n>Engels actually praised Smith, because he was a precursor, and criticized Duhring, for making the same mistakes as Smith 150 years later.\n\n\nExactly, Smith's confusion and self-contradiction was a sign of his brilliance. They were productive contradictions because Smith was at the cutting edge of science.\n\n\n>So labour that does not produce a use value is \"useless\" (these are probably not the correct terms to say this).\n\n\nThe terms are correct. This is just what Marx says:\n\n\n>If the thing is useless, so is the labour contained in it; the labour does not count as labour, and therefore creates no value.\n\n\nhttps://www.marxists.org/archive/marx/works/1867-c1/ch01.htm\n\n\nI understand what you meant now though. The aspect of social necessity is not really relevant to the point Marx was making.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Otelo_",
                                                                    "body": "Thank you. You have been a great help.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MLMinpractice1917",
            "body": "is anyone having a problem where they are getting replies to posts/comments and being unable to see them? I have made some comments here recently and sometimes I'll see a notification symbol from reddit, and I'll check. and there will be more total comments on the post I commented on, but I dont see anything new usually. I was wondering if anyone has an experience with something similar? I just feel like Im getting replies and am for some reason unable to see them. and its not all the time, I do get responses that I see and reply to. But it just seems like there are others that are just invisible to me. but maybe Im wrong.",
            "score": 4,
            "replies": [
                {
                    "author": "Autrevml1936",
                    "body": "Yes I see it as well, I believe they're from comments unapproved by the mods so they're invisible to regular Users. Also sometimes a user Replies to a comment and the mods delete it before one can reply, though I believe deleted comments no longer count towards the total comment count.",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}