{
    "title": "Rant on \"History is decided by the Victors\"",
    "author": "poppyblose",
    "subreddit": "communism",
    "rank": 480,
    "score": 27,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/communism/comments/1dns4lw/rant_on_history_is_decided_by_the_victors/",
    "id": "1dns4lw",
    "selftext": "It makes no sense to me how so many liberals that bash Stalin and Mao constantly praise this dictum written by Robespierre of all people. Strangely, it is hegemonic knowledge, yet at the same time, *the same people* constantly side with the capitalist victors. There is such a bizarre belief in bourgeois revisionist historians prominent in American academia because of their bourgeois revisionism. Like while there are some radical brilliant theorists in academia, if you look at any poli sci department you will see constant reformist liberals that justify the system, if not your outright neo conservative Straussians. Even for the radical theorists, most fall into Cold War representations of Stalin, Mao, and other communists that lacks a really transformative material project along with the necessary social(or cultural!) revolutions. Like with everyone who criticizes Stalin and Mao, where are you getting your information? From the victor? It just makes no sense to me how there is so little historiographical awareness from people on how they receive educaiton, as if the more degrees and not the onto-epistmeological narratives/background one is in is not 100x more important. Classism also plays a heavy role in this, as well as the concentration of knowledge production in academia. I am not saying you can't critique Stalin or Mao. I am just saying be honest with yourselves when you read your wikipedia articles my god. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}