{
    "title": "Bi-Weekly Discussion Thread - (July 21)",
    "author": "AutoModerator",
    "subreddit": "communism",
    "rank": 429,
    "score": 10,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/communism/comments/1e89auv/biweekly_discussion_thread_july_21/",
    "id": "1e89auv",
    "selftext": "We made this because Reddit's algorithm prioritises headlines and current events and doesn't allow for deeper, extended discussion - depending on how it goes for the first four or five times it'll be dropped or continued.\n\nSuggestions for things you might want to comment here (this is a work in progress and we'll change this over time):\n\n* Articles and quotes you want to see discussed\n* 'Slow' events - long-term trends, org updates, things that didn't happen recently\n* 'Fluff' posts that we usually discourage elsewhere - e.g \"How are you feeling today?\"\n* Discussions continued from other posts once the original post gets buried\n* Questions that are too advanced, complicated or obscure for r/communism101\n\nMods will sometimes sticky things they think are particularly important.\n\nNormal subreddit rules apply!\n\n[ Previous Bi-Weekly Discussion Threads may be found here https://old.reddit.com/r/communism/search?sort=new&restrict_sr=on&q=flair%3AWDT ]",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[https://www.redspark.nu/en/peoples-war/cpi-maoist-to-observe-martyrs-week-from-july-28-to-august-3-of-2024/](https://www.redspark.nu/en/peoples-war/cpi-maoist-to-observe-martyrs-week-from-july-28-to-august-3-of-2024/)\n\n> In a solemn tribute to the unwavering dedication and sacrifice of it’s brave comrades, the Communist Party of India (Maoist) has declared to observe Martyrs’ Week from July 28 to August 3 of this year.\n\n>The CPI (Maoist) observes Martyrs’ Week every year in memory of those who have laid down their lives in the pursuit of the cause of revolution in India.\n\n>In a press release, the party’s Andhra-Odisha Border Special Zonal Committee (AOBSZC) secretary, Comrade Ganesh, said that the Maoist party’s Martyrs’ Week would be observed to honor the sacrifices of the comrades who have laid down their lives for the revolution. Comrade Ganesh said that the party would organize various programmes and events during the week to pay tribute to the party’s martyrs.\n\n>“In the last 6 months, 140 comrades have been martyred in Chhattisgarh alone. The Chhattisgarh government has launched a massive operation called Operation Kagar to suppress the Maoists, which the party has termed as a conspiracy to loot the wealth and resources of the dalits and tribals. The central and state governments are trying to eliminate our party, but it’s impossible. The central government has announced Operation Kagar to eradicate Maoism from the country within the next 3 years. In this war of destruction, the police are the main enemy, who are torturing people, molesting them, and killing them without any reason,” maintained Comrade Ganesh.\n\n>Comrade Ganesh condemned the government’s Operation Kagar, which he said was aimed at eliminating the Maoists. He alleged that the government was trying to crush the movement by killing innocent people and branding them as Maoists.\n\n>Comrade Ganesh also accused the government of trying to loot the resources of the tribals and poor people. He said that the Maoists would continue to fight against the government’s policies and protect the interests of the people.\n\n>Comrade Ganesh appealed to the people to participate in the Martyrs’ Week observance and make it a success. He said that the Maoist party would not be intimidated by the government’s repressive measures and would continue to fight for the rights of the people.\n\n>The CPI (Maoist)’s Martyrs’ Week observance is being held to commemorate the death anniversary of Comrade Charu Mazumdar, general secretary of the erstwhile CPI (ML), who was killed in police custody in 1972.\n\nUnrelated:\n\n[https://www.newindianexpress.com/states/kerala/2024/Jul/21/maoist-manoj-trained-in-handling-automatic-weapons-finds-ats](https://www.newindianexpress.com/states/kerala/2024/Jul/21/maoist-manoj-trained-in-handling-automatic-weapons-finds-ats)\n\n[https://redherald.org/2024/07/23/comrade-manoj-holding-high-the-morale/](https://redherald.org/2024/07/23/comrade-manoj-holding-high-the-morale/)\n\n>In India, the Maoist Manoj, who was detained in Kerala on Thursday, July 18, was [reportedly](https://www.yenidemokrasi34.net/gozaltindaki-maoist-manoj-saldirilara-sloganlarla-yanit-verdi.html) brought to court on July 21. During his 4-day detention period, Manoj was subjected to police torture. During the detention period, Manoj was prevented from sleeping. With the imposition of collaborationism, the police tried to collect information about the Maoists in Wayanad Forests.\n\n>Manoj was brought to a court on July 21. Manoj’s lawyers told the court that Manoj was tortured in custody of the Kerala police. Thereupon, the court decided to bring Manoj back on July 26 with his medical report. The investigation office requested that Manoj be kept in custody for 12 days.\n\n>Manoj came out of the court chanting slogans. He saluted the Indian revolution and the People’s War with the slogans “Long live Naxalbari”, ” Long live the Communist Party of India (Maoist)”, “Long live Maoism”, “Long live Marxism-Leninism-Maoism”, “Long live the Revolution”.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Drevil335",
            "body": "Given the ongoing Olympics, I feel like an analysis of the superstructual role of sports in modern capitalist society would be fitting and useful. I have some thoughts on the matter, but they aren't too well developed. This is a topic, I feel, that has been subject to some obfuscation by social fascists, whose analysis of sporting events generally doesn't go beyond *panem et circenses*, in line with their general view that the Imperial labor-aristocracy is only being blocked from their revolutionary impulses by brainwashing.\n\nTo the contrary, it seems clear that (and I apologize if this seems banal) professional sports are a major site of the reproduction of petty-bourgeois/settler ideology in the modern imperial core. Existing as it does in the context I'm most familiar with, Amerikan football seems like a pretty clear example of this. The form of the game does reflect the ideology of settlerism itself in many ways; it's immensely violent, for one, and as such valorizes a kind of rugged physicality and strength, not dissimilar from the settler mythos of \"the pioneer\". Moreover, the dynamic of the game (one side trying to get the ball to the other side of the field, the other putting up heavy resistance every yard of the way), does heavily parallel the process of Amerikan settler-colonialism; that may not be incidental, as while nearly all modern field (or court, or rink) sports take that general form, in Amerikan football it is the very essence of the game: in it, advance down the field is not merely a way to establish the conditions in which points can be scored (as in Football or Basketball, for instance), but the very means by which scoring is achieved. In terms of the sometimes-lauded strategic aspect of the sport, emphasis is usually placed on the \"genius\" quarterback and/or head coach, who comes to take a role quite similar to that of the petty- or big-bourgeois business \"guru\" of petty-bourgeois/settler ideology. Moreover, the character of such strategies is often compared to that of military planning; thus, in a substantial way, Amerikan football serves as a proxy, for its predominantly settler viewership, for imperialist war.\n\nThe associations between Amerikan football and Amerikan fascist chauvinism only become explicit after this: the Amerikan national anthem being sung before each and every NFL game, Amerikan flags being draped on fields, military jets crossing the skies before games, publicized meetings with the president for Super Bowl winning teams, etc. Given this, it's quite interesting that the vast majority of professional and college Amerikan football players are New Afrikan; these players, however, are primarily rated for their strength and athleticism (in clear parallel to the expectations of slave-masters), and are predominantly placed in positions that involve a lot of physical contact and risk of injury; positions that are less intensive, and also ones that serve as a figurehead for the team as a whole (quarterback) are predominantly filled with settlers. Thus, the national composition of Amerikan football teams superstructurally reinforces the national oppression of New Afrikans in settler society. Given this, the violent response of settlers to even Colin Kaepernick's admittedly tepid critique of state violence against New Afrikans, expressed in the particularly sensitive environment of *their* sport, is quite explicable.\n\nI sense, though, (excuse the pun) that I might have thrown myself a softball; I feel like an analysis of basketball, which has a predominantly New Afrikan viewership as well as player base and actual popularity beyond the United States, would be more interesting, as would (non-Amerikan) football. I'd be particularly interested in analyses of the superstructural role of sports in imperialized countries (I read that football was introduced in the Congo by Belgian priests aiming to integrate African youth into colonial rule), and of course of the Olympics in general.",
            "score": 12,
            "replies": [
                {
                    "author": "cyberwitchtechnobtch",
                    "body": "I don't have much to add besides noting the lack of adoption of Amerikan football (Gridiron) outside of Amerika. The game is prohibitively complicated (and expensive) in its fully realized form to have any mass adoption, and despite this it is the most played sport in the u.$. Even small towns in the midwest have a high school with enough resources to maintain a field, bleachers, helmets and padding, and training equipment. Rugby suffers from a similar complicated form. Compare that to a basketball court or a football (soccer) field where these are a given, all that's really needed to play the full game is the ball and knowledge of relatively straightforward rules. It's also interesting to note how the more intense, high-contact, team sports have a broad, popular appeal in settler-colonial nations, reflecting the underlying violent (and particular form of) militarism of their societies and their eventual integration of their oppressed nations into the sport, with them taking the role of bodies to throw at the other side while the role of quarterback or scrumhalf goes to the oppressor nation.\n\nThe question of sports in a given mode of production is also something that would be interesting to explore. I haven't researched the role sports took on in the USSR or the experiments with them during the GPCR; if anyone has suggestions on where to start, I'd appreciate it.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "turbovacuumcleaner",
                    "body": "> I'd be particularly interested in analyses of the superstructural role of sports in imperialized countries\n\nI'm not the best person to add much to this, I'm by no means a soccer fan, far from it, but the same logic of American football can be applied here, with a few minor tweaks: there are no Embraer military jets flying before games, but soccer exposes all contradictions of settler societies nonetheless: players are predominantly black, while clubs are owned and managed by the settler petty bourgeoisie. The parasitism of this class is clearly showed in the rampant racist outrages when players fail to win a match, score a goal or anything like that, and cases of racist discrimination against Brazilian players reach worldwide proportions. There are barely, if any international noteworthy settler players, despite half the country being white of German and Italian descent. Playing soccer is a predominantly proletarian sport that is exploited by the petty bourgeoisie, both as extracting surplus-value, as well as entertainment built upon national oppression.\n\nWhich then goes to my next point: clashes between clubs' administration and their crowds are constant, as well as within the crowds themselves, since they contain both classes. During the Bolsonaro administration, crowds were in constant conflict due to some players' open support of fascism. Originally, the first clubs in the 1890s were exclusive to only the richest settlers that had lived in England for some time and brought the sport back, but with industrialization between then and the 1910s, when black and white workers got off factories and gathered around in their free time, it started to acquire the \"democratic\" and \"popular\" meaning it has today, with this being explicitly promoted during the national capitalism of the Vargas era. This also meant the development of soccer was inextricably tied to the origin of unions and Communist agitation, and despite deindustrialization, these crowds remain as a site of fierce class struggle, with anti-fascist organizations spontaneously popping up and disappearing. However, this also creates some problems: Communism's presence in soccer is extremely mystified through its \"democratic\" character, so everyone from liberals to Communists can't help but long for the past, but never actually engage with it in a serious level. [This](https://averdade.org.br/2021/02/67-anos-do-dr-socrates-sou-socialista-no-sentido-pleno-da-palavra-comunista/) is one of such examples: Sócrates' sympathy for Soviet revisionism through Cuba is never adressed, Democracia Corintiana is elevated to a pedestal despite being reformism, and no questions are made as to what allowed for this movement to sprung up and die off. Sócrates is only useful so as to point to a bridge between the national identity of soccer and anti-imperialism, but failing in the process.\n\nAs a side note, I disagree with looking at the violence of Amerikan football and soccer exclusively as by-products of settler colonialism, in the sense it only exists in these societies. European soccer crowds are infamously violent as well, and this violence also takes the shape of white chauvinism against immigrants and players, and chauvinism amongst European nations as well. This could clearly be seen during the Eurocup. Settler colonialism may be the specific content for the Americas, but its more abstract form is national oppression.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "secret_boyz",
                            "body": "I agree with your comment at the end about seeing violence exclusively through settler-colonialism, although I still think its interesting since violence is inherent in the sport of rugby/American football while European soccer violence comes from the crowds.\n\n  \nIve also found it interesting to look at this thread through an old thread from smokeuptheweed9 where he talks about Freud and the narcissism of small differences.\n\n[https://www.reddit.com/r/communism101/comments/153uevq/comment/jt7cqy3/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/communism101/comments/153uevq/comment/jt7cqy3/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nI wont pretend to have a deep grasp on Freud but I think it could apply to sports and its relation to fascism. Allegiance to a team is based on petty differences in one's regional locations, player, playstyle, or team color preferences, etc. But fascists will go to the pub on the weekends, drink beer, and engage in aggression towards the fans of the opposing teams even though they made their decision on which team to support in the same way, and like you said, when they're watching national teams play instead of clubs, they will show aggression and blame losses on the immigrant/black players. For example, English fans blaming their poor performance on Bukayou Saka.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Drevil335",
                                    "body": "I definitely agree. I've thought before about the parallels between soccer hooliganism and reactionary nationalism, but on closer inspection they appear to be basically the same thing.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Are you American? I only ask because the Netflix produced *Last Chance U* was extremely popular in America when it was first released and is a raw reflection of everything you’ve written here. There’s a real clear conflict between the obese, gruff, obviously vehemently racist head coach who will win at any cost and the players who end up at this Mississippi community college. They are portrayed as on their “last chance” since the only pathway forward that an audience can conceive of for the most often poor, black athletes other than abject poverty and crime is a scholarship to a four year institution playing football. The way that these athletes talk about the sport and the way the coaches talk about the sport is so starkly different.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Turtle_Green",
            "body": "/u/urbaseddad /u/daalkulak \n\ntagging as a rejoinder to this [earlier discussion](https://www.reddit.com/r/communism/comments/190e79w/biweekly_discussion_thread_january_07/kgthqce/) about where to find PFLP docs. Not sure if reddit has banned the domain so will write it like so for now.\n\nhttps://pflp[hyphen]documents[dot]org/",
            "score": 4,
            "replies": [
                {
                    "author": "DaalKulak",
                    "body": "[https://foreignlanguages.press/wp-content/uploads/2020/08/S08-PFLP-Strategy-Lib-Palestine-7th-Printing.pdf](https://foreignlanguages.press/wp-content/uploads/2020/08/S08-PFLP-Strategy-Lib-Palestine-7th-Printing.pdf)",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}