{
    "title": "Are there any good documentaries or biopics about communism and/or Marx/Lenin/other important figures/events etc?",
    "author": "Shintoho",
    "subreddit": "communism",
    "rank": 408,
    "score": 72,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.reddit.com/r/communism/comments/1ehr4wa/are_there_any_good_documentaries_or_biopics_about/",
    "id": "1ehr4wa",
    "selftext": "Films or TV series are both good",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Johnnywaka",
            "body": "The revolution will not be televised. Documentary that was filmed during a coup attempt in 2004 in Venezuela",
            "score": 36,
            "replies": [
                {
                    "author": "justyoureverydayJoe",
                    "body": "Great rec, one of the more thrilling docs ive seen",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Timthefilmguy",
            "body": "The Young Marx is a lot of fun. There was also a show about the Russian Revolution with Patrick Stewart as Lenin, though I’ve only seen clips. Che part 1 and 2 are both awesome too.\n\nMaybe not as globally important but there’s a Neruda biopic by Pablo Larrain that I also very much enjoyed that centers on Chillean politics at the time too.",
            "score": 18,
            "replies": [
                {
                    "author": "infinite-conspiracy",
                    "body": "I think the show was called Fall of the Eagles. Its so great and actually covers a lot of concurrent history or the revolution. I'm not a buff on the actual history of the era though, so I can't attest to its accuracy, but it had the vibes of being historically accurate lol.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Timthefilmguy",
                            "body": "Yes! Fall of the Eagles. Thank you!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MethuselahsCoffee",
                    "body": "Cuba Libre on Netflix is good with the broad strokes. Whether one wants to support Netflix or not…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "c0rap3",
            "body": "\"Lenin: The Train\" Ben Kingsley is Lenin \n\nPart 1: [https://www.youtube.com/watch?v=0R1zfT4G8lQ](https://www.youtube.com/watch?v=0R1zfT4G8lQ)\n\nPart 2: [https://www.youtube.com/watch?v=\\_aaKIZ6ZYfY](https://www.youtube.com/watch?v=_aaKIZ6ZYfY)",
            "score": 11,
            "replies": []
        },
        {
            "author": "AwesomeOrca",
            "body": "Judas and the Black Messiah is about Fred Hampton and the biopic about a leftist I've seen in the last couple of years.",
            "score": 19,
            "replies": []
        },
        {
            "author": "JohnWilsonWSWS",
            "body": "BBC TV series “Fall of Eagles”. It has political weaknesses but worth watching. \n\nEpisode 6: Absolute Beginners\nhttps://youtu.be/_Kks1va6eq0?si=T3r3TN751XobzNGi\n- deals with the 1903 Second Congress of the Russian Social Democratic Labour Party at which the split between the  Bolsheviks and Mensheviks occurred. \n\nEpisode 12: The Secret War\nhttps://youtu.be/PGmGpGmXlLU?si=07fC86L_3J45fZur\n- 1917, the February Revolution and the secret train taking Lenin and other back to Petrograd \n\nEpisode 13: End Game\nhttps://youtu.be/jaT8OVLEEkA?si=9W2R8DZ7Hnp7BWjd\n- brief mention of the October Revolution in the opening. About the German surrender.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Zealousideal_Low_858",
            "body": "I highly recommend I Am Cuba, Matewan, and Emitaï, which in different ways each critique labor exploitation and colonialism. I've also been recommended a movie called Reds, although I haven't seen it yet. And the Boots Riley film Sorry to Bother You is quite good.",
            "score": 7,
            "replies": []
        },
        {
            "author": "thesonglessbird",
            "body": "State Funeral is an interesting documentary about Stalin’s funeral. It ends with the usual “Stalin was terrible and killed 1000000 billion people” but the rest is just pure footage with no commentary.",
            "score": 3,
            "replies": [
                {
                    "author": "International-Tree19",
                    "body": "It gets really boring after 10 minutes, there's nothing really going on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "urbaseddad",
            "body": "What for?",
            "score": 3,
            "replies": [
                {
                    "author": "Shintoho",
                    "body": "to watch, what do you think",
                    "score": 1,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "Yeah no fucking shit, I'm aware documentaries are consumed by watching. You didn't answer my question though; watching is not an end in and of itself.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "throwaw_ayyyyyy_69",
                                    "body": "To learn? Why the hostility?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "urbaseddad",
                                            "body": "Learn what, and what for? Learning is also not an end in itself. The hostility is because OP (and you) don't try to actually critically engage with my question, instead just giving obfuscated \"common sense\" responses, snark and tone policing included, as if watching or learning are ever ends in themselves.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "urbaseddad",
                                            "body": "Who are you? You've never posted in this sub or spoken to me before and you're calling me your comrade. Go away ",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "International-Tree19",
            "body": "Is there any good docus about Stalin on youtube? I can't find any that says at least one good thing about him, I've seen Hitler documentaries that are kinder to him than to Stalin, crazy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "reeeetc",
            "body": "Joshua Oppenheimer's *The Act of Killing* is a must-see. Deals with the US-backed anti-leftist murder program in Indonesia. Raw, confrontational interviews with anticommunist mass-murderers. Realer than direct footage of violence.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Constant_Sky_442",
            "body": "On YouTube you can find a series of TV shows about Lenin's life, but there are no episodes there. All the episodes that showed the most striking revolutionary actions and calls to fight the capitalists were not released. They are still somewhere in the archive of the studio that stole the people's property. The series is called: В.И. Ленин. Страницы жизни (ТО Экран, 1985) I hope there are subtitles and you can watch it.  \nI also want to recommend my personal favorite films about great revolutionaries and their lives, including Lenin: Ленин в Октябре (1937 полн. вер.),  Ленин в Париже 1981, Штрихи к портрету Ленина, В начале века 1961, Валерий Чкалов (1941), Великое зарево\\[1938\\], Вихри.враждебные 1953, Депутат Балтики 1936, Ленин в 1918 году, Незабываемый 1919 год (1951), Свет над Россией (1947) (its very good movie), Человек с ружьём (1938 original version), Шестое июля (1968), Яков Свердлов (1940).  \nUsing any title on YouTube, I think you will easily find any film. Some, such as Light over Russia or Lenin in October, Lenin in 1919 - are very strong films. Yes, they are fictional, this is not a documentary chronicle, but they are recreated in those years when people were guided by a scientific approach and tried to do everything conscientiously. In the film about Chkalov, of course, there are excesses, for example, Stalin speaks too pompously in places. Being a modest person, he would hardly have said some things and would hardly have approved of such a sycophantic approach to his person. But there are not many such moments and for the most part everything looks good.  \nI would also like to highly recommend you watch the trilogy about the great writer Maxim Gorky. It's called \"Детство\", \"В людях\", \"Мои университеты\". The first part is easier to find by writing it like this: Детство Горького (1938) Полная версия, The second part: В людях (1938) Полная версия. Thirt: Мои университеты (1939) Полная версия.  \nThis trilogy is an autobiography, telling about his childhood, youth and school years. This film, like no other, very clearly reflects how ordinary people lived in those years and how terrible it all looked, what they had to go through. Of course, the film does not show all the horrors and to understand more fully you need to read \"Notes from the Village\" or \"The Life of Ivan\". But much will become clear about the situation of the peasants, people who did not belong to the rich owners and why the people rebelled and made a revolution and half the globe became \"red\", and the capitalists organized a mass extermination of communists.\n\nI hope you like some of this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JohnWilsonWSWS",
            "body": "“The Young Karl Marx” by Raoul Peck is excellent\n\nReview\nhttps://www.wsws.org/en/articles/2017/03/15/marx-m15.html\n\nConversation with director Raoul Peck\nhttps://www.wsws.org/en/articles/2018/03/01/peck-m01.html",
            "score": 1,
            "replies": []
        },
        {
            "author": "Galrexx",
            "body": "Less about actual theory but i really enjoyed Trumbo, it's about communist writers in Hollywood during the cold war, or at least I think it was then, very fun movie",
            "score": 1,
            "replies": []
        },
        {
            "author": "Llaethenor",
            "body": "The film *Reds* is the first that comes to mind, it's a film based on *Ten Days That Shook the World* by John Reed.   \n\nA good documentary I recently watched is [Seeing Red: Stories of American Communists](https://youtu.be/ltCKYrSa_uY?si=Z4IdNLq99e8apBBx) which is pretty much what it says in the tin!",
            "score": 1,
            "replies": [
                {
                    "author": "Shintoho",
                    "body": "is Eisenstein's *October* any good?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Llaethenor",
                            "body": "I watched it during my history A Level so I may be biased, but I think it's pretry good. Eisenstein is a great director, and it's interesting seeing how the October Revolution was presented in the early days of the USSR, but I would say if you want more pleasant viewing it would be best to go for something more modern - though you will learn a lot from Eiseinstein's work.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Shintoho",
                                    "body": "I've seen *Battleship Potemkin* and enjoyed that one but I'm told that *October* is a little bit more academic and hard to follow with its montage imagery",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -1,
            "replies": [
                {
                    "author": "daughtersofchaos",
                    "body": "dude you watch anime and play video games and you wanna dog on someone for asking about documentaries? maybe they are reading marx and want to watch something less demanding on the side.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "> Or they’ve already read Marx and Lenin\n\n\nI highly doubt that",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}