{
    "title": "Vijay Prashad and Ammar Ali Jan on the necessity of armed resistance ",
    "author": "Environmental-Cry468",
    "subreddit": "communism",
    "rank": 371,
    "score": 10,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/communism/comments/1ewgbqo/vijay_prashad_and_ammar_ali_jan_on_the_necessity/",
    "id": "1ewgbqo",
    "selftext": "I really think both of them articulated the need for armed struggle/resistance perfectly. This portion is at 54:26 to about 1:10. It kinda changed mind on the Maduro government, where previously I had been critical of his repression of protestors but now I see the argument. Eager to hear others' thoughts on their politics and their argument: [https://www.youtube.com/watch?v=L5FCWM7Hlhc](https://www.youtube.com/watch?v=L5FCWM7Hlhc)",
    "comments": [
        {
            "author": "smokeuptheweed9",
            "body": "Sorry OP but you got scammed. Where it really counts in India, Vijay Prashad is opposed to armed resistance and supports the repression of peasants and workers because it threatens the legal gains of the party that directly benefits Prashad (and published most of his work).\n\nAs for the arguments, the first one is banal and a regression from bourgeois philosophy. The French revolution already established that war is the continuation of politics and that terror is itself necessary for justice. This person vacillates between this position and a weaker position that terror is justified in response to reactionary violence, as if the PKI could only respond to persecution rather than preempt it. Prashad's point is bizarre and only makes sense from the perspective of Indian political culture which is still heavily influenced by Soviet revisionism, possibly the last place on Earth that is the case. His argument that Stalin violated the norms of the constitution is from another era, when revisionist law for the \"state of the whole people\" was tied to an actual state. Now it's just bizarre. How many people actually care about the 1936 Soviet constitution outside the arcane party structures of the CPIM? It's such a tangent I assume you simply tuned it out. TBH I assume you tuned most of this out since it isn't really about Venezuela at all and there is no \"repression\" there comparable to either Indonesia or Cuba. Which is fine, the point is a basic one and I don't expect you to pay attention to a 90 minute video of people chatting on zoom. But why the affection for these petty grifters? Why do you need their opinion? That's a long time to half pay attention when you could have read Benjamin's vastly superior *Critique of Violence* in the same time using all of your attention.",
            "score": 22,
            "replies": [
                {
                    "author": "NobodyOwnsLand",
                    "body": ">Where it really counts in India, Vijay Prashad is opposed to armed resistance and supports the repression of peasants and workers because it threatens the legal gains of the party that directly benefits Prashad (and published most of his work).\n\nNot only this, Prashad has long [openly derided](https://i.imgur.com/I2Lso1b.png) armed struggle. Beyond just being against it where it really counts, he's barely tolerant of the concept in the abstract. Prashad is the exact kind of career \"communist\" the movement most needs to rid itself of, only interested in tepidly speaking on revolution in the historical sense and vehemently opposed to it in the present. Like labor aristocrat union heads and the nonprofit industrial complex CEOs, he happily makes a living off of worker struggles, but genuine revolution means he's out of a job.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Emergency_Tea_580",
                    "body": "Hey man I always see your comments on here and find them really insightful, do you have any other book/written work recommendations on political violence/ armed resistance? The Benjamin one sounds great but I’d love to add some other stuff to accompany it. \n\nBtw if you ever feel like it you should post a reading list of books you hold in high regard in general because your posts are always great and leave me and probably others looking for more. Thanks",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": ">I really think both of them articulated the need for armed struggle/resistance perfectly.\n\nLmfao.\n\nI admit that I could not stand listening to Prashad for more than 4 minutes but what he said was so hypocritical that it was legitimately funny - especially the part on defending \"ourselves\" against the \"thugs\" of the bourgeois state. \n\nSmokeuptheweed9 has already pointed this out to you:\n\n>Where it really counts in India, Vijay Prashad is opposed to armed resistance and supports the repression of peasants and workers because it threatens the legal gains of the party that directly benefits Prashad (and published most of his work).\n\nbut I feel we need to consolidate it with a concrete example of Prashad's hypocrisy and liberalism. Let us see what he had to say on the Lalgarh struggle:\n\n[https://southasiarev.wordpress.com/2010/01/23/vijay-prashad-attacks-the-peoples-struggle-in-lalgarh-and-a-response/](https://southasiarev.wordpress.com/2010/01/23/vijay-prashad-attacks-the-peoples-struggle-in-lalgarh-and-a-response/)\n\n>Poverty does not lead to Maoism. It certainly contributes to it, but it does not produce it. What produces Maoism is the act of making political violence legitimate (even glorifying it). Rather than make the case that there is space within the (however limited) democratic institutions, people like Arundhati Roy trumpet the armed road. Patient work through the democratic institutions produced the important developments for the Dalit \\[oppressed caste\\] movement and the working-class movement.\n\nThe last sentence sent me flying lol. Someone remind him to read up on the Dalit Panthers.\n\n>In South Asia, the recent examples of organizations that thrive on the cult of violence include the Liberation Tigers of Tamil Eelam (LTTE) and the United Liberation Front of Asom (ULFA). The Maoists glorify both of these groups – they have recently procured the arms that ULFA was to send to LTTE.\n\nThis is a straight lie. [Edit: meant to quote the line where he states that there are arms deals going on between the maoists and the LTTE which was/is a common bourgeois fabrication:\n\n> The Maoists glorify both of these groups – they have recently procured the arms that ULFA was to send to LTTE. ]\n\n>If the government attempts to provide any sops toward development (such as schools and medical centers), the Maoists simply blow them up (this is clearly documented by Human Rights Watch in *Sabotaged Schooling. Naxalite Attacks and Police Occupation of Schools in India’s Bihar and Jharkhand States*, December 2009). It is to their interest to allow matters to remain in stasis within the “liberated zones.” It is specious to talk of the Maoists as liberators: they are infected with the virus of extortion and power.\n\nThe school buildings (built by private contractors who milked the state money) where the armed forces have famously built their hideouts and loaded their LMGs to shoot anyone on sight? \n\nu/[Environmental-Cry468](https://www.reddit.com/user/Environmental-Cry468/) please do something else with your time instead of engaging with such garbage.",
            "score": 15,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "I'd never seen that article before. What a scumbag. And yes, the hypocrisy is so direct I doubt he even remembers it, hopping from one grift to the next and suddenly showered with attention from American \"intellectuals.\"",
                    "score": 15,
                    "replies": []
                }
            ]
        }
    ]
}