{
    "title": "It is said liberalism is the moderate wing of fascism. What are your thoughts on this?",
    "author": "None",
    "subreddit": "communism",
    "rank": 357,
    "score": 105,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 46,
    "url": "https://www.reddit.com/r/communism/comments/1f3392q/it_is_said_liberalism_is_the_moderate_wing_of/",
    "id": "1f3392q",
    "selftext": "I, personally, wholeheartedly agree.\n\nBut i'd like too hear from my fellow revolutionaries. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "GaoHAQ",
            "body": "just look at what macron is doing right now",
            "score": 116,
            "replies": [
                {
                    "author": "brainfreeze_23",
                    "body": "came here to say this, and honestly I have nothing to add. Stalin was right, plain and simple.",
                    "score": 68,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Could you add some context to what he is doing?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "jonnyjive5",
                            "body": "Didn't he just ban the leftist representatives that won the popular vote? That's anti-democratic, overriding the will of the people to preserve the status quo",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "serr7",
                            "body": "His party would rather work with the fascists than the non rightwing. Who aren’t even communists, they just don’t believe in massacring immigrants and such.",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "bitchingdownthedrain",
                            "body": "Banned the majority winner of their parliamentary? I believe? elections. It was a coalition of multiple groups, he had personal issue with one of the further left groups. They said they would basically bow out of actual representation so long as the coalition stood, to like calm fears of a leftist revolution, and Macron still banned the lot anyway saying something along the lines of needing stability (status remaining quo)",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sebmusiq",
            "body": "Well, well, well...\n\nLook at France and you'll see that the thesis is 100% correct",
            "score": 35,
            "replies": [
                {
                    "author": "None",
                    "body": "What us happening there?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Sebmusiq",
                            "body": "In the last re-election the new popular front had the most votes and now Macron refuses to coalise with the NFP. And since neither the NFP nor the RN and Macrons party have the absolute majority, means Macron has to coalise with the RN.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sexualbrontosaurus",
            "body": "All you have to do is watch the DNC.  Harris giving the Mussolini line of about workers and business working together because of patriotism.  Trotting out the daughter of a contra death squad member to talk about how bad communism is.  Promising to continue arming Isntreal.  Absolute fascist shit show, and those are the moderate liberals.",
            "score": 64,
            "replies": [
                {
                    "author": "GFFloyd",
                    "body": "My thoughts exactly, the moment that she said that the US army would continue to be the most lethal in the world was totally fascist. As a non-american, whose country suffered from US intervention, this kind of rhetoric just makes me sick (probably 90% of the world as well). Good thing that the US is an empire in decline.",
                    "score": 30,
                    "replies": []
                }
            ]
        },
        {
            "author": "ambrotosarkh0n",
            "body": "I'm sure given enough thought I could add something to this but it is succinctly put and accurate. The American political \"left\" works at the behest of capitalist policies and aims and supporting them is supporting fascism.",
            "score": 34,
            "replies": [
                {
                    "author": "Royal_kiwi_18",
                    "body": "The western idea of leftism is shifting from total class equality to progressivism and moderate social programs. Very concerning and even more so with how many “leftists” still defend the Democrats who have been leading this shift in “leftist” thinking.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "you're free to do what you want, but you're kidding yourself if you think supporting either of the bourgeois parties does anything to move the us towards communism",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Look at France and how Macron is allying himself with the far-right (fascists). Assata Shakur also makes note of liberalism, “ As far as I'm concerned, \"liberal\" is the most meaningless word in the dictionary. History has shown me that as long as some white middle class people can live high on the hog, take vacations to Europe, send their children to private schools, and reap the benefits of their white skin privileges, then they are liberals. But when times get hard and money gets tight, they pull off that liberal mask and you think you're talking to Adolf Hitler. They feel sorry for the so called underprivileged just as long as they can maintain their own privileges.”",
            "score": 13,
            "replies": []
        },
        {
            "author": "SnakeJerusalem",
            "body": "liberalism is the force that creates the material conditions for people to turn to facism.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Purple24gold",
            "body": "From the perspective of the colonized, there's no fundamental difference between fascism and liberalism.",
            "score": 13,
            "replies": [
                {
                    "author": "sti-wrx",
                    "body": "Can’t believe I’ve never heard this before. Thanks for sharing.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SPNB90",
            "body": "I believe its \"social democracy is the moderate wing of fascism\" which I agree with even more. Liberalism isn't moderate in its support of fascism. Soc-dems end revolutionary support at reformism to continue to bow to capitalism and boo-hoo at any real revolutionary movement.",
            "score": 27,
            "replies": []
        },
        {
            "author": "miquiliztlii",
            "body": "Yes.\n\nNothing else to add. Just yes.",
            "score": 9,
            "replies": []
        },
        {
            "author": "PsychologicalScar852",
            "body": "When you're supporting several genocides and literal neo-nazis you can't call yourself moderate",
            "score": 8,
            "replies": []
        },
        {
            "author": "ShareholderDemands",
            "body": "One fascist Two fascist Red fascist Blue fascist.",
            "score": 7,
            "replies": [
                {
                    "author": "Punk_Rock_Princess_",
                    "body": "How have I never heard this before? Beautifully put.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LiuKang1080",
            "body": "For more information on this topic I recommend Fascism and Social Revolution by RP. Dutt. Here is the audio book I recommend: \nPart 1: https://www.youtube.com/watch?v=WvBUvJjEO28\nPart 2: https://www.youtube.com/watch?v=shJNfOzgLQs",
            "score": 3,
            "replies": []
        },
        {
            "author": "EasterBunny1916",
            "body": "In the US, Democrats are running campaign ads appealing to conservatives regarding immigrants. They're taken opposition to the death penalty and torture out of their platform. They refused to allow even 1 Palestinian American Democrat to speak at their convention.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Loud-Cry4015",
            "body": "I agree with you. All kinds of examples we can look at today. France and USA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unsocialist117",
            "body": "Scratch a liberal and a fascist bleeds",
            "score": 1,
            "replies": []
        },
        {
            "author": "Various_Foot_4886",
            "body": "Scratch a liberal and a fascist bleeds",
            "score": 1,
            "replies": []
        },
        {
            "author": "TwoCrabsFighting",
            "body": "Fascists hate liberals. \n\nLiberals span the middle of capitalism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gomrade",
            "body": "Where I'm from Liberalism represented the strong arm of the Bourgeoisie before Fascism was even invented. In their antagonisms with the old Aristocratic/Royalist elite they almost tore the country apart (especially since they were puppets of the Entente while the Royals supported the Central alliance), they were forming second governments, their loyalist officers competed with the Right in who will do the most military coups (when Liberals did them, they were called \"movements\"), some of these officers had an admiration for Mussolini after his march in Rome; Liberals created laws that banned all Union activity and promoting Socialism of any stripe could sent you to concentration camp, they paved the way for the eventual establishment of a Fascist dictatorship where the leader had only 5% popular support (both right-wingers and liberals voted in favour of the dissolution of the parliament and give him dictatorial powers to \"deal with the communist threat\"), after WW2 and in the face of the imminent rise of the Communist Party they backstabbed the anti-fascist resistance and engineered a Civil War with the help of Churchill. They utilised all the Fascist collaborators and paramilitaries, while blaiming the \"far-left\" for what was happening. They opened concentration camps (again) for the Communists, while public opinion forgot about that fact and blames the Right. Thanks to them we ended up being governed by Fascists, collaborators and deserters, while our Resistence fighters died, got sent to exile, or escaped in Warsaw Pact countries. And that whole mess stopped in the '70s, after the collapse as of a US-backed military dictatorship which had banned all political parties to... combat the communist threat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ambitious-Humor-4831",
            "body": "It's a mere polemic phrase targeted at new communists to shock them. I have no idea what \"moderate\" even means in this context. One should just make absolute statements or avoid using fascism as some kind of scary word. Both ideologies threaten the entire world.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Duduzin",
            "body": "Edit: Sorry, let me correct myself—it seems I gave the impression that im saying you would be completely wrong. Quite the opposite, I strongly agree the idea that liberalism is just moderated fascism is absolutely correct. I provided the explanation below because fascism and communism are often associated as opposing ideologies, which creates the illusion that they are somehow complementary.\n\nYou would be wrong in saying that; there is no ideologically opposing correlation between fascism and radical leftism.\n\nRadicalism on the left means going to the root of the issues. For example, when we say that capitalism is unsustainable because it aims to exist with infinite expansion within a world with finite resources, this statement can be made because we went to the root of the issue using a method within material reality, with the goal of the emancipation of the working class by breaking away from the dominant mode of production.\n\nFascism is cornered liberalism going to its extreme to protect the interests of the bourgeois class. When liberalism and the bourgeoisie find themselves pressured in the class struggle and close to defeat, they use their extreme face—fascism—ignoring the morality they once claimed to protect and their own institutional rites if necessary. Take France, for example: Macron is a sly neoliberal. At the moment, he is ignoring democratic rites and carrying out an institutional coup because the French bourgeoisie was slightly threatened. That’s why it is said that Social Democracy is the antechamber of Fascism, and why radicalism is different from extremism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "depressingonion123",
            "body": "I'd disagree. Liberalism is not fascism and equating it with fascism, or saying everything bad under liberalism is fascism, would be defending the terrible evil inherent in liberalism, by saying it's actually fascism.\n\n Fascism is separate to liberalism and something that a capitalist wouldn't necessarily strive for if the opportunity arises, as fascism is generally much more restrictive on the market and more likely to hamper trade. It is true though, that liberals will always side with fascism over communists, since it does protect the current hierarchy of ownership and prevents people from forming class consciousness. \n\nFascism is to liberals, more like the bonapartism of 19th century France that marx described. A restrictive government that is tolerated, because it will side with the bourgeoisie in the class war. \n(This is very long, I hope I made my point understandable though)",
            "score": -1,
            "replies": []
        },
        {
            "author": "Rising_Tide_King",
            "body": "Depends on how you'd describe liberalism.",
            "score": -1,
            "replies": []
        }
    ]
}