{
    "title": "Modeling the IMT/RCI",
    "author": "Henry-1917",
    "subreddit": "communism",
    "rank": 344,
    "score": 1,
    "upvote_ratio": 0.57,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/communism/comments/1f9g5mg/modeling_the_imtrci/",
    "id": "1f9g5mg",
    "selftext": "[https://shimmering-skull-0c5.notion.site/Are-You-a-Communist-Modeling-the-International-Marxist-Tendency-Revolutionary-Communist-Interna-6c3045a46be6423d9a71af1308948111](https://shimmering-skull-0c5.notion.site/Are-You-a-Communist-Modeling-the-International-Marxist-Tendency-Revolutionary-Communist-Interna-6c3045a46be6423d9a71af1308948111)",
    "comments": [
        {
            "author": "smokeuptheweed9",
            "body": "This article series is unfortunately 90% filler so I wouldn't recommend anyone actually reading it. It is useful in that it is evidence for its own claims against itself. The author, having never learned anything about Marxism in the IMT, has regressed back into liberalism. This is proof of the IMT's own fundamental liberalism and basic dysfunction but unfortunately means that such studies from ex-members, recruited and discarded quickly, are of very little value. If you're expecting an ex-IMT member to have real insight into the fundamental problems of Trotskyism you will be disappointed. The only thing they get out of the whole experience is that Trotskyism itself is superfluous to Trotskyist practice, which should be the practical work of entryism, eliminating any revolutionary history as reference, and turning Marxism into a form of \"sectarianism.\" \n\nAs a log of what it's actually like to be in the IMT there is some funny information. The undemocratic nature of slates, the facade of unified opinion covering for a real unified opinion (by this I mean the CC and other leaders pretend there was discussion about different lines with the majority opinion imposed but in reality there is no substantive discussion behind the scenes, the leadership are as much slaves to the organization's immanent logic as the members), the genuinely delusional usage of \"revolutionary optimism\" are all well known. But the amount of money that is squeezed out of both interested visitors and members is shocking. Membership costs money. Movie night and socials cost money. Newspapers cost money (local branches buy them from national and have to make up the difference). Every event expects donations, for which regular members are supposed to serve as an example, basically as audience plants who start a slow clap. The author started at their first meeting giving $40 dollars and they felt guilty about not giving what was expected.  \n\nAlso this line is really funny\n\n>We are running our recruitment campaign quite publicly, as we have nothing to fear from the Labour bureaucracy at present, since the people we want to recruit aren't looking towards them, and they have expelled us anyway. \n\nYou didn't kick me out of the club, I chose to leave once I was lying on the curb. Presenting this as a principled choice is, as is said today, serious copium. Unfortunately the author derives the wrong lesson and thinks \n\n>Some of these splits may have been legitimate at the time, but they seem somewhat obscure in 2024, as the USSR has collapsed and the British section of the IMT has been expelled from the Labour Party.\n\nThis is just an excuse for a reformist break with even the minimal revolutionary ideas of Trotskyism. It is the opposite: because the IMT is rebranding in a completely superficial manner, it has in no way broken with the underlying logic that led to decades of capitulation to the labor party and the Democrats (the article points out that it even joined the DSA in 2016) and claims to independence are just sour grapes retroactively justified as the master plan the whole time. The author is also fundamentally wrong about the IMT's distinction, presumably because the level of education in the party is so poor party members themselves now buy the BS meant for the mass of walking ATMs. It is the slavish devotion to the labor party that distinguishes the IMT compared to other Trot parties, not the defense of the USSR as a worker's state. Even by Trot standards the IMT is pathetic, but unfortunately we will have to tolerate it for a while because it is the only party that figured out search engine optimization.\n\nE: OP I see now you're the author. My advice is to find your audience (you don't need to painstakingly explain the use of \"Box\" to an audience looking for theoretic lessons from your experiences - the explanation of the differences between orgs on Palestine is where the bulk of your attention should go; all you did was merely catalogue them without any analysis). Your general conclusions about the IMT's fundamental problems are correct, at least descriptively, but the political lessons you draw from them are wrong. Sectarianism is not the problem because the IMT is not sectarian at all. Sectarianism implies a difference in theory being elevated over the practical needs of mass politics. But there are no theoretical differences that distinguish the IMT, this is merely a factional dispute for money and attention within liberalism. People do not call the Democratic primaries \"sectarian\" because we understand that the disputes between individuals within the party have no importance to anyone except each candidate's army of interns. You were basically an intern of Alan Woods instead of Maria Svart. As for the cataloguing of relative membership numbers in Russia vs the US and UK today, this is the same superficial understanding that IMT members use to justify blind recruitment (as you yourself point out earlier). You have not broken with this logic but use it for even more reformist ends, since smaller numbers eliminates any pretension of communism as a propaganda tool for the elevation of pure agitation (using your terms). There are, unfortunately for liberals, more works Lenin wrote besides LWC (that you think you've found the secret that was repressed by Trots for 100 years shows the sad, cloistered world of IMT education), and even LWC has been badly misused in your analysis since it is ultimately a sympathic account of \"left wing communism\" unlike the renegade social democrats of the second international who are enemies of humanity.",
            "score": 22,
            "replies": []
        },
        {
            "author": "cyberwitchtechnobtch",
            "body": "If you're going to continue investigating the IMT you must address ideology as an emergent property of class composition. You gave some insightful descriptions of the internal dysfunction of the IMT and your chapter but they are not unique to the IMT save for obscure language or esoteric insults like \"Zinovievist.\" But ultimately you failed to present a causal explanation for any of its dysfunction and you do address the question of politics at the end of the series but fail to criticize it on a deeper level and break from Trotskyism entirely. You *must* break from Trotskyism entirely (though in this case it is just Dengism at the end of the day given the lauding of Capitalism as a progressive force with the focus on the \"productive forces\"); I see that you are still entertaining it in one of your cross-posted threads. Does it not ring an alarm when one of the people who replied basically presents this as a rite of passage for other Trotskyists, \n\n>\"You are now an official member of the ex-comrade of the IMT club.\"\n\nThat poster also failed to explain the toxicity of the IMT in the same way you failed to do so (though they are apt in describing it like a pyramid scheme). It is reduced to empirical explanations like a lack of financial transparency or low recruitment standards. Why do these problems exist in the first place? Why does the IMT end up reproducing the same banal politics of other Leftist organizations but with a more toxic internal disorganization? Your series is thorough but it is not a Marxist critique. You must forget everything you learned at the IMT and start over in building your understanding of Marxism. I'm sorry you wasted your time, energy, and money being in such a useless organization but this should give you sober clarity on how malicious the IMT's recruitment is and the failure of Trotskyism at the ideological level.",
            "score": 8,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "Some of the responses in the other threads are remarkable.\n\n> One of the criticisms that was raised throughout this document was that the RCA has a sort of Toxic Optimism. I definitely understand where this is coming from. I think that the period of work we've been in for the past 1-2 years has been success after success.\n\nWe're not delusionally optimistic, we just win too much. \n\n>What was Ted Grant's organisation has become a retirement fund for Woods and a few others. Not a few of them have never done a day's labour in their life - many became full-timers in their early twenties and have only ever worked for the organisation. It was never discussed in the open, but on the sidelines some comrades would point out the problem - the full-timers have nowhere to go, they are unemployable outside of the organisation. That is a colossal material pressure towards bureaucratisation - that is what the 'open turn' towards being the RCI is. \n\nI suppose if all you learn is the Marxism of the IMT, you can only respond with the same nonsense. In this case, if every problem is an individual failing, the failure of the party for those who've lost faith must be the fault of an individual at the very top. This mirror's Trotskyism's obsession with Stalin but at least Stalin, Lenin, and Trotsky are world historical figures. No one in the world cares about Ted Grant and Alan Woods. \n\nIt's just sad that the party eats up and spits out young people who get nothing from the whole experience except bitter emotional associations and an empty wallet. One should at least learn something of Marxism, if nothing else through negative example.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "dovhthered",
            "body": "Honest question: How does a Trotskyist organization uphold Lenin's \"Left-Wing Communism: An Infantile Disorder\" as part of its manifesto?\n\nIsn't Trotskyism a left-wing deviation?",
            "score": 4,
            "replies": [
                {
                    "author": "Henry-1917",
                    "body": "Yeah, education can be useful, but it's pointless if the organization's theory inaccurately describes the world. Trotskyists generally follow Lenin, and the IMT upholds the first 4 congresses of the comintern.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}