{
    "title": "The deadly malady stalking India’s workers - Caravan Magazine ",
    "author": "None",
    "subreddit": "communism",
    "rank": 337,
    "score": 32,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 4,
    "url": "https://caravanmagazine.in/health/silicosis-india-silica-dust-killing-workers",
    "id": "1fc3c3e",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "The article requires a subscription so I uploaded a pdf here:\n\nhttps://archive.org/details/the-deadly-malady-stalking-indias-workers-the-caravan/mode/1up\n\nSpeaks about silicosis, how it is affecting mining workers, and how the state is repressing information regarding it.",
            "score": 17,
            "replies": [
                {
                    "author": "MajesticTree954",
                    "body": "reading this I felt a heavy weight on my chest..\n\nI'm reminded of a passage from Capital, from the 'Health and Education Clauses of the Factory Acts'.\n\n>\"What could be more characteristic of the capitalist mode of production than the fact that it is necessary, by Act of Parliament, to force upon the capitalists the simplest appliances for maintaining cleanliness and health? \n\n>In the potteries the Factory Act of 1864 ‘has whitewashed and cleansed upwards of 200 workshops, after a period of abstinence from any such cleaning, in many cases of 20 years, and in some entirely’ (this is the ‘abstinence’ of the capitalist!), ‘in which were employed 27,800 artisans, hitherto breathing through protracted days and often nights of labour, a mephitic atmosphere, and which rendered an otherwise comparatively innocuous occupation, pregnant with disease and death. The Act has improved the ventilation very much.’ \n\n>At the same time, this part of the Act strikingly demonstrates that the capitalist mode of production, by its very nature, excludes all rational improvement beyond a certain point. It has been repeatedly noted that the English doctors are unanimous in declaring that where the work is continuous 500 cubic feet is the very smallest space that should be allowed for each person.\n\n>Now, just as the Factory Acts, owing to their compulsory provisions, indirectly hasten the conversion of small workshops into factories, thus indirectly attacking the proprietary rights of the smaller capitalists, and assuring a monopoly to the big ones, so too, in the same way, thousands of small employers would be expropriated directly, at a single stroke, if it were made obligatory to provide the proper space for each worker in each workshop. This would strike at the very roots of the capitalist mode of production, i.e. the self-valorization of capital, whether on a small or a large scale, by means of the ‘free’ purchase and consumption of labour-power. \n\n>Factory legislation is therefore brought to a dead halt before these 500 cubic feet of breathing space. The health officers, the industrial inquiry commissioners, the factory inspectors, all repeat, over and over again, that it is both necessary for the workers to have these 500 cubic feet, and impossible to impose this rule on capital. They are, in reality, declaring that consumption and the other pulmonary diseases of the workers are conditions necessary to the existence of capital.\"",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Zizou3peat",
                    "body": "Thank you, I’ve seen many articles of workers with lung problems, early cancers etc",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}