{
    "title": "What was lenin concept of centralism",
    "author": "None",
    "subreddit": "communism",
    "rank": 328,
    "score": 23,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/communism/comments/1feav3g/what_was_lenin_concept_of_centralism/",
    "id": "1feav3g",
    "selftext": "Im slightly confused by chapter four of State and Revolution what did he mean when he uses the word centralism.  As he claims through centralism self goverment can be attained fully but surely this is the opposite of centralism. I think I lack a bit of context. I also dont really understand why he is so aganist federalism especially when he quotes engels, who seemed to argue that in a state as big as the USA federalism is neccessary (so the same must be true of russia) sorry if this is a silly question I am new to reading theory",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClarSco",
            "body": "He's talking about \"democratic centralism\" not \"centralism\".\n\nCentralism and Federalism refer to **where** in the political system power is concentrated. Centralism seeks to keep most of the political levers at the top layer, Federalism aims to push all but the most critical levers at least one layer down the chain.\n\nDemocratic Centralism is method of intra-party discipline.\n\nThe gist of DC is that members of the party are free and (ideally) encouraged to express any opinions on a policy. Those opinions are then debated rigourously within the party until some degree of consencuss has been reached. At this point, the party (and its members) need to all stand behind the outcome of that debate to the public as a united front. \n\nPublicly espousing a view that runs contrary to the party line will therefore be punished, eg. by expulsion from the party.",
            "score": 10,
            "replies": []
        }
    ]
}