{
    "title": "Stalin's Place in History (see comments)",
    "author": "Particular-Hunter586",
    "subreddit": "communism",
    "rank": 321,
    "score": 25,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.marxists.org/reference/archive/mao/selected-works/volume-7/mswv7_467.htm",
    "id": "1ffgm5v",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Particular-Hunter586",
            "body": "I found this work by Mao when researching the history of the Sino-Soviet split, and I'd like to open a discussion about it. I was wondering if anyone knew more about the context in which he was speaking, since I was honestly taken aback by the extent to which Mao accuses Stalin of \"cult of personality\". I think it ties into an ongoing question here about how we criticize previous communists and communist movements without falling into liberalism.",
            "score": 12,
            "replies": [
                {
                    "author": "kannadegurechaff",
                    "body": "it took place only a few months after Khrushchev's speech denouncing Stalin’s cult of personality. Perhaps Mao was influenced by the speech? This was also during a period before the full emergence of the Sino-Soviet split.\n\nit’s quite different from what he wrote after Stalin’s death, in [The Greatest Friendship](https://www.marxists.org/reference/archive/mao/selected-works/volume-7/mswv7_299.htm), where he praised Stalin in much stronger terms, and later in 1963, where the CPC took a stance against the so called \"cult of personality\", in the open letter [On the Question of Stalin](https://www.prisoncensorship.info/archive/etext/classics/mao/polemics/qstalin.html):\n\n>Thus it is clear that the issue of \"combating the personality cult\" raised by the leadership of the CPSU has come down through Bakunin, Kautsky, Trotsky and Tito, all of whom used it to attack the leaders of the proletariat and undermine the proletarian revolutionary movement.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Ambitious-Humor-4831",
                            "body": "Mao owed his entire career as a revolutionary to Stalin. Stalin was the one who advocated for Mao leadership in China and Mao would listen to a lot of Stalin's suggestions. Mao A Reinterpretation goes into this but there was never a real big divide between Stalin and Mao.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Technical_Team_3182",
            "body": "It was discussed in the thread below in the past\nhttps://www.reddit.com/r/communism/s/Eqk40cL1D9",
            "score": 12,
            "replies": []
        }
    ]
}