{
    "title": "Any advice on tactical ways to go about informing people on communism locally?",
    "author": "Plastic_Drawer_2251",
    "subreddit": "communism",
    "rank": 320,
    "score": 31,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.reddit.com/r/communism/comments/1fg01iu/any_advice_on_tactical_ways_to_go_about_informing/",
    "id": "1fg01iu",
    "selftext": "I have been doing a lot of reading, thinking, listening, writing.. etc; But I really want to hear other comrade's thoughts on doing this.\n\nOur biggest advantage is that everybody is pissed off at the system, one way or another, whether they know it or not.\nBut you can't just go up to someone and even say \"communism\", in a country where \"communism\" failed pretty miserably due to lack of administration, etc.\n\nI'm mainly concerned about which things you could relate to people about, that isn't obviously \"too socialist\".\n\nThe elderly can't even survive properly at times because of their pensions.\nThe youth has no clue, including myself, how the hell we'll thrive in the future, how we'll be able to even pay for rent in some cases, etc.\nThe working class can most definitely relate to a feeling of being exploited.\nNurses, and all vital employees are not being paid anything close to their work's worth.\nOn top of all these issues, capitalism is also destroying the environment, dumping money into the arms industry \"pointlessly\".\n\nOf course we can always mention these to the people, in this way. But how would you relate it, even if gradually, to communist goals, without turning people away too quickly?\n\nKnowing how to relate these topics to us would be incredibly useful for approaching my family with it too, since they also have a pretty skewed view of Communism, from their time alive.\n\n(For context, I'm from Romania. The subject is either too touchy, completely avoided, or used as an insult; you can probably see why I'd be so wary when approaching anyone with this.)\n\nThanks in advance, comrades!",
    "comments": [
        {
            "author": "GeistTransformation1",
            "body": ">But you can't just go up to someone and even say \"communism\", in a country where \"communism\" failed pretty miserably due to lack of administration, etc.\n\nExcept for instances of state persecution which may need special consideration, you absolutely can and should identify yourself as being a communist to other people if that's what you are; the people who are repulsed by that word are not going to become cadre anyways.\n\nYou have to consider the implications of what it means to be a communist in Romania, and I suggest you ditch the term ''working class'' and instead use ''proletariat'' as that has a specific meaning, and it is the most advanced section of the proletariat who will form the nucleus of the communist party. The folly of searching for the ''working class'' to organise with is that you will encounter reactionaries, specifically amongst the labour aristocracy and petty-bourgeois, who do perform labour and often identify as working people but are almost always opposed to revolution since their class interests are reliant on the extraction of surplus value that only capitalism can generate.\n\nEdit: And don't fall for propaganda that Eastern Europeans despise communism, even if you yourself are Eastern European and think you know better about what they believe in. If you know where to find the Romanian proletariat then you can trace their political development and find people to organise with as they are not going to repulsed by communism, a communist party is simply the most advanced concentration of proletarian interests in a bourgeois society.",
            "score": 43,
            "replies": [
                {
                    "author": "Particular-Hunter586",
                    "body": "Does Romania have a significant labor aristocracy (in the modern meaning of it rather than Engels’s definition with regards to union leadership)?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "GeistTransformation1",
                            "body": "Romania is on the periphery of the European Union but it certainly would have a labour aristocracy, just not as significant as Germany for example.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Plastic_Drawer_2251",
                    "body": "What exactly do you mean by \"instances of state persecution\" here?\nIt seems like right now you can definitely have some form of \"free speech\" (as long as it's not threatening their system too much). I've just been very careful either way, I'd assume that a strongly revolutionary mindset and intensions could potentially get someone in real trouble if voiced. Is this the sort of thing you were referring to?\n(I'm not even sure of sources where I could find out more about what's dangerous and what isn't right now, to be completely honest.)\n\nAlso really appreciate you shedding light on the term \"working class\" here. That's a very important differentiation I didn't really consider until now.\n\nRegarding the edit: Very true. The hatred against communism is definitely not that major if I think about it more. The propaganda you hear very often your whole life can genuinely overshadow what you actually observe if you're not careful lol.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GeistTransformation1",
                            "body": ">What exactly do you mean by \"instances of state persecution\" here?\n\nA lot of post-socialist states in Europe have restrictions on communist parties and symbolism associated with communism, though the consequences are usually fines and an inability to official register as a party which isn't a huge problem, the only really dangerous place to identify as a communist amongst these countries is Ukraine where you can be prosecuted for treason or get murdered. Communists shouldn't be averse to breaking the law or risking themselves for revolutionary gain but as I \nsaid, it requires special consideration but for Romania, I wouldn't worry too much about the legal ramifications of calling yourself a communist.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "chelestyne",
                                    "body": "Wanna add PH as well. While we can still identify ourselves as communists, we literally have this government-funded National Task Force to End Local Communist Armed Conflict (NTF-ELCAC) who, of course, jails every activists, not even just communists, without proof of belonging to the armed struggle. The PH government also added the Anti Terror Law, which is nothing but a made-up law that they can file against activists.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Plastic_Drawer_2251",
                                            "body": "Yeah, that's definitely something to look out for. Either way I'll never be public about it, especially when as a person I'm a lot more serious about it than just calling myself a communist.\nYa never know who's seeing you, even on the street, idk lol. My paranoia would never let me openly talk about it to everyone anyway.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "browhybro",
            "body": "Unionization drives. I recently started my own org in one of the least unionized cities in America. Turns out, way more people want to be unionized than we initially thought.\n\nLearn about the unionization process (or partner with someone who does), put up flyers or pamphlets near unorganized workplaces, and then advise them on how to unionize. Our organization also helps with the paperwork. The left has very good rhetoric. Sound, rational, and true. But not enough of us are willing to actually go out there and do something about it. Unionizing is the very first step to revolution.",
            "score": 3,
            "replies": [
                {
                    "author": "MauriceBishopsGhost",
                    "body": "This doesn't really hold up to scrutiny in the United States. Here all major unions (including \"independent\" unions like UE) tail the major capitalist/imperialist political parties and membership are largely composed of petty bourgeois or labor aristocrats individuals. \n\nThe American so-called communist organizations are often tailing these unions under the auspices that they fight for workers rights. \n\nThey all fight for the class interests of their members which generally involves fighting for a bigger slice of the spoils of Imperialism. To give two different examples: AFSCME which represents government employees fighting for a bigger slice of US tax dollars for their members, UAW which represents automotive employees fighting for a bigger slice of inflated profits from Ford for their members. In both instances the union is fighting to maintain wages and working conditions above the value of the labor.\n\nAll of the major communist and socialist organizations in the united states do some sort of union work, whether that is working to unionize new workplace, showing up to \"picket lines\" with the aformentioned unions. This doesn't do a whole lot to further the class interests of proletarian and oppressed classes. \n\nThere is probably more work to be done here, and some interesting and critical discussion about unionization in the first world has taken place on this sub but there probably should be more.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Raphoyz",
            "body": "From personal experience as an active organised marxist-leninist, people are aware that they and/or others are being exploited, one way or another. You dont need to start by describing yourself as a comunnist.\nWhen Im agitproping and selling my party newspaper, I usually talk about long work hours, hunger, poverty and homelessness (which  huge problems Im my country - Brazil) and the fact that media never address these things properly.\nI go around these subjects and tell how we should be doing stuff instead (ex.: expropriating abandoned buildings to provide housing), without describing tham explicitly as socialism. I usually get at least positive head nods or, in the best cases, they buy the paper or even ask to join the party.\nPeople tend to look down on communism around here, so you gotta start with the biggest issues and trace It back to class exploitation. Most working people agree with socialist policies, they either just dont know It or are mislead.",
            "score": 8,
            "replies": [
                {
                    "author": "_youwasattheclub_",
                    "body": "So you manipulate them? Sounds about right for a communist. #capitalism",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Plastic_Drawer_2251",
                            "body": "Ah, how beautiful it is to see someone blatantly ignoring how they're actively being manipulated daily by bourgeois ideology, through social media posts, even product advertisements on the street, the daily little sprinkles of sexism, patriarchy, pro-capitalist propaganda (\"if you work hard enough you'll get to our level\" and you never will, because you don't exploit everyone like they do).\n\nTruly magnificent how you don't realize you're supporting your own exploiters through your anti-communist rhetoric.\n\nAll the person above is saying is that they're helping people *connect* all the actual facts about the capitalist system, *making them aware* of how even their existence, their labor is used as a commodity, like they're just objects in a machine, that are only there because they're forced to in order to survive, further putting money in the rich people's pockets.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "Plastic_Drawer_2251",
                    "body": "I'll start to look more into that specifically, combatting anti-communist propaganda is a huge part of it afterall. Thanks, comrade!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 4,
            "replies": [
                {
                    "author": "Plastic_Drawer_2251",
                    "body": "Yeah, it's very unfortunate when you hear people even *defending* capitalism, and only because they aren't aware of how it works.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "xSwampxPopex",
            "body": "This is honestly a great question that I’m not sure I have an answer to. I’m in the US and recently mentioned to a pretty forward thinking, albeit certainly not communist, coworker that I’ve been reading Lenin and his response was “hey at least it’s not Mein Kempf.” The unfortunate reality is that Cold War attitudes never really went away. I generally try to present concepts in a way that is outcome oriented which typically goes over well, but if you say scary words like “Marx” all of that goes out the window.",
            "score": 3,
            "replies": [
                {
                    "author": "Plastic_Drawer_2251",
                    "body": "Yeah, it's difficult trying to talk *around* it, at least at first, and still stay accurate in what you're saying. Sometimes mentioning names in inevitable, but I *have* been watching a lot more videos on surrounding subjects from Marxism Today, that really helped me through the \"stepping on eggshells\" at the beginning of conversations.\n\nI'm mostly trying to focus on very common issues the proletariat has, that channel does an insanely good job at integrating Marxist/MLM theory into something so relatable.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Plastic_Drawer_2251",
                    "body": "Ah, don't we all love it when somebody chimes in without any research and tons of reading into something whatsoever, to properly inform themselves before even talking.\nMaybe you don't have the time or right resources for that, but at least don't involve yourself then lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}