{
    "title": "Oppressed-nation proletarians in the U$",
    "author": "Particular-Hunter586",
    "subreddit": "communism",
    "rank": 299,
    "score": 71,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 35,
    "url": "https://www.reddit.com/r/communism/comments/1fq4aep/oppressednation_proletarians_in_the_u/",
    "id": "1fq4aep",
    "selftext": "I’m curious whether this sub has ever had extended discussions, especially since recognizing the question of the labor aristocracy, regarding the existence of a proletariat among the oppressed nations in the U$. There seems to be a significant vacillation, or perhaps disagreement, on the question espoused by frequent users here; for example, just this month, u/smokeuptheweed9 telling a chauvinistic white commentor that “the vast majority of Black proletarians are socialists, just not in the way you recognize” and talking about \"the proletariat being mobilized for Blue Oval City in Haywood County\" and \"the rural proletariat still involved in the cotton industry\" while other users discussed how Cope’s work and the cooptation of the BLM movement implied *no* Black proletariat existing anymore (and questioned the idea of the Black nation as a revolutionary force at all). Furthermore, I know MIM and MIM(Prisons) went back and forth on this question but ultimately agreed there were no Black proletarians. \n\nThe existence of proletarians of oppressed nations would seem to imply that the calculation of who is \"proletarian\" simply based off of surplus-value, as Cope does, is an incorrect way to view the question; rather, a thorough analysis of the living conditions and the class standpoint and alliances of these sections of the masses would be a better way to determine who is proletarian (an idea which I think is more productive, given that that's how *Settlers* is formulated). It is clear that the question of who is proletarian is much more than a semantic question, but for a subreddit largely comprised of Amerikans that places such great emphasis on correct class analyses and on the struggles of oppressed nations, there is very little discussion of whether these are *proletarian* struggles.\n\nThis seems to me to be an incredibly significant question that guides how both individual communists and communist parties should carry out work, and it feels as though a lack of investigation and discussion has occurred. So, I’d like to open a discussion here about it. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokeuptheweed9",
            "body": ">a thorough analysis of the living conditions and the class standpoint and alliances of these sections of the masses would be a better way to determine who is proletarian\n\nI agree, since as you point out wages are only one of the ways that surplus value is redistricted and the wage relation is only one area where the reproduction of capital occurs. To not consider property ownership in the US settler context is obviously flawed if not deeply troubling. I would hope Cope's fascist turn has caused people to think about some of the limitations of his work.\n\nI won't dispute the experience of MIM on this issue since orientation towards prisons is basically a wager on it. But I don't think we must be obedient to MIM because they are an organization and we are merely individuals. There have been some recent discussions about some of the ideas of MIM that have not aged very well and I think we can evaluate on our own whether a black proletariat exists without capitulating to this poster from r/revdem which takes the bad parts of Maoist (Maoism as a reborn CPUSA) to become a rightist faction of the DSA.",
            "score": 25,
            "replies": [
                {
                    "author": "Particular-Hunter586",
                    "body": ">we can evaluate on our own whether a black proletariat exists\n\nHas any of this, anything *like* this, been done to any extent by users on this subreddit at all? The closest I can think of would be that *Spectre* series which was good but obviously came from a journal with some theoretical problems of its own. You've been around this place for much longer than I have - has there ever been serious time and energy devoted to any sort of analysis, either via social investigation or via studying real economic data like Cope and MIM did, of this question? And if not, I guess I'm kind of curious as to why not, and why users on here take a position one way or another *so strongly*. Maybe I'm expecting too much of this subreddit, though, as a public and disparate space for discussion.\n\n> To not consider property ownership in the US settler context is obviously flawed if not deeply troubling.\n\nRight, and to be honest, musing on this idea is part of why I made this post in the first place. A frequent admonishment of chauvinistic first-worlders pandering to the labor aristocracy is \"proletariat doesn't mean working for a wage, it means people with nothing to lose but their chains!\" But what does that imply for the extremely numerically significant parts of New Afrika, especially the urban ones, who, yes, are making superprofits at their minimum wage jobs or in the underground economy, but nevertheless can't hold down a home, even a rented one, can't afford a working car, and are seeing their prospects for the future stolen away by deindustrialization and the dispossession caused by the anarchic motions of capital?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "The closest thing would be the extended discussions of how Chinese capitalism works and the nature of global manufacturing. It's straightforward to take that and apply it inversely to the American consumer aristocracy. Though to your point, that analysis would lead one to conclude that there is no proletariat in the US since everyone participates in the consumption of Chinese toys, electronics, medicine, plastic, etc.\n\nYou don't need us to analyze the US proletariat, every communist party has attempted to do so in practice. Every attempt has been a failure and they've all been discussed here. However I'm not quite ready to give up on the existence of a proletariat at all since, other than MIM, there are no parties that even acknowledge the existence of a labor aristocracy as a Marxist concept. There was discussion of \"state unions\" which some Maoist group thought was a great innovation when in fact it is a regression from the labor aristocracy. And yet it is still a step forward from the practice of other groups. \n\n>has there ever been serious time and energy devoted to any sort of analysis, either via social investigation or via studying real economic data like Cope and MIM did, of this question?\n\nWell yes, I think the posts here in good threads are as serious as anything else, though given the word limits the empirical work is done beforehand and it's referenced in its conclusions. But there is no one post with someone's thesis on who the proletariat is, that question is far too broad. It's like people who has \"how do we make revolution?\" If I had a 5 minute answer for you it would already have happened.\n\nThe specific post you're talking about was basically me telling some white dude to do something uncomfortable because I knew he wouldn't. I would imagine if a communist party really tried to organize in the way I discussed they would fail in the same way US communists have failed on similar terrain for a century. But the currently existing parties aren't even competent enough to try it, there's only so much we can say in an observational role.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Particular-Hunter586",
                                    "body": ">that analysis would lead one to conclude that there is no proletariat in the US since everyone participates in the consumption of Chinese toys, electronics, medicine, plastic, etc.\n\nAs someone who lived in a \"third world country\" at one point in my life, if \"the consumption of Chinese toys, electronics, medicine, plastic, etc.\", or even the *over*consumption of such things for consumerist pleasure, were the hallmarks of the labor/consumer aristocracy, then vast swathes of the slightly-more-developed third world are also marked by huge consumer aristocracies. It's intricacies like this that make me think that these analyses are way too vulgar; it seems obvious to me that there's a difference between owning a home and a car and a 401k, and owning a bunch of cheap Chinese clothes and toys.\n\n>other than MIM, there are no parties that even acknowledge the existence of a labor aristocracy as a Marxist concept\n\nIs this the case? I thought that a fair amount of communist/\"communist\" writings and practice recognize the existence of the labor aristocracy, they just don't assume it to be the *entirety* of the US. Or are you using a strict definition of \"communist party\" here?\n\n> the empirical work is done beforehand and it's referenced in its conclusions\n\nDo you have any examples of this? Or anything I should be searching? \n\nI'm not asking for someone's thesis on who the proletariat is, or a five minute answer, rather just for any signs of discussion on the investigation into of the existence of a Black proletariat (or a migrant proletariat, or whatever). It seems like all of these threads end off in \"well, this should be investigated, someone should do that\" without much more discussion.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "smokeuptheweed9",
                                            "body": "> I thought that a fair amount of communist/\"communist\" writings and practice recognize the existence of the labor aristocracy, they just don't assume it to be the entirety of the US\n\nThey are forced to acknowledge that Lenin used the term but there is no application of it in either theory or practice.\n\n>Do you have any examples of this? Or anything I should be searching?\n\nI just remember things that interest me, I don't keep track of the threads themselves, sorry. The best way to provoke discussion is to analyze a concrete phenomenon or event, like I said the question you're asking is too broad.\n\n>It's intricacies like this that make me think that these analyses are way too vulgar; it seems obvious to me that there's a difference between owning a home and a car and a 401k, and owning a bunch of cheap Chinese clothes and toys.\n\nIs there? The real problem with third worldism is not the expectation that there will be no revolution in the first world (that much is obvious) but that there will be revolution in the third world. The globalization of manufacturing has not had that effect and the revolutions that have happened are on the older terrain of anti-colonialism and anti-feudalism. That is why the \"third worldists\" like Cope (before full blown fascism) and Lauesen have all become Dengists. That's the actual manifestation of third world politics in the era of multinational monopoly capitalism, at least if we remain in the terms of progressive national bourgeois revolutions surrounding the first world cities. The most useful intervention of MIM is the simple challenge: show me where the revolution is actually happening. The \"Maoist\" in this thread simply denies reality itself and reduces a century of failure to a lack of consciousness or a proper party. I don't think MIM closes the book on the issue but few are even willing to confront the challenge because of its terrifying implications. Surviving that will require acknowledging we're still looking for the proletariat of today because capitalism moved much faster than Marxist theory could keep up.",
                                            "score": 22,
                                            "replies": [
                                                {
                                                    "author": "Particular-Hunter586",
                                                    "body": "The question of “where is the third world revolution?” is one that has weighed at my mind, too. I’d dismissed it as a question of inexperience (I’m pretty young) and petit-bourgeois defeatism, and had soothed my fears by thinking of the Filipinos and the Indians, but at some point these dismissals stop being reassuring and start seeming as hollow as they clearly are. Is your claim, then, that “Marxism”, the science of making revolution as we understand it, has yet to catch up with the “Marxism” that determines how the world actually works?\n\n> the revolutions that have happened are on the older terrain of anti-colonialism and anti-feudalism.\n\nTo be sure I’m clear here, you’re talking about revolutions such as China’s, yeah? Is the idea behind this then that globalization has pushed capitalism so far beyond what the “great theorists” of Marxism ever supposed, to a point where revolutionary politics are impossible without a deeper understanding of the world of globalization? \n\n> That's the actual manifestation of third world politics in the era of multinational monopoly capitalism\n\nIf “the actual manifestation of third world politics” is the anti-proletarian falsehood of Dengism, what does that say about “third world politics” as a whole? ",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "smokeuptheweed9",
                                                            "body": ">Is your claim, then, that “Marxism”, the science of making revolution as we understand it, has yet to catch up with the “Marxism” that determines how the world actually works?\n\nThat's a good way to put it. Our situation is like the one Walter Benjamin faced: finding hope in the wreckage of history.\n\n>To be sure I’m clear here, you’re talking about revolutions such as China’s, yeah? \n\nI'm talking about the experience of China being applied to somewhere like Nepal. I was utterly convinced of the correctness of semi-feudalism as applied to India in the last thread on the subject. But the actual practice (inserting Maoist politics into the farmer's movement) is lacking. I'm not criticizing the CPI(Maoist), the level of repression there is extreme so there is only so much you can get through reporting and a real breakthrough will only come when such repression is no longer sustainable against widespread revolutionary power. But I actually wanted the person arguing for the development of rural capitalism in India to do a better job because the claim that the Indian farmers protesting are kulaks is the kind of bold provocation I like.\n\n>Is the idea behind this then that globalization has pushed capitalism so far beyond what the “great theorists” of Marxism ever supposed, to a point where revolutionary politics are impossible without a deeper understanding of the world of globalization? \n\nI would specify that Marx predicted it completely but that the level of specificity required to do politics is beyond merely rereading the classics. This is kind of what you're asking for in the OP. Marx even says that China's walls against free trade will be battered down in the Manifesto. But the specific evolution towards that event is both necessary to understand for politics and unpredictable.\n\n>If “the actual manifestation of third world politics” is the anti-proletarian falsehood of Dengism, what does that say about “third world politics” as a whole? \n\nI think it's reached the limit of its life cycle. Even Sam King's much better and more recent work seems unable to comprehend the real technological accomplishments of China in the last few years and any theory that takes wage differentials as the primary form of superexploitation won't last much longer against this phenomenon. Communists are right to assert the persistence of the nation-state as the foundation of capitalist accumulation and revolutionary politics. But it can also be misplaced, in pockets of China wages have already reached first world standards (if not the US, Spain or Taiwan). Comparing \"Chinese\" and \"American\" wages is an abstraction which can sometimes disguise more than it reveals.",
                                                            "score": 23,
                                                            "replies": [
                                                                {
                                                                    "author": "AltruisticTreat8675",
                                                                    "body": " > I think it's reached the limit of its life cycle\n\nI think the 2020-21 Thai students protests has finally nailed it in the coffin, if that's not clear to you then it's the Candlelight movement in Korea that ended up being absorbed into the system. There are holdouts like Bangladesh but I'm not too optimistic about it (and I admit I don't know much about Bangladesh). \n\n> Even Sam King's much better and more recent work seems unable to comprehend the real technological accomplishments of China\n\nI really think you should study Southeast Asia, in particular countries like Thailand or Malaysia where there's a general trend of stagnation and the decline of manufacturing (at least since 1997) followed by the \"rise\" of the Chinese workshop of the world and the political \"responses\" to them. If even South Korea is losing in competition to China, what are the hope for SE Asia? Obviously I second everything you said here.",
                                                                    "score": 15,
                                                                    "replies": [
                                                                        {
                                                                            "author": "smokeuptheweed9",
                                                                            "body": "Third worldism isn't actually new. It goes all the way back to the Algerian revolution, when it was asserted for the first time that the (French) working class was reactionary and the national liberation struggle didn't need them or was even against them. But this issue was sort of deferred, as Vietnam took the place of Algeria and made the problems of the latter go away thanks to the connections between the communist party of Vietnam and the socialist world, including western communist parties. It then became the cause celebre for the new communist movement whereas the uncomfortable history of Algeria was forgotten even in France and the reformism of the communist party was seen as primarily a political problem rather than an accurate reflection of the class interests of its base. The first thing the new left did in France was go back to the \"working class.\"  \n\nWhat is new is throwing off this baggage and returning to the initial problem of mass reformism and chauvanism and trying to find a materialist explanation (Sartre avoided it and turned commitment to Algeria as a moral issue). But it also contains the traces of the era that no longer make sense. The foreign policy of Maoist China wasn't actually different than the USSR until it became completely different in a bad way because the fundamental issue was still national liberation struggles and the communist orientation towards the nationalist bourgeoisie and colonized petty-bourgeoisie. Algeria was a challenge but it was only really the most radical expression of the general movement for decolonization and late development. Dengism is, among other things, an application of this logic to the present, with Prashad explicitly calling it a new non-aligned socialist movement (though he is fundamentally dishonest on this issue since there was a great struggle within that movement over the definition of socialism between Cuba, Yugoslavia, and the rest - it was not taken for granted or deferred).\n\nFormal \"third worldism\" came after May 68 and similar events of the time, where the student movement showed its strength and the workers showed passivity or even reaction (the \"hard hat riots\" in the US are an infamous inflection point) but never went back and engaged with the limits of the Algerian revolution itself (to be fair, at the time the military coup seemed to advance further towards \"socialism\" and anti-colonialism, it's only retroactively that the cracks are visible) nor did it find a real political practice to substitute for first worldism. Even the KAK relied on the PLFP to have something to do, when that party inevitably became irrelevant in the receding tide of anti-colonialism they had nothing to do (and Lauesen became a Dengist). And that was a fringe organization, we're the ones reconstructing some coherence out of this period based on innovative praxis rather than support or influence. Both the PLFP and KAK combined the anti-colonial nationalism of Algeria with the Marxism-Leninism of Cuba and Vietnam (with some Maoist references), it's only retroactively that the contradictions between them come back to haunt us (everyone liked the Cuban revolution, even Trots).\n\nSo it's no surprising such an old concept is showing its age. It is more the power to offend that makes it interesting rather than its completeness that makes \"third worldism\" so appealing.",
                                                                            "score": 17,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Particular-Hunter586",
                                                                                    "body": ">the initial problem of mass reformism and chauvanism\n\nBut mass reformism and chauvinism are problems not just in first world revolutionary movements, but in third world ones as well, aren't they? Reformism especially, one can look to Nepal and India (the CPI(Marxist), not the CPI(Maoist)) for examples of reformism far more immediately reactionary than the DSA ever has been.\n\nI think I need to study the history of non-communist revolutionary movements much more deeply before I can fully understand exactly the points you're making here, but this all makes sense.\n\n>The foreign policy of Maoist China wasn't actually different than the USSR until it became completely different in a bad way\n\nAre you talking about the alliance with the United States out of the misguided belief that social-fascist Russia was now the greatest threat to communism?",
                                                                                    "score": 12,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "smokeuptheweed9",
                                                                                            "body": "I think the CPIM has the appearance of being a mass reformist party but it actually has no mass basis. The substance of the Kerala welfare state, to the limited extent that it exists, is actually remittances from workers in the middle east. The state is just a parasite on this inter-personal wealth transfer. Land reform and industrial development, both the foundations for mass politics, were complete failures and Indian \"democracy\" is really just the same old system of landlords or bosses mobilizing votes in a system of patronage, whether the CPIM, INC, or BJP. This is important to understand because, unlike the US where the white majority has an autonomous hatred of the black population, attempts to put Indian politics on the basis of caste chauvanism have failed. Even Hindu fascism is formally against caste discrimination, and using Muslims as a scapegoat has been no more successful in overcoming the class struggle between the peasants and landlords.\n\nThe DSA is only interesting because of its success. It didn't have to advertise itself to Marxist-Leninists and even Maoists, they went to it of their own volition. The Maoist movement in Nepal has been an utter failure since its absorption into the state, either to accomplish basic democratic tasks or to create a stable political basis for reformism. \n\n>Are you talking about the alliance with the United States out of the misguided belief that social-fascist Russia was now the greatest threat to communism?\n\nI mean before that, when China and the USSR were attacking each other's foreign policy but doing the exact same thing in Vietnam. Before the turn towards the US, the most you could say was that Chinese aid came with less conditions and more little red books, but even then Cuba did the same thing with more commitment. Foreign policy was one of the areas where the cultural revolution had implications for thinking about politics in a new way but it was never actually put into practice. Part of this was the role of Zhou Enlai on the issue but the biggest part is that the ideas of Lin Baio, which inspired much of what we're discussing, got caught up in domestic political machinations.",
                                                                                            "score": 16,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Particular-Hunter586",
                                                                                                    "body": "I don’t know enough about either the state of affairs in India or Lin Biao to respond satisfactorily to this, but thanks for all your insight here.",
                                                                                                    "score": 8,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Particular-Hunter586",
                                                                    "body": ">any theory that takes wage differentials as the primary form of superexploitation won't last much longer against this phenomenon\n\nWhat other forms of superexploitation are there? Or are you positing that this is another open question that \"Marxism\" has yet to answer, due to a lack of practice?\n\nOne thing that third world politics has certainly lacked in answering, for me, is why exploited countries *also* turn towards social democracy. Explanations of why social democracy is a dead end that skip over Lenin v. Kautsky and Bernstein entirely, and instead justify the hatred for social democracy simply with \"it relies on exploited third-world labor\", have always seemed shallow. Though obviously the social democracy of the DSA is counterrevolutionary and chauvinistic in ways that, say, Nasserite social democracy might not be, and though it goes without saying that the exploitation of nations is the primary contradiction on a global scale, the failure of first-world \"first-worldist\" groups in *theory* combined with the failure of first-world \"third-worldist\" groups in *practice* has left a void that fetishization of modern China (or, in other cases, the DPRK or Vietnam, or for some \"anti-imperialists\" even Iran) has swooped in to fill, this sub has noted it well. \n\nBut that's less of what I'm wondering; rather, what are the tendencies that *led* to Nasser, Sankara, et. al.'s nationalist social democracies? In China it's obvious, since the GPCR laid out exactly what would lead to a capitalist counterrevolution and exactly what it would look like in action. But if the justification for social democracy in first-world countries is solely predicated on the labor aristocracy... why do nationalist and ostensibly \"ML\" revolutions devolve into social democracy in the third world, too?",
                                                                    "score": 13,
                                                                    "replies": [
                                                                        {
                                                                            "author": "smokeuptheweed9",
                                                                            "body": ">What other forms of superexploitation are there? \n\nAs Sam King points out, the fundamental means of superexploitation takes place in the production process itself based on one's relationship to monopoly capital. This is reflected in wage differentials but that is a secondary, empirical expression. King uses GDP-per-capita which, while also imperfect, is better than wages as a measure.\n\n>One thing that third world politics has certainly lacked in answering, for me, is why exploited countries also turn towards social democracy\n\nI think you're getting caught up in the contradictions of Dengism. I would not call Nasserism \"social democracy\" even if it gives the appearance of being a \"welfare state\". Its primary purpose is different as is its class basis. The closest equivalent in the first world would be Prussian or Japanese late development, with the maturity of imperialism making this a doomed path. The closest thing is the \"Pink Tide\" governments which do have the appearance of social democracy. But here the problem is the opposite: whereas before social democracy was defined too broadly, this defines it too narrowly. Social democracy at its height led to major restructuring of the capitalist West and a solid basis for the labor aristocracy as a political force. Lula or Chavez channeled the political rhetoric of social democracy (someone like Olof Palme or Andreas Papandreou) but have none of the accomplishments. Neoliberalism led to a restructuring of the French or British economy whereas the election of Bolsonaro has only political and rhetorical effects.\n\nNevertheless, the general point is correct. There is room for both reformist politics (at least in rhetoric) and fascist politics and this has a real effect in the political arena. Thaksin may have had little overall effect on the Thai economy but for communists he represented a major political force to be understood and reckoned with. My causal explanation, echoing u/AltruisticTreat8675, is that China has changed the terrain of global politics.",
                                                                            "score": 14,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Technical_Team_3182",
                                                                                    "body": "Sorry to interrupt the flow of the conversation, I just want to ask a question with regards to China’s role in the global economy in the next few decades. After Covid and the witness of the state coordination campaigns of China, there seems to have been a shift away from China due to lower “wage differentials” , rate of profits, or political instability with protectionist US. This week, the Gen Secretary of Vietnam visited US and Cuba, talked with corporates and Biden to increase cooperation of Vietnam. Vietnam desires for US to consider it a market economy and cooperate on the new semiconductor industry. Nevertheless, a contradiction is that China [1] will plan to use it, along with SEA neighbors, to “nearshore” manufacturing to maneuver the protectionist measures of US. Will the wage differentials in China hit the point where it’s no longer profitable, seeking a restructuring of the global economy away from China towards SEA or Latin America, or this is only temporary and it will be long until China ceases to be the dominant manufacturing factory of the world? Socialist “Revolution” seems far from imminent in SEA and more likely will be US neocolonialism which emerges victorious more than anything else. How much longer can the “spatial fix” continue and where are its next locations? \n\nIf the “spatial fix” can somehow temporarily replace China, “social democracy” will probably continue to be a dominant ideology if there is another commodity boom that comes from it. China also appears to be ramping up military spending so I’m not sure if that counts for anything either—maybe like a Brezhnevite stagnation in the economy.\n\n\n\n[1] https://www.nbcnews.com/news/amp/rcna172798",
                                                                                    "score": 12,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "kannadegurechaff",
                                                                            "body": ">One thing that third world politics has certainly lacked in answering, for me, is why exploited countries also turn towards social democracy. Explanations of why social democracy is a dead end that skip over Lenin v. Kautsky and Bernstein entirely, and instead justify the hatred for social democracy simply with \"it relies on exploited third-world labor\", have always seemed shallow.\n\nI once asked a similar question [in this thread](https://www.reddit.com/r/communism101/comments/188ee5c/how_socialdemocracy_works_in_non_imperialist/). Perhaps you'll find the answers useful.",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "theaceofshadows",
                                                                    "body": "> I was utterly convinced of the correctness of semi-feudalism as applied to India in the last thread on the subject. But the actual practice (inserting Maoist politics into the farmer's movement) is lacking. I'm not criticizing the CPI(Maoist), the level of repression there is extreme so there is only so much you can get through reporting and a real breakthrough will only come when such repression is no longer sustainable against widespread revolutionary power. But I actually wanted the person arguing for the development of rural capitalism in India to do a better job because the claim that the Indian farmers protesting are kulaks is the kind of bold provocation I like.\n\nThis is why I wanted the discussion to actually happen, though I was hoping for a more competent response from CLI cadre than the one that was received. I think the question of Maoists not participating in the farmer's protest has already been publicly answered, [given the status of Dr. Darshan Pal, convenor of the united front leading the farmer's protest in 2020-21.](https://www.ptinews.com/story/national/cpi-maoist-expels-farmer-leader-darshan-pal-for-naxal-links/1028089)\n\nThis is a different conversation than what is going on but the farmer's movement should really be looked at in light of the internal line struggle ongoing within the united front of farmers. Unsurprisingly, the revisionism of Darshan Pal and his fellows is actually linked to the question of agrarian capitalism vs semi-feudalism, with him ultimately holding the belief that Punjab, Haryana and Wester Uttar Pradesh show signs of capitalist development (while the rest of the country remains semi-feudal). How would this justify aligning with what would be kulaks and landlords? They had no clarity during the course of the 2020 Farmer's Protest, their organizations were largely comprised of rich peasants. The internal struggle culminated with the 26th January 2021 republic day incident when the militant formations (including the Khalistanis) within the farmer's movement broke from the rest of contingent and stormed the red fort. Pal divided the revolutionary camp with his eclectic position and fear of peasant militancy. All of this has culminated with the letter I shared above, the splitting of the united front itself into SKM-Political (the agrarian capitalism status quo) and SKM-Non Political and the formation of the Kisan Mazdoor Morcha, which is a separate united front mobilizing organizations of landless peasants and agricultural labourers. SKM-NP and KMM are leading the 2023-24 farmer's movement. Darshan Pal's camp of neo-revisionists though, is a curious case in that they have ultimately aligned with SKM-P, they have ultimately chosen inaction over a serious exposition of whatever their line is.",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sea_Till9977",
                                                                            "body": "Is the idea that Indian farmers in the protest are kulaks a bold provocation, or challenge 'intuition'/'common sense'? For a learning Marxist like me and a petty-bourgeois Indian, the surface level analysis was that Indian farmer protest is upper caste in character and composition, which was good excuse for me to not even read much about it in depth. The Nazariya article challenged that thought and also made me realise I fully didn't even understand what a New Democratic Revolution really is until few weeks ago, despite being a Maoist this whole time.\n\nI remember a member of Trotskyist party (a useless embarrassing one) in one of the imperialist nations, asking me about the farmers protest in India. My reply was that it is not what it seems, and isn't some sort of mass upheaval of the poor peasants. Of course it is true, but it is an incomplete analysis. I did say something correct but not fully intentionally. Funnily, my answer was considered the unconventional, interesting answer. In response, the person who asked the question told me how a lot of the protests and mass movements that we read about in the news are actually petty-bourgeois in character (if i remember their words correctly).  I hope you get what I mean, im not able to fully explain it in words.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "theaceofshadows",
                                                                                    "body": "The entire left contingent threw its back behind the farmers protests. Most progressive intellectuals (apart from a cohort of the Ambedkarites) also saw it correct to back the movement. To reject the movement entirely is interesting for a left political party, but it isn't surprising for the petite bourgeoisie, particularly that section of the petite bourgeoisie which has experienced a degree of capitalist penetration and/or experiencing distorted capitalist relations. This is a small section, one highly detached from the rest of the petite bourgeoisie and the masses, but the CLI ML is a party that caters to this section of society and is a representative of its politics. Hence its dreams and fantasies of capitalism in India. So it isn't surprising if you felt that what CLI ML and its fronts not surprising, since Reddit's usage in India comes predominantly from this section of Indian society. Re-reading things from the Kisan Andolan after further politicisation can quickly change the outlook of people from this class background.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Autrevml1936",
                                                            "body": "> Is your claim, then, that “Marxism”, the science of making revolution as we understand it, has yet to catch up with the “Marxism” that determines how the world actually works?\n\n\nI've been reading Cornforths work on Marxism and Dialectical Materialism(before his metaphysical turn) and there's this point that Stalin made in '39 that's quoted where Stalin says that he stands for \"Creative Marxism\" as opposed to \"Dogmatic Marxism.\" And in expanding upon this Cornforth brings a few more quotes. Which seems extremely similar.\n\n\n> “There is dogmatic Marxism and creative Marxism. I stand by\nthe latter,” said Stalin.\n> Creative Marxism:\n> “Concentrates its attention upon... the path and means of realizing Marxism for various situations, changing the path and means when the situation changes.... It takes its directives and guiding lines not from historical analogies and parallels, but from the study of surrounding conditions. In its activities it relies, not on quotations and aphorisms but on practical experience, testing every step it takes by experience, learning from its mistakes and teaching others to build a new life.”\n\n\nCould it be said that modern Marxism, so called Maoism \"Third-Worldism,\" has become overly dogmatic and reliant upon statistics and formulas rather than investigating the conditions of the world today? investigating the conditions of oppressed and oppressor Nations in the US, conditions of advanced Imperialist countries and oppressed Nations, and the contradictions within these Nations, homeless Euro-Amerikans living in tent slums and Euro-Amerikan Silicon Valley software programmers, Black people living forever in prison and Compradors like Obama, etc. etc?",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Particular-Hunter586",
                                                                    "body": "Ideally any communist formation would constantly be investigating all these things, and then applying them in practice. Today, in the imperial core, it feels like serious groups either theorycraft (to steal a crude term from a hobby subculture) about these conditions, a laser focus on social investigation, but don’t actually apply any of those findings in their practical work; or dogmatically stick to understandings of what might have stemmed from social analysis 30 or 40 years ago, but at least make the effort of applying these understandings in their work. (If it is clear which 2 groups I’m talking about here, well, it’s because for all their errors they both seem to be at the forefront of seriousness and antirevisionism; if not, that’s fine, because they’re merely symptoms of a larger problem regarding the dialectical relation between theory and practice going ignored.)",
                                                                    "score": 10,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "dovhthered",
                            "body": ">But what does that imply for the extremely numerically significant parts of New Afrika, especially the urban ones, who, yes, are making superprofits at their minimum wage jobs or in the underground economy, but nevertheless can't hold down a home, even a rented one, can't afford a working car, and are seeing their prospects for the future stolen away by deindustrialization and the dispossession caused by the anarchic motions of capital?\n\nI think this is the point where we need to start the analysis and question whether this is enough to be considered as revolutionary as the \"traditional\" proletariat. People in this subreddit are quick to compare everything to Pakistani and Bangladeshi sweatshop workers because it's easy to identify them as extremely exploited and oppressed, and by consequence, revolutionary, since it’s obvious they have \"nothing to lose but their chains.\"\n\nAnother aspect that might be worth investigating (though I know you'd like solutions over further investigations) is comparing the living conditions of the Amerikan homeless population. To my knowledge, there is a significant number of people living in tents or in their cars, and one might argue that they have better living conditions than the proletariat of colonies and semi-colonies. \n\nIs it useful to compare whether someone is more or less exploited? In another thread, we were arguing about this, and /u/geisttransformation1 was arguing that it’s not:\n>It's not useful to compare who is more exploited, a person can only be exploited or not exploited; is a Syrian immigrant in Sweden less exploited than the average worker in Ghana and is that an important determination to make as part of evaluating their revolutionary consciousness?\n\nI'd argue that without this comparison, we end up defending the existence of a white proletariat in Amerika.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Particular-Hunter586",
                                    "body": "> People in this subreddit are quick to compare everything to Pakistani and Bangladeshi sweatshop workers because it's easy to identify them as extremely exploited and oppressed, and by consequence, revolutionary, since it’s obvious they have \"nothing to lose but their chains.\"  \n\nBut the (not vast, but nevertheless) majority of the people of the world fall somewhere between “first-world parasite” and “Bangladeshi sweatshop worker”. And I’d go so far as to say that the majority of the people of the world fall somewhere between “first-world parasite” and “first-world chronically homeless living in a tent slum”, too, though maybe that’s just my chauvinism talking.   \n\n > Is it useful to compare whether someone is more or less exploited?   \n\nOf course it is, for specific questions of line and strategy. Is it useful to draw some arbitrary line after which people who are “less exploited” are considered counterrevolutionary rather than revolutionary? Maybe sometimes; no doubt it’s proven useful in the first world, if nothing else, then for evaluating failures. But I can’t imagine it’s useful to do crude comparisons of these questions without doing deep investigations into the history and radical currents among the groups. There’s a reason that New Afrikans, for example, demonstrate a level of militancy and organization and radicalism that the “more-exploited” illegal migrants they work alongside in gig work don’t. (And, again at risk of showing my ass and being rightfully criticized — more than Bangladeshi and Pakistani sweatshop workers, too, both at the moment and historically.)",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Drevil335",
                                            "body": "Bangladeshi sweatshop proletarians have a strong tradition of resistance to capital: in fact, there's a rather robust strike wave mobilizing throughout textile factories in Bangladesh as we speak. I would hardly call them any less radical or militant than New Afrikans; in fact, they're incomparably more so than the somewhat significant firmly petty-bourgeois, bought-off section of the New Afrikan nation.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Particular-Hunter586",
                                                    "body": "Of course there's been relatively radical resistance in the form of strikes, and that's commendable and points to the inklings of class consciousness. But unlike in New Afrika, where there's been decades of active armed struggle and production of radical theory and explicit Maoist organizations garnering broad bases of popular support, have such things happened in Bangladesh? If so, if there have been any advances of revolutionary practice at the levels of the Black Panthers, the BLA, or even broader anti-imperialist New Afrikan nationalism, I'll eat my words here.\n\n>they're incomparably more so than the somewhat significant firmly petty-bourgeois, bought-off section of the New Afrikan nation.\n\nNow this is comparing apples to oranges, of course Bangladeshi sweatshop workers are more radical than the bought-off section of the New Afrikan nation. The question is, how much of the New Afrikan nation is bought off, how are their conditions shifting, and why do even the New Afrikans enjoying a standard of living far above the Bangladeshi sweatshop workers demonstrate consistent and remarkable resistance to the Amerikan empire? (If your claim is that they *don't* in fact demonstrate that resistance, well that's one of those provocative points that smokeuptheweed was extolling earlier in the thread, so I'l happily hear you out; perhaps the Panthers, the BLA, and the various Black nationalist movements described in *Settlers* weren't truly as radical as they seemed? Or perhaps the state has gotten a lot better at buying off New Afrikans?)",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Drevil335",
                                                            "body": "I'm not particularly well-informed about Bangladesh, but I do think that the militance of Bangladeshi textile proletarians is remarkable; there was an even larger mobilization last year, and strike waves in most years since at least 2006. I don't know nearly enough about Bangladeshi conditions to say why textile workers haven't been organized yet along Maoist lines, but given how radical they already are, there is clearly immense potential for them to be mobilized in a revolutionary manner. I don't think the fact that they haven't yet done so, and that their demands are as yet mostly economic rather than political, speaks to any deficiency in radical potential as compared to New Afrika.\n\nRegarding New Afrika, you're asking the critical questions that, admittedly rather mechanically, I've skirted around. Cope's analysis of New Afrikan integration into the labor aristocracy is definitely reductive: since the national question is the principle contradiction in occupied Turtle Island, it's certainly safe to say that national position determines revolutionary consciousness in this country more than class position, though the latter is far from irrelevent. This interplay between national and class position can clearly be seen in the consciousness of the New Afrikan petty-bourgeoisie, which has become more prominent since the 60s. They are a class which reaps immense super-profits from imperialism, though far more precariously than the settler petty-bourgeoisie, and is still subject to national oppression. Their national oppression begets a demand for a change to the current state of things which is certainly in contrast to the political consciousness of most settlers (who are perfectly content with the current structure of global imperialism, their political consciousness being centered around the tiniest of localized ripples within that structure), but at the same time, their reactionary class position prevents their national consciousness from becoming revolutionary. The solution for them, rather than ending their national oppression through ending settler-colonialism and imperialism, is instead more fully integrating into imperialist parasitism through \"reparations\". [This Vox article](https://www.vox.com/the-goods/22245223/black-middle-class-racism-reparations) is immensely insightful regarding this topic, actually because of its liberalism rather than despite it.\n\nThese people, however, definitely are not representative of the whole New Afrikan nation, which remains far poorer than the Settler nation, even if that poverty is wealth compared to the conditions of the third world proletariat. National oppression, however, is determinate, and that national oppression is particularly intense, with over 10% of New Afrikan men between ages 20 and 34 being imprisoned by the state. While all New Afrikans are more likely to be imprisoned than settlers, poorer New Afrikans are more likely to be imprisoned than petty-bourgeois New Afrikans, and this imprisonment is more likely to erode their already precarious economic position, not to mention the psychological effects on children whose parents are snatched away by the state (if they themselves aren't the ones being arrested, of course). All of this is accentuated by the fact that the police (or angry white people with guns and ropes, which basically play the role of the police) periodically brutalize and murder New Afrikan folk in the street or in their homes. It's interesting to note that, after the end of the Black liberation movement in the 80s, New Afrikan resistance against the state has mostly been in the heels of these murders, most recently after the murder of George Floyd in 2020. Of course, the Maoist influence on these movements has been basically non-existent (a massive contrast, as you note, to the Black Panthers or BLA), and I'm not entirely sure why (an immediate guess, of course, is the absence, within the on-going global retreat of communism, of a revolutionary figure like Mao Zedong to give inspiration to the movement), but that doesn't negate the radical significance of these movements, something which has certainly unnerved the white people and imperialists trying to co-opt them. Of course, they are rather spontaneous expressions of rage and resistance toward the brutal white-supremacist state, which, however inspiring and justified, has no real potential to bring an end to that state; this is a limitation that will certainly need to be addressed in the future. I'm definitely not saying that the New Afrikan nation no longer has revolutionary potential, but cooptation and the end of organized liberation struggle has certainly altered the situation significantly from the 60s and 70s, especially with the further development of a black petty-bourgeoisie which is nationally oppressed but with a class position that inclines them to social fascism rather than revolution. This is something that I urgently need to do significantly more investigation about, of the social as well as literary kind, because its a critical aspect of the strategic situation in the US settler-colony.",
                                                            "score": 11,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "DaalKulak",
                                                            "body": ">If so, if there have been any advances of revolutionary practice at the levels of the Black Panthers, the BLA, or even broader anti-imperialist New Afrikan nationalism, I'll eat my words here.\n\nPurba Banglar Sarbahara Party, or Proletarian Party of East Bengal, has a history dating back to war of 1971 and continues to operate today. The PBSP has a history(and still continues to some extent) of armed struggle alongside other Marxist-Leninist and Maoist parties in Bangladesh. The fact that this can be found from a few simple google searches and such bold claims are made is frankly ridiculous. It negates documented history of decades of militant armed struggle just to prove point about New Afrikans?\n\nRead here for further context: [https://www.bannedthought.net/Bangladesh/PBSP-General/BriefHistoryOfPurboBanglarSharboharaParty-2013.pdf](https://www.bannedthought.net/Bangladesh/PBSP-General/BriefHistoryOfPurboBanglarSharboharaParty-2013.pdf)\n\nThe sweatshops that are talked about are also relatively new, emerging with \"globalization\". It is unfair to talk about a relatively new section of the proletariat and compare it to history New Afrikan classes with longer time-span of history when imperialism was on it's backfoot. Even so, there has most likely been some organization by Maoist parties, even if small. For sure in past the proletariat in these countries definitely were organized with developed theory to back it up. You can simply look up Siraj Sikder and find some of the class analysis back then. Pakistan has it's own history of struggle as well, and so do countries all across the world.\n\nTagging u/Drevil335",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Particular-Hunter586",
                                                                    "body": "That’s entirely true, and that was a really dumb thing for me to say. I did do a cursory search on armed struggle and Maoism in Bangladesh and didn’t find much of anything (the bannedthought page didn’t show up for whatever reason), but I should’ve investigated further before jumping to that conclusion. And the point about sweatshops being relatively new is a good one. I should’ve looked more into it before trying to draw conclusions from a lack of knowledge.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DaalKulak",
                                                                            "body": "Well, the first result for me is, \"Maoist insurgency in Bangladesh\" but it's not that important anyway. The real point is mostly the lack of serious investigation before making bold claims(even remarking that it could be chauvinism without care).\n\nFor this discussion though, I think the modern sweatshops being new is important, since they are actually directly related to the shift of manufacturing away from internal semi-colonies to the Third World. It's an imperialist strategy to undermine revolutionary struggle in both conditions, and to some extent it worked, but moreso in internal semi-colonies. Anyway, in the case of a NDR, the main force would be the peasantry led by the proletariat, so the bulk of the struggle would not take place in the cities, but the rural areas and slums(as the PCP had done). Not sure about the relationship between the emergence of sweatshops and slums, but my point is that even with armed struggle the peasantry would be the main force that's organized.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoAcanthisitta3968",
            "body": "If you have no choice but to sell your labor-power for a wage, you are a proletarian. It is simply a description of the relationship to production, not a moral or political assessment. It is not the same thing as saying they have a proletarian worldview - something that has to be forged through prolonged ideological struggle and practical experience. \n\nMany communists in the US want to define away the US proletariat via surplus-value alchemies, or by pointing out various opportunisms or reactionary views held by this or that strata. The truth that the proletariat exists in the US, but is politically weak and dominated with bourgeois ideology, is painful to people who imagine a revolution to be a year or two around the corner. But that is the truth, and it doesn’t change at all the necessity of organizing the proletarians and developing them into the class-conscious proletariat that they must be.",
            "score": -10,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "It's fine if you don't believe the labor aristocracy makes sense as a concept but don't sell it as common sense compared to \"alchemies.\" The concept has a long pedigree and it's not really interesting to explain its basic foundations every single time it is brought up. The OP is asking about the extension of the concept after Lenin and its historical applications, you haven't added anything by defining it away with a crude definition that begs the question (what does it mean to have \"no choice?\" That is exactly what is being discussed except you have turned it into a subjective decision rather than a position in the totality of capitalist reproduction).",
                    "score": 25,
                    "replies": [
                        {
                            "author": "NoAcanthisitta3968",
                            "body": "My position is that the labor aristocracy is a political phenomenon within the proletariat, not a separate class. I think OP, like Sakai, is getting themselves is into a tangled mess by disqualifying huge swaths of wage-laborers from the ‘proletariat, because of their subjectivities and ‘class stand’ (which seemingly means that they are dominated by bourgeois ideology, hardly surprising in a bourgeois country with no CP)\n\n“No choice” means you have no other way besides wage-labor of reproducing your existence within the structure of social production (leaving to one side lumpen parasitism, which is outside the structure of production). You do not own land (or enough to reproduce yourself), you do not own means of production, you only own your labor-power which you sell to the capitalist. There is more nuance to it than that - for example, a doctor may not possess land or means of production but plays a petty bourgeois role in social reproduction, as an overseer within a capitalist hospital. But the compulsion towards wage-labor is the main aspect",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "smokeuptheweed9",
                                    "body": ">There is more nuance to it than that - for example, a doctor may not possess land or means of production but plays a petty bourgeois role in social reproduction, as an overseer within a capitalist hospital. \n\nThat's not \"nuance\" that's literally what is being defined. We simply have a concept of \"social reproduction\" which corresponds to the reality of global monopoly capitalism.\n\n>I think OP, like Sakai, is getting themselves is into a tangled mess by disqualifying huge swaths of wage-laborers from the ‘proletariat, because of their subjectivities and ‘class stand’\n\nNeither Sakai nor the OP are doing this. \n\n>My position is that the labor aristocracy is a political phenomenon within the proletariat, not a separate class\n\nThat statement is meaningless since an axiom of Marxism is that superstructural phenomena like politics and culture have material explanations. As I already said, you've simply explained the concept as subjective (the domination of bourgeois ideology) and haven't engaged with Lenin's concept of bribery at all.",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}