{
    "title": "MLs and Maoists, do you think Fundamentals of Marxism Leninism manual is an ok source of theory?",
    "author": "Dirt-surfer",
    "subreddit": "communism",
    "rank": 244,
    "score": 8,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/communism/comments/1gnxke3/mls_and_maoists_do_you_think_fundamentals_of/",
    "id": "1gnxke3",
    "selftext": "[https://www.marxists.org/reference/archive/stalin/works/fundamentals-marxism-leninism.pdf](https://www.marxists.org/reference/archive/stalin/works/fundamentals-marxism-leninism.pdf)\n\nIt was written during krushchovs time towards the end, but what ive read seems to be mostly okay\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I can't comment on that specifically, but I guess it depends on what you're wanting to learn about. Leninism specifically? As a Maoist, I'd say Stalin's \"The Foundations of Leninism\" is really good. There's free versions on marxists.org and marx2mao.com, and you can get a paperback version from Foreign Languages Press (Paris) or get their PDF version for free. \n\n\nI will say though I'd be cautious of things about Leninism post-Stalin since there was such a heavy revisionist trend. I'm sure there's still valuable insight in it, but probably nothing I couldn't read in sources I'm more confident in lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "SuccessfulPlant2908",
            "body": "Yes it's a good source from what I can tell so far. I've been reading and taking notes for a few days now. Got my physical copy on New Outlook Publishers for like $13 ish",
            "score": 1,
            "replies": []
        }
    ]
}