{
    "title": "Finding it hard to talk about Puerto Rico",
    "author": "NoTouch5936",
    "subreddit": "communism",
    "rank": 230,
    "score": 114,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/communism/comments/1gu8jdy/finding_it_hard_to_talk_about_puerto_rico/",
    "id": "1gu8jdy",
    "selftext": "My family is Puerto Rican, and as a Marxist, I support Puerto Rican independence. My family is fine with this view, but I often struggle to discuss Puerto Rico with others, even those who consider themselves “left leaning”. When I explain my support for independence, they usually counter by saying, “Most Puerto Ricans don’t agree,” as if that invalidates my opinion. This response completely ignores over a century of American influence and propaganda, as well as the brutal crackdowns on the independence movement in the 20th century (Look up the Ponce Massacre).\n\nIt’s frustrating because their argument often boils down to “Listen to Puerto Ricans!”, as though that’s the only factor worth considering (Not to mention most Puerto Ricans don’t exactly support statehood, either. Besides, turnout in the referendums are low.) This is my main issue with the liberal tendency to believe that if a group doesn’t seem to want something for themselves, it automatically means that stance is right. Of course, we should listen to oppressed people, but life is complex, and there are often external reasons as to why someone might not support their own liberation. For example, most of the working class isn’t Marxist, but that doesn’t mean Marxism is invalid. I see this kind of thinking mostly applied to people of color or non-Western nations, as Americans, particularly white Americans, often don’t bother to learn about other countries’ histories, even when the U.S. has played a significant role. This is why I don’t agree with “just listen to x group”; it oversimplifies things and avoids a real understanding of the issue.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "liewchi_wu888",
            "body": "We should also be cognizant that when liberals and \"left leaning\" settlers say \"Listen to X voice\", the voices they raise are always the most tepid and moderate of the comprador, the type that would provide a safe, \"reasonable\" critique of the current status quo, but will always moderate it to some tiny reform so as to not hurt the liberal settler's delicate sensibility.",
            "score": 65,
            "replies": []
        },
        {
            "author": "TechWormBoom",
            "body": "As a Puerto Rican Marxist myself, I understand what you mean. My family tends to also accept the liberal framework more although they understand what I am saying and don't try to call demean me personally. \n\nWhat I tend to emphasize is that the colonial relationship between the United States and Puerto Rico has led to the public consciousness being shaped by the United States. Puerto Ricans do not remember the Ponce Massacre. My own father who is a liberal was the one who taught me about Pedro Albizu Campos and other socialist figures in PR history. Yet they aren't able to recognize themselves who crushed those leftwing movements. Liberals don't understand that these referendums are heavily influenced by U.S. interests and economic pressures. I tend to emphasize that becoming a U.S. state will not help PR. You are already watching wealthy mainlanders invest in real estate and displace local Puerto Ricans. My family always criticizes that the local government never does anything but they don't understand how little control the governor actually has. Puerto Rico is a prime example of a neo-colony. We have the illusion of democracy. PR is just a neoliberal tax haven for wealthy people.",
            "score": 28,
            "replies": []
        },
        {
            "author": "IncompetentFoliage",
            "body": "I don't know much about Puerto Rico so take this for what it's worth.  But do you think that Puerto Rican workers who oppose independence are being opportunist and looking for crumbs from the spoils of imperialism rather than pursuing their essential long-term class interest?  The same way how proletarians may opportunistically avoid rocking the boat at work or become scabs rather than risking their jobs.  I just think this\n\n>This response completely ignores over a century of American influence and propaganda\n\nplaces too much emphasis on subjective factors.",
            "score": 14,
            "replies": [
                {
                    "author": "NoTouch5936",
                    "body": "Absolutely, but it’s also true that many people, including Puerto Ricans themselves, are unaware of the recent history between the US and Puerto Rico. As someone mentioned earlier, most young Puerto Ricans don’t even know about the Ponce Massacre. It’s a combination of both.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Desperate-Body3938",
            "body": "I vehemently support Puerto Rican independence 100%.\n\nThe people of Puerto Rico have been under the boot of US imperialism since 1898. The United States has destroyed Puerto Rico for many years now. Everything is automated. They don't grow as much sugar cane as they use to. The United States destroyed all the manual labor from cutting sugar cane to having it mechanically removed from fields.  The cost of living is very high in Puerto Rico. Many Puerto Ricans came to the US to find work and better opportunities only to discover racism and oppression here in the United States. \n\nPuerto Rico would be better off free and independent from US imperialism and colonialism. The richest people in the world has brought up a lot of land in Puerto Rico. The people who support Puerto Rico becoming a state of the US are voting against their own interests and people. \n\n¡Que Viva Puerto Rico Libre Y Socialista!",
            "score": 8,
            "replies": []
        },
        {
            "author": "None",
            "body": "There were very legitimate criticisms that needed to be made about “classical” epistemology and belief formation/knowledge production. The traditional model ignored the social embeddedness of people and posed itself as class/race/gender etc… neutral while fully working within the bounds of the hegemonic ideology of a given era/region. But a crude standpoint epistemology, where the mere possession of a given identity confers perfect knowledge about anything and everything pertaining to that identity is clearly an overreaction and completely unscientific. There is still a role for expertise and investigation in forming knowledge, not to mention that this sort of standpoint epistemology is self defeating; as soon as two people who share an identity disagree, how is this adjudicated according to this viewpoint?",
            "score": 5,
            "replies": []
        },
        {
            "author": "the_ironic_curtain",
            "body": "I'm willing to bet that some of these same people believe Hong Kong should be independent from China, or otherwise support an independence movement that lacks popular support. This reveals that we make choices of what to support not based on majoritarianism but based on what we think is right. \n\nThat said, the reason you want Puerto Rican independence (I assume) is because of its exploitative relationship with empire. I think it can be helpful to push at the contradictions present in the ground truths instead of jumping to high level conclusions. Outlining what would be fair for the people of Puerto Rico, and how it is antithetical to US imperial interests to provide that, could be a more constructive starting point for why you believe independence is ultimately necessary.",
            "score": 5,
            "replies": []
        },
        {
            "author": "moleman92107",
            "body": "Are we even sure “most Puerto Ricans don’t agree?” All the referendums have offered multiple options, many independence voters abstain out of protest, and those who want statehood are delusional thinking any Congress in the next few decades will change their mind to admit Puerto Rico. Clearly the status quo is shit, but I don’t think we can accurately say what most Puerto Ricans want.",
            "score": 4,
            "replies": [
                {
                    "author": "NoTouch5936",
                    "body": "I wouldn’t say most Puerto Ricans support independence, but I also wouldn’t say most support statehood either. Many people don’t have strong opinions on the matter. That said, independence is definitely gaining traction. In the most recent referendum, it received 30% of the votes! A historic number given how many typically abstain from voting. A growing number of young Puerto Ricans are starting to back independence, a movement once thought to be all but dead on the island. Even high profile figures like Bad Bunny have begun criticizing the PNP and pro-statehood factions though to be fair, I’m not sure if he’s explicitly endorsed independence",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lardlad95",
            "body": "Ask them anything else about Puerto Rican history or politics, and they'll stutter and mumble until it becomes apparent that they only want statehood for PR as a cynical ploy to beat Republicans. \n\nThey don't actually care about Puerto Rico and they'd be ecstatic if it turned into another Hawaii. \n\nAs a side note on the family thing. My mom was a Black Panther, but my dad is fairly neutral on politics...except when it comes to Puerto Rican independence. Hell, he was the one who gave me my copy of War on All Puerto Ricans.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Last_Tarrasque",
            "body": "This isn't exactly about what you said but may I recommend this article by The Masses: [https://the-masses.org/2024/10/17/boriken-liberation-front-commemorates-the-anniversary-of-el-grito-de-lares/](https://the-masses.org/2024/10/17/boriken-liberation-front-commemorates-the-anniversary-of-el-grito-de-lares/)",
            "score": 2,
            "replies": []
        }
    ]
}