{
    "title": "Divisions within the Labor Aristocracy?",
    "author": "SheikhBedreddin",
    "subreddit": "communism",
    "rank": 217,
    "score": 16,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/communism/comments/1gy59vq/divisions_within_the_labor_aristocracy/",
    "id": "1gy59vq",
    "selftext": "It seems like much of the population in the US is made up of labor aristocrats, but also in my personal experience there seems to be a fair amount of room for labor aristocrats to struggle against each other.\n\nPart-timers at UPS seem like a decent example, though I don’t have any direct experience with them. Is there any historical precedent for contradictions among Labor Aristocrats being turned into an out-and-out battle?\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokeuptheweed9",
            "body": ">Is there any historical precedent for contradictions among Labor Aristocrats being turned into an out-and-out battle?\n\nWhat do you mean by \"out-and-out battle?\" Israel is not devoid of political struggle. Neither was apartheid-era South Africa. But these are not struggles that communists are particularly interested in. Even moving beyond social fascist politics among whites, are communists more interested in political struggles between \"colored\" people and whites in SA? Or Ashkenazi and Mizrahi Jews in Israel? The record is dismal and one has to question why such peripheral, reformist struggles get so much attention over the much broader and more obviously revolutionary national liberation struggle. \n\nThe answer is, in this framing, we are the \"colored\" people, those who have been driven towards radical politics because we are excluded in some way from normative class reproduction but are not organically linked to the much larger struggle that conditions our lives and lurks behind the otherwise minor threat we pose. At least within Amerikan borders, the demographics are not as favorable to national liberation as in SA (though our situation is not that different from Israel). More fundamentally, our apartheid borders are the global system of national borders itself (without minimizing the specific nature of Amerikan internal apartheid and national oppression), meaning a \"native republic\" thesis is not obvious and there are no reformist solutions to apartheid. But demographics are irrelevant to taking a principled line since our goal is to redefine them until a revolutionary subject emerges, not take bourgeois sociology at face value. \n\nI think the term \"crypto-Trotskytist\" is useful for so-called \"anti-revisionist\" politics that are primarily concerned with the labor aristocracy, since in South African this explicitly fell on racial lines:\n\n>Groups in South Africa that adhered to the International Left Opposition were always minuscule and poverty stricken. There were only branches in Cape Town and Johannesburg, with a handful of supporters in Durban and Port Elizabeth. This was not very different from the spread of the Communist Party: it reflected the sparseness of population and the siting of transport, colleges and industry. The different social structures of the provinces inevitably affected the perceptions and activities of the groups; they had to find their constituents from the local population and had to advance ideas that would get a response.\n\nhttps://www.sahistory.org.za/archive/trotskyist-groups-south-africa-retrospective-view-baruch-hirson-encyclopedia-trotskyism\n\nWhereas the communist party fused with the national liberation movement, the most important result for Trotskyism was\n\n>the multiracialist, Trotskyist Unity Movement which, in large numbers, dominated Coloured politics in the Western Cape.\n\nhttps://www.scielo.org.za/scielo.php?script=sci_arttext&pid=S0018-229X2010000200022\n\nYou can read more about it here (from an extremely biased, racist Trot)\n\nhttps://www.sahistory.org.za/article/non-european-unity-movement-neum\n\n>The basis for the programme of the NEUM was conceived within the ranks of the Workers Party of South Africa (WPSA), a small group of Cape Town based Trotskyists who stressed the centrality of the land question and the demand for the vote in their programme...\n\n>The WPSA was a Trotskyist organisation and many of the points in its programme were similar to that of other anti-Stalinist, socialist, groups. It attacked international finance capitalism, warned of an impending imperialist war, condemned fascism, and so on. In analysing South Africa the WPSA tried to break new ground, partly to condemn the Comintern instruction that the CPSA work for a 'Black Republic', a slogan that the WPSA found repugnant.\n\n>The WPSA programme commenced with an account of land possession in South Africa and pointed to the concentration of land holding in the hands of big capital. The vast majority of farmers, particularly African cultivators, owned little land. Consequently the programme writers concluded that the central question in the country was the land question, which was 'the alpha and omega', the axis around which the revolution in South Africa would revolve. They called on the white workers to support the black peasants in their demands if they were to have any stake in a transformed society, but gave little attention to the black workers, viewing them mainly as peasants who worked temporarily in the mines.\n\n>The WPSA also accepted the criticism [of Trotsky] that their rejection of the Black Republic slogan had been a polemical exaggeration arising from their criticism of the Comintern. But this too did not lead to any changes: the Black Republic slogan was not used in WPSA propaganda nor is it certain that this slogan ever persuaded members of the WPSA to concentrate their work in the nationalist movement...\n\n>They did not appeal to pan-Africanism, to a glorification of blackness; they did not discuss problems of language, or of common nationality, because these were not issues that were thought to bear on the future struggle.\n\nDo not be confused by the \"land question,\" without national liberation this was just a reflection of petty-bourgeoisie ambition to land ownership and intellectual leadership of the masses \n\n>The [NEUM's 10-point] programme (in its expanded form)... avoided all the questions of how the new democratic state was to be brought into existence and, consequently, how the land would be redivided. But, in fact, that was not the crucial question that had to be posed at the time. If the movement was serious in its intent it had to send its organisers across the country to speak to those 'working the land' and provide tactics for opposing existing land legislation. Except for one corner of the eastern Cape this was never done. Point 7 remained abstract and academic without organisational content. Not unnaturally this was eventually one of the points on which the NEUM split in 1958 - Tabata saying that land could be bought, Kies and others claiming that there could be no private property in land.\n\nThe rest of the program being generic reformist demands. Notice that the practical effect of ignoring black national liberation was reformist politics within the intermediate colored strata despite Trotsky's own criticism of \"Trotskyism\" in practice. If you absolutely refuse to take liberalism in Israel seriously, South Africa is the next best case study for politics within a settler context\n\nhttps://www.google.com/books/edition/Not_White_Enough_Not_Black_Enough/qLw8KzRbRdQC?hl=en&gbpv=1&printsec=frontcover\n\nThis book has a much better discussion of the NEUM movement. Its goal is to understand why colored people became the bedrock of the Democratic Alliance despite their racial oppression. Though since the American \"left\" mostly corresponds to relatively disenfranchised \"working class\" whites, this book is probably more relevant to understanding the mainstream of labor aristocratic social fascism rather than the \"communist/colored\" fringe\n\nhttps://theconversation.com/ordinary-white-south-africans-and-apartheid-bound-to-a-racist-system-they-helped-prop-up-232774\n\n>the history of “ordinary” whites shows that, from its early months in power, the state first sharpened its social engineering methods on whites it considered “problematic”. Drunks; chronically idle and itinerant men; those employed in jobs positioned on the same levels as Blacks.\n\nAll political efforts oriented around these \"problematic\" whites obviously failed except to advance the relative position of \"working class\" whites. But that doesn't mean their struggles were fake, you have to accept that taking a principled position means you will not always be involved with what appears to be \"possible\" because it is legal and corresponds to ideology of the status-quo.",
            "score": 17,
            "replies": [
                {
                    "author": "SheikhBedreddin",
                    "body": "I might be misunderstanding you, but I think that you might be misunderstanding me. \n\n> Even moving beyond social fascist struggles among whites, are communists more interested in political struggles between “colored” people and whites in SA? Or Ashkenazi Jews and Mizrahi Jews in Israel?\n\n> But demographics are irrelevant to taking a principled line since our goal is to redefine them until a revolutionary subject emerges, not take bourgeois sociology at face value. \n\n> Though since the American “left” mostly corresponds to relatively disenfranchised “working class” whites, this book is probably more relevant to understanding the mainstream of labor aristocratic social fascism rather than the “communist/colored” fringe. \n\nThese sections made me think that we more or less agree here, but that you think I’m arguing for something like “the white working class taking its rightful place by separating from the rest of the white labor aristocracy.” \n\nBut that’s not what I’m advocating for. I agree that national liberation is central, but I also have seen with my own eyes that the subjectivity of “labor aristocrats” extend to the “colored” subjects that you were describing. If I wanted to use your language, then Id ask how to separate off a stratum of the “colored” in order to properly align them with the international proletariat. \n\nThe dominant political expression of every oppressed nation today is one that abuses and exploits its most oppressed stratum. If we are really intent on globalizing this “colored” conception then we have to take it seriously and consider what it means to group those most oppressed stratum together, unite with their friends, and attack their enemies.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": ">If I wanted to use your language, then Id ask how to separate off a stratum of the “colored” in order to properly align them with the international proletariat.\n\nYou can't. History proved that the Trotskyist line was wrong and that colored people defended their privileges in alliance with whites once they shared the common threat of African political power. At best you will get individuals who are able to commit class suicide and nevertheless should be treated with suspicion and kept away from leadership positions. Every single attempt at forging an alliance with white radicals and black proletarians in the US ended in disaster, and Sakai showed there were many attempts. Notably, this extends to all the populations that became white in the American context, of whom there are probably many more than the original settlers.\n\n>The dominant political expression of every oppressed nation today is one that abuses and exploits its most oppressed stratum\n\nThere is still a fundamental difference between South African black workers taking out their frustration on other African workers and the imperialist relationship between white labor aristocrats and black proletarians. The existence of the Black Hundreds and national chauvanism in Russia was not sufficient to prevent the Bolshevik revolution because for the mass of Russian peasants and workers exploitation was the primary contradiction. National chauvanism and bigotry have a much longer history than monopoly capitalism. But once revolution was not successful in Western Europe it was clear that imperialism is decisive once a labor aristocracy forms. This is the foundation of the theory, I think you've forgotten the fundamentals in your attempt to try to understand the seeming complexity of politics today. While we can indulge in a concept of a \"consumer aristocracy,\" this only makes sense in the context of monopoly capitalism putting certain populations in the position of \"post-industrial\" management of the surplus value of the third world, by itself existing in a world of global commodity production is not sufficient as the basis of a labor aristocracy. This is I think one of the fundamental flaws of Torkil Lauesen's thought and why he has become a Dengist, since he has lost the ability to find a revolutionary subject (since even Chinese people \"exploit\" each other by buying commodities within an uneven national space).\n\n>If we are really intent on globalizing this “colored” conception then we have to take it seriously and consider what it means to group those most oppressed stratum together, unite with their friends, and attack their enemies.\n\nThe point of the comparison is that the colored population was even smaller than the white population and equally irrelevant. It may have taken more radical forms, even acting like a place for dissident communists when white society was hostile to all communists, but that was just petty-bourgeois politics in a different form.\n\nRadicals in the labor aristocracy are barely a drop in the bucket in the face of billions of proletarians worldwide and in today's age of widespread literacy and decades of communist political history in every country, they don't need us. So why do you care? Obviously because we're talking about ourselves as \"friends.\" But there's no reason to build a theory around this and doing so leads to chauvanism very easily. If our lives come and go it will make no difference to the movement of History.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "SheikhBedreddin",
                                    "body": "> …national chauvinism in Russia was not enough to prevent… revolution because… exploitation was the primary contradiction \n\n> imperialism is decisive once a labor aristocracy forms \n\n> the definition of proletarian includes class consciousness which is oriented towards the abolition of class society \n\nI think I’m understanding you better now, and I’m realizing that I may have been too broad with my definition of labor aristocrat initially. Similar to TL I failed to really comprehend the subjective aspect of the process (which includes, I feel, the relations of production) and therefore included people who certainly do have revolutionary subjectivity inside the labor aristocracy on the grounds that they might consume more than they produce. \n\nIf I am understanding you properly, though, this definition lacks needed nuance. \n\n> they don’t need us\n\nOf course not. I do not care, though. I have no aspirations towards leadership. I will continue my political work until I am incapable.\n\nEdit: As an extended auto-critique, I think that I have used this subreddit as a stop-gap for my limited understanding of political economy. The fact that so many people on here are Labor Aristocrats or outright Petit-Bourgeois obscures broader class analysis if readers aren’t careful. I think that my lack of care led me to a deviation where I assumed there was no proletariat at all within the borders of Amerika. I recognize this is incorrect now.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "smokeuptheweed9",
                                            "body": "Well the major flaw in my analysis is that I don't interrogate the Communist Party of South Africa's political line except to point out the flaws of Trotskyist criticism. While it is true the latter made itself immediately irrelevant and hopelessly reformist, the former did eventually turn into opportunism, where the CPSA became the right flank of post-apartheid SA integrating into global capitalism (and global white supremacy). In that regard you're not wrong to point to a kind of \"imperialist pyramid\" where, if not the masses of South Africa, the black ruling class serves as a sub-imperialist regional force with the \"black republic\" thesis as an excuse. I've said much of what you've said in the OP myself, and you pushed it to its logical conclusion so I can see the opportunism inherent to a broad, amorphous definition of the labor aristocracy based on consumption or wage levels vaguely above a world average.\n\nThat is, while I think the essence of monopoly capitalism hasn't changed, there is danger in ignoring the specifics and applying crude third worldism to every situation in the hopes that we can just pick up where decolonization left off (and in Dengist fashion deny its limitations, blaming everything on the CIA and the IMF and whoever convinced the CPSU to restore capitalism against their own interests). Apartheid South Africa is a useful case study because, in its own fucked up way, it was a post-colonial state. \n\nStill, compromising with the labor aristocracy is not the way. The primary contradiction today remains the relative and absolute growth of the proletariat across the globe and if the labor aristocracy has grown as well as a result, we'll just have to go deeper. I do think we have to draw lines in the sand though. Defining the Chinese working class as non-proletariat is too much and we do have to differentiate between older forms of discrimination and those that derive \nfrom monopoly capitalism.\n\n>I think that my lack of care led me to a deviation where I assumed there was no proletariat at all within the borders of Amerika. I recognize this is incorrect now.\n\nI would push the opposite way and say that the borders of Amerika are precisely what are no longer a coherent basis for politics.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "SheikhBedreddin",
                                                    "body": "I can imagine, roughly, what you’re talking about with respect to Amerika’s borders, but I guess I have trouble comprehending how a struggle could even transcend that. The most obvious thing is struggles taking place in Mexico, but I think I lack a concrete enough understanding of cartels or NAFTA to comprehend where to even begin on something like that.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "smokeuptheweed9",
                                                            "body": "One of the attractions of the PLFP to international communists was that while it was a national liberation movement, this nation was spread across refugee camps across multiple territories. For a group like the KAK which was looking for a form of international communist politics not tied to the domestic labor aristocracy, the attraction was obvious and went both ways, since in navigating multiple bourgeois regimes the PLFP was particularly attuned to the global media and building international solidarity networks.\n\nThis strength could also be a weakness, and though the PLFP was not as marginal to the first intifada as the PLO, the exile in Tunis played a damaging role for all Palestinian national liberation movements. Even with Hamas filling the void, it is de-facto limited to Gaza, and while it has leveraged that territorial control well and there is no organic connection between the \"axis of resistance\" and the actual operation of Hamas as a political actor (the same contradiction has been noted in Hezbollah's sectarian role in domestic Lebanese politics and its ideology of resistance to Israel which gives it a base legitimacy beyond the Shia bourgeoisie).\n\nBut Palestinians are still a refugee population and the dispersed nature of Palestinians against the territorial control necessary to wage a war of resistance is a contradiction they have navigated with more general lessons. I don't think there's a shortage of case studies of combining the continued relevance of the nation-state form and the migration of proletarians in the age of globalization, you just have to think creatively about what is new instead of what is old.",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "urbaseddad",
                                                                    "body": "Thanks for the food for thought wrt to immigrant / refugee proletarians. \n\nI do want to question your use of \"imperialist pyramid\". How would you say the way you use it here differs from that of the KKE?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "smokeuptheweed9",
                                                                            "body": "I used it specifically to reference the KKE's concept because very few people think much of it. Obviously it has some problems but I appreciate attempts at new theorization and I do think there is some truth to expanding the concept of \"sub-imperialism\" beyond its limited use in Marini. Though as you already know, I tend to think more of the KKE than they perhaps deserve because of my much greater distance than yourself.",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "urbaseddad",
                                                                                    "body": "Hm. I'm not familiar with the term. Is it something akin to what bourgeois analysts call \"regional power\"? I guess that would fit countries like South Africa and Brazil. Also perhaps Turkey, since obviously it has a lot of military and economic influence in the region and is a member of NATO, yet lacks the labor aristocracy and the \"global power\" or financial hub status for me to feel comfortable calling it imperialist, despite the fact a lot of \"the left\" including the more radical \"communists\" in (the Republic of) Cyprus likes to do so. That also leaves the question of where we put China and Russia, because they are more than mere regional powers yet still lack the labor aristocracy of the big imperialist powers (though it's important to say, I estimate Russia has a decently sized labor aristocracy, just not a majority). According to the recent discussion on China and this discussion now it seems they'd better fit somewhere between \"sub imperialist\" and \"imperialist\". Funnily enough, a pyramid starts to emerge...\n\n\nEdit: I often make harsh criticisms of the KKE yet I'm not entirely dismissive of it. I think there is use in it currently, although it will have to be struggled against eventually, save for a further change in course.",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Particular-Hunter586",
                                                                                            "body": "Not to hop into the conversation, but I find it interesting that some people on here (not saying that you or smoke do this) eschew Lenin's definition of imperialism and the hundred years of Marxist and third-worldist scholarship that followed, in order to define an imperialist country as \"one that is majority labor-aristocratic\". Though the definition holds by and large true today, I think that using the term prescriptively instead of descriptively leads to an extremely circular definition of the labor aristocracy, and also to some bizarre historical retrospective analysis - the working class in England that Engels described was most certainly not \"majority labor-aristocratic\" for much of England's existence as an imperialist power. \n\nActually, as I'm writing this I see how it relates to the recent discussion on whether South Korea is imperialist that me and u/AltruisticTreat8675 and u/whentheseagullscry were having.",
                                                                                            "score": 11,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "smokeuptheweed9",
                                                                                                    "body": "I saw that discussion but didn't have time to respond. My thought is that South Korea is a net exploiter but not an imperialist nation. This is the inverse of the point Michael Roberts makes about China \n\n>https://thenextrecession.wordpress.com/2024/09/09/iippe-2024-imperialism-china-and-brics/\n\n>Robert Veneziani et al from the LSE, London also developed an ‘exploitation index’ for countries which showed that “all of the OECD countries are in the core, with exploitation intensity index well below 1 (ie less exploited than exploiting); while nearly all of the African countries are exploited, including the twenty most exploied”. The study put China on the cusp between exploited and exploiting.\n\nMR goes further and says that China is \"net exploited.\" Although MR is also a Dengist and the king of applying bourgeois statistics to Marxism to made broad, spurious claims. So I would fall back on Lenin's consideration that imperialism is composed of 5 different categories and that, without diluting the centrality of monopoly capitalism too much, there is room to be stronger in one category than others. This is the solution the CPI Maoist came to, where they basically list the characteristics of imperialism and show how China fits them without bothering to compare them to a global standard. I've criticized their articulation before but I'm willing to reconsider after the last few years. If there is another world war, you don't win a prize for saying \"well technically China loses more surplus value than it gains.\"",
                                                                                                    "score": 12,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Particular-Hunter586",
                                                                                                            "body": "Thanks for this reply; I definitely don't understand how a nation can be net exploiter but not imperialist, but I'll go back to Lenin and the basics of unequal exchange about it.",
                                                                                                            "score": 5,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "smokeuptheweed9",
                                                                                                                    "body": "The closest analogy I'm thinking of is Portugal \n\n>A somewhat different form of financial and diplomatic dependence, accompanied by political independence, is presented by Portugal. Portugal is an independent sovereign state, but actually, for more than two hundred years, since the war of the Spanish Succession (1701-14), it has been a British protectorate. Great Britain has protected Portugal and her colonies in order to fortify her own positions in the fight against her rivals, Spain and France. In return Great Britain has received commercial privileges, preferential conditions for importing goods and especially capital into Portugal and the Portuguese colonies, the right to use the ports and islands of Portugal, her telegraph cables, etc., etc. [10] Relations of this kind have always existed between big and little states, but in the epoch of capitalist imperialism they become a general system, they form part of the sum total of “divide the world” relations and become links in the chain of operations of world finance capital.\n\nThe point that is implied but not explicitly stated is that Portugal *also* gets the privileges of its colonies under the tutelage of Britain. So it is a link in the chain (or rather block in the pyramid) with England at the head because the concrete history of the transition from colonialism to imperialism imprints on a world that already exists. I'm not the first one to make this point of course, anti-communist frontier states like Korea and Taiwan have often been thought of in these terms. The only difficulty is generalizing it since\n\n>commercial privileges, preferential conditions for importing goods and especially capital\n\nIs now a universal feature of a system of formally independent sovereign states.",
                                                                                                                    "score": 9,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "smokeuptheweed9",
                                                                                            "body": "The problem of course is that a theory of an imperialist pyramid is approaching a theory of \"ultra imperialism\" since everyone is in the same pyramid. A theory of competing pyramids, which would capture inter-imperialist competition (which is, ultimately the point of the theory) would better but it would have to have a venn diagram like structure where inter-imperialist pyramids overlap without being identical. At a certain point, as u/Particular-Hunter586 points out, were starting to get away from an already coherent theory and terminology without sufficient cause. I'm only considering it because the KKE is one of the few forces in the world seriously confronting pro-Russia opportunists in the communist movement, a phenomenon more important than its numerical support because its internal logic requires a theoretical response.\n\n>Though the definition holds by and large true today, I think that using the term prescriptively instead of descriptively leads to an extremely circular definition of the labor aristocracy, and also to some bizarre historical retrospective analysis - the working class in England that Engels described was most certainly not \"majority labor-aristocratic\" for much of England's existence as an imperialist power.\n\nThis is the inevitable result of starting from bourgeois sociology and working backwards. One encounters the same problem when bourgeois scholars point out that for most of colonialism's history, it was unprofitable, at least on a balance sheet, and therefore a theory of colonial exploitation makes no sense. Or when it is pointed out that social democracy was an inevitable result of Marxism because the \"working class\" never became an absolute majority of the population, necessitating parliamentary compromise. This supposedly also counters some crude idea of absolute polarization of the population into bourgeoisie and proletariat. It has long been pointed out the dangers of relying on wages for a theory of imperialism. It is fine for an approximation to make a general point but, as u/urbaseddad pointed out earlier, it is only one form of superexploitation and possibly not even the primary one in the American settler context. Profits are not immediately ascertainable and the proletariat has never been a simple numerical value, Marxism is better than that.",
                                                                                            "score": 11,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "SheikhBedreddin",
                                                                    "body": "I think this ties into a question/post that I made a while back. The US is a hotbed of many of these refugee communities, and when organizing them a question comes up between solidarity with their home and an internal hierarchy of different refugee communities. It seems like anti-imperialist resistance would be made most effective if the different diasporic communities were able to merge into one “internationalist” category, but I always see that fall into a very vulgar economism.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "pinkfishegg",
            "body": "I don't think part timers at ups are a good example. I used to be a UPS part timer before being laid off. I got like 10 hrs of work a week. The labour aristocracy are more like people who are hired to work for the union in high places. \n\nSome average union members a few generations ago could be petty bourgeoisie in that they made enough money and had enough stability that they could partially live off investments, especially housing. Not that the labour share of value is a lot lower and the housing market is messed up I think most workers even with a decent job aren't like this.",
            "score": -6,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "> The labour aristocracy are more like people who are hired to work for the union in high places.\n\n\nThat's the Trotskyite definition of the term. You're engaging in apologia for imperialist parasitism ",
                    "score": 18,
                    "replies": [
                        {
                            "author": "pinkfishegg",
                            "body": "Ok than what's your definition? I wouldn't say the poor workers in the US count.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "If a healthy, single, childless White worker lives like a proletarian (i.e. with multiple housemates and as frugally as possible, at bare subsistence levels) and works a minimum wage job in a major US city they can save up money in the order of tens of thousands of USD within a year. No equivalent (i.e. healthy, single, childless working minimum wage) proletarian in a Third World country could ever do such a thing. This doesn't change much if you compare White workers that are unhealthy with a family to take care of to their Third World counterparts; the former still has a much greater ability to earn and spend or save money than the latter. There is an absolutely ridiculous amount of surplus value circulating in the US economy that even the poorest White workers have access to. Now guess where this surplus value comes from. The Third World and the internal colonies of the US, so the \"poor\" White worker still has an exploitative relation to labor on a global level since they receive net positive amount of surplus value. This is compounded by the fact that accumulating surplus value in the form of saving inflated wages means the White worker can now accumulate capital and transcend their status as purely a wage laborer.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "pinkfishegg",
                                            "body": "I get what your saying if you compare a third world worker that a 1st world but I think this adds to standard of living rather than status as a wage laborer. 10s of thousands of dollars a year is a lot to buy commodities but it's not actually a lot of you are trying to start a business and start making money off of other people. They may benefit from the exploitation of the third world but they aren't actively profiting off unless they own stocks.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Drevil335",
                                                    "body": "It's more than enough to invest in stocks, which integrates them into the M-C-M' circuit and turns them into a direct exploiter of the global proletariat. This also isn't a marginal possibility: an absolute majority of white Amerikans own stocks, including many \"poor\" white workers.",
                                                    "score": 19,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "smokeuptheweed9",
                                                    "body": ">I think this adds to standard of living rather than status as a wage laborer. 10s of thousands of dollars a year is a lot to buy commodities but it's not actually a lot of you are trying to start a business and start making money off of other people. They may benefit from the exploitation of the third world but they aren't actively profiting off unless they own stocks.\n\nYou're confusing yourself. We are discussing the labor aristocracy, that this class is not able to leverage its wealth into becoming bourgeois is true by definition. That the labor aristocracy are \"wage laborers\" is again true by definition, that is not what you yourself were previously discussing (since union officials are also wage laborers). \n\nRegardless, the point is not whether the labor aristocracy has sufficient wealth to no longer be considered proletarian. The point is that the definition of proletarian includes class consciousness which is oriented towards the revolutionary abolition of class society. You are defining things backwards, where a mechanical definition of \"wage labor\" is applied to society and then you are forced to explain why that class lacks any inkling towards revolutionary politics and accommodate yourself to the inevitability of reformism. The point of communism is to find the proletariat as a revolutionary subject for politics (as we have seen historically, this has always involved finding the proletariat where it was previously hidden, in the Russia and Chinese countryside, in the national liberation movements, in the jungles of Cuba, etc.). If you cannot find it, then your analytic framework has failed. The theory of the labor aristocracy is a late addition to Marxism (and a theory of a broad consumer aristocracy even later) because it observed what was actually happening and tried to find a material basis for it. Your insistence on wage labor is 200 years too late and has no value. It is completely alien to Marxism which has always been the minority tendency in the worker's movement until revolutionary ruptures force it to the front.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "urbaseddad",
                                                            "body": "> The point is that the definition of proletarian includes class consciousness which is oriented towards the revolutionary abolition of class society.\n\nThat's an interesting comment, one that I've heard of before from one person vaguely contemplating it, but I didn't know its origin and thought it might be their own invention. Where did you get this from; can you elaborate?",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Common_Resource8547",
                                                    "body": "Their high wages are drawn from imperialist super-profits, that alone is indicative of \"drawing profit\" from the third world.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}