{
    "title": "Can someone give me a bit of perspective on the Czechoslovak communist system from 46-89?",
    "author": "ambuehlance",
    "subreddit": "communism",
    "rank": 212,
    "score": 19,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/communism/comments/1gzm5to/can_someone_give_me_a_bit_of_perspective_on_the/",
    "id": "1gzm5to",
    "selftext": "Hello comrades! As many have recommended since the election I picked up a copy of “On Tyranny” and well so far, I hate it. Snyder keeps talking about communism in the same breath as fascism, often equating the anti-democratic nature of the Nazis with communism in the 20th century. Often he specifically mentions Czechoslovakia, making me think he must have emigrated from there as a kid or something. He has some serious beef with communism but never clearly articulates what’s so anti-democratic about it. Literally he gives not a single example. Anyway maybe if anyone has an opinion about what was so anti-democratic about Czech communism from 46-89 that would be appreciated.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asrahn",
            "body": "I don't have much in the way of input myself here other than to say that pretty much anyone else would be better to read than Snyder. He's a huge proponent of the Holodomor myth, and his primary concern during the Gaza genocide has been to tweet incessantly about how bad Trump and Vance is and make vague allusions to future \"authority\" that the Americans might suffer under (or, most likely, to sell his wretched book), and he's refused to express himself publicly on the matter even as his lectures have been shut down by protests.",
            "score": 10,
            "replies": [
                {
                    "author": "ambuehlance",
                    "body": "Thank you. I’m going to power through this book because it’s only like 100 pages but wow, I didn’t realize that my feed was full of liberals until I started reading this!",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Asrahn",
                            "body": "There's no doubt some insights to gleam from his texts as he's ostensibly rather well read, but know that it's all going to be heavily influenced by his political views (rabid anti-communist), which are what fuel both his scholarly work as well as what he focuses on covering in his books.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PrimSchooler",
            "body": "This is an incomplete answer as while I'm Czech I've only recently started educating myself, so a lot of this is still based on public opinion, and thus likely some parts I might be unaware of being propagandised yet - and it's almost impossible to find information that isn't highly sensationalized.\n\nThe biggest thing people point to were the political trials - Milada Horáková in 1950, Slánský, Oatis and Zenáhlík in 1953 (among other lower profile trials).\n\nHoráková was a national socialist and feminist, she had a favorable view of the USSR through a feminist lens, but turned against the communist's takeover of the country through the National Front coalition, she continued contact with NatSoc politicians in exile and was senteced to death. This is the most polarizing one, her buddies were happy to flee to the western capitalists for help, but she did seem like a well meaning person, that's going into personal opinion of course, but that was reflected in public's view of the trial, as the sentence was seen as unncessarily harsh.\n\nSlansky and co. were said to be Trostkyists but I don't know about them tbh, Oatis was in fact in contact with the French, and I don't know much about Zenahlik. \n\nSource (in Czech): https://www.nacr.cz/verejnost/badatelna/digitalni-badatelna/politicke-procesy\n\nThe trials were carried out in Soviet style with (allegedly, didn't check primary sources) rehearsed testimonies, with the current (western) explanation for them being that the KSČM needed someone to blame for failed economic policies (that was part of Slansky's trial) and to drum up support for the goverment by swiftly pointing out enemy spies.\n\nThen there is the Warsaw Pact \"invasion\" of Czechoslovakia in 68, which was in response to (then head of the KSČM) Dubček's reforms, which ranged somewhere between Dengist and full liberalizationthough Dubček decided to lead with free press, which quickly turned to \"lets talk about those trials from the 50s again\" and followed by Two Thousand Words manifest by Vaculík, a liberal author, calling for further reforms and accepting blame on the part of the communists, while the manifest didn't call for liberalization as policy, it did allude to it, so while Dubček probably didn't foresee this going that far, the \"conservative\" communists within the party wrote a letter to Moscow to come and stop the counter revolution that was brewing in Prague (and they were not wrong, one of the leading members of Prague Spring would go on to become our first lib president, Václav Havel, also a prominent member of the CIA-backed (admitted a few years ago by their correspondent) Charta 77 movement).\n\nSorry that I don't have much connective tissue between these events, I still need to learn more.",
            "score": 11,
            "replies": [
                {
                    "author": "DeathHeadCZ",
                    "body": "Je radost vidět tu i nějakého soudruha z mé země :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PrimSchooler",
                            "body": "Od téhle odpovědi jsem se ještě dozvěděl že Slánský nejspíš byl odsouzen také kvůli prodejí zbraní Israeli, ale Sovětskému vedení se nehodilo to zveřejňovat protože měli stále šanci v Israelské komunistické straně.\n\nhttps://cs.wikipedia.org/wiki/Dod%C3%A1vky_zbran%C3%AD_z_%C4%8Ceskoslovenska_do_Izraele_v_letech_1947%E2%80%931949\n\nhttps://sovinform.net/USSR-Stops-Czechoslovak-Arms-Transfers-to-Israel.htm\n\nJeště jsem se neprokousal historií naší KSČM, dnes vypadají dost slabě, oficiálně market-socialist, jestli máš co přidat rád to i přeložím, nejsem socialistou moc dlouho, takže mi dost vědomostí stále chybí :)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DeathHeadCZ",
                                    "body": "Dnešní KSČM úplně nepovažuji za marxismus-leninismus. V jejich programu jsem nenašel nic, co by napovídalo tomu, že jsou to komunisté - až na jejich název. Mluví tam o současných problémech, ale vizi budoucnosti za mě moc nemají. Po přečtení jejich programu bych řekl, že i Marx by od nich dal ruce pryč. Prakticky opustili vše, co má komunistická strana představovat, ale na druhou stranu tento proces začal už v ČSSR. Tam vlivem revisionismu, který započal již v Sovětském svazu, se přestali soustředit na třídní boj a od Chruščeva dál začali decentralizovat ekonomický systém, což vedlo k následné stagnaci ekonomiky i u nás. To je jedna z hlavních věcí, co je u nás komunistům vyčítána - stagnace ekonomiky. Ale za to nemůže myšlenka socialismu jako taková, nýbrž neschopnost tehdejších představitelů komunistických stran. Na invazi vojsk Varšavské smlouvy se dnes u nás vzpomíná bolestivě. Fakt je ten, že z právního hlediska to nebylo úplně opodstatněné a zabránilo to sebeurčení národa. Fakt je ale také ten, že tu probíhaly procesy, které byly hrozbou pro socialismus u nás a hrozila liberalizace a demokratizace společnosti, což je v rozporu s naším cílem socialismu a následného komunismu. Dalo by se to shrnout tak, že Češi většinou nemají rádi komunisty proto, že ekonomika stagnovala (za což nemohla myšlenka systému, ale tehdejší komunističtí lídři), byla omezena svoboda (což ale je v principech marxismu-leninismu - ochrana před kontrarevolucí) a potřeba národní hrdosti a sebeurčení národa (což nejde úplně ruku v ruce s našimi cíly). Dá se za to také vinit dnešní vzdělávací systém, kterým rve do hlav dětí anti-komunistickou rétoriku a přikrášluje si socialismus. Myslím, že aby dnešní komunisté byli úspěšní, musí opustit současnou pasivitu, být více viditelní a vysvětlovat základní principi marxismu-leninismu, socialismu a komunismu.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BrazilianCowpoke",
                    "body": "Thank you for sharing those informations! Some months ago i tried to learn Czech so i could study communist czechoslovakia but the lack of digitalized sources (like books) on the period didn't help a lot, so i gave up but i found some sources that may help you and other czech comrades, i can share it with you if you want.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PrimSchooler",
                            "body": "Sure! I've put the history of the SSRs book from sovinform.net on my reading list, beyond that I'd be glad to have more sources.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ambuehlance",
            "body": "Yeah I picked up on that right away. Thanks for your insights!",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Apparently Vaclav Havel is a darling of a lot of university-educated American liberals. Somehow I missed the memo on that one, but I have a colleague who keeps bringing him up like I should care.\n\nI clocked *On Tyranny* for what it was without having to read it, as soon as I saw a preview in which it implied that having two parties, one of which works against your interests, is more \"free\" than just having one party that works to further your interests. Inevitable that it would engage in horseshoe nonsense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "Checked your account. You're calling Harris a left wing extremist. Opinion discarded.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Historical \"facts\" without evidence, from a liberal's point of view",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "Flashy-Leg5912",
                    "body": "Can you give a concrete example on how it might have deviated? Because you're currently just making an accusation.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Flashy-Leg5912",
                                    "body": "Go read Khrushchev lied by grover furr\n\nEdit: it's not perfect, but it's good enough to dispell the myths surrounding stalin.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Flashy-Leg5912",
                                                    "body": "Look the name up and just read the internet archive version.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}