{
    "title": "What happened to the Red Guards/CRCPUSA?",
    "author": "Last_Tarrasque",
    "subreddit": "communism",
    "rank": 208,
    "score": 25,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.reddit.com/r/communism/comments/1h0vw9n/what_happened_to_the_red_guardscrcpusa/",
    "id": "1h0vw9n",
    "selftext": "I have recently taken on the painful, frustrating and confusing task of trying to figure out what the hell is going on with the situation of Maoism in the US. Trying to figure out what organizations exist, what they are, etc. Inevitably, I keep ruining into the Red Guards.\n\nWhat I know is this, the Red Guards formed, called themselves MLM, became relatively large and influential in comparison to other organizations within the US Maoist movement, then rebranded as the CRCPUSA, and then later exploded. I have heard them been accused of being a cult, heard accusations of abuse and other such scandals, political accessions of left deviationism, settler apologetics and chauvinism and other such issues.\n\nAll that being said, I am still rather unclear on what happened. Also I keep hearing about the Black Red Guards, are they related or something completely separate?",
    "comments": [
        {
            "author": "NobodyOwnsLand",
            "body": "So my direct knowledge is limited as I wasn't a member of the CR. However I have had direct conversations with people involved alongside reading what many others have already cited. In terms of line and practice I see a few key things consistently come up (in no particular order):\n\n*1. A generally lazy assessment of the history of the Communist Movement in the US stemming from an assumption that \"reconstitution\" of the CPUSA is the primary task*\n\nThe question of \"reconstitution\" versus \"constitution\" of a Maoist Party in the US was never seriously approached. Rather, there was an *a priori* position that the CPUSA must be reconstituted which was not arrived at from a genuine assessment of our conditions and the history of the US Communists, but rather from the fact that reconstitution was done in Peru, the Philippines, etc. This is coupled with an uncritical assessment of the CPUSA in the 1930s, and goes hand in hand with:\n\n*2. An inconsistent view of the national question in the US, and later the outright liquidation of it in practice.*\n\nLet me quote you two passages from the Red Guards/CR-CPUSA organ *Struggle Sessions* which are two years apart:\n\n>“Revolutionaries owe black people everything. It was the black liberation struggle which provided the most acute scientific knowledge of how to fight the bourgeoisie in this prison-house of nations, inspiring other oppressed nations during the New Communist Movement toward the program of national and social revolution. As usual, whatever has been the most successful will also receive the most criticism, criticism which must not be opportunistically used to diffuse the question of Black Liberation…”\n\nThis is quite true. In particular, a key part of combating white settler chauvinism in the US — something which has consistently produced vacillating tendencies in the white working class — is firmly taking up the banner of national liberation and self-determination for all oppressed nations and centering the key role of Black, Indigenous, etc. revolutionaries in pushing the movement forward here. If we do not do this, we backslide into settler historical revisionism and absurdly center white men as liberators:\n\n>“… it is hard for them to deal with the fact that… the end of slavery did not mainly come from slave revolts… the main material force that crushed slavery was a force of an army of almost a million white men… the main leaders of this revolution were representatives who had vacillated on the question of abolition, and/or who were always ambivalent if not outright opposed to equality between black and white men… Lincoln and Grant did not “betray” Black people in the U.S.… The final consolidating act of the American republic was centered around the abolition of African slavery, and we wouldn’t have developed the antecedents of Communist revolution if it hadn’t happened.”\n\nDon't worry about vacillation or chauvinism, that's how the Civil War was won! This is of course ignoring the essential fact that *the 13th amendment did not abolish slavery*. They have nothing to say about sharecropping, prison enslavement, or the present destitution of many Black Belt counties and Indigenous reservations — many of which comprise the poorest and least developed areas of the US, with any development generally to support nearby prisons. Instead, like with many other US Parties (Maoist or otherwise) any meaningful practice around national liberation has been liquidated in the hopes of appealing to the \"whole\" working class. What is left unsaid is that \"whole\" working class is the white working class *specifically*, with Black, Chicano, Indigenous workers comprising peculiar minorities which must be subordinate to the white masses due to their \"minority\" status.\n\n*3. A general failure to form a Communist vanguard Party structure in a Leninist, let alone Maoist, way.*\n\nI mentioned at the end of point 1 that the CR-CPUSA had an uncritical assessment of the CPUSA in the 1930s. They are far from alone in this. The vast majority of US Parties (of course excluding the Trotskyists) maintain that we must return in some way or form to the practice of US Communists in the 1930s under the CPUSA. While there were certainly things from that time period which were good, such as the line on national liberation, we must be more thorough than that if we are to move forward. *Some* of this work has been done by groups such as the Bay Area Study Group in '79, however by their own admission this work is incomplete due to the difficulty of gathering sources in their time and situation. In my own study, I tend to agree with their ultimate conclusion that the CPUSA was never actually organized as a Leninist vanguard Party. It never genuinely overcame the criticisms Stalin laid out in his speeches about them, and when they did eventually gain some unity, it was around white settler chauvinism.\n\nThis is not a model to be replicated, let alone glorified. If we seek to \"reconstitute\" the CPUSA in order to return to that perceived era of militancy in the 30s, all we'll be reconstituting is more of the same bullshit under the banner of Gonzalo Thought. It's gonna be more burnout, more abuse, more movementism, more commandism, more chauvinism, and less revolution. The so-called \"self criticism\" of the CR recently released indicates that this was exactly what happened. I say \"so-called\" because in many instances throughout the piece they double down on these actions and positions. Leadership and cadre development wasn't carried out, internal democracy and accountability was seriously insufficient, serious social investigation and class analysis hadn't been carried out, and the plan to win and fully reconstitute the Party was vague at best.\n\nThe International Communist League has asserted that this \"liquidation\" of the CR-CPUSA *\"does not, in any way, help to build a communist party, nor does it constitute a method of revolutionaries and communists for developing the struggle.\"* However, when the \"unity\" of this organization is premised on lazy analyses, when it embraces outright revisionist views on US history, when it fosters and protects an inconsistent and (at the very least) questionable leadership core, and more — it is not helpful to the movement to defend, and as many in the RSN, RSG, etc. have pointed out, it's actively harmful and drives the people and potential allies away from Maoism. This weak and improper \"unity\" is what actually liquidates parties. The ICL loves to minimize and ignore the history of the Revolutionary Internationalist Movement, but they offered important lessons around this (from *On the Struggle to Unite the Genuine Communist Forces*):\n\n>\"In the late 1990s, a movement to unite a number of forces that made up part of the Indian MLM movement resulted in the formation of the Janashakti organisation. Its creation was met with enthusiasm from important sections of the fighters and supporters of the MLM movement. But this unity was false and hollow. It was based on negotiations to determine the \"common points\" that existed between the merging organisations. But these \"common points\" included, and indeed were based on, a continuation of a wrong summation of the Naxalbari movement led by Charu Mazumdar and actually represented a repudiation of that experience and those lessons. Not surprisingly, this opportunist unity, like so many others in the history of the international communist movement, was based on \"combining two into one\"... In the case of Janashakti, the unprincipled unity did not last long and burst like a soap bubble. The enthusiasm the unity had given rise to was replaced by an even deeper demoralisation. This does not mean that there is not much in the experience and understanding of Janashakti's members and leaders that can and must contribute to the formation of a genuine united Marxist-Leninist-Maoist vanguard party in India. But for this experience to be useful, for it to be really at the service of the people, the process of \"dividing one into two\", and specifically the process of criticising and repudiating opportunism and revisionism, is essential.\"\n\nImagine if the RIM had insisted that Communists in India maintain their \"unity\" within the Janashakti organisation, rather than attack what was wrong and form a new path towards genuine revolutionary unity, and labeled those who sought to do so as \"liquidators\". We would never have gotten the Communist Party of India (Maoist) and the resurgent People's War in India since 2004. The same is the case here. The ICL and those who insist on the CR-CPUSA as the only path forward are combining two into one in their appeals for \"unity\", and obsessing around the *form* of the criticisms against them (that they're in the open, naming leadership, etc.) rather than the *content* of the criticisms (that leadership is not genuinely Maoist, that party practice is unprincipled, lazy analysis, cadre wasn't developed, etc.) and so they abandon any materialist analysis of what has happened in favor of all of these people being \"liquidationists\".\n\nWe can and must do better than the revisionists. This doesn't mean taking every criticism at their word, but it does mean engaging with that criticism in a genuine way and not dismissing it because it was posted to Twitter. Why was it put out this way? Could this be a sign of bad internal means of criticism? There are a lot of allegations against leadership which I can't personally evaluate the complete validity of, but I can evaluate the responses to them, and the responses I've seen from many, particularly the ICL, the Worker, etc. are *barely distinguishable from what the PSL would put out in similar circumstances.* The only real difference being the annoying self-aggrandizement that constantly pervades the stereotypical Party writing of this tendency.\n\nDon't take this as a complete analysis. Do your own research.",
            "score": 48,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "Good post, I can't believe they wrote that about slavery and the civil war. Leave the defense of Lincoln to Trots please.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "NobodyOwnsLand",
                            "body": "My mouth hit the floor when I read it the first time. For transparency, the context of this was in [an article criticizing Maoist Third-Worldism](https://struggle-sessions.com/2020/05/11/maoism-v-s-maoist-third-worldism-responding-to-criticism-from-a-reader/), labeling J. Sakai and others as \"identity politicians\". While I and Nobody Owns Land have our own criticisms of the Third-Worldist tendency it's absolutely inexcusable to take on such a massively chauvinist line just to get a dig in. Especially coming from a group so seemingly obsessed with \"unity\".",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "red_star_erika",
                                    "body": "I remember that awful chauvinist article. \n\n>While I and Nobody Owns Land have our own criticisms of the Third-Worldist tendency\n\nhow does your org define the third-worldist tendency and what are the criticisms? I ask because the definition laid out in the article is in bad faith and groups in communists who reject the term.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "NobodyOwnsLand",
                                            "body": "Sorry for taking a while to reply, but I'll preface this by agreeing that the aforementioned article is absolutely written in bad faith. It's incorrect to talk about the LLCO and MIM/MIM(prisons) as if they were/are identical. Though there are links between these groups, they represent different tendencies that must be viewed differently. Nobody Owns Land has criticisms of both tendencies (which will be the bulk of our response), but also sees significant potential for unity in practice with MIM(Prisons) that doesn't exist for what remains of the Leading Light trend. We are of the mind that a natural part of the process of overcoming the errors of the RCP-USA and summing up our successes will be struggling with MIM thought in *mutual* good faith (something which has largely not been done so far ***by any group***) and resolving these line struggles in order to produce a genuinely unified Maoist movement which can organize revolutionary struggle, and eventually war.\n\nSome rough, condensed definitions of the two trends (as we see them) are:\n\n- MIM thought — crystallized within the Maoist Internationalist Movement (when it still existed as a centralized entity) as Marxism-Leninism-Maoism \"from the vantage point of the Third World proletariat\". Today it is primarily expressed by [MIM\\(Prisons\\)](https://www.prisoncensorship.info/archive/books/FPLmimp.pdf) and asserts that genuine revolution can only come from the Third World proletariat rising up against the First World (where [\"there is no significant exploited population\"](https://www.prisoncensorship.info/article/maoism-around-us/)) and establishing the Joint Dictatorship of the Proletariat of the Oppressed Nations (JDPON).\n\n- Maoism-Third Worldism or \"Leading Light Communism\" — which asserts that Third Worldism represents [\"the fourth and highest stage of revolutionary science.\"](https://web.archive.org/web/20110822103538/http://monkeysmashesheaven.wordpress.com/leading-lights/) It asserts that [\"[t]he content of Maoism as a universal new stage was already articulated in a systematic fashion by Maoists, especially Lin Biao\"](https://web.archive.org/web/20090203180239/http://monkeysmashesheaven.wordpress.com/sunrise-in-the-east/) and that \"[i]n order to clarify our genuine advances, in order to cut through the Gordian knot of contending “Maoisms,” we are naming a new stage of revolutionary science.\"\n\nA major practical difference between these two trends (today) is the role they envision for themselves in practice. MIM(Prisons) does not envision itself as the revolutionary vanguard in the US. In their words *\"While MIP-amerika had aspired to play a vanguard role in armed struggle some day in the future, MIM(Prisons) will never play this role.... Our principal task is to maintain the prison ministry as a source of educational and agitational material and as a central coordinating body for the anti-imperialist prison movement.\"* LLCO, on the other hand, directly envisioned itself as the \"leading light\" of the revolutionary movement. On this, we feel that while the organizing of MIM(Prisons) is vastly more principled, it is also a major error to move away from a democratic centralist Party model to a decentralized cell structure. As veterans of various \"decentralized\" movements, we strongly feel that decentralization is only useful in very limited and specific ways, and that it largely hurts rather than helps Communist organizing, even when the issue of security and infiltration is taken into account.\n\nIt is important, however, to point out that these trends do contain significant overlap. For example, in one of the previously linked documents by MIM(Prisons) they state their agreement with the eight \"breakthroughs\" which the Leading Light Communist Organization cited as the basis of the advancement of Maoism into Maoism-Third Worldism. These are:\n\n>1. \"At the core of revolutionary science today is the recognition that the first world, the metaphorical West, has no significant social groups that can be aligned in any consistent or reliable way with the third world, the metaphorical East. There is no Western proletariat. There are no significant exploited social groups in the first world.\"\n\n>2. \"At the core of revolutionary science today is the understanding that the principal contradiction in the world is between the West and the East, the first world and the third world, the global cities and the global countryside, imperialism and exploited nations.\"\n\n>3. \"At the core of revolutionary science today is the global people’s war model associated with Lin Biao.\"\n\n>4. \"At the core of revolutionary science today is the imposition of a joint dictatorship of the exploited nations and their allies over the exploiter populations.... This requires the disbanding of the U.S. and Canada \\[and\\] support for national liberation and self-determination for oppressed \\(but often not exploited\\) nations currently held captive within the borders of the first world... This requires return of the land.\"\n\n>5. \"At the core of revolutionary science today is the reaffirmation that a new bourgeoisie arises within heart of power within socialist society.\"\n\n>6. \"At the core of revolutionary science today is the rejection of both the Theory of Productive Forces and the associated idea that socialism is a mere extension and democratization of bourgeois privilege.... thus it is necessary to reject the idea that the bourgeois standard of living of first worlders as a whole is a result of anything other than super-exploitation of the third world.\"\n\n>7. \"At the core of revolutionary science is the reaffirmation of the doctrine of the dictatorship of the proletariat.... Class neutrality does not exist.\"\n\n>8. \"The core of revolutionary science reaffirms that people’s war, broadly construed, must be carried through to the end.\"\n\nThis provides a useful foundation on which we (Nobody Owns Land) can establish where we agree and disagree with both tendencies, additionally taking into account documents and practices which we can also align or disagree with. Nobody Owns Land is in total agreement with points 5 through 8, partial agreement with points 2 and 4, and firmly disagrees with points 1 and 3. \n\nAny Revolutionary Communist organization, including all of the leading parties in the third world which MIM(Prisons) has previously described as \"steeped in revisionism\", would find agreement in points 5 through 8 at the very least. We agree with the position in point 4 that the US and Canada (we'd also include all other settler-states) must be broken up outright for socialist revolution to succeed at all in these areas. There will be no socialist US, there will be no socialist Canada. Socialism and national self-determination will mean the negation of these entities and transfer of the land to the oppressed nations within. Where we disagree is that this is something which can happen principally *externally*, through the imposition of the Third World dictatorship on the First. While revolution in the Third World will absolutely play a key role in producing revolutionary conditions and must be *materially* (not just rhetorically) supported from our position, as Maoists we also understand that between the external and internal, it's the internal contradictions which ultimately produce a qualitative leap to a new stage. \n\nIt is our view that the oppressed (and definitely exploited) nations within these countries, grounded and built into a revolutionary force through the land struggle (a process presently taking place in the resurgent tenant unions among other places), will be the decisive factor in the destruction of the US, Canada, and all other settler-states. We additionally expect this land struggle to naturally produce new nations which (unlike the white settler-nation) can produce socialist states in conjunction with the New Afrikan, Chicane, and multitude of Indigenous nations. While the majority of white workers are labor aristocrat, we contend that the oppressed nations within settler-states must be understood through the lens of neo-colonialism, with the masses of workers being misled by a comprador bourgeoisie acting in alliance with the dominant settler-bourgeoisie.\n\nOn the issue of our partial agreement with point 2. While we agree that a key feature of the period of neo-colonialism (as the last stage of imperialism) is the contradiction between the First and Third Worlds, we disagree that this is directly analogous to the global cities and countryside or that this comprises the *principal* contradiction in today's global capitalism. The principal contradiction remains between the proletariat and bourgeoisie, and it would be a mistake to take this contradiction to a national level as well in all instances. There are absolutely times where we can frame this through the lens of nations, such as in the contradiction between the zionist entity and Palestine, or the US and Indigenous nations. However the framework LLCO and MIM(Prisons) are in agreement with here seems to us to have the same issues as Sam Marcy's \"Global Class War\" thesis. Our approach towards imperialist aggression against the Third World must be revolutionary defeatism, however it's also important to recognize that the class struggle is also ongoing *within* these nations. If we don't recognize this, then we will end up in the same position as the revisionists who frame every protest in Iran or China as \"color revolution\", who frame \"great leaders\" like Maduro in Venezuela as revolutionary poles, and lead the masses away from genuine solidarity with revolutionary workers worldwide.\n\nI'm again running up against Reddit's character limit so I'll end this by saying we additionally strongly disagree with both trends' assessment of the Revolutionary Internationalist Movement, but we consider works like *Settlers* to be major advancements of the Communist Movement and we view MIM(Prisons) as the most principled force organizing US prisons.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "red_star_erika",
                                                    "body": "I appreciate you criticizing MIM Thought in a principled manner unlike most; however, I think some of your points are in error. \n\n>as Maoists we also understand that between the external and internal, it's the internal contradictions which ultimately produce a qualitative leap to a new stage.\n\nit is odd to argue against JDPON on this basis when, even by your own calculations, you are betting on the oppressed nations of Turtle Island to impose their liberatory will onto the white settler nation rather than waiting for the white nation to undergo transformation by itself and collectively decide to return occupied land. so you essentially believe in a more limited JDPON. plus, there are imperialist nations that do not have internal semi-colonies. I do not entirely write off the possibility of a socialist Turtle Island emerging without outside intervention. but like MIM, I recognize that the closest an imperialist nation has come to socialism was [in Germany after Soviet invasion](https://www.prisoncensorship.info/archive/etext/countries/germany/imperialismoverthrown.html) (use Tor for this link). this does not go in the face of what Mao said about internal and external contradictions since the Soviets had to work with what existed in Germany by attempting to elevate the advanced and isolate the backwards. but ultimately, Germany was not able to fully change her color while proletarian dictatorship still guided the USSR due to the large labor aristocractic presence, as demonstrated in the article. if she had a large internal proletariat, the external factor of Soviet occupation would've made the road to German socialism much shorter. \n\n>The principal contradiction remains between the proletariat and bourgeoisie, and it would be a mistake to take this contradiction to a national level as well in all instances.\n\nthis is the correct in the sense that the contradiction between proletariat and bourgeoisie informs all other contradictions in our present era but it is ultimately incorrect since the contradiction between oppressor and oppressed nations currently takes primacy in every situation. Mao did not recognize the proletariat vs bourgeoisie contradiction as being principal in China [until 1952](https://www.marxists.org/reference/archive/mao/selected-works/volume-5/mswv5_21.htm). the revolutionary task in third world nations is to rid the country of imperialism and its appendages (semi-feudalism and the comprador bourgeoisie). in the first world, the task is to build a genuine anti-imperialist movement. comparing MIM(Prisons) to Marcyism is unfair since they recognize that only the proletariat can defeat imperialism and they do not defer unearned authority to bourgeois regimes the way today's \"Marxist-Leninists\" do. read [their statement on the Taliban's victory in Afghanistan](https://www.prisoncensorship.info/article/whither-afghanistan/) (again, Tor) and compare it to reactionaries like Jackson Hinkle who fawn over the Taliban with shameless orientalism.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Particular-Hunter586",
                                                            "body": "Eugh, I hadn't thought about Jackson Hinkle in a second. I peeked at his social media out of curiosity, and he's now whining about how Trump is \"deep state\" instead of \"draining the swamp\" without even having deleted those awful AI-slop edits of him defending Trump from assassination attempts.\n\nWith regards to the rest of your comment, I think that the difference between \"fundamental contradiction\" and \"principal contradiction\" is something to note here.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "red_star_erika",
                                                                    "body": "yeah, it seems acp's gamble was leeching onto the Trump base and trying to drill Dengist \"multipolitary\" values into them so they can try to steal them from under Trump by acting shocked and crying betrayal when the imperialist turns out to be an imperialist. it's completely cynical and patronizing from people who supposedly believe in the white proletariat. maybe the grift will work out for them if Trump voters get sick of Tesla death robots knocking on their front door to ask them at gunpoint why they let Elon's latest tweet flop. who knows?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Particular-Hunter586",
                                                                            "body": ">maybe the grift will work out for them if Trump voters get sick of Tesla death robots knocking on their front door to ask them at gunpoint why they let Elon's latest tweet flop\n\nCan't tell if you're being sarcastic or not here, so apologies if you're talking tongue in cheek. But this seems like a weird thing to say, in line with people who fearmonger about the U$ becoming a \"digital dystopia\" or \"technofeudalism\" or whatever. In reality the Tesla robots, if they develop that far before climate crisis and inter-imperialist war (or, fingers crossed, revolutionary delinking of rare earth metal-mining countries in Africa, or a return to the revolutionary road in China) doom Amerikan tech expansionism, are going to be deployed to knock at the doors of Hamas sympathizers in the Middle East and red-tagged Pinoy activists with guns at the ready, and knocking at the doors of Trump voters with delivery orders of fresh fruit and booze and cheap commodities. I think you and I can both recognize the deeply reactionary kernel behind inflated fears of AI and other technology, exacerbated by (equally reactionary) Amerikan culture-industry sci-fi.\n\n(Only bringing this up because by and large I really like your analysis, and this surprised me. Sorry again for digging too deep if this was just a throwaway comment. I know it's cliche to say but I can't read tone over the internet at all.)",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "red_star_erika",
                                                                                    "body": "it's tongue in cheek. I don't think that would actually happen.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Particular-Hunter586",
                                                                                            "body": "My bad :)",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Particular-Hunter586",
                                                    "body": "Like Erika, I disagree with some of this criticism, but I think it's great to see MIM thought both taken seriously but not taken as dogma or without criticism. I will say, regarding MIM(Prisons)'s assessment of the Revolutionary Internationalist Movement, I remember the now defunct u/mimprisons mentioning maybe a year or so ago that they were working on a long writeup regarding the RIM, the RCP, MIM's orientation towards both, and perhaps also including stuff about the ICL and the OCR - this was in the context of a discussion about the CPUSA's role in the Comintern. I wish that the account were still active because I'd be interested to see whether that turned into anything.\n\n>a process presently taking place in the resurgent tenant unions among other places\n\nThis is interesting, my gut reaction without a ton of research (largely due to a Kites article I read on the topic) is to dismiss the trend of \"resurgent tenant unions\" as almost akin to mutual aid. Has anyone in your group (or anyone else who you've been influenced by) written anything about the potential for radical land struggle in tenant unions? \n\n>If we don't recognize this, then we will end up in the same position as the revisionists who frame every protest in Iran or China as \"color revolution\", who frame \"great leaders\" like Maduro in Venezuela as revolutionary poles, and lead the masses away from genuine solidarity with revolutionary workers worldwide.\n\nTo be fair this isn't unique to third-worldism - there have been people on here and writing for other supposedly \"Maoist\" organizations who overcorrected against Amerikan-chauvinist Sinophobia and Russophobia by essentially alleging BRICS to be the \"lesser of two evils\", both with and without talking about the Amerikan labor aristocracy as justification.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "NobodyOwnsLand",
                                                            "body": ">This is interesting, my gut reaction without a ton of research (largely due to a Kites article I read on the topic) is to dismiss the trend of \"resurgent tenant unions\" as almost akin to mutual aid.\n\nIn our experience the present trend of tenant union organizing, particularly that aligned with the recently-formed Tenant Union Federation (TUF, pronounced \"tough\"), marks an intentional departure from mutual aid focused paradigms of tenant organizing towards a \"power hungry\" (the exact words used in these orgs) practical power focused one which seeks to organize tenants into a union structure which can form the mass base of escalating attacks against landlords to eventually liquidate landlords as a class entirely. The founding TUF unions gained their unity through struggles around practice (militant mass organizing rather than advocacy or aid, rejection of legalism and anti-strike attitudes, strong leadership development from the base rather than relying on paid organizers, rejection of liberal attitudes toward conflict, etc.) and are preparing to demonstrate the fruits of this in the near future. We see this as a generally very positive development in the US, though there are some open questions/struggles within TUF which must be resolved in order to maintain this positive role, particularly clarifying its politics and the role of politics in the movement (should or shouldn't politics be in command? Is \"ideology\" something which keeps our goals in-focus or a dogmatic hindrance to our relationships with people?).\n\nWe see the present role of Maoists in the tenant movement as learning from the practices shown to be successful by these unions (linking up with the tenant masses in the process), uniting with communist tenant leadership (which exists at every level of TUF) in order to advance the land struggle along revolutionary lines, and struggling against elements which seek to de-politicize the struggle and divert these unions back into advocacy and aid work. Where we're at, this has so-far been successful, with the union recently purging a particularly petty-bourgeois mis-leader seeking to divert resources away from mass work and into reformist policymaking. \n\n>Has anyone in your group (or anyone else who you've been influenced by) written anything about the potential for radical land struggle in tenant unions? \n\nDue to the recent-ness of all this and the even more recent nature of our own organization not much has been written by us, and what has been written has been published in liberal outlets that limit what language can be used. Nobody Owns Land is working on a more detailed assessment of the tenant movement and its importance, to be published as a statement online and in-print, but I can't say when this will be complete. One thing that has recently been published from the LA Tenants Union is the book [Abolish Rent](https://www.haymarketbooks.org/books/2443-abolish-rent). LATU is not part of TUF, but is on good terms with it (think the CPP and RIM) and is very close to it in terms of practice. Abolish Rent is an excellent introduction to the practice of tenant organizing and does a decent enough job in beginning a more mature conversation about material land struggle in the modern US, a conversation which we see as having taken a step back since the decline and end of sharecropping in the US and the likewise brushing aside of the Black Belt thesis by most nominally-communist organizations.\n\n>To be fair this isn't unique to third-worldism\n\nMy apologies if it seemed as though I was implying it to be. It definitely isn't exclusive to that. My main intention was to highlight what I see as a natural end-point of framing the first and third-world as bourgeois and proletarian, particularly since it runs the risk of reframing the class struggle in the third world as simply one of external meddling and invasion, when these are tactics of imperialism which are in many cases empowered by the internal class struggle within the third world (for example: the partition of Africa being maintained in many cases by African national-bourgeoisies, as pointed out by Walter Rodney)",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Particular-Hunter586",
                                                                    "body": "This is all really interesting, I hadn't even heard of TUF. The existence of tenant unions with a broader focus than just temporarily improving the life of the newly-immiserated labor aristocracy is very promising. And the fact that there's communist tenant leadership at every level of TUF. I think that the idea of tenant struggles as land struggles (I'm imagining you mean among oppressed nations?) is an interesting one, albeit one that I'd need to see much more investigation and theoretical justification for, since obviously even the most radical tenant unions are far from what the land struggle resembled in semi-feudal countries. \n\nI don't have enough time or money at the moment to read Abolish Rent, and my instinct would be to dismiss a random Haymarket publication with buzzwords like \"abolishment\" and \"real estate greed\", but I'll give it the benefit of the doubt that it's better than that. Totally understand if not, but if there's anything in the book explicitly related to either the redevelopment of tenant struggles from a communist standpoint, or the land question in conjunction with oppressed nations, would you mind taking photos and sending them to me or posting them here? Or just summarizing what's been said?",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "clinamen-",
                                                                            "body": "the book is available on anna’s archive.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SheikhBedreddin",
                                    "body": "Wait who are you distinguishing yourself against as “Nobody Owns Land” ? That’s your screen name, isn’t it?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "NobodyOwnsLand",
                                            "body": "[Nobody Owns Land is a zine, guerilla publisher, and communist organization based in Louisville, KY](https://www.nobodyowns.land). I (the operator of this account and other social media associated with this) go by Dechoukaj. I serve as the org's Minister of Information, with part of my role being answering questions relating to line.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sea_Till9977",
                    "body": "That passage about the civil war is kinda insane. How do communists who capitulate always say shit worse than liberals? I have also seen this wrt Palestine.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "None",
                            "body": "For a group that ranted a lot about postmodernists, they sure seemed to think like them!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bubbly-Ad-2838",
                    "body": "The main mistake with the CR-CPUSA, which it shares with a great deal of other \"Maoist\" or not \"Maoist\" organizations, is the rejection of dialectics and its replacement with hermeneutics and apriorism, or more generally, subjectivism. The \"self-criticisms\" by the CG-CR-CPUSA and The Worker are even more shameless. While they doubled down in their subjectivism, they even opportunistically adopted third-worldist and obscurantist approaches by saying their failures are due to the economic status of the US not being able to produce revolutionaries. Let us forget how shameful and opportunist this is for a second, when they had repeatedly denounced third-worldism, but just face the fact: whatever added difficulty there is for being in the US, I'm sure organizing 200 people (and failing at it) doesn't begin to reach that.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Tsjr1704",
                            "body": "When did they ever claim the economic status of the US was behind their failures? Citation needed.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Bubbly-Ad-2838",
                                    "body": ">The United States, as the sole, hegemonic, imperialist superpower, with all of its opportunism and bribery, is not able to produce the kind of revolutionary consciousness found in Russia then, nor in the Third World today. This must be grasped in order to understand our own amateurishness, in combination with what was outlined above.\n\n[https://theworker.news/2024/11/16/some-lessons-on-the-historical-experience-of-constituting-the-bolshevik-party/](https://theworker.news/2024/11/16/some-lessons-on-the-historical-experience-of-constituting-the-bolshevik-party/)",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Tsjr1704",
                                            "body": "Why did you cut out the whole quote? This is not a “third worldist” position. This is basic Leninism: revolution and revolutionary organization develops unevenly, conditions which allowed the quick development of the Bolsheviks and that generated tried and tested leaders in militant practice are not the same here in the USA. I don’t see anything strange about that. \n\n“It should also be noted that the law of uneven development also plays a role in the process of Party reconstitution in the United States. This law expresses the general spasmodic development of imperialism in the stage of its decomposition, where the economic development of countries are sharply demarcated, and the world is divided and redivided among the imperialists through inevitable wars and conflicts between them. This uneven development, however, allows imperialism to be broken at its weakest link, and for the proletarian revolution to be victorious in one country first. This also means that in these “weak links” in the chain of imperialism, that the revolutionary movement will generate proletarian revolutionaries and leaders of a higher quality based on a greater degree of practical revolutionary experience. This is necessarily so as it is an expression of the unevenness in development of the world proletarian revolution, where the principal contradiction in the world is between the oppressed nations and imperialism, and historically, it has been in these countries were the proletarian revolution has developed most qualitatively. The United States, as the sole, hegemonic, imperialist superpower, with all of its opportunism and bribery, is not able to produce the kind of revolutionary consciousness found in Russia then, nor in the Third World today. This must be grasped in order to understand our own amateurishness, in combination with what was outlined above. LPP pa",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Tsjr1704",
                    "body": "That article was correct. If you are angry and feel it's chauvinist, then Lenin, Mao and Stalin were chauvinists and \"white settler leftists\" as well.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "NobodyOwnsLand",
                            "body": ">then Lenin, Mao and Stalin were chauvinists and \"white settler leftists\" as well\n\nHow? I'm sorry, but you don't get to hide behind genuine revolutionaries when the topic at hand had nothing to do with any of them. I'll give CR-CPUSA credit for one thing though: most \"communist\" groups in the US avoid publishing actual direct statements of their view of US history like the plague, preferring instead to endlessly posture about the Russian, Chinese, and Peruvian, etc. revolutions. CR-CPUSA/Red Guards instead really said with their whole chest \"vacillating petty bourgeois and labor aristocrat white people played the decisive and leading role in US revolutionary history, and unity means uniting with this.\" Props to their honesty.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Tsjr1704",
                                    "body": "I am not engaging with you, you are intelligent enough to read what they wrote and I won't demean you by presuming you are illiterate.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Autrevml1936",
                            "body": "Can you not just say \"the\" article was correct as a few different articles were referenced(do you mean that Chauvinist article about the Civil War and Lincoln? Or a different one?). And actually address all of their critiques of the CRCPUSA.\n\n\nAnd actually address Settler Colonialism in the U$ by addressing Sakai's Settlers and the text's by MIM.\n\n\n\"Lenin, Mao and Stalin were chauvinists and \"white settler leftists\" as well\" is not a response and shouldn't be considered \"White\" as it is a result of Settler Colonialism and the Labor Aristocracy.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "urbaseddad",
            "body": "There's a \"Maoist\" turned DSA shill YouTuber called Black Red Guard. Maybe that's what you're thinking of. But I'm not amerikan so perhaps others can clarify. I'm also interested in a political analysis of why the RGs / CRCPUSA exploded, I don't find the accusations of cult behaviour and so on a satisfactory explanation for that, especially because the accusations are being used for anti-communism.",
            "score": 15,
            "replies": [
                {
                    "author": "NobodyOwnsLand",
                    "body": "My understanding is that, years ago (pre-pandemic), Black Red Guard was part of the Red Guards in St. Louis and was part of \"Serve the People\" which was a mass organization focusing on food aid. When he left the Red Guards around 2019 he was part of a split in Serve the People which produced \"For the People\" in St. Louis, which continued the previous STP work. After a period of mud-flinging between the two groups it seems like STP folded sometime after 2020, with FTP's last activity (online at least) taking place over a year ago as well. Since then, again as far as I know, his main work has been his YouTube channel and showing up at local actions repping the DSA.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "theenbyjune",
                    "body": "i often wonder what drives someone like brg to turn to shilling the dsa after such a long time preaching maoism, but then again, look at people like zak cope.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "For BRG perhaps it's the lack of of revolutionary theory and practice and strategy in the US. For Zak Cope he's a prod settler and although he had started to turn into a fascist before, it looks like Operation Al Aqsa Flood when his class comrades were attacked is what pushed him over the edge.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -6,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "It sounds like you yourself are a DSA shill trying to do some lame covert advertising for this faction. Go away",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comrade_Graydon",
            "body": "Have you heard of the Maoist Communist Union? They are a pre-party formation that grew out of a previous organization called Mass-proletariat. They have a piece on the [Red Guards](https://www.bannedthought.net/USA/MassProletariat/2017/MP-RGA-IsNotAnMLM-Organization-171226.pdf).",
            "score": 5,
            "replies": [
                {
                    "author": "Last_Tarrasque",
                    "body": "I have heard of the Maoist Communist Union, I got quite into them for a while but I have come to learn that they hold some extremely reactionary positions akin to neo Trotskyism. There reactionary position mainly falls on the line of Settler/Labor Aristocrat \"Maoism\" and a take on the PCP that tails western narratives (I am aware there is much debate on the PCP within Maoist cercles, the MCU's take on the PCP would make even the most hardline Sisonist jump to Chairman Gonzalo's defense)\n\nArticle by MIM prisons on the MCU's settler/labor aristocrat Maoism: [https://www.prisoncensorship.info/article/a-polemic-against-settler-maoism/](https://www.prisoncensorship.info/article/a-polemic-against-settler-maoism/) (use Tor)\n\nArticle on the MCU's awful take on the PCP: [https://newsocietytheoreticaljournal.wordpress.com/2024/06/14/paper-will-put-up-with-whatever-is-written-on-it-exposing-the-right-opportunist-headquarters-in-the-us-communist-movement/](https://newsocietytheoreticaljournal.wordpress.com/2024/06/14/paper-will-put-up-with-whatever-is-written-on-it-exposing-the-right-opportunist-headquarters-in-the-us-communist-movement/)",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "clinamen-",
            "body": "There has been some discussion here. If you type CRCPUSA in the search bar a few threads will show up.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "> they implicitly denounce any Communist organization or Party as a \"cult\"\n\nYup. In the text on the CRCPUSA's underground tactics the editor of the cult accusations website literally highlights parts of direct Lenin quotes as \"passages\" which are \"significant\" in indicating supposedly cultish behavior. It's naked anti-communism.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Bubbly-Ad-2838",
                    "body": "Two questions. \n\n1. The anti-cult people were all leaders of the CR-CPUSA, were they not? How come this is the membership quality of a supposed \"communist\" organization?\n\n2. What is the task of the CR-CPUSA that needs to be fulfilled? To be clear, you are saying a minuscule organization, declared by a dozen people with zero social practice in class struggle, somehow occupies the ideological position of \"reconstituting\" the Party which no one else can assume?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "hallelooya",
            "body": "I don't have the energy--it's a long story. But the Revolutionary Study Groups have a statement: [https://struggle-sessions.com/2023/01/29/statement-on-the-opportunist-former-leadership-of-the-us-maoist-movement/](https://struggle-sessions.com/2023/01/29/statement-on-the-opportunist-former-leadership-of-the-us-maoist-movement/)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tsjr1704",
            "body": "u/Last\\_Tarrasque,\n\nThere is an ongoing movement among disparate Maoists and revolutionaries who are interested in Maoism to reconstitute the Communist Party. I'm a supporter of that effort, but am not involved. To my knowledge, there was a split in 2022, stemming in large part from the mistreatment of certain leaders towards the rank-in-file. Out of that came those supporting [The Worker](http://theworker.news) newspaper, who have pushed for reconstitution. There is the [\"Politically Degenerate Right Liquidationists\" (PDRL),](https://redlibrary.info/works/usa/a-statement-on-the-politically-degenerate-right-liquidators.pdf) the group that pushed for the dispersal of organized Maoists and that run the [\"Maoist cult exposed\"](https://maoistcultexposed.wordpress.com/) website. Originally those dismayed with the old leadership were part of a project called the \"New Working Group\" but the PDRL went their own way to focus on \"cult education\" while others skeptical of the PDRL's anti-Communist turn formed their own organizations known as the \"Revolutionary Study Groups.\" Further, there is also the [New Labor Press](https://newlaborpress.org/), which also came from that. \n\n[\"Our Main Weakness In The Three Fields\"](https://redlibrary.info/works/usa/our-main-weaknesses-in-the-three-fields.pdf) by the Central Group of the CR-CPUSA was a self-criticism released by some former organizers, essentially identifying some of the political errors involved between 2014 and 2022 that led to a dispersal.",
            "score": -2,
            "replies": [
                {
                    "author": "Autrevml1936",
                    "body": "The CRCPUSA has been discussed before on this sub:\nhttps://old.reddit.com/r/communism/comments/x1krsm/the_collapse_of_the_crcpusa_and_red_guards/\n\n\nAnd the criticism isn't worth much:\nhttps://old.reddit.com/r/communism/comments/1gedjb7/comment/lus6qrp/",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}