{
    "title": "Was the USSR socialist?",
    "author": "Powerful_Marketing16",
    "subreddit": "communism",
    "rank": 196,
    "score": 1,
    "upvote_ratio": 0.51,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/communism/comments/1h8cagz/was_the_ussr_socialist/",
    "id": "1h8cagz",
    "selftext": "I recently came by some leftcom content that argued that stalinist USSR was not socialist because it had commodity production, commodity fetishism, wage labour and claiming \"stalin was a lassallean because both upheld socialist commodity production\" I personally do not agree with these claims, but do you have any arguments / videos that defend the economics of the USSR? if so i would like to study it.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Historical development is a process not an on-off switch. Whether a country is socialist is not simply a matter of political economic facts abstracted from broader history, but must be evaluated relative to where a society is coming from and where it’s headed.",
            "score": 28,
            "replies": [
                {
                    "author": "IdRatherBeMyself",
                    "body": "This \\^\\^\\^\n\n\"Socialism\" is a period when the elements of both capitalism and communism are present in the society. If the share of the former is decreasing and the latter increasing — it's progress. If it diminishes — it's regress. \n\nIf you look at the USSR through time, you'd see that it was exactly that — progress, when the capitalist elements were gradually eliminated. For example, the last job centers (places where unemployment people would flock to to get whatever temp job for a day) closed their doors in the beginning of 1930s. Yes, there was unemployment, until there wasn't.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": ">I recently came by some leftcom content that argued that stalinist USSR was not socialist because it had commodity production, commodity fetishism, wage labour and claiming \"stalin was a lassallean because both upheld socialist commodity production\" I\n\nMost of these people are losers who are desperately seek attention by making the most controversial takes that will become the next soundbite to be argued over on Twitter. Take initiative and do your own investigation, and don't let yourself be so easily influenced \n\n>do you have any arguments / videos that defend the economics of the USSR? \n\nStalin's *Economic Problems of Socialism in the USSR* for one. That's the text where most of these misinterpretations about Stalin advocating for commodity production come from",
            "score": 60,
            "replies": []
        },
        {
            "author": "kannadegurechaff",
            "body": "[Economic Problems of Socialism in the U.S.S.R.](https://www.marxists.org/reference/archive/stalin/works/1951/economic-problems/index.htm)",
            "score": 21,
            "replies": [
                {
                    "author": "ComIntelligence",
                    "body": "A classic and essential text for all serious Marxists, absolutely required reading which must be engaged with to obtain a full understanding of the process of Socialist Construction.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "niddemer",
            "body": "The USSR was socialist during Stalin's time, but it went revisionist pretty shortly afterward",
            "score": 5,
            "replies": []
        },
        {
            "author": "oysterme",
            "body": "These guys wanted the USSR to immediately become some sort of anprim commune immediately after the Tsar was overthrown no matter how impractical that would have been.",
            "score": 3,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "Practicality is a loaded term and the goal never was and never will be \"anarcho-primitivst communism\" (whatever that is supposed to mean)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "oysterme",
                            "body": "How is “practicality” a loaded term in materialist circles?\n\nAnd why is Anarcho primitivism in quotes here? You can look up that tendency if you are unfamiliar.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "Revisionists justify all sorts of disgusting things in the name of \"pragmatism\", \"being practical\", \"realism\", etc.\n\n\n\"anarcho-primitivst communism\" is in quotes because I have no idea what that's supposed to mean but I know it has nothing to do with communism or its goal, so whatever it is it's a misnomer.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": []
        },
        {
            "author": "LucasFishwall",
            "body": "The debate over whether the USSR was truly socialist is a complex and nuanced one. Leftcoms argue that the USSR, under Stalin, was a state capitalist system due to its reliance on commodity production, wage labor, and centralized planning that didn't abolish the market completely. However, many Marxist scholars and economists argue that while the USSR had flaws, its planned economy represented a significant break from capitalist systems. *“The Political Economy of Stalinism”* by Neil Robinson and *“The Economics of Feasible Socialism”* by Alec Nove are two key works that defend the Soviet economic system, emphasizing that it was a form of socialism with its own contradictions. For video resources, you might check out *The Real Story of the Soviet Economy* by the YouTube channel *The Russian Revolution* for a breakdown of the system and its development over time. It's important to consider both sides of the argument to understand the complexities of Soviet socialism.",
            "score": 0,
            "replies": [
                {
                    "author": "Powerful_Marketing16",
                    "body": "it seems i could not find the video about the soviet economy by the russian revolution, however, i will be checking out those books!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Trap_Ritual",
                    "body": "I cannot find that YT channel anywhere…. Link?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}