{
    "title": "Stop NATO’s War Policy! – Joint Statement of the DKP and PCPE",
    "author": "Democritus755",
    "subreddit": "communism",
    "rank": 179,
    "score": 13,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/communism/comments/1hcrfw9/stop_natos_war_policy_joint_statement_of_the_dkp/",
    "id": "1hcrfw9",
    "selftext": "\n\nJoint Statement of the German Communist Party (DKP) and Party of the Peoples of Spain (PCPE)\n\nThere are military bases of NATO and its leading force USA in many states of the world, in some of them US nuclear weapons are stationed. They are an immediate danger for all countries that do not subordinate themselves to the USA and its allies. From 2025, it is planned to station additional SM-6 medium-range missiles, Dark Eagle hypersonic missiles and Tomahawk cruise missiles, to begin with in the FRG. These are being announced as conventional missiles, but all of them can be equipped with nuclear warheads. These are offensive weapons that threaten the strategic balance. This is a further step towards escalation and increases the danger of a nuclear war. \n\nNATO has been an aggressive imperialist war alliance since its foundation, initially directed against the socialist states. The number of wars of aggression waged by NATO states since its foundation runs into the dozens; in addition to a few other states, it has been mainly the United States that has been responsible for them. \n\nAfter the defeat of socialism in the Soviet Union and Eastern Europe, NATO expanded continuously and against all agreements to the Russian border. A further step was to be taken in 2014 with the coup d’état in Ukraine by nationalist and fascist forces. When this was met with resistance in parts of the country, Ukraine became a military staging area through which NATO is now waging a war against Russia, with NATO weapons as well as financial and political support.\n\nIn October 2024, a NATO tactical headquarters (Commander Taskforce Baltic) was officially opened in the German Baltic Sea port of Rostock, in violation of the provisions of the “Two Plus Four Treaty”. \n\nNATO supports Israel politically and with weapons in its genocide in the Gaza Strip and its terrorist war against Lebanon. \n\nIn Asia, too, NATO is pursuing an aggressive policy of provocation against the PRC in Taiwan, with the expansion of aggressive military alliances such as AUCUS. \n\nNATO countries are militarily active in Africa and Latin America to enforce their imperialist interests there. \n\nNATO’s war policy, which is the military expression of the efforts of the USA and its allies to achieve imperialist dominance and subjugate other states and peoples, is responsible for millions of deaths, it endangers world peace, and it causes poverty and misery worldwide.\n\nWe want to protest in our countries coordinated, so on a common date, against NATO war policy!\n\nWithdrawal of all US nuclear weapons from Europe\n\nNo deployment of new medium-range missiles in Germany!\n\nWithdrawal of all NATO facilities!  \n\n\nSignatories:\n\n\n\nSolidnet Parties:\n\nCommunist Party of Bohemia and Moravia\n\nCommunist Party of Bangladesh\n\nCommunist Party of Britain\n\nSocialist Workers’ Party of Croatia\n\nGerman Communist Party\n\nHungarian Workers’ Party\n\nKurdistan Communist Party – Iraq\n\nWorkers’ Party of Ireland (official)\n\nCommunist Party (Italy)\n\nCommunist Party of Luxembourg\n\nRomanian Socialist Party\n\nCommunist Party of the Russian Federation\n\nRussian Communist Workers’ Party\n\nCommunists of Serbia\n\nCommunist Party of the Peoples of Spain\n\nCommunists of Catalonia\n\nCommunist Party (Switzerland)\n\nCommunist Party of Ukraine\n\n\n\nOther Parties:\n\nDanish Communist Party\n\nPole of Communist Revival in France\n\nDemocratic Front for the Liberation of Palestine\n\nParty of Communists of USA\n\nPosted at: [https://dailyworkerusa.com/index.php/stop-natos-war-policy-joint-statement-of-the-dkp-and-pcpe/](https://dailyworkerusa.com/index.php/stop-natos-war-policy-joint-statement-of-the-dkp-and-pcpe/)\n\nRetrieved from SolidNet – [http://solidnet.org/article/German-CP-CP-of-the-People-of-Spain-Joint-statement-Against-the-imperialist-war-alliance-NATO-Stop-NATOs-war-policy/](http://solidnet.org/article/German-CP-CP-of-the-People-of-Spain-Joint-statement-Against-the-imperialist-war-alliance-NATO-Stop-NATOs-war-policy/)\n\n",
    "comments": []
}