{
    "title": "TKP-ML has successfully concluded its 2nd Congress.",
    "author": "BoudicaMLM",
    "subreddit": "communism",
    "rank": 176,
    "score": 37,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 15,
    "url": "https://maoistroad.blogspot.com/2024/11/long-live-our-2nd-congress-organize.html",
    "id": "1hdbroc",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I wonder about their line on Syria now.",
            "score": 13,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "I wonder what their line on Cyprus is",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "BoudicaMLM",
            "body": "For clarification, this is the TKP-ML that was the organising committee faction of the TKP/ML which split over involvement in HBDH, which is an alliance that united various Communist forces with the PKK, in the fight against the Turkish state, and also to defend Rojava. The TKP/ML central committee faction didn't want to be involved in this because they saw the PKK as an organisation that did not have the correct line on the national question (ie that \"autonomy\" was enough of a goal, rather than full national self-determination for the Kurds.) My understanding is fairly limited of all, and I would like clarification on the TKP-ML v TKP/ML split.",
            "score": 13,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "Is this the one that's part of the ICL or is the ICL member the party they split from?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "sovkhoz_farmer",
                            "body": "TKP-ML is not a member of the ICL. That would be TKP/ML.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "Thanks ",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "sovkhoz_farmer",
                                            "body": "Your welcome.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Last_Tarrasque",
                    "body": "Could you explain this more? I have just about zero background other than knowing that the TPK/ML exists so I understood very little of that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bubbly-Ad-2838",
                    "body": "Basically the Rojava section of TKP/ML wanted to tail the PKK (hilarious) and split and made their own Party. HBDH is basically PKK plus.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BoudicaMLM",
                            "body": "I think saying that being involved in HBDH is tailism at this point, I would like to see someone make that argument though. The old TKP/ML have left but still support them, whereas the new TKP-ML are still involved but are critical of the PKK regardless. It's a really difficult split to follow, but then you look over at the MKP Partisi /MKP Parti split...\n\nIt's a mess, and I do wonder if the Turkish movement isn't just in an early stage of development since Kaypakaya died. I am interested to see now, after events in Syria affect Rojava, where do all these HBDH cadre go? Do they stay in Syria? Go back to North Kurdistan? Istanbul? Berlin? The actual organisational infrastructure of groups like TKP/ML, TKP-ML and the MLKP is impressive and shouldn't be discounted as an important subjective factor.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Bubbly-Ad-2838",
                                    "body": "TKP/ML has an unclear approach on PKK. It correctly claims PKK to be an armed reformist national movement that needs to be supported, but one wonders what this support materially entails, especially with its diminished combat capacity after the split. They don't exist in Rojava really.\n\nThe split is rather simple, a minority of the party faked a signature to join HDBH and later when confronted decided to split, which finds its support in Rojava and Europe. HBDH is a process entirely led by the PKK who doesn't even claim to be socialist and works with CHP. Let's be real here, all these parties, MLKP, TKP-ML, etc. in Rojava are basically PKK pawns to recruit Turkish intellectual/youth into their stillborn reformist project. When is the last time these 100 Communist Parties in Rojava did anything Communist other than waving their flags? All the while PKK/PYD sells more oil to the US, continues maintaining semi-feudalism, and plays realpolitik with tribal leaders, Russia, SAA, and the opposition, failing spectacularly in the process. Apparently TKP-ML is now Armenian nationalist? At this point no one really cares, because their theory has already been confronted with practice. MLKP makes the case even more obvious because they explicitly don't believe in anything at all, being an alliance of the different failed elements of the 20th century anti-revisionist left, think FRSO with an army.\n\nFor TKP/ML which is not in Rojava, their small armed bands will continue to exist with an urban movement regardless of Rojava's existence. Rojava has not played a positive role for the Turkish left but rather a black hole that wastes their resources and manpower, again something DHKP realized 20 years ago before Rojava, just like they made the assessment on PKK 20 years ago, which the TKP/ML was too entrenched in their pragmatic alliance with PKK to point out until very recently. (DHKP is the main successor of Dev-Genç in your bio)\n\nE: the split between the two MKPs is more unclear although it's of no interest to anyone. Who cares about how they implement multi-Party socialism?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Thegreatcornholio459",
            "body": "so what does this mean, is this group still going to be active despite the turkish government crackdown on kurds",
            "score": 2,
            "replies": [
                {
                    "author": "Careless_Owl_8877",
                    "body": "yes it would seem so",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}