{
    "title": "Why do some people say Amerikan?",
    "author": "Nohrian_Noctem",
    "subreddit": "communism",
    "rank": 166,
    "score": 49,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 58,
    "url": "https://www.reddit.com/r/communism/comments/1hg8tfr/why_do_some_people_say_amerikan/",
    "id": "1hg8tfr",
    "selftext": "I see on social media some people (usually left-leaning) spell American as Amerikan, I tried looking around and couldn't find an answer so I'm just curious why that is? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Important_Trouble_11",
            "body": "My guess is that 'Amerikkkan' got shortened",
            "score": 178,
            "replies": []
        },
        {
            "author": "OMGJJ",
            "body": "https://www.prisoncensorship.info/archive/etext/faq/amerika.html",
            "score": 20,
            "replies": [
                {
                    "author": "Nohrian_Noctem",
                    "body": "Cheers for the link! very insightful read",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "kannadegurechaff",
            "body": "it's an anti-colonial name against the occupying white settler nation. \n\namerika, amerikkka, Kanada, Klanada, Turtle Island, Abya Yala, Aztlán, etc—any non-colonial name is welcome.",
            "score": 128,
            "replies": [
                {
                    "author": "Cuntillious",
                    "body": "I really like Klanada\n\nEdit: [klanadian flag](https://imgur.com/a/y5ZSk0f)",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "prettysweett",
                    "body": "Why turtle island?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "FunnyDirge",
                            "body": "Thats what native Americans called the US",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "insertcreativename43",
                                    "body": "Its not called turtle island in every nativen american language though right?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "_HI_IM_DAD",
                            "body": "It’s the name of the continent prior to anglo takeover",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "_HI_IM_DAD",
                                            "body": "??\n\nI didn’t say “was” the name. It *is* the name that is and has been, since at least the 70s, widely recognized to refer to the continent without regard to its colonizers. \n\nI appreciate the impulse to push back on what commonly is an essentializing tendency. But we gotta give people a bit of breathing room. I am and have for a long time been personally invested in learning all I can on this continent and its peoples’ deep histories and variety of traditions, historiographies, languages, belief systems, networks, relationships to the earth, food ways, and just as many other aspects I’ve yet to encounter. Not because I subscribe to some white saviorist “noble savage” fetish, but because history is the air we breathe and I won’t waste the time I was given shrugging off paternalistic aristocrats pouring mountains of stolen wealth into a project of burying the past.",
                                            "score": 18,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "It was started by Comrade George Jackson and Comrade WL Nolan, and was popularized by the Black Liberation and New Afrikan Independence Movements in the US, based on two things: the use of Amerikkka and the belief that in traditional Afrikan languages a ‘k’ was used in place of a ‘c’. Whoever said it was an anti colonial thing was correct.",
            "score": 14,
            "replies": []
        },
        {
            "author": "16ap",
            "body": "This is a baseless, long shot but to me it sounds like a critique to imperialism by evoking the German spelling “Amerika” thus alluding to the nazi regime.",
            "score": 35,
            "replies": [
                {
                    "author": "Nohrian_Noctem",
                    "body": "hmm that seems likely! I saw it most recently with people criticizing the recent Warfare trailer, how Hollywood will make pro-war movies about soldiers murdering thousands but feeling bad about it so it's ok. So I suppose it makes sense there for the person being critical to spell it as Amerikan",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Sure-Eggplant",
                    "body": "Not only the German spelling, but almost any other european languges spelling. I think a lot of europeans write this by mistake.\n\nI do too.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "16ap",
                            "body": "Italian, Spanish and Portuguese use the C. French uses “que”. Regardless, I interpret OP’s question as why do people who do it intentionally do it.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Odd-Dot1978",
                            "body": "Sorry but no.... This is not the reason. This mistake is just too uncommon. \nWe do struggle with putting the name of the country in capital letters. This is confusing because we say \"deutsche Sprache\". -> translates to *g*erman language and not German language. \n\nBut replacing our k's with c's is the easiest and most intuitive thing when learning English. We do this all the time. Here are some examples: \nKatastrophe -> catastrophy, \nKaffee -> Coffee, \nKaramell -> caramel,\nKoalition -> coalition \nKontakt -> contact \n\nAlso: European languages differ greatly....",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Sure-Eggplant",
                                    "body": "If you say so idc\n\nI surely write Amerika sometimes, but don't mess up the examples you gave\n\nBut i'm hungarian, so also different",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "princeloser",
            "body": "Because Amerikkka is a racist settler nation, and it cannot function without its racism. The prison system to this day functions as a form of population control against New Afrika and the many nations of Turtle Island. The point is to not forget or ignore it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "It's short for Amerikkkan. Which is sort of amusing to Filipino leftists.",
            "score": 16,
            "replies": [
                {
                    "author": "autumn_dances",
                    "body": "that took me a while, lol",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "_HI_IM_DAD",
            "body": "I love that this question made you think “communists…they’ll know this one”",
            "score": 8,
            "replies": [
                {
                    "author": "Nohrian_Noctem",
                    "body": "lmao, tbf most of the people I see spelling it that way are communists so I figured \"eh, worth a shot asking\" and I got my answer!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "_HI_IM_DAD",
                            "body": "Oh yeah you were not wrong at all, I guess I’d have expected like “antifa” or “anarchist” if not “liberal” or “sjw” to come before “communist” lol. May be a good sign.. that the dirty scare word resulting from a near century of anticommunist propaganda is finally shaking off? I can only hope.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "QuestionPonderer9000",
            "body": "https://www.prisoncensorship.info/glossary\n\nThis has explanations for a lot of the language you see here.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fernxqueen",
            "body": "Most likely it is (consciously or unconsciously) an abbreviated version of Maoist Standard English, where it is Amerikkkan, which differentiates between American, as pertaining to the U.S. (or in MSE, I usually see it referred to as the u.$.), and American, as pertaining to the continent, by invoking the white supremacist, colonial, imperial nature of the former.\n\n\nI'm not sure \"Maoist Standard English\" is a serious term or that it comes from Mao in any way, but a lot of Maoists specifically use it (both online and in print). See [this statement](https://www.prisoncensorship.info/archive/etext/faq/amerika.html) from MIM.",
            "score": 7,
            "replies": [
                {
                    "author": "SomeRightsReserved",
                    "body": "Mao never wrote in English so there’s no reason Maoist standard English would have something to do with him. \n\nMaoist standard English is used to refer to English that’s been directly translated from simplified Chinese(which is what Mao wrote in) and that’s used a lot by English Maoists. It’s pretty easy to identify because they use a lot of old outdated words that no one uses today.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "red_star_erika",
                            "body": "what are you talking about?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "Perhaps they googled \"Maoist Standard English\" and came across this AI-written nonsense article and thought it was real. https://sciencegate.blog/maoist-standard-english-linguistic-legacy/#MSE_Grammar_Morphological_and_Syntactic_Structure\n\n\\+ u/Particular-Hunter586",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Particular-Hunter586",
                            "body": "This is entirely untrue. Where did you get this from?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "fernxqueen",
                            "body": "Right, I mean that I don't know if the *idea* of using different spellings is something that stems from Mao Zedong Thought directly, or if it's simply associated with Maoists. I wasn't trying to imply he used the spellings himself.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "That_birey",
            "body": "İ dont know but in turkish america is writen and read as amerika so i like it",
            "score": 2,
            "replies": []
        },
        {
            "author": "IncompetentFoliage",
            "body": "I am not certain about the etymology but I have always assumed that it was in imitation of the style of KKK wordplay, like in Sakai’s “Klass, Kulture & Kommunity” and that Amerikkka was derived from this usage.",
            "score": 2,
            "replies": []
        },
        {
            "author": "whatthethethefrack",
            "body": "I've only seen it spelled Amerikkkan and assumed it was a shorthand for highlighting the white supremacist character of our society. If it is being spelled with only one k, it might just be a consequence of our very intelligently-funded public education system. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "VirtualReference3486",
            "body": "In my language we also say „Stany Spierdolone” (The Fucked-up States), because it rhymes with the name.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SCLST_F_Hell",
            "body": "This has some relation with all that “America is the continent, not the country, people born in the US needs to be more aware and start to use a new word to refer to themselves” stuff?\n\nSorry if I pushed someone’s buttons. Not on purpose. That is something I heard not long ago.",
            "score": -4,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "> America is the continent\n\n\nNo it's not. The continent is Turtle Island. I get the impression that Latins who say this are themselves colonial chauvinists, unhappy by the fact that the name often gets associated exclusively with the USA colonial regime and that they don't get to participate in that.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Auroraescarlate44",
                            "body": "If the generally recognized indigenous peoples names for the continent are being used Turtle Island would only be the northern part, Abiayala is the whole continent. As far as I know the southern portion has no generally recognized name, aside from Pindorama being used for Brazil.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "u/turbovacuumcleaner what do you think? Is calling the whole continent Abiayala better / more accurate than calling it Turtle Island? First time I'm hearing of it so not sure of its social and political context and connotations. Anyway, regardless, my broader point about the continent being called amerika and the Latins who bicker about who gets to use the colonizer name still stands",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Auroraescarlate44",
                                            "body": "These alternative names gain relevance due to being recognized by a significant number of indigenous groups since there are thousands of different languages still spoken by indigenous peoples in the continent, so there are many different names for the land. Abiayala was originally used by the Kuna people in Colombia but has gained relevance as a general name because of Continental Summits of Indigenous Peoples and Nationalities of Abya Yala that have been held periodically and attended by representatives from peoples of the whole continent. \n\nI don't know the origin of the recognition of Turtle Island as a general name but I have never seen it used in the context of the whole continent, only the North, so that's why I pointed it out. I agree with your point about the name America, it's irrelevant whether the imperialists have monopolized it, it should be discarded, it's mostly the petty bourgeois Latins who care about it.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "turbovacuumcleaner",
                            "body": "Yes, you are right.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lower_Acanthaceae423",
            "body": "A fascist was just elected president of Amerikkka, you figure it out.",
            "score": -4,
            "replies": [
                {
                    "author": "Natural-Permission58",
                    "body": "When was a fascist not elected as the president? Who is a fascist according to you?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Lower_Acanthaceae423",
                            "body": "We have had some shitty presidents, but none of them could be categorized as a fascist except Donald Trump. Only he has checked every box on the criteria.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Lower_Acanthaceae423",
                                            "body": "What are you talking about? I just told you, Trump is the only one that can be categorized as a fascist",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Natural-Permission58",
                                                    "body": "Again, who is a fascist according to you?",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -1,
            "replies": []
        }
    ]
}