{
    "title": "How to find organizations, tips, advice, wear to look?",
    "author": "Last_Tarrasque",
    "subreddit": "communism",
    "rank": 162,
    "score": 7,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/communism/comments/1hh5sru/how_to_find_organizations_tips_advice_wear_to_look/",
    "id": "1hh5sru",
    "selftext": "I am an Amarikan Maoist looking to find MLM organizations that I can actually get involved in. What are the best ways to go about looking for orgs to get involved in. Are there certain places to look (IRL or online)? Should I employ a specific tactic? Etc. If anyone has any organization recommendations that is welcome too.\n\nSecondarily, in order to potentially serve as inspiration, if it is safe and you are at liberty to discuss it, how did you find and join up with the organization you are currently working with. (Obviously don't break party secrecy or say anything that could endanger people).",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SheikhBedreddin",
            "body": "I feel like these posts show that this sub is doing something wrong.  It feels somehow novel. I don’t really know how to articulate the feeling any further there.",
            "score": 14,
            "replies": [
                {
                    "author": "None",
                    "body": ">It feels somehow novel.\n\nCan you at least expand on what you mean by this specifically?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "SheikhBedreddin",
                            "body": "The basic logic of these “help me find an organization” posts seems to be very apparently in logical contradiction with MLM. I’ve only seen “help me find an MLM organization” posts cropping up in the past year or so. \n\nIt seems like this is a sign that the internet is becoming able to digest MLM as a theoretical movement. It seems like this subreddit has been a part of that.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I think I get the idea. The reddit landscape makes it really easy to be overly credulous towards Maoism without any self-introspection. Perhaps it's because this is the only sub where you can read worthwhile Marxist analysis of current events from quality posters. But the search function almost turns Maoism into an answering machine, it doesn't take any self-criticism or introspection to look up \"r/communism opinions on [BLANK]\", see the general consensus on a subject, and begin engaging with the subreddit while following those political lines instead of taking them as inspiration for creating their own dialectical materialist analysis. I think one of the mods said it best when they called this subreddit \"a surrogate party for its members\" (or said it was becoming that, I can't find the post).\n\nI say all of this because I'm not smart enough to draw on more than my own experience. My account is new and I've only been a Maoist for a short time. It's tough to actually start reading and analyzing Marx and blindly consuming posts on this sub can sometimes feel like a really easy way out of that. I bring this up because I can see OP hasn't had too much engagement with this subreddit yet trusts its userbase's opinions so much that they're willing to partially give away their location and ask them how to make a massive life decision with no background knowledge whatsoever.\n\nI'm sure this also has something to do with Maoism being \"Deprogramified\" by YouTubers like Marxism Today or meme subs dedicated solely to gleefully dunking on social fascists (which is admittedly fun but can easily become unproductive).\n\nEdit: to be clear I don't think this is the sub's fault at all, I just don't think there is a way to have a forum on reddit that is impossible for liberal mentalities to take hold of, even when said subreddits are vocally against them. I don't understand the self or self-identity though so I'm sure someone else can elaborate or correct me on that statement.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "TheReimMinister",
                                            "body": "Yes, all true. Internalizing an answer without re-producing the answer yourself is like dissecting a cake and believing that its ingredients are crumbs and icing. Capitalism incentivizes a person to passively consume the cake and that is precisely the logic underlying the structure of social media, but as you allude to that doesn't mean that we can't take the time to bake (at the expense of forfeiting the incentive that social media provides). While it takes active effort to study and apply, it is something that everyone and anyone is capable of partaking in. Knowledge is relative - it is always the distance between what you know now and what you will know through active effort, and not an absolute amount of substance to absorb.",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "Last_Tarrasque",
                                            "body": "yeah that's fair, not pleasant to read but fair.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "BoudicaMLM",
                                            "body": ">It's tough to actually start reading and analyzing Marx and blindly consuming posts on this sub can sometimes feel like a really easy way out of that.\n\nThis is an excellent, crucial point. \n\nAs a self-criticism, I find myself going into the trenches of old posts on this subreddit, rather than working though the books that I've been trying to study for a few months now. \n\nIt's hard work to do this, but I think trying to find someone you know to study with helps. I've tried to work through things on my own, and I've tried to work through things in groups big and small. I think the most effective way in my view is working in small groups, where you can't just come along to a reading group and listen in to what other people are saying. I think there are huge limitations too, to trying to take on all the work of historical materialist analysis by ourselves too. \n\nNot sure how I fee l about your comment about Maoism being \"Deprogramified\" - I'm assuming you mean that rather than working in organisations with a political programme, instead people interested in studying Maoism are content with working in small isolated groups and posting online. (like ourselves!)\n\nOn the one hand, we need to have a concrete analysis of a concrete situation, and to be able to study and think about the material conditions we live in, we need to put in a lot of hours into making sure we understand Maoism. On the other hand, knowledge comes from practice, and it's hard to make those leaps in understanding without engaging in the real world around us. I guess it's difficult to understand the ratio between theory and practice, in terms of the amount of time to dedicate to it.\n\nSay you can dedicate 12 hours a week to doing work, just to pick an even round number.  \nMeetings usually take 2 hours, and maybe 3 for an action or whatever that may be, a protest/social investigation/stalls/doorknocking/organising and running an event, whatever. I think 3 hours for that is a reasonable amount of time. \n\nI think mininium 1 hour week needs to go to org admin, maybe an hour for misc prep work.  \n\nI honestly have mostly ended up spending my own individual study time that I have remaining a week scrolling here, or aimlessly looking at documents on various websites, and maybe if I'm being really honest, if I'm lucky, I do 1 hard hour of actual study.\n\nDiscipline is important and is something I need to improve on. It's tireing to do this stuff after working a job, doing org stuff, and then trying to follow through on other commitments .  \n  \nBut the point of trying to be a Maoist is to try not to take the easy way out.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "urbaseddad",
                                    "body": "https://www.reddit.com/r/communism101/comments/14c37a9/how_do_one_find_other_antirevisionists_andor/\n\nI did this a year and a half ago.\n\nEdit: although I think it's clear that I wasn't looking for \"recs\" on an organization or party; I had the belief (and now know for sure) that such an organization does not exist in Cyprus, at least not in the south, and so my basic issue (that I could not properly articulate at the time) was how to start party-building. Perhaps that's somewhat different than OP here or the other posts you're talking about. I did articulate a similar-sounding question though, and that was literally how to find individuals who would at least be sympathetic to anti-revisionism to begin working on the party-building process with. I do see how that question was misguided now, and also, finding \"individuals\" to begin party-building and finding an existing organization to join as OP is asking are perhaps different things.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Last_Tarrasque",
                                    "body": "Is that a bad thing, or am I reading your comment wrong?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "smokeuptheweed9",
                                            "body": "It's more that it's hard to understand your motivation asking this question. You don't know who I am or anything about me. I also don't know anything about you. Why would my recommendation be worth anything? \n\nWe get these threads a lot, mostly from liberals who have not yet broken with politics as a form of consumerist identity. They're not really looking for an answer, more adulation that they will now \"touch grass.\" Besides my distaste for being used as bellows for someone else's ego, this attracts disreputable people who have recruitment quotas. Both groups deserve each other but somewhere else please.\n\nIt's odd to treat Maoism in this way, because it's peripheral to this culture (the Maoist \"meme\" cultures are sad) and ostensibly exists to criticitize the parties one would find if you go from \"watch Jordan Peterson vs Zizek at x2 speed 'ironically' -> listen to an audiobook of the Communist Manifesto -> post 'Luigi' memes in Hasan Abi's chat -> Google \"communist party\" so you can make spicy leftist friends -> post \"what do you think about the CPUSA [the first result]?\" on reddit.\" \n\nI'm not saying that's you, it's because that's not you the question is hard to understand. It's hard to imagine someone emerging from the womb as a Maoist without having learned about all the existing \"communist\" parties and their various flaws. The Maoist movement is weak, if the answer was \"your country's national communist party\" or \"the party the CCP says is good\" then it would be easy. Instead, this subreddit mostly serves to give people space to criticize actually-existing parties because there's nowhere else to do it without the aforementioned grifters jumping at the opportunity or a bunch of liberals falling into despair at the first difficulty. \n\nI will grant Maoists are bad at social media so there probably are some pre-party formations that deserve to be mentioned as existing, at least based on the number of blog posts from orgs I've never heard of analyzing the mass line.  But even then, I can't give you an answer. It would exhaust all the good will we've built up as a safe space for discussion without endorsements.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Last_Tarrasque",
                                                    "body": "That's fair, I've found several organizations though the internet, but getting involved in actual work (which I do want to do, I don't want to just consume \"maoism\" as an identity) has been hard. I was more looking for general advice on how to do such a thing, how to find local comrades and link up with them, etc, than suggestions of actual organizations.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FinikeroRojo",
                    "body": "Agree. It feels like people come in here and read the sub and adopt this \"MLM\" Identity and work from there idk if I'm explaining myself but I don't like how it can be turned into that",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": ">and read the sub\n\nI think the inverse is actually the problem, people are receiving their information from places other than this sub. This is one of the only places on the internet that doesn't bullshit you about Marxism",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AstronomerForsaken",
            "body": "Marxism-Leninism is not an identity that can be 'shopped for' like a community service project. This misunderstanding reflects bourgeois individualism and liberal volunteerism. Revolutionary organization is a clandestine, disciplined, and professional force that proves itself through struggle. You will find the correct organization and cadre through practice and struggle—not by browsing options. Begin by organizing those around you, placing yourself where you are most needed, and grounding your work in Marxist-Leninist principles.",
            "score": -6,
            "replies": [
                {
                    "author": "SheikhBedreddin",
                    "body": "I’m genuinely amused that you think that what you just said is meaningfully different from OP.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "communist_moose",
                    "body": ">Begin by organizing those around you\n\nWhat does that mean",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}