{
    "title": "Historical document: Joint Statement by the KKP(M-L) Organizing Committee and the TKP(M-L) Central Committee",
    "author": "urbaseddad",
    "subreddit": "communism",
    "rank": 153,
    "score": 26,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 9,
    "url": "/r/redcyprus/comments/1hk7kpw/historical_document_joint_statement_by_the_kkpml/",
    "id": "1hk7qwo",
    "selftext": "",
    "comments": [
        {
            "author": "Particular-Hunter586",
            "body": "Really neat translation, thank you for putting in the work to make this available. It's always interesting to see the way that antirevisionism is made explicit in party programmes from the late 20th century.\n\nA few questions: first, maybe this is just because I'm not reading it carefully enough or I don't have enough background in Cypriot history, but it seems that this statement recognizes the existence of two different nations in Cyprus (Cypriot-Greek and Cypriot-Turkish), but only pays passing mention to those. To the best of your knowledge, how did the KKP take the national question into account in terms of revolutionary strategy?\n\nSecond:\n\n>The party of the labor aristocrats\\*, who are increasingly becoming a part of the Turkish Cypriot ruling classes with each passing day, is the CTP (Republican Turkish Party), a servant of Russian social-imperialism. The CTP also supports the occupation, quarrels with the ruling class parties over its share of exploitation and the expansion of Russian social-imperialism's influence in northern Cyprus, and serves the Turkish Cypriot ruling classes by infiltrating the workers' movement under the guise of being \"progressive,\" working to undermine and make the Cypriot revolution impossible from within.\n\n>\\[\\* *Labor aristocracy*: The segment of the working class which occupies the privileged, parasitic position of benefiting from the surplus value extracted from the workers of the Third World imperialized nations by the First World imperialist nations.\\]\n\nIs the definition you've included of labor aristocracy (which I agree is the correct and necessary way to understand the term in the current day) really the same one that the document is using? Like, is the statment alluding to Cyprus extracting value from the Third World and buying off a significant segment of its (ex-)proletarian working class? This seems incorrect given my knowledge of the economic state of the region in 1978 and from things I've seen you say in the past. I hate to sound like the average confused social-fascist but it seems to me here (especially with regards to the phrase \"infiltrating the workers' movement\") that the oft-toted original definition of well-paid union leaders and populist politicians makes more sense in this context. Or am I wrong, and, as far back as 1978, imperial superprofits were distributed among enough of the Cypriot proletariat to create a significant parasitic non-exploited segment?\n\nAnd finally, is the TKP(M-L) involved in the joint publishiment of this statement the same one that Kaypakkaya was the founder of? I'm uncertain (and can't find from cursory online searches of Wikipedia, [marxksts.org](http://marxksts.org), and banned thought.net) when this party differentiated grom the TKP/ML).\n\n(I apologize if any of this doesn't make sense; I have a cold and fever and it's making my writing come out scrambled for some reason. I've tried to edit this for clarity the best ofy abilities.)",
            "score": 8,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "> And finally, is the TKP(M-L) involved in the joint [publication] of this statement the same one that Kaypakkaya was the founder of? I'm uncertain (and can't find from cursory online searches of Wikipedia, [marxists.org], and banned thought.net) when this party differentiated [from] the TKP/ML).\n\nI found this on the TKP-ML website after coming across the site in [this thread](https://www.reddit.com/r/communism/comments/1hdbroc/tkpml_has_successfully_concluded_its_2nd_congress/). The TKP-ML, based on the discussion in said thread, was formed after the more pro-Rojava organizing committee within the TKP/ML broke off (in 2016 per u/Obvious-Physics9071). However, this statement was released in 1978, way before this split happened, so I imagine it was actually made by the \"original party\" (I put that in quotation marks because I'm not sure to what extent it really was a united party after Kaypakkaya's murder in 1973). On the other hand I can't find it on the TKP/ML's website, so I'm not really sure.\n\nu/Bubbly-Ad-2838 u/BoudicaMLM please clarify if based on your understanding I'm wrong.\n\n> To the best of your knowledge, how did the KKP take the national question into account in terms of revolutionary strategy?\n\nI have no clue, because as I said in the post the only concrete thing I know about the KKP(M-L) so far is what's in this statement. I'd like to know too if anyone has more information.\n\n> Or am I wrong, and, as far back as 1978, imperial superprofits were distributed among enough of the Cypriot proletariat to create a significant parasitic non-exploited segment?\n\nI am not so sure about this, but I get the impression that in the 80s (so a bit later than this statement) things were going quite well for us in the south economically. I don't know if this was a result of social democracy or of some form of imperialist parasitism already at the time.\n\nI included that definition because it's the Marxist definition as far back as Lenin. Correct me if I'm wrong but AFAIK \"labor aristocracy\" meaning the upper echelons of yellow unions is largely an anarchist / syndicalist / trade-unionist / economist thing.\n\nHowever I did consider whether they were using this definition, because I was also under the impression that there were little imperialist spoils to go around at the time. On top of that from what I know the \"Gonzaloite\" current the that TKP/ML belonged to (or ended up belonging to?) does not really uphold the thesis of the mass labor aristocracy in parasitic imperialist nations. AKEL was and is the party that dominates left-wing trade-unionism so they could be referring to that.\n\nQ: Labor aristocrats do still exist in imperialized / semi-colonized nations, rights? They just make up a small part of the population. I considered that maybe they meant that labor aristocrats (again, in the correct sense) which had ties to \"Russian social-imperialism\" made up this party; however, I'm not sure to what extent Soviet capital had penetrated Cyprus at the time if at all, although for sure we did buy weapons from them.\n\n> (I apologize if any of this doesn't make sense; I have a cold and fever and it's making my writing come out scrambled for some reason. I've tried to edit this for clarity the best ofy abilities.)\n\nDon't worry about it. Hope you get better quick.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Bubbly-Ad-2838",
                            "body": "Just to address the point I was mentioned for. TKP/ML, the party founded by I. Kaypakkaya, was originally written as TKP/ML in it's first documents, but also in other ways such as TKP(ML), TKPML and TKP(M-L). Perhaps it's to match the Greek KKE(m-l) but also there could not be any confusion for any normal person. When the Eastern Anatolian Committee of TKP/ML split in the 1990s under the direction of CoRIM and assumed the name TKP(ML), they tried to bizarrely claim that there's a big difference with punctuation and the original party was called TKP ML with no slash or parenthesis which was split in two, TKP/ML and TKP(ML). And finally, when the Rojava committee of TKP/ML split in 2016, they took up TKP-ML following the lead of TKP(ML). TKP(ML) today took the name MKP, Maoist Communist Party, and the name is retired. So this document was by the original party.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "Thanks so much for the clarification. I didn't know the MKP used to be the parentheses one. Also are these all the noteworthy splits in the original TKP/ML or are there more to be aware of? Perhaps one that assumed different names, not just differentiating in punctuation. ",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Bubbly-Ad-2838",
                                            "body": "There's one more of note, \"TKP/ML Movement\" that became MLKP. Initially Hoxhaist, later adopted a left-refoundationist view. Plays a big role in SDF. There's minor splits like \"Bolshevik Party\", \"TKP/ML MPM\" etc., but they aren't active.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "urbaseddad",
                                                    "body": "What's left refoundationism? Is it the position laid out in this document? https://frso.org/posts/theses-on-left-refoundation/",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Bubbly-Ad-2838",
                                                            "body": "Actually maybe \"left refoundationism\" isn't the best description since it shares similarity with both wings of FRSO? Basically all the disputes in the 20th century within the Communist movement are things of the past and we need to look forward in a generic \"Marxist-Leninist\" opportunist way. The difference being, FRSO/Workers Party of Belgium does it with some remaining Maoist influence and terminologies, while MLKP does so with some leftover Hoxhaism.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Obvious-Physics9071",
                    "body": ">And finally, is the TKP(M-L) involved in the joint publishiment of this statement the same one that Kaypakkaya was the founder of? I'm uncertain (and can't find from cursory online searches of Wikipedia, [marxksts.org](http://marxksts.org/), and banned thought.net) when this party differentiated grom the TKP/ML).\n\nIirc TKP(M-L) (also sometimes written as TKP-ML) is a 2016 split from the original TKP/ML.",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}