{
    "title": "In all circumstances, the struggle of the Syrian communists will continue | Syrian Communist Party (Bakdash)",
    "author": "HappyHandel",
    "subreddit": "communism",
    "rank": 149,
    "score": 90,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/communism/comments/1hm8vvx/in_all_circumstances_the_struggle_of_the_syrian/",
    "id": "1hm8vvx",
    "selftext": "In defense of the homeland and the people’s livelihood. Our country, Syria, has witnessed a radical change in a few days. What the Syrian Communist Party warned about repeatedly has come true: the economic and social policies followed by the former regime would lead to catastrophic results. The comprehensive looting of the state and the people by the new big bourgeoisie, practically spearheaded by key figures in power, led to widespread popular discontent and the complete collapse of the regime’s mass base, resulting in its rapid downfall.\n\nIt is worth mentioning that our opposition to the adopted approach was not whispered in closed rooms or narrow circles but was openly expressed in our party’s documents and statements and through all available platforms. As a result of our party’s bold and clear positions, we were symbolically excluded from the government, then from the People’s Assembly, and eventually restricted at the local administration level and various trade union organizations.\n\nThis is a brief overview of the past, and the importance of the past lies in drawing lessons for the present and the future. Regarding the present, one of the most tragic outcomes of recent developments is the destruction of the country’s defensive capability by the Israeli enemy, which carried out the largest air piracy operation in a few days, destroying our national defense infrastructure without any real opposition, except for rhetorical and superficial responses to mitigate the justified discontent of any loyal patriot.\n\nAmong the dangerous outcomes is the expansion of foreign occupation of our lands. We have seen high commissioners of the mandate state and its funding state gloating joyfully in the wounded Damascus, the ancient Damascus, the pearl of the East, which has always healed its wounds to return as a beacon of civilization in the East. This happened after Hulagu and Tamerlane, and before that, Salah al-Din came to defeat the colonial Western enemy, which the corrupt and feuding Fatimid kings could not face. The fleeing ruler resembles those who placed their interests in wealth and pleasure above the interests of the homeland, despising the people, and consequently losing their thrones and wealth.\n\nThe controlling forces currently in power have promised many things, including establishing order and stability. We will see, as practice is the measure of truth.\n\nWe, the Syrian communists, see in light of recent changes an increase in the importance of major national tasks, which are:\n\n1. Struggle against foreign occupation and the expulsion of all foreign forces from the homeland.\n\n2. Achieving complete national independence and full national sovereignty.\n\n3. Relentless struggle for the unity of the national territory.\n\nAchieving these noble goals requires the unity of all patriots in our country, and there are many of them.\n\nIn addition to these major national tasks, the Syrian communists also see the priorities of the struggle including the following tasks:\n\n1. Achieving democratic freedoms such as freedom of assembly, demonstration, publication, press, and the formation of parties, associations, and unions.\n\n2. Achieving complete equality for all citizens in rights and duties regardless of belief and social origin, and granting full cultural rights to Syrian Kurds and other national minorities.\n\n3. Adopting a new constitution for the country democratically, through a constituent assembly elected on the basis of proportional representation, ensuring broader representation of the country’s citizens.\n\n4. Respecting freedom of belief, which is especially important in Syria’s circumstances. This was recognized with the emergence of the national movement in Syria when its early pioneers raised the slogan: “Religion is for God and the homeland is for all.”\n\n5. Preserving the public sector, which played a significant role in the country’s development and can play an important role in reconstruction and economic development.\n\n6. Restoring social gains that were eroded by the former regime, especially in the fields of free public health services and democratic education.\n\n7. Encouraging national production, particularly in the key sectors of industry and agriculture, protecting it from foreign competition, restoring agricultural security, and working to invest national resources in a way that serves the development of national production and raises the living standards of the majority of citizens.\n\n8. Preserving the social gains achieved for Syrian women and working towards achieving full equality between men and women.\n\n9. Maintaining the richness and diversity of Syrian national culture and encouraging creative artistic work in all fields.\n\n10. In foreign policy, applying the principle of positive neutrality in line with national interests and eliminating any international or regional colonial influence.\n\nThe Syrian Communist Party believes that achieving these tasks will restore our country, Syria, to its well-known position as a sovereign and strong nation.\n\n\nhttps://www.facebook.com/share/p/1Cku21Kc5T",
    "comments": [
        {
            "author": "urbaseddad",
            "body": "Did you translate this? In any case thanks for sharing.\n\nTangentially, I know the CPS-Bakdash and the CPS-Unified parties emerged over disagreement about perestroika (CPS-Unified being pro perestroika while CPS-Bakdash was pro Brezhnevite revisionism), but what is the difference between them today? Based on their respective Wikipedia articles they were both part of the Ba'ath-led coalition, but from what I see the CPS-Unified is part of the WAP grouping. I see CPS-Unified also published a statement on the overthrow of Assad but their statement seems only concerned about restoring the functioning of the capitalist economy and superstructure, it includes nothing about social issues like the CPS-Bakdash's statement here does.",
            "score": 7,
            "replies": [
                {
                    "author": "HappyHandel",
                    "body": ">Did you translate this? \n\n\nTranslated with ChatGPT-4.",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}