{
    "title": "Exposing the Modern Revisionist Line of ‘Balraj’ and Lackeys as the Ideological Wing of Operation SAMADHAN-Prahar (Firmly Resolve to Forge the Path of NDR!)",
    "author": "RedAntOfTheTrees",
    "subreddit": "communism",
    "rank": 141,
    "score": 15,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 2,
    "url": "https://nazariyamagazine.in/2024/12/28/exposing-the-modern-revisionist-line-of-balraj-and-lackeys-as-the-ideological-wing-of-operation-samadhan-prahar-firmly-resolve-to-forge-the-path-of-ndr/",
    "id": "1hpeof5",
    "selftext": "Baccha Prasad Singh alias Balraj, is a lackey of the Indian state who had been expelled from CPI(Maoist) in 2023 on grounds of his ideological degeneration and counter revolutionary activities. Currently he's been working to infiltrate, and create new revisionist organisations with the label of MLM to break the unity of the new democratic movement in India. This is an article by a student activist from Delhi exposing his revisionism, many points of which are successors of the past revisionist currents.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "theaceofshadows",
            "body": "This is a seminal contribution to the Indian Maoist movement. The way in which revisionism is attacking the revolutionary movement in the period of fascism in India is worth documenting and Balraj’s open use of his ex CCM status is common knowledge among communist circles in North India. He has sown doubts among the old petite bourgeois and their “Maoist” organisations are meeting point of people who have been kicked out of genuine of Maoist organisations. Glad to see a polemic against him.",
            "score": 9,
            "replies": []
        }
    ]
}