{
    "title": "Was the New Deal fascist?",
    "author": "WhiteRob37",
    "subreddit": "communism",
    "rank": 134,
    "score": 73,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/communism/comments/1hsshzx/was_the_new_deal_fascist/",
    "id": "1hsshzx",
    "selftext": "I feel like maybe this is controversial (or maybe it’s a cold take?), but it seems that essentially the aim of the New Deal was to create a wealthier, “superior” white race. This is based on the systematic exclusion of Black people from the benefits of New Deal programs and the remnants we see today in the massive wealth disparity between white people and people of other races? \n\nI also recognize that it was specifically a response to increasing unrest, increasing class consciousness, and the rise of a socialist alternative in the Soviet Union. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ernst-thalman",
            "body": "Absolutely yes. This is why the term social fascist is theoretically useful. For the reasons you described but also because it was fundamentally class collaborationist. The general idea of the new deal economic policies was to revive the capitalist-imperialist system through Keynesian “prime the pump” public spending and state intervention. The result was the modern labor aristocracy and the destruction of anything resembling a progressive labor movement. It’s not a 1 to 1 but in many ways this mirrors the economic projects undertaken in nazi germany and fascist Italy around the same time",
            "score": 82,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "> this mirrors the economic projects undertaken in nazi germany and fascist Italy around the same time\n\n\nCan you elaborate?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "ernst-thalman",
                            "body": "I want to do this question more justice but in the meantime I recommend The Wages of Destruction by Adam Tooze as well as Empire of Destruction by Alex Kay. Tooze does a pretty good job of dispelling myths about the nazi welfare state and national “socialism” while also documenting its development, along with increased public spending on infrastructure and social services to support the growing military industrial complex and rearmament efforts.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Obvious-Physics9071",
                            "body": "I don't know in enough depth about other specific policies of the new deal to comment on them, but the National Recovery Administration (although struck down by the courts in 1935) was run by open admirers of Italian fascism.\n\nRoosevelt's appointed head of the NRA was Hugh Johnson who reportedly distributed copies of \"The Corporate State\" (tract by the fascist economist Bruno Biagi) to other NRA officials.\n\n[Of Corporatism, Fascism, and the First New Deal](https://openyls.law.yale.edu/bitstream/handle/20.500.13051/5051/Of_Corporatism__Fascism_and_the_First_New_Deal.pdf?sequence=2&isAllowed=y):\n\n>General Johnson gave his farewell speech, invoking the \"shining name\" of Benito Mussolini. It was not the first time that the Director of the NRA, who was widely rumored to have fascist inclinations, had spoken glowingly of Italian practices. Nor was General Johnson alone in the early New Deal years. A startling number of New Dealers had kind words for Mussolini. Rexford Tugwell spoke of the virtues of the Italian Fascist order. So did internal NRA studies. And the President himself expressed interest in bringing the programs of \"that admirable Italian gentleman\" to America.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "royalt213",
                    "body": "It doesn't seem to mirror them to me. Hitler did essentially the opposite. He raided public funds and piped them to wealthy elites and privatized public goods. The same type of things occurred in Italy. The New Deal protected unions, whereas Mussolini and Hitler obliterated them.\n\nBoth the New Deal and fascism were ultimately in service of capitalism but, to me, they seem to represent opposite ends of the spectrum in going about it.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "ernst-thalman",
                            "body": "I wish I had more time to respond to this in depth, but for now, I challenge you to find a meaningful structural difference between the AFL-CIO and the Arbeitsfront in their relationship with the state",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "royalt213",
                                    "body": "Well, the AFL and CIO didn't merge until 1955, so I'll assume you're just generally referring to both of them, since their split occurred during that period. But their split is noteworthy and relevant since their disagreements centered around the New Deal itself.\n\nBut, for one, collective bargaining was completely banned under the Nazis and expanded via the AFL and CIO during the New Deal. The NLRA also wouldn't have passed without the AFL and something equivalent to that in Nazi Germany would have been the stuff of fantasy. The AFL was free to criticize the FDR administration while that was not tolerated whatsoever in the Arbeitsfront. Also, importantly, the AFL predated the New Deal as an independent organization while the Arbeitsfront was a sham labor organization completely invented by the Nazi party after they raided all of the independent unions, often killing their leaders.\n\nYou could definitely argue that FDR co-opted the AFL, but its relationship to the state seems dramatically different to me.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sea_Till9977",
                            "body": "I believe you should think about the existence of the Amerikan labour aristocracy before using the broad term of 'unions' and labour etc.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Razzmatazz6459",
            "body": ">The contradictions within the bourgeoisie became so great that a fascist coup d'etat was attempted against the New Deal. A group of major capitalists, headed by Irenee DuPont (of DuPont Chemicals) and the J.P. Morgan banking interests, set the conspiracy in motion in 1934. The DuPont family put up $3 million to finance a fascist stormtrooper movement, with the Remington Firearms Co. to arm as many as 1 million fascists. Gen. Douglas MacArthur was recruited to ensure the passive support of the U.S. Army. The plan was to seize state power, with a captive President Roosevelt forced to officially turn over the reins of government to a hand-picked fascist \"strong-man.\n\n>As their would-be Amerikan Fuhrer the capitalists selected Gen. Smedley Butler, twice winner of the Congressional Medal of Honor and retired Commandant of the U.S. Marine Corps. But after being approached by J.P. Morgan representatives, Gen. Butler went to Congress and exposed the cabal. An ensuing Congressional investigation confirmed Gen. Butler's story. With the conspiracy shot down and keeping in mind the high position of the inept conspirators, the Roosevelt Administration let the matter just fade out of the headlines.\n\n[https://readsettlers.org/ch7.html#3](https://readsettlers.org/ch7.html#3)\n\nYou may have already read Settlers but he has a chapter that discusses The New Deal. I haven't taken the time to study fascism and it's origins enough to say if The New Deal is fascist itself; though how the New Deal became financially possible appears to have fascist elements (for example, the Mexican Repatriation).\n\nThe \"Business Plot\" is what the above passage refers to with the plan being to install a fascist dictatorship via coup d'état. The plan never materialized of course but it seems a section of the bourgeoisie looked to a fascist political movement as a legitimate solution to the political and economic turmoil at the time.",
            "score": 35,
            "replies": []
        },
        {
            "author": "Autrevml1936",
            "body": "> but it seems that essentially the aim of the New Deal was to create a wealthier, “superior” white race\n\n\nIt didn't attempt to create anything New, it empowered the already existing Euro-Amerikkkan Settler Nation. There was no need to create a \"Superior\" White Race(of course, there's nothing \"Superior\" about it).",
            "score": 26,
            "replies": []
        },
        {
            "author": "None",
            "body": "recommend reading Blood In My Eye by George Jackson, the back sections of the book where he writes at length abou the rise and development of Amerikan fascism and specifically the New Deal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cillychilly",
            "body": "If it wasn't, it would not have happened. The US is a fascist country.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GennyD420",
            "body": "Adolf Berles explicitly states in a NYT article that the brain trust was considering a egalitarian command economy or an enforced hierarchical command economy. His thoughts on Bolshevism being entirely possible for the US are encouraging but he also thinks fascism is preferable to general economic collapse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -5,
            "replies": [
                {
                    "author": "Autrevml1936",
                    "body": "All I can say is, What the fuck? Where is any discussion of the National Contradiction? Settler Colonialism?\n\n\n> for the same reasons they have always struggled in the US - they’re a minority (in the literal sense) and are politically harder to advocate for.\n\n\nThis is not the reason New Afrikans have Struggled in Occupied Turtle island. What about how they were an imported Nation whose purpose was to labour for the Settler Nation to offset and transition to a different Labor Source than the First Nations. Or how reconstruction made New Afrikans an internal Semi Colony.\n\n\nAlso a discussion of if there is a Proletariat amongst the White Working Class? Maybe even Imperialism and the Labor Aristocracy?\n\n\nWhat about how racism, is in Essence, a result of the National Contradiction?\n\n\n> Lastly, if you’re genuinely interested in leftist theory, get off reddit and grab a book.\n\n\nYes, Read [Settlers](https://readsettlers.org/).",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "organic",
            "body": "The funding side-stepped finance and was primarily focused on infrastructure projects that increased productive forces.  \n\nThe \"alphabet soup\" of programs were relentlessly attacked by the bourgeois of the time (particularly the NIRA and WPA).  \n\nThe compromise with southern racists was baked into the political alliances of the time, so while blacks were excluded from the programs in the south, they were included in the north and was a major driver of the great migration.\n\nUltimately, the reason it fell was a resurgent post-war bourgeois that were committed to tearing it down brick-by-brick.  It was finally killed by Carter/Reagan/Clinton, with Clinton/Obama ushering in modern financialized neoliberal fascism.",
            "score": -4,
            "replies": []
        }
    ]
}