{
    "title": "Capitalism and AI are an amplifying feedback loop ",
    "author": "InitialTrue1316",
    "subreddit": "communism",
    "rank": 121,
    "score": 6,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/communism/comments/1hyal7y/capitalism_and_ai_are_an_amplifying_feedback_loop/",
    "id": "1hyal7y",
    "selftext": "I know that Nick Land is in touch with alt right politics but I think he has an interesting thought in this. \nLand views capitalism not just as an economic system but as an emergent form of intelligence. It operates through distributed decision-making, market forces, and competition, which adapt and self-optimize over time. In this sense, capitalism resembles a decentralized, algorithmic process akin to artificial intelligence.\nCapitalism \"thinks\" through markets, supply chains, and feedback loops.\nIt evolves autonomously, without needing central control, much like AI systems learning through data and iterations.\n\nAI represents the apex of capitalism's logic: relentless optimization, efficiency, and the displacement of human decision-making by machine processes. Land suggests that capitalism's ultimate goal is to transcend human input entirely, achieving self-replication and acceleration through technological means. AI embodies this trajectory because:\nIt automates and accelerates production, innovation, and consumption cycles.\nIt learns, adapts, and grows in complexity much like the global market system.\n\nLand emphasizes that both AI and capitalism operate on principles that are alien to human values like morality, individuality, and community. They are cold, inhuman forces:\nCapitalism prioritizes profit and efficiency over human welfare.\nAI, as it develops, could similarly disregard human-centric concerns in favor of its programmed goals.\n\n\nIn this way, AI and capitalism merge as one seamless, accelerating force, driving history toward what Land calls the \"singularity\" — a point where technological evolution becomes so rapid that it breaks with human comprehension and control.\n\nCapitalism and artificial intelligence are not merely intertwined; they are the same system, manifesting the same inhuman logic of optimization, acceleration, and self-replication. Both operate as autonomous, decentralized intelligences, prioritizing efficiency, expansion, and profit over human values or needs. Just as capitalism erodes human agency through relentless commodification and exploitation, AI embodies this logic in its purest technological form, automating decision-making and displacing human control.\n\nThis development aligns with Deleuze’s theory of societies of control, where power no longer operates through rigid structures of discipline but through fluid networks of surveillance, modulation, and constant adaptation. AI and capitalism together expand this system of control, embedding it into every aspect of life—tracking behavior, predicting desires, and influencing decisions. In this regime, human subjects are reduced to data points, constantly monitored and governed by algorithms that enforce compliance and extract value.\n\nTo confront this trajectory, we must recognize that the rise of AI is not neutral or inevitable but a continuation of capitalism’s domination in a new, more pervasive form. Resistance to this system demands not just an opposition to AI as a tool of control but a fundamental challenge to capitalism itself and its capacity to reshape society into a seamless web of inhuman power.",
    "comments": [
        {
            "author": "smokeuptheweed9",
            "body": "There is something interesting here but the basic flaw of Land is taking a superficial observation of capitalism and thinking that is Marxism. Marxism is not the observation that capitalism has its own autonomous logic, that is just as easily subsumed into bourgeois economic theories like \"systems theory\" Marxism is the understanding of the social relations behind the fetishism of capitalist autonomy. Capitalism may appear to\n\n>transcend human input entirely, achieving self-replication and acceleration through technological means. AI embodies this trajectory because: It automates and accelerates production, innovation, and consumption cycles. It learns, adapts, and grows in complexity much like the global market system.\n\nAnd it even appears as a thinking being as a result. But that is a fetish of the basic dependence of capitalist production on surplus value and the social relations that alienate human beings from the products of their labor. \n\nIn that sense, AI is similar because it only produces crap. The fetishism is that AI produces art and therefore threatens artists, when the truth is that artists have already been subordinated to the capitalist mode of production and therefore produce nothing but crap. AI merely makes that explicit and abolishes common fantasies of the petty-bourgeoisie for the brutal efficiency of producing \"information\" (to borrow another term from Deleuze - though a more common term without the philosophical obscurity is \"content\").\n\nYou're right that this is a historical process where the development of imperialism as a stage has shifted the form of social alienation away from the state and towards the market. I'm not sure Deleuze or Foucault have anything to say that isn't already in Marx (and quite a few flaws you would have to overcome to get value out of them) but if it helps you I won't stop you.\n\nI will also point out that it does interest me that Land became an early Dengist and there does seem to be a close relationship between postmodernism and Dengism.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Tradclasstrugle",
            "body": "The argument is interesting but I see a fundamental flaw with your description of AI. LLMs are not intelligent, and more than that they are not self-improving over time, by the contrary, chatGPT has reportedly gotten worse with time. Which is not surprising due to three reasons that I can think of:\n\n1. Feeding back the sloop stock it makea into the machine is bound to result in worse output;\n\n2. Creating a incentive for people to subscribe to GPT 4.0.\n\n3. People are getting better at prompting, and/or the requests being more serious reveals the limits of the whole gimmick.\n\nThat being said, capitalism can operate as a self-improving machine, but what that means is rather concerning. Because it never fixes its flaws, and is blatantly marching ever forward against physicial limits such as: the tendency of the profit rate to fall, natural resources, pollution, limits of the human mind and the misery it creates.",
            "score": 2,
            "replies": []
        }
    ]
}