{
    "title": "Statement by the politburo of Hamas on the ceasefire",
    "author": "sovkhoz_farmer",
    "subreddit": "communism",
    "rank": 108,
    "score": 100,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/communism/comments/1i25jw5/statement_by_the_politburo_of_hamas_on_the/",
    "id": "1i25jw5",
    "selftext": "In the name of Allah, the Most Gracious, the Most Merciful.\n\nThe leadership of the Islamic Resistance Movement (Hamas) delivered a short while ago to the mediator brothers (Egypt and Qatar) its response to the ceasefire agreement proposal.\n\nThe movement's political bureau held an emergency meeting to discuss the proposal submitted by the mediators.\n\nThe movement dealt with all responsibility and positivity, based on its responsibility towards our patient and steadfast people in the honorable Gaza Strip, by stopping the Zionist aggression against them, and putting an end to the massacres and war of genocide to which they are being subjected.'\n\nThe Islamic Resistance Movement - Hamas",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "red_star_erika",
            "body": "it is wonderful news! and a step forward for the Palestinian national liberation struggle. it won't represent a total end to the violence since even under \"peace\" Palestine faces violent national oppression. not to mention the likelihood that israel will engage in as much brutality as they can before the ceasefire goes into effect  like they did in Lebanon (and like in Lebanon, will probably engage in violations after). but this still will hopefully allow for much needed healing.",
            "score": 32,
            "replies": [
                {
                    "author": "AlgebraicMisery",
                    "body": "I cannot but feel utter sadness and despair, as the horrors of the IOFs endless terror bombing instead give way to this brief let up; and the true extent of the destruction is partially uncovered from underneath the rubble. I don't need to reiterate how much the Palestinians suffered, but I weep at the thought that even the Nakba may have been surpassed in its traumas that the Palestinians have been forced through, day after day, and events like these for many years to come",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "red_star_erika",
                            "body": "the iof being forced to agree to withdrawal from Gaza does not \"mainly benefit\" israel, who failed in their objective to ethnically cleanse and establish permanent occupations in Gaza. a total hostage deal and israeli withdrawal has been what Hamas and the other national liberation factions have been pushing for. don't call me inept if you don't know what you're talking about.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Autrevml1936",
                                            "body": "> How many times do these settler colonial states need to follow the same strategy of displacement, containment, and genocide before it is clear that there is NEVER a ceasefire for national liberation?\n\n\nSo there are no *temporary* agreements in War? Should they continue this current Struggle until Palestine achieves Total Victory? Or is the Palestinian National Liberation a Protracted War?",
                                            "score": 18,
                                            "replies": []
                                        },
                                        {
                                            "author": "red_star_erika",
                                            "body": "\"the iof being **forced** to agree to withdrawal from Gaza does not \"mainly benefit\" israel, who **failed** in their objective to ethnically cleanse and establish permanent occupations in Gaza.\"\n\nfucking prick.",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "Sea_Till9977",
                                            "body": "i think you believe you sound more radical than you actually are. A substantial prisoner swap is always a victory for the resistance. This ceasefire, which was already proposed months ago, being accepted now is only because the resistance factions forced such an unfavourable situation.\n\nAll the resistance groups, not just Hamas, that called for a permanent ceasefire are under no delusion that israel just stops bombing or stops being settlers. They also know that countries like Qatar and Egypt are only mediators, not allies and their bourgeoisie remain to benefit from the subjugation of Palestinians. Nor do they need a reddit user to remind them that national liberation is still the only objective. \n\nLike the other user said, the Palestinian fighters are ready for a protracted war. Thousands of prisoners being released is an achievement that you are understating here. What do you think the point of Operation Al-Aqsa flood was? What was the purpose of taking hostages, including soldiers that are going to be exchanged for hundreds of Palestinian prisoners?",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Far_Permission_8659",
                                                            "body": "Reactionaries will pretend any course of action is beneficial to them because that’s what paper tigers do. You’ve never actually explained why you disagree with the Joint Operations Room labeling this a victory nor have you outlined any coherent tactical claim for what *should* occur. Nobody is disputing that settler-colonialism must be opposed, but you’ve put the onus on Palestinians to pointlessly engage even when it is disadvantageous while never holding yourself to that same standard.\n\nIf you were actually practicing adventurism at least there would be something to say about resisting national oppression, but you’re not. You’re just another coward demanding others die for you.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "Sea_Till9977",
                                                                    "body": "The comment got deleted, but what did this person say in reply to my comment?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Far_Permission_8659",
                                                                            "body": "Basically that celebrating the ceasefire was liberal worship of fandom because the Amerikan-Israeli front spun it as a win. Instead, Palestinians should have continued fighting for the nebulous objective of “opposing settler-colonialism”. It probably wasn’t worth responding to but I’ve been noticing an uptick of faux-ultraleftism as a justification for rightism in my own organizing and felt compelled to critique it openly.",
                                                                            "score": 6,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Turtle_Green",
                                                                            "body": "for the sake of accountability, the author of the deleted comments was /u/AnthropenPsych. Ironic to attack others for protecting their \"online ego\" whilst deleting one's own posts to safeguard from critique.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Far_Permission_8659",
                                                                            "body": "It hasn’t “fallen through” in the slightest, so I have no idea why you think that. Do you think this wasn’t anticipated in the very terms of the ceasefire? The fact that this is sending fundamental fractures into the Zionist camp and its international standing is precisely one of the things it was meant to do.\n\n>I am attacking the liberal joy and “good news” in promoting a ceasefire.\n\nIf a ceasefire is the best strategic choice for continuing protracted war against Amerikan-Israeli settler-colonialism then it should be greeted with celebration. Clearly you disagree so where? Do you think communists simply shouldn’t comment on affairs in other countries? Do you think this is the wrong strategic choice for the present situation?\n\nOf course, you’ve already ceded that you have no interest in actually debating the ramifications of this. You simply want to appear rhetorically radical by painting any celebration of this as “liberal” while your own “proletarian politics” is ambiguous and defined only in opposition to what is occurring here and now. None of this is surprising— this is the heart of settler “radicalism” where they’re totally revolutionary but all current revolutionary options are not radical enough so they have to just sit around being a parasite.\n\nAnyway I’m done with this. It felt important for me to highlight the latter phenomenon since it’s an epidemic online and off and those not involved in Amerikan communist orgs might not immediately sniff it out. You’ve exhausted your purpose now.",
                                                                            "score": 10,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "sovkhoz_farmer",
                                                            "body": "You have misplaced the external cause with the internal. By doing this you are actively engaging in Idealism. The ceasefire did not took place beacuse of Biden or Trump, it took place because the resistence completely dislogded the IOF's attacks and the IOF failed its military objective thanks to the progressive coalition of national forces of palestine.\n\nE: Besides, do you think you are really more aware of the situation in palestine than lets say Hamas,PFLP,DFPL? Have you tried reading statements about the reasons for this celebration or the ceasefire itself? What about the reason for the Al-Aqsa flood? \n\nHow arrogant.",
                                                            "score": 11,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sovkhoz_farmer",
            "body": "It seems that Hamas will agree to this ceasefire. What to make of this? What will be the fate of the national struggle of palestinians?",
            "score": 12,
            "replies": [
                {
                    "author": "theNatDemRedditor",
                    "body": "The struggle for National Liberation continues. For as long as Israel continues to exist as the primary aggressor along with US backing, there can never be peace in the Middle East. We should support their ceasefire deal and any measure that ensures the safety of the Palestinian people who were being exterminated. Hamas should know what to do and let them determine and walk their path.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "urbaseddad",
                    "body": "Well that's what we were calling for weren't we? \"Ceasefire now\". All the liberals can go home now.\n\n\nJokes aside locally we had decided to support the call for a permanent ceasefire (in this context permanent meaning Israel exits Gaza vs temporary meaning it stays) to end the genocide and since the fighting factions were calling for it. My immediate reaction seeing these news was to not believe that Israel will stick to the ceasefire one second and to doubt if it will even be achieved or if the war will continue. However even if it is achieved and the war ends the struggle obviously doesn't end. There will need to be a war against the Zionist entity again until its destruction, next time with a stronger correlation of forces and certainty in victory.\n\n\nEdit: something that is worth examining that I didn't is why the deal was signed in the first place. There's hearsay it's to prepare for war with Iran, I've seen someone analyze it as that since Israel failed to import workers from South Asia they need to stop the genocide and try to reintegrate the Palestinians into the labor market as superexploited labor. Otherwise, perhaps the war was too costly and Israel decided to cut it's losses.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "supercooper25",
                            "body": ">There's hearsay it's to prepare for war with Iran\n\nConsidering that Trump (possibly the most anti-Iran president in American history) is about to enter office and is openly taking credit for the ceasefire, this certainly could be the reason, and is consistent with the logic of Israel's ceasefire with Hezbollah which was immediately followed by the HTS and IOF offensives in Syria. Still, it must be stressed that this agreement was only possible because of the heroic efforts of the Palestinian resistance factions, irrespective of alterior motives.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Far_Permission_8659",
                            "body": "I do think it will be interesting to see how this political relationship develops in the wake of the ceasefire between Hamas, Israel, and the PA. I think the Al-Aqsa flood was successful in ending the ongoing system of buying off a portion of compradors and leaving the rest under subsistence aid. The degree to which the current power balance in the APF can persist in the wake of this qualitative shift is an open and critical question but as you point out the communist line seems clear.\n\nThe ceasefire should be celebrated, but it’s doubtful it will last and what comes after is critical. From their conduct during the war I have faith in the communist forces in Palestine to find that direction forward.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Sea_Till9977",
                                    "body": "With the way things are going on in Jenin, I believe the way forward has already been set and the compradors are seeing the beginning of their end. Of course, I remember earlier statements from the Resistance factions calling for unity (we also saw the Fatah Hamas/other resistance factions conducting talks earlier) and calls for diplomatic unity but I do believe that the goal is to subjugate PA under the armed resistance movement. Not to mention Hamas, and PIJ (not sure about PFLP's presence in West Bank) are conducting activities in the West Bank as well, where the situation is only escalating and contradictions are intensifying. The people of West Bank are ready as well for this escalation.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "NobodyOwnsLand",
                                            "body": ">not sure about PFLP's presence in West Bank\n\nTake this with a grain of salt, as my main source is my mother who lived in the West Bank in the 90s, but my understanding is that the PFLP has more presence in the West Bank compared to Gaza.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "PlayfulWeekend1394",
                                                    "body": "I'm pretty sure they do, the west bank has been the launch point of the majority of the PLFP's significant actions up until the Gaza war",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Sea_Till9977",
                                                    "body": "I clearly have to read more. Somehow missed this very basic fact. Thanks for the information.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "urbaseddad",
                                    "body": "> From their conduct during the war I have faith in the communist forces in Palestine to find that direction forward\n\n\nYeah? Can you elaborate?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Far_Permission_8659",
                                            "body": "/u/supercooper25 and I were discussing it [here](https://www.reddit.com/r/communism/s/AqwFSuhey1) but the basic idea is that the PFLP has pretty consistently maintained itself as an indispensable fighting organ of the popular front while refusing to subordinate itself to its reactionary elements. If you have criticisms of their position please share, them, however. I’m mostly working off of party statements and the general strategic situation of the war.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "urbaseddad",
                                                    "body": "Excellent. It sounds like you're right, I'm just not as familiar with their publications as you are, that's why I asked. ",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "HappyHandel",
                                    "body": "AFP?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Far_Permission_8659",
                                            "body": "Sorry, meant the Alliance of Palestinian Forces, although that’s a bit of an outdated term that doesn’t fit for the current popular front. Should have used “Joint Operations Room” but I’ll let my error stand.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "long live the resistance",
            "score": 2,
            "replies": []
        },
        {
            "author": "guestoftheworld",
            "body": "I don't know how to feel about this. I want a ceasefire for the suffering civilians but I'm afraid this will hurt the resistance",
            "score": 2,
            "replies": [
                {
                    "author": "PlayfulWeekend1394",
                    "body": "How would it hurt the resistance? They won, the military and political aspect of this conflict has been an overall tactical and strategic victory.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TheSyndicate10",
                            "body": "Can you explain how was this a tactical and strategic victory?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "PlayfulWeekend1394",
                                    "body": "Sure. Starting with the tactical victory, \"Israel\" lost military, the JOR was able to inflict serious damage to the IOF's military equipment and armor and inflict serious casualties on a large scale to the point of overflowing hospitals for wounded soldiers and vehicle shortages during the war. At the same time \"Israel\" failed to achieve any of it's military objectives throughout the war and was unable to inflict any debilitating damage on Hamas, and in fact has provided little evidence of any tactical victories. The largest strategic victories the IOF can claim right now are rescuing just 3 hostages, the killing of a few replaceable top commanders and destroying some smaller groups' rocket launch sites, which didn't even stop them from firring rockets. On the JOR's side, the JOR carried out a number of successful complex operations, consistently won large battles and carried out thousands of successful smaller operations. The ceasefire deal that looks like it will be signed was the JOR's deal, and fulfils most if the JOR's demands and none of \"Israel's\". \n\nOn the Strategics side \"Israel\" has been humiliated, suffered a serious economic crisis and is losing population as many settlers flee. The regime's reputation has tanked and it is starting to be isolated globally and internal contradictions are sharpening. Aa for the resistance, Hamas makes it weapons primarily out of unexploded IOF ordnances, which they now have more of than they could ever dream of. The JOR and forces of resistance have consolidated, the PA is now weaker than ever and actively starting to crumble, recruitment has and will likely continue to skyrocketed for all resistance factions. Overall there is chaos under zionist heaven and the situation is very good.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "TheSyndicate10",
                                            "body": "Thanks for the explanation!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "PlayfulWeekend1394",
                                                    "body": "My pleasure",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Alter360",
                                    "body": "Watch the YouTube video from first thought \n\nhttps://youtu.be/b_TYj_9HxTU?si=MuXwtnBWHTRsN7Ic",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "guestoftheworld",
                            "body": "Because as soon as the borders open Gaza will be depopulated as it's even more unliveable now. No people. No resistance.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Twig_Of_Life",
                                    "body": "I think you’re underestimating the resilience of the Palestinians. Many of them, if not most of them, will not leave their land. Especially with the trauma of the nakba so prevalent in Palestinian culture, the Palestinian people are incredibly resistant to giving up even an inch of their land. \nAnother thing to look at is the people who stayed in the northern Gaza Strip eating grass and animal feed instead of going south because they were not going to leave their homes.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "guestoftheworld",
                                            "body": "That's true",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}