{
    "title": "Need help with project on enver Hoxha",
    "author": "FitAd5739",
    "subreddit": "communism",
    "rank": 64,
    "score": 8,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/communism/comments/1ih6uh8/need_help_with_project_on_enver_hoxha/",
    "id": "1ih6uh8",
    "selftext": "So I’m doing a project about , comrade  Hoxha and I was wondering, are there any sources that anyone could give me or places I can look to have information about not only him but Albania when it was socialist, especially ones that do not use anti-communist propaganda",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DashtheRed",
            "body": "What is this \"project\" you are doing, because if it is for school, you are probably just going to get yourself an \"F\" if you try to uphold Stalin in a liberal classroom, and your teachers are not going to be won over.\n\nhttps://www.marxists.org/reference/archive/hoxha/works-index.htm\n\nhttps://www.marxists.org/glossary/people/h/o.htm#hoxha-enver\n\nhttps://www.marxists.org/history/erol/albania/index.htm\n\nhttps://espressostalinist.com/marxism-leninism/enver-hoxha-page/",
            "score": 15,
            "replies": [
                {
                    "author": "Obvious-Physics9071",
                    "body": ">because if it is for school, you are probably just going to get yourself an \"F\" if you try to uphold Stalin in a liberal classroom\n\nAs someone who defended Stalin for a speech/debate project in high school, they probably won't fail you (never happened to me though I would not put this past many American teachers), but be prepared for your classmates and teacher to be confused and ask if you are serious or typical anti-communist questions.\n\nedit: spelling",
                    "score": 5,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "That's pretty funny but I respect it",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Obvious-Physics9071",
                                    "body": "I'll admit in retrospect it was a bit silly but I don't regret it.\n\nThough if you are eloquent enough and have done the reading you can definitely get some students to begin questioning what they are being taught. Most (American) teachers only know the barest anti-communism, so once you begin speaking on the details they don't really know how to respond, which other students usually found amusing.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "urbaseddad",
                                            "body": "May be silly in the sense of, what are you trying to achieve? But that depends on circumstances (for example are you doing clandestine work as a communist and have to outwardly hide your views as an individual? Then it's stupid and dangerous. Are you tasked by a communist organisation to recruit among the youth in your school? Then it's great. Are you just doing it just cos, without putting anyone at risk? Then why not.) But I don't think there's anything to regret. At the end of the day I really meant it's funny, not silly. Mostly because I'm imagining the looks on people's faces. But I love it, especially if you managed to combine it with discussing communism more with some of your classmates.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FitAd5739",
                    "body": "So a freind wanted me do a lecture about him and I just want to make sure I get everything right",
                    "score": 1,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "> So a freind wanted me do a lecture about him\n\n\nWhy? Who is this friend?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "FitAd5739",
                                    "body": "He’s  a freind from school and also a socialist and was curious about Comrade Hoxha and the Albanian Revolution",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "urbaseddad",
                                            "body": "For what end tho? What are you hoping to achieve by doing this presentation for him? Why does he want to know about Hoxha and Albanian socialism?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "FitAd5739",
                                                    "body": "Because he was curious also why is it  such a big deal",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "urbaseddad",
                                                            "body": "It's a big deal because the question of practice is a big deal for Marxism. There must be a goal because this is communism, we don't just do things for vibes. So I'm trying to figure out what your goal is but even if it's just for vibes I'd like to know so as to understand.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "FitAd5739",
                                                                    "body": "My goal is to pretty much tell the truth about the Albanian Revolution and also comrade Hoxha to the contrary of anti-Communist propaganda and I’m not doing this to be very clear for vibes. I’m doing this to educate people about what communism is and what socialism is because as a person of color and as  someone who’s in the movement . This is something that I take seriously.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "urbaseddad",
                                                                            "body": "> I’m doing this to educate people about what communism is and what socialism is because as a person of color and as someone who’s in the movement . This is something that I take seriously.\n\n\nRight, finally we're getting somewhere. You know your friend better so perhaps it's a worthwhile endeavour to try to educate them, but I also wonder why you specifically want to focus on Hoxha? Are you a Hoxhaist? That's fine if you are, it's just not obvious to me why Hoxha over say Lenin, Stalin or Mao.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FitAd5739",
                                                                                    "body": "You’re not I’m a Marxist Leninist  but like I said, I wanted to make sure you know get this right when talking about Albania and him I’m also my friend is sort of new to the movement  so  he’s sort of finding  his footing and so I usually myself give lectures about you know, communist, history, and Marxist ‘s theory and other things.\n\nAnd so he asked me if I would talk about the Albanian Revolution and  Hoxha",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "urbaseddad",
                                                                                            "body": "Hm okay I see. Well I think I don't see anything wrong with that then, as long as this education is part of broader effort to study the history and theory.\n\n\nEdit: you should keep in mind that Hoxha was an important figure for communist history overall as after the fall of the USSR to revisionism (1956) he along with Mao were the two main figureheads of global anti-revisionism. So when you read about Hoxha read about him in the context of his steadfast rejection of Titoite revisionism, his prescient rejection of Khrushchev (coming round to the view earlier than Mao), his ultimate coalition with Mao, and later his incorrect rejection of Mao and the lessons the Chinese revolution after Mao's death. Hoxha was overall a great socialist leader, one of the best, but veered in the wrong direction and made errors (the extent of which is debated among Maoists) in the last ten years of his life or so. Despite this Albanian socialism achieved many and impressive things.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "FitAd5739",
                                                                                                    "body": "Yeah is there any articles or things that you could point me to about both him and Albania",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "urbaseddad",
                                                                                                            "body": "I'm not sure of anything specific besides his own work and what has already been linked. I believe there exist some Maoist assessments of Hoxha but I don't remember where and by whom. I could perhaps look for it but I don't know how far you're trying to go and whether that would be useful to you. Also read my edit to the above comment. Beyond that perhaps you can look up more recent discussions on Hoxha in this sub and r/communism101",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "FitAd5739",
                                                                    "body": "That’s the reason why I’m doing it also as I  stated I need any sources or anything to study over and look over",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}