{
    "title": "Bi-Weekly Discussion Thread - (February 16)",
    "author": "AutoModerator",
    "subreddit": "communism",
    "rank": 39,
    "score": 8,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 121,
    "url": "https://www.reddit.com/r/communism/comments/1iqf8sk/biweekly_discussion_thread_february_16/",
    "id": "1iqf8sk",
    "selftext": "We made this because Reddit's algorithm prioritises headlines and current events and doesn't allow for deeper, extended discussion - depending on how it goes for the first four or five times it'll be dropped or continued.\n\nSuggestions for things you might want to comment here (this is a work in progress and we'll change this over time):\n\n* Articles and quotes you want to see discussed\n* 'Slow' events - long-term trends, org updates, things that didn't happen recently\n* 'Fluff' posts that we usually discourage elsewhere - e.g \"How are you feeling today?\"\n* Discussions continued from other posts once the original post gets buried\n* Questions that are too advanced, complicated or obscure for r/communism101\n\nMods will sometimes sticky things they think are particularly important.\n\nNormal subreddit rules apply!\n\n[ Previous Bi-Weekly Discussion Threads may be found here https://old.reddit.com/r/communism/search?sort=new&restrict_sr=on&q=flair%3AWDT ]",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-Marxists** - This subreddit isn't here to convert naysayers to Marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or Marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sudo-bayan",
            "body": "I was recently in contact with a small NatDem group organizing out of my university, so far they aren't as large as other orgs I've encounters but what made them stand out for me was their understanding of theory and the better management of their org (better rules and structure for members, they also need to study theory as a requirement and it progresses at different levels).\n\nAnyway the more interesting thing I wanted to bring up is the discussion about Jeepney Drivers, according to them they are called, 'malaproletariat' as in 'malapit sa proletariat', this is something I've wondered about but have not yet seen articulated until this point, since initially I wondered if Jeepney drivers would be classified as some variant of very petite bourgeoisie.\n\nThere is some difference though in the set up of Jeepney drivers, some have actually become proletariat through franchising system. Something I want to discuss when I can bring it up is analysis of Tricycle drivers (I think the closest idea in other countries would be a pedicab). \n\nMy gut instinct feels that there is something different between a vehicle used for mass transport, and another vehicle used as a form of taxi. However tricycle drivers are also poor, and depending on the setup of their franchise may also not own their tricycle.\n\nThere is some interesting history though, the Amerikkkans tried to popularize the human powered rickshaw which was met with resistance, at least according to this article though I'll have to study it more.\n\nhttps://www.cambridge.org/core/journals/international-review-of-social-history/article/rickshaws-and-filipinos-transnational-meanings-of-technology-and-labor-in-americanoccupied-manila/38B0B7062070A05936C131D4BA9C0F6E\n\nThough I'm unsure if there has been any more analysis on the general topic of transportation.\n\nI would like to know if there has been any deeper analysis on transportation from other communists?",
            "score": 20,
            "replies": [
                {
                    "author": "Bubbly-Ad-2838",
                    "body": "Malaproletariat in English is semi-proletariat, no? They live the life of the proletariat.\n\nMao:\n\n>The small handicraftsmen are called semi-proletarians because, though they own some simple means of production and moreover are self-employed, they too are often forced to sell part of their labour power and are somewhat similar to the poor peasants in economic status. They feel the constant pinch of poverty and dread of unemployment, because of heavy family burdens and the gap between their earnings and the cost of living; in this respect too they largely resemble the poor peasants.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "sudo-bayan",
                            "body": "Yes, that's accurate, particularly this part \n\n>...forced to sell part of their labour power and are somewhat similar to the poor peasants in economic status.\n\nWhat I want to further discuss though is the broader trends in that sector.\n\nI can see the lives of Jeepney drivers fitting well, but I wanted to also find discussion about tricycle drivers. They are also poor, I would think most also fit that category of semi-proletariat, but the nature of their work is different from mass transportation. I guess to put it more bluntly, I observe more organization for the cause of Jeepney drivers but see much less with tricycle drivers. \n\nAnother thing is the conversion of the semiproletariat into proletariat, which can be seen with the Jeepney modernization program. \n\nI would like to have more discussion about it because it seems like an issue that is closer to something tangible in the lives of Filipinos. For instance the U$-Marcos alliance is somewhat abstract (unless you live near a U$ Base) and though it is something we should profoundly reject it isn't something one usually observes unless they encounter the soldiers themselves. With jeepney drivers, in a regular commute you can see what they are going through, and if you talk with them learn about the precarious nature of their lives. One can also see the cynical belief that E-Jeepneys are some solution (when it is essentially a mini-van) and how it does not solve any of the issues it claims to solve. \n\nYou seem familiar with the Philippine context, maybe you can offer your thoughts, I'd be happy to learn.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "bumblebeetuna2001",
                                    "body": "this exact topic got brought up in a conversation in my life this week. someone was asking about labor organizing for \"workers\" in the philippines, and i wasnt sure whether to bring in the jeepney phaseout into the discussion because i realized i dont understand if they are classified as workers or petit b.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rhinestonesthrow",
            "body": "That recent [billy woods interview by Jacobin](https://jacobin.com/2025/02/billy-woods-rap-zimbabwe-colonialism) really shows how low the bar is for political hip-hop these days. Not that I expect musicians to have good politics, but billy woods being the son of a Marxist intellectual who fought for Zimbabwe's liberation perhaps made me naively hopeful",
            "score": 20,
            "replies": [
                {
                    "author": "doonkerr",
                    "body": "Subjectively, I enjoy a lot of his music, but his analysis is terrible, I mean come on:\n\n>For example, when I was a kid, I found the Shining Path really exciting and fascinating. And then later in life, I was thinking: thank god they didn’t win. That doesn’t make their opponents good. But the Shining Path was a cult of personality led by a psychopath.\n\n As if the masses in Peru don’t have the ability to think critically and were simply duped into “cult of persynality” worship. \n\nThe habit of condemning revolutions because they were “worse off” afterwards also rings through this whole interview. It’s almost like he’s an r/Ultraleft  user parroting memes with the level of vile cynicism attributable to those who frequent that subreddit.\n\n>In what country in the world does one party remain in power for thirty, forty years and not become corrupt?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Pleasant-Food-9482",
                            "body": "Fuck. This is true. This article is full fascism. Why is he so worried about maoism, particularly at a time where its gaining some reasonably high internet fandom fanfare in the world petty-bourgeoisie and in the first-world labour aristocracy (both class audiences being liberals and of fascist \"left\" libertarians masqueraded as \"marxists\", who hate maoism)",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "doonkerr",
                                    "body": "Based on his music and what was said in the article, I’d imagine that much of his cynicism stems from him watching so many “left” parties and organizations fall in the west. I don’t know enough about Zimbabwe’s Revolution and how much that might’ve affected his outlook as well, but he’s talked in his music before about his dad being a Maoist, “Little Red Book in my father’s breast pocket, the ground shook. History movin’ underfoot, I was on his shoulders on tenterhooks”.\n\nIn his music, this cynicism manifests in lyrics such as “It’s a freedom in admitting it’s not gonna get better” but ideologically, the endpoint of this cynicism is a pure rejection of the possibility of objective truth (or the possibility of revolutionary change) and ends in post-modernism, hence his eclectic and disjointed perspectives shown in that article. You can even hear this slow progression into cynical post-modernism by comparing projects like “History Will Absolve Me” and “Dour Candy” to his newer projects like “Maps”, “Church”, and “We Buy Diabetic Test Strips”.\n\nAll this article did was put my own criticisms with his politics out in the open. But, like u/rhinestonesthrow alluded to, he’s just a musician who makes his money through petty bourgeois production, and Woods’ politics clearly reflect it.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sea_Till9977",
                    "body": "It was embarassing seeing people trying to shoehorn some political analysis to Kendrick's medicore Superbowl performance. Apparently just including any sort of lukewarm 'ha Amerika controls us right' reference through Samuel Jackson in an Uncle Sam outfit is some profound shit. Sad because despite Kendrick's politics always being reformist with some peek of radicalism here and there (which influenced me, including the reformism), it seems that since 2022 he has just devolved into garbage politically.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "sonkeybong",
                            "body": "Yeah, liberals were acting like the inversion of Gil Scott-Heron was some kind of radical manifesto when it was just more indication that \"revolution\" means just another media spectacle in service of the Democrats.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "rhinestonesthrow",
                            "body": "Kendrick has never been interesting politically. It's weird that To Pimp A Butterfly is considered a political album; there are political elements to it, but it isn't any more political than the average 90s hip-hop album, it's just that hip-hop has become so commodified and commercialized that any artist who strays from a broadly appealing sound is deemed \"conscious\"",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Otelo_",
                    "body": ">That recent [billy woods interview by Jacobin](https://jacobin.com/2025/02/billy-woods-rap-zimbabwe-colonialism) really shows how low the bar is for political hip-hop these days.\n\nUnfortunately, I don't think the bar is low just for Hip-Hop, but for music in general too. A few months ago I made a comment about how it would be impossible for an artist as popular and as mainstream as Bob Dylan was in 1971 to release a song like \"George Jackson\". I still think that is true: perhaps the equivalent in terms of popularity would be someone like Kendrick Lamar releasing a song about Palestinian prisoners or something like that. Yet he has remained silent, which was to be expected\\*. Of course, we expect more from Hip-Hop artists in comparison to other artists in terms of activism due to the history of the genre, but I would say that, ever since at least the turn of the century, political Hip-Hop as a subgenre has becamed completely marginal and those who declare themselves to be political have few interesting things to say (or sell out like Big Mike or Ice Cube).\n\nAbout billy woods, i don't want to sound mean but the guy makes music for Anthonys Fantanos: guys who want to seem cool by listening to Hip-Hop, on one hand; while on the other only giving praise to \"artsy\" and \"intellectualoid\" hip-hop artists. It is very telling how Fantano constantly fails to predict the direction to which music is going: he either praises artists which are nothing new in terms of style and have made no (or few) contributions to the evolution of the genre's \"sound\", so to say (Kendrick's albuns, the last Tribe album, for example); or he praises albuns which are so \"advanced\" in terms of sound that, in the end, they truly aren't really advanced because they are too detached from what Hip-Hop (in general) at the moment sounds like - theses artists or albuns ended up not having that much impact in the evolution of Hip-Hop (Im thinking of names like Death Grips or JPEG Mafia; guys whose influence in mainstream is virtually unnoticeable). It his also very telling that he gave such low scores to albuns like 808s & Heartbreak, Yeezus or that he dislikes Lil Wayne in general, when Kanye and Lil Wayne (Kanye more in terms of sound, Lil Wayne more in terms of rapping techinque) are the blueprint, for better or worse, for current Hip-Hop.\n\n\\*The problem for political Hip-Hop artists, and in this I will include Kendrick, is that a lot of the times they only worry about being revolutionary in terms of the content of their art, not worrying about being original too in terms of form. I know that I will sound like Im trying to be different but Kendrick always bored me. There is nothing (or very few things) original in him. He is basically a mixture of Tupac (mostly the \"political\" content of his songs) with Lil Wayne (his rapping technique). His instrumentals are also not revolutionary (in the artistic sense). All this in my opinion, of course. Subjectively, I also dislike his voice.\n\nAlso something that should not be ignored is how well he has been assimilated by liberalism; this becamed even more visible after his beef with Drake and his Superbowl performance. Basically everyone has sided with Kendirck. I have even seen corporations make Tiktoks or whatever siding with Kendrick and making fun of Drake. Not something you would expect regarding a \"revolutionary\" rapper.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "humblegold",
                            "body": " Everything written in this thread is why I despise non Africans discussing \"conscious\" hip hop. \n\n\nMarxism has given you the analytical tools to correctly observe how Kendrick reproduces bourgeois ideology, and how he's compatible with liberal fetishization of \"the black experience,\" but you lack the ability to see the parts of Kendrick's music that would resonate with New Africans. \n\n\nYou've basically just used Marxism to reproduce more advanced sounding versions of generic white liberal hiphophead takes: glazing Bob Dylan for 70's New Left performative mediocrity, giving Kanye's \"influence\" undue credit for his parasitic feeding on the wave of trap and industrial with two mid at best albums, and using Jay Electronica as an example of an \"interesting\" political rapper, when the only thing politically interesting about him is how his disdain for jewish people conflicts with his dating habits. \n\n\nI have never met a single other black person who thinks that Kendrick's music is somehow \"revolutionary.\" It's not. That's not why a song like Sing About Me I'm Dying of Thirst can hit the way it does. White people have observed a black person rapping about his life and decided he's talking about the *The Revolutionary Black Experience*.\n\n\nI don't mean to go ballistic on you. I'm a black jazz musician and I just hate the way non black people discuss \"political\" black art, even explicitly bourgeoisie black art. I actually hate all of the comments in this specific thread aside from the one by /u/doonkerr and chose you because you commented the most so this frustration isn't meant to just be about you, for all I know you are black.\n\n\nI feel like there needs to be an added note next to the link to readsettlers on this sub that says \"While yes, this is one of the most important books anyone can read, this will not in fact make you the resident black person understander.\"\n\n\n[EDIT] I want to specify that I meant the first comment doonkerr made in relation to criticizing billy woods.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Sea_Till9977",
                                    "body": "I know this was not directed to me but I want to reply to explain what I think, and also because your comment hits certain points that I didn't talk about but do share. I think that's encapsulated by you talking about SAMIDOT.\n\nFor starters, I'm Indian. Kendrick's music was part of the process of me becoming more 'leftist' and listening to his music made me learn more about New Afrika. And yes, feel free to critique that, since metropolitan petite-bourgeois youth in India seem to think listening to rap songs means you can pose as being black (or even say slurs).\n\nI still listen to GKMC or TPAB because of moments like SAMIDOT (I mean when he says \"if I die before your album drop..\" still makes me emotional) or How Much A Dollar Cost. That's why the thought that Kendrick is unoriginal didn't make sense to me.\n\nKendrick's music has also seemingly touched upon the third world as well, at the very least I know a Dalit Tamil progressive rapper called Arivu (I have my problems with him, especially since he got more famous recently and started associating himself with questionable politics, but that hasn't affected his music much yet thankfully) who was massively inspired by Kendrick's music. And I do love the way Arivu writes and what he has to say. And the kind of qualities (a focus on writing, and that too vividly about one's/ a people's experience) of Kendrick's music and the beauty of hip-hop in general is what makes it seem to resonate with people in the third world (both rapping and the dance form). Like I said, not that his politics was ever revolutionary or anything but it did influence me positively and was part of my 'radicalisation process', along with the reformism and all.\n\nBut I do stand by my dislike for Kendrick since 2022. The idea that his 'healing' since MMATBS constitutes him just not being as political anymore just irks me. And the fact that people justify it makes me dislike it even more. I miss a song like Blacker the Berry for instance, because often I relate to the anger. Especially in the last couple years with my involvement in Palestine solidarity organising and experiencing more racism being Indian, and understanding the Indian struggle as a whole.\n\nTbh these are quite unfiltered thoughts. Feel free to critique them.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "humblegold",
                                            "body": " There's nothing for me to critique that you didn't already get to. I had no idea about Arivu or the impact hip hop had in India and it honestly makes me happy to hear that similar to Jazz and the Blues, no matter how commodified Hip Hop becomes it can still serve as a voice for the oppressed somewhere. \n\n\nI don't disagree with you on MMATBS. I remember some of my white friends wondering why I was a bit disgruntled by it when the album came out. Between Auntie Diaries, the whole \"I'm not your savior\" thing, and Kodak it really felt like this was Kendrick patting himself on the back before fully completing his transformation into one of the black bourgeoisie, and it absolutely was. That being said, since then I went through some shit, and had to unpack some shit from my past and the next time I listened to that album I fought back tears. \n\n\nThere's some shit on there that is very personal and uncomfortably real for certain experiences. For me it represents that despite everything we go through, there is still hope for black people that we can heal.\nAs a child I endured repeated abuse from white adults that was concealed from my parents. It made me a bitter, alienated and violent person, and hearing myself reflected back on this album helped me more than any therapist or counselor ever could. \n Shit I'm getting a bit teary-eyed just thinking about it. \n\n\nIt was ultimately Fanon, Malcolm X, Marx, Engels, Lenin, Stalin, Sakai and Mao that gave me the keys to understanding and healing, but I will always credit art that showed me that I wasn't alone. \n\n\nThe difference between the conclusion reached by me and the conclusion reached by this album is that the knowledge that I can heal makes me want to fight harder.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Otelo_",
                                    "body": "You don't have to apologize for criticizing me. Just to make it clear, I am not black. I am a southern european, but still white.\n\nIn all honesty, there is not much that I can reply to you without sounding like I'm trying to force my point of view or repeating what I have already said in comments where others have criticized me. The fact that a handful of users, including some that are well regarded here, have criticized me makes me assume that I am probably in the wrong here.\n\nI would, however, point out that when I mentioned that some see Kendrick as revolutionary, I wasn't specifically talking about black people in particular. I had in mind either those that I know in real life (which are mainly white and from a country completely different from the US) or what I see on the internet. As you can imagine, I don't know any New African personally.\n\nI am also aware that Kanye, a lot of times, operated by taking elements from the underground or lesser known waves or artists (parasitically like you said it) and incorporating them in more mainstream music. In my opinion, there is still merit in that too, but I understand your point. About Bob Dylan I only know a few songs, and I was only talking about one in specific (George Jackson), but don't you agree that it would be very improbable for a song like that one to be made today by an artist as mainstream as he was? I am not so much focusing on him as an artist (nor saying that he was a revolutionary while nowadays artists are not), but more on the structure of the music industry (or society in general) which allowed for certain themes to be addressed back then that wouldn't be possible now. About Jay Electronica, I do think that, thinking better, you are indeed right.\n\nAnd, since we are here, I am also interested in hearing which rappers do you think are good (like I asked another user).",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "humblegold",
                                            "body": "Appreciate your response. I lurk here and only just started commenting and the way you all handle criticism is something I greatly respect and try to emulate. \n\n\nI think the main reason why Bob Dylan could make a song like that is because no one really cares about George Jackson. I personally care about his life and his work quite a bit but I think if you were to ask the average white person who was around then who George Jackson was they wouldn't know or feel strongly about him. It was a nice PR stunt for Bob and his hero status among settlers is still virtually unblemished. He scored points with the Berkeley camp and the Bacon camp didn't care. \n\n\nPalestine is far more visible among the US population right now. I think that artists of Dylan's size back then would have been skittish about something like this too. \nThat being said it's embarrassing to hip hop that of all the \"big\" rappers only Macklemore had the stones to make a pro Palestine rap calling on people to withhold their votes. \n\n\nIt's also worth pointing out that music culture is more fragmented than it's ever been. The middle section of artists is larger (but less wealthy) than in the past and many of them can and have made at least marginally pro palestine music, but the ones at the very top like Drake, Kendrick and them are very much still dependent on record labels, distributors, promotion deals and good PR with the public.\n I've seen rappers call for the death of Joe Biden for his genocide, just not popular ones. An example would be Infinity Knives. \n\n\nLastly, I think petty bourgeois anxiety about A.I. and the class position of musicians also makes them less likely to step out of line. I credit reading y'all on this sub for making me have to start being honest with myself about how my being a musician was making me take reactionary stances on A.I among several other things. \n\n\nAlso to be fair to you I have more of an axe to grind with Bob Dylan than most because I'm from the same state as him and euro americans worship him here. He frequently gets used as an example of what \"real lyricism\" looks like as opposed to rap so when I see someone bring up Bob Dylan and Hip Hop in the same sentence I immediately expect racism. \n\n\n\n>And, since we are here, I am also interested in hearing which rappers do you think are good (like I asked another user).\n\n\nHonestly at the moment when it comes to mainstream hip hop right now I'm most interested in what the ladies are doing. Meg, Flo Milli, Rico Nasty, Doechii etc. To me Glorilla is by far the most interesting new rapper to emerge out of the 2020's. I'm honestly just happy to see black women that don't have to force themselves to be considered \"classy\" by Euroamerican standards finally get to talk their shit in on stage, even if it isn't revolutionary. \n\n\nI think I most often listen to chopped soul/jazz sampled stuff ala Denzel Curry, Lupe, Black Thought, Larry June, Schoolboy Q, Action Bronson, Freddie Gibbs and all them.\n\n\n[edit] grammar and clarified a few sentences.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "vomit_blues",
                                                    "body": "Your contribution was very much needed. I’d been following this thread as a dedicated fan of hip hop and hadn’t really felt the urge to contribute because the scope of the conversation was so far removed from my own understanding and I wasn’t even totally positive if I was wrong or if they were. But overall that’s a mistake on my part and just justifying intellectual laziness, ultimately I read these posts multiple times and gave them the pass as “engaging” with music and therefore interesting. But it’s very sobering to read through these threads and see the artists being praised actually gravitate toward the median of “acceptable” reddit musicians like Bob Dylan or most surprisingly the hip hop heads type recommendations from u/red_star_erika. To be fair to her she wasn’t speaking authoritatively or even as a rap fan. The Jay Electronica mention was arguably even worse.\n\nThe artists you raise toward the end of your post are more interesting and worth including in the conversation because what’s ultimately happening here is pretending to grapple with the ideology of compradors who claim to speak for New Afrikans and dismissing it, while intentionally excluding music that is still immanent in some sense to class struggle. I seriously doubt anyone in this thread before you had the idea to ask both what appeals people to Kendrick (something I’d like to hear more from you about) but also the legitimate artistic production occurring organically. But I don’t think anyone here is equipped to or has any stakes in analyzing NBA Youngboy or Glorilla. The outcome either way is these people being excluded from the conversation and talked for just so they can be turned into strawmen. It’s pretty grim.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "red_star_erika",
                                                            "body": "I am a bit confused by your comment. to clarify, I was not giving recommendations since one of the artists I mentioned I said was mostly bad. I was briefly assessing the kind of music I used to like at a time when I was more of a hip-hop listener in response to a question posed to me that I otherwise wouldn't have had much to respond with. I knew that bringing up what I used to be into would probably put me under a fan stereotype but I figured that the music deserves being taken seriously since I took it seriously back then. I am aware that my understanding is incomplete but was anything I said actually incorrect? \n\n>The artists you raise toward the end of your post are more interesting and worth including in the conversation\n\nwhat makes this so and what makes these artists more immanent to class struggle? so far, u/humblegold has only qualified them by genre influence and gender so what sets them apart in terms of being worth talking about on r/communism isn't obvious to me. we both mentioned Denzel Curry who was originally from SpaceGhostPurrp's collective so would it not be worth understanding why he ended up more interesting artistically? \n\n>The outcome either way is these people being excluded from the conversation\n\nisn't this inherent to discussing art? you say you are a dedicated fan of hip-hop but this comment reads as shutting down on the possibility of it being engaged with by us which seems more grim to me.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "vomit_blues",
                                                                    "body": "u/humblegold already said all there was to say wrt a critique of the thread. So what I intended to point out was that beneath the surface of the conversation was a familiarity with hip hop that is still very “reddit-y”. I should have been clearer though that I wasn’t trying to single you out as a particularly bad contributor to the thread.\n\n> would it not be worth understanding why he ended up more interesting artistically?\n\nWell this is what I’m really challenging. Actually I don’t really agree that every person mentioned by u/humblegold is all that good. I should have been at least somewhat critical, since it’s not even really true that all of their art would be immanent to class struggle. Rather I was really responding to the centering of Glorilla who I do find interesting. \n\nArtists aren’t what I called immanent to class struggle but the art itself. That’s something we determine after the fact based on the content of the work arranged in a social totality.\n\nSo where I see eye-to-eye with u/humblegold is that there’s a worthwhile analysis to be made of the recent wave of popular female rappers. I want to point to Nicki Minaj’s song Shether to begin.\n\nhttps://youtu.be/61TJVzkdKNA\n\nThe content is clearly reactionary: Remy Ma is a “groupie” whose connections in hip hop come from however many guys who have claimed to have slept with her. Putting aside the gossip that comes from a diss track, this is the key takeaway. Nicki Minaj very specifically has been a vessel for male chauvinism in rap her entire career. The contradiction of being a “valid” female emcee in a genre dominated by men is resolved with her own history of sexism, which is really just capitalist ideology speaking through her. In fact the necessity of a female rapper being so vile is a fairly recent phenomenon.\n\nhttps://youtu.be/f8cHxydDb7o\n\nThe objective outcome of the neo-colonization of New Afrika is the introduction of all forms of reaction. So I’m not pinning this all on Nicki Minaj but instead I see it as the words of the new comprador class, reflecting patriarchal capitalist ideology.\n\nWhat I’d like to see more conversation about that u/humblegold brought to the table is what lead to the final death of a relative dry spell for female rap and the explosion of a very particular “genre” which is sexually outspoken women whose music intentionally avoids the male gaze, like Glorilla. Determining if this is truly immanent to the class struggle or not is beyond my own abilities but it’s at least a better use of everyone’s time than most of what had been said in this thread before.\n\n> isn’t this inherent to discussing art?\n\nWell amongst discrete people on an online forum it’s simply the popular tendency, dictated by the logic of reddit itself. But it’s also something that should be resisted. What I didn’t mean by exclusion was the obvious inability for certain people to speak, what I’d actually meant was the understanding that certain people can’t speak and accepting that on its face and deciding to speak for them, ultimately leading to laziness and crappy conversations.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "humblegold",
                                                                            "body": "You're on the right track with this. The Glorilla and female rap analysis is good so far. I would add that I find the cultural conversation around her unashamedly heavy Memphis accent to be important as well. Specifically how her accent relates to how the femininity of black women is perceived, how language and accents get used to enforce cultural norms etc. Her and Meg Thee Stallion's song 'Accent' is probably the most literal reflection of this. \n\n\nFrom a craft standpoint it's interesting how the Memphis accent being what it is opens up rhymes that literally aren't possible in standard dialects of English, and specifically how the interplay of her demonstrated ability to speak \"proper English\"  with her conscious choice not to change or dampen her accent despite the doors it would open. The heavily circulated interview clip of her rhyming 'beautiful' with 'spirit' comes to mind, or her songs where she rhymes a \"Standard\" word with a \"Memphis\" word. \n\n\nI should clarify in regards to your statement about criticism that several of the male rappers I mentioned I don't consider particularly useful to class struggle. There's little political value in Action Bronson's music to me, it actually makes sense that his music is as reactionary as it is because one of his parents fled the Hoxha administration. \n\n\nI put those men in the same jazz/soul category because I see aspects of the jazz tradition reflected in them, be it production choices, philosophical approach to their craft, rhythmic styles etc. I occasionally transcribe their rhythmic phrases the way I might a Paul Chambers solo to use later for improvisation. Also they occasionally reflect certain parts of my own life in the same way grunge spoke to disgruntled petty bourgeois youth of the 90's, sadly even in their chauvinism. \n\n\n>What I didn’t mean by exclusion was the obvious inability for certain people to speak, what I’d actually meant was the understanding that certain people can’t speak and accepting that on its face and deciding to speak for them, ultimately leading to laziness and crappy conversations\n\nThis is right on the money.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "vomit_blues",
                                                                                    "body": "An element of postmodern art is its decomposition into discrete, territorial monads ready for consumption by the mass audience ready to consume it. Resistance to that comes in the form of objective conceptual regularity, and Accent is a good example. \n\nSome of what you’ve said here and elsewhere reminds me of Ngũgĩ. If I’m building off of his arguments, an interesting angle to me is that Meg and Glorilla are conjunctive interventions where the voice of the subaltern speaks beyond words (if we momentarily treat them monadically) but within pure articulation.\n\nTo be fair to Nicki she was outspokenly a NYer in her language, but what cuts her off and brings her into the postmodern is a populist extroversion. Think of the reverse of *Honestly, Nevermind* where instead of commodifying the domesticity of NJ, the world of Nicki Minaj imagines a distinctly male world of common rap. Regional and class differences are flattened out into a flow of pure content or reterritorialized lignes de fuit. The logical conclusion of this is Travis Scott but Kanye West is a sort of parasitic zygote. This specific movement is distinctly postmodern in its obliteration of the real in favor of the primacy of the commodity fetish. For Nicki, her voice is just part of the product. For Glorilla, you should be alienated by it.\n\nJust trying to expand on you gravitating toward the accent as Glorilla’s interesting.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "red_star_erika",
                                                                            "body": ">Well amongst discrete people on an online forum it’s simply the popular tendency, dictated by the logic of reddit itself. But it’s also something that should be resisted.\n\nI still do not understand this line of reasoning at all and I don't know if I am misunderstanding since even you say it is the art itself rather than the artist that is immanent to class struggle so the art should be allowed to speak for itself. do you mean like people making assumptions about the beliefs or intentions of an artist when you talk about people \"speaking for them\"? how is it to be resisted? you don't seem bothered saying that Nicki Minaj is a vessel for patriarchy without her present.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "vomit_blues",
                                                                                    "body": "Alright, I’m starting to think maybe my own words, unclear in hindsight, might be the issue here. I said “these people” are excluded and it looked like I meant the subjects of the sentence, NBA Youngboy and Glorilla. I’d meant “these people” as in New Afrikans and people with their class perspective. That’s who’s excluded.\n\nSo it’s not that anyone was speaking for artists about their own art, or that I’m speaking for Nicki Minaj, but that ex post facto the conversation was immanent to a non-proletarian position which created a specific disconnect: the thread gave a one-sided analysis of the content of comprador ideology but was unable to progress into the appeal of the music to the subaltern classes of the u.s. This is actually the meat of what u/humblegold had to say and his most interesting observation. His response to you contained a potent quote from Sakai I also agree with. Basically, what was being said was obvious and far from a Marxist analysis. It was liberal common sense dolled up with Marxist terminology.\n\n> art should speak for itself\n\nSince art doesn’t have a mouth, it’s merely an image or a dead monad given life by scientific critique. We give it the mouth and by the grace of god what it speaks must be truth. So the argument is just that you were incorrect, at the most bestowing the art with a mouth that speaks a half-truth, stating the obvious, obfuscating what’s critical: productive analysis that lends insight into the consciousness of the proletariat and “changes the world”.\n\nSorry if what I said in the first comment was unclear, by the way.\n\nedit: Music is a relatively autonomous cultural sphere. The danger is falling into a mechanistic determination of the bourgeois content of the music and chalking up the enjoyment of it by New Afrikans as nothing more than an outcome of a “degenerated” class perspective, or an over exaggerated theoretical dependence on the presence of the lumpenproletariat. In both cases it’s close to what u/humblegold warned against which is seeing New Afrikans as brainwashed. The sphere of musical production itself is a decentered structure and its consumption in the postmodern area is more like a buffet table where the unconscious selects particular elements and wilfully ignores the rest. That’s. because everything is a commodity, even what we retroactively determine as revolutionary, a type of “content” that is also a decentered structure.",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "red_star_erika",
                                                                                            "body": ">I said “these people” are excluded and it looked like I meant the subjects of the sentence, NBA Youngboy and Glorilla\n\nyeah, this is what I thought you meant. I understand what you are saying now and I think I struggle with identifying what is revolutionary in art in general. my understanding of what constitutes proletarian art is still unclear which indicates a need for further study rather than throwing out random half-thoughts.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "whentheseagullscry",
                                                                            "body": "> What I’d like to see more conversation about that u/humblegold brought to the table is what lead to the final death of a relative dry spell for female rap and the explosion of a very particular “genre” which is sexually outspoken women whose music intentionally avoids the male gaze, like Glorilla.\n\nI don't know much about rap so I've been keeping quiet, but I do know Glorilla was accused of being made by her producers to have sexual music, an accusation which she very bluntly shut down on social media. Seems to bolster your point, here. Would you say this is related to WAP and the brief moral panic it incited? Outrage over women (especially black women) embracing their sexuality?",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "humblegold",
                                                                    "body": "I don't really care about the quality of your music taste. We do have some overlap but that's really not what I'm getting at. It's the perspective, and the taste of users in this thread helps elucidate that. \n\n\n\n\n>what makes this so and what makes these artists more immanent to class struggle? so far, u/humblegold has only qualified them by genre influence and gender\n\n\n\n\nFor starters, this obviously isn't \"immanent\" to class struggle. That's just a lazy way to dodge responsibility by pointing out the completely true fact that this is relatively low priority for communists. You all as communists consciously chose to discuss African music, so now an African musician is challenging you to do so in a way that isn't garbage. \n\n\n\n \nJ. Sakai points out that any garden variety liberal can identify that there is in fact an upper class that is materially incentivised in reproducing its own ideology. That any settler would-be class traitor has a responsibility to go beyond pedestrian race unity regarding New African conditions. All people in this thread have done is congratulate each other for the groundbreaking realization that yes, petty and haute bourgeois musicians reproduce their class ideology through music. I can walk into a barbershop and have a conversation more valuable than that. \n\n\nAfter Doonkerr's first comment correctly pointing out Billy Woods' reactionary and disgusting anti maoist comments any other comments became redundant, unless they were to actually advance the analysis, which none did. The actual  purpose they served was reinforcing the idea that African music exists only for the consumption of settlers, and that any connection actual Africans might have to it is an exception not worth analyzing. \n\n\nThere's been no attempt to see what aspects of these hip hop artists resonate with the New African population. Until\nyou've done that everything in this thread is little better than YouTube video essay slop and will inevitably arrive at the liberal conclusion that the black proletariat and lumpenproletariat is simply \"brainwashed\" into enjoying bourgeois music. \n\n\nI don't yet have the ability to fully analyze this music with a proletarian perspective as a New African petty bourgeoisie. If I can't do it, you all as the settler petty bourgeoisie definitely can't and you haven't proven otherwise. I have a feeling that someone like Smokeuptheweed or DashTheRed could, but until they do I haven't seen anything. \n\n\nI'm not advocating this sub become a Glorilla fanpage, I'm demanding you either advance your Marxist lens or dispense with the liberal garbage before it turns into racism. I can't tell you how that will look because I don't know how white communists should go about accomplishing that. \n\n\n\n>isn't this inherent to discussing art? you say you are a dedicated fan of hip-hop but this comment reads as shutting down on the possibility of it being engaged with by us which seems more grim to me.\n\n\nWhat's wrong with you guys being shut out? I should be shut out of a discussion Smoke has about Korean history because I can't contribute to it more than the average liberal.  \n\n\nSo far you've all provided as much value as the settler lens can and thus should be shut out if your lens can't be developed. I revisited this thread several times before commenting waiting for something more valuable and it hadn't revealed itself, so now I'm providing the petty black perspective. \n\nOnce we have access to the black lumpen and proletarian perspective, if I can't advance my own I should be shut out as well.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "red_star_erika",
                                                                            "body": "I don't think you have yet provided a more advanced analysis than me. I never said the music was only for the consumption of settlers and I in fact implied the opposite by mentioning overlap in demographics. my purpose in saying that mainstream music has to be able to appeal to settlers was to open up the possibility of a revolutionary struggle in art taking place in the underground in response to the other user's overreliance on influence as a metric. \n\nsince we are capable of grasping proletarian politics despite being non-proletarian, the same should apply to our approach to art although you and I have both said we need improvement in this area. I think feeling resonance with art is a political matter and since you said in another comment that you resonated with a Kendrick album because of oppression you went through, that would indicate a progressive aspect to the music although you note its shortcomings in not resolving in a revolutionary manner. I do not say things like \"here is why this or that appeals to New Afrikans\" (aside from the fact that there could be both reactionary or revolutionary reasons for why something appeals to someone including those who are oppressed) because art or aspects of art which I say are good and art or aspects of art that are capable of resonating with the advanced feelings of the oppressed should be one and the same thing since I am trying to apply Marxism. of course, I am not confident in my ability to do this so if I say something is good and it is bad or vice versa, I should be criticized. but ultimately, I am just as capable of understanding things as someone like smokeuptheweed. \n\n>I should be shut out of a discussion Smoke has about Korean history because I can't contribute to it more than the average liberal.\n\nbut you should not be satisfied with that. I am not satisfied with my approach to art so I commented while highlighting my shortcomings in the hopes that my understanding could be advanced. if I just kept my thoughts in my head, this would never happen.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "humblegold",
                                                                                    "body": "> I don't think you have yet provided a more advanced analysis than me.\n\n\n\n\n1. Yes I have. That you don't think I have is exactly why I said I take no issue with this perspective being shut out. \n\n\n2. It isn't really my intent or responsibility to decolonize your mind and present my own full analysis on the topic of black art. I already explained that I asked you all to stop spewing nonsense and develop your understanding more. To continue my Korea metaphor this would be like if instead of studying I just continued talking about some bullshit I read in a tabloid about North Korea when I was 14 and this served as the basis for the rest of the conversation's political understanding of Korea. \n\n\n\n3. I really hate explaining racism to non black people.  Unfortunately I have a narcissistic/idealistic delusion that it's worth trying to do. That or masochism. \n\n\n\n>I never said the music was only for the consumption of settlers\n\n\nOf course you didn't, you didn't have to. That's what I keep trying to say. Your original comments were among the least reactionary in this thread which is why I don't understand why you can't grasp this. \n\n\n\n>I do not say things like \"here is why this or that appeals to New Afrikans\n\n\n\n What I said is that you and all the other commenters consciously or unconsciously engage with African art through the lens of how it can be consumed by settlers. As such once you made the correct observation of \"Billy Woods is saying some fascist bullshit\" or \"There are numerous examples of reactionary garbage in Kendrick Lamar's music\" you have nothing more to contribute. Through continuing criticism through an undeveloped settler perspective you negate the African one.\n\n\nA good example of this would be /u/doonkerr's attempt to describe MMATBS's theme of infidelity. Racial self loathing combined with colonial imagery of the black beast ravaging the settler girl can create a real fetishization of white women as a form of self punishment or validation seeking. When I heard that for Kendrick it manifested in infidelity I didn't condone it but wasn't surprised. That is a theme that could resonate with a black person of any strata. I've seen this validation seeking in the American black bourgeoisie and I've seen it in East African homeless people. \n\n\n Instead we get \"he cheats on his wife lol.\" After reading that I'm embarrassed I held up his earlier criticisms of Woods. Any liberal could have said that shit. \n\n\n\n\n>but ultimately, I am just as capable of understanding things as someone like smokeuptheweed.\n\n\nThis is true and that's why I'm going to rescind my lazy appeal to authority that Smoke would have something much more valuable than you to contribute. They most likely would not. Now that I think about it I think I recall reading some comments they made months ago on the topic of Kendrick and I remember not being impressed. \n\n\n>but you should not be satisfied with that. I am not satisfied with my approach to art so I commented while highlighting my shortcomings in the hopes that my understanding could be advanced. if I just kept my thoughts in my head, this would never happen.\n\n\nThat's why I specifically said that you have already contributed all a settler can, and if you don't significantly advance you should be shut out. Even if it was my responsibility to teach you, what you're doing isn't trying to learn, it's justifying yourself. \nThe fact that you all have such a strong understanding of Marxism that you can use it to justify yourself makes it even more dangerous, but the fact that you are all Marxists is precisely why I am telling you this in good faith instead of filing it away with all the other drivel on reddit. \n\n\nUndeveloped settler critiques of black bourgeoisie eventually end up sounding like Klu Klux Klan watercooler talk. I am nipping that in the bud.",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "red_star_erika",
                                                                                            "body": "thank you for your input.",
                                                                                            "score": 6,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "vomit_blues",
                                                                                            "body": "I also saw Smoke’s comments on Kendrick and liked them. I’d really like if you expanded because I want a critique that can aim at my own presuppositions and deconstruct them.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "doonkerr",
                                                                                            "body": "Thank you for the critique. My ability to analyze art is limited at my current level of understanding, and that comment of mine is a reflection of that. I was making an attempt to push the limits of my thinking, and it still fell short. The analysis you added is clearly much more detailed. In the future, I’ll try to put in more effort before commenting.\n\nEdit: Additionally, as a white persyn, black infidelity is something I did not take into account, and as you pointed out, it shows the limits of my class position. You’ve given me (and likely everyone else who participated here) a lot to think about when it comes to analyzing New Afrikan culture. It’s like you said in an earlier comment, simply reading Settlers does not make you understand Black culture.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "humblegold",
                                                                                                    "body": " I don't like soothing white people's racial anxieties but to give you some credit I have never seen white communists respond to criticism in as productive a way as you lot have and I feel encouraged to contribute more when I can in the future.",
                                                                                                    "score": 7,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Otelo_",
                                                    "body": "Thank you for your response.\n\n >He frequently gets used as an example of what \"real lyricism\" looks like as opposed to rap so when I see someone bring up Bob Dylan and Hip Hop in the same sentence I immediately expect racism.\n\nYes I understand how that can be frustrating. Like I said, it was more about a song in specific and not about him as an artist overall. Besides, he also had reactionary songs too like one which is explicitly zionist \"neighborhood bully\". I admit that I do like some songs of his, but I'm definitely not his greatest fan nor anything like that.\n\nAbout Palestine, perhaps the best comparison would be Vietnam, no? But even then there are still differences, since the war affected americans in a more direct way, for example because of conscription, which perhaps \"forced\" artists to take a stance. Also, if I am indeed sad that Hip-Hop artists have not taken a position, it is only because I expected more from them because of the history of the genre. One would already expect silence from euro-american musicians.\n\nAbout the music industry, you make up good points which unfortunately I am not abilitated to comment on since I am just a casual listener. I remember the discussion about AI though, it was indeed interesting.\n\nRegarding female rappers, I confess that although I don't think that I have any prejudices against them, I end up not knowing many of them. I only know the really mainstream ones like Nicki or Cardi. Also since I do listen to some Three 6 Mafia Gangsta Boo, but that is it. I think I must explore that part of Hip-Hop more. About the male rappers you mentioned, I do like most of them, some I don't know very well.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "red_star_erika",
                            "body": "I don't care about Fantano but, since communists have to take up the task of art criticism, why should influence on the mainstream be a metric for determining good and bad art (especially with hip-hop currently being under neo-colonial domination and having to appeal to settlers)?",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Otelo_",
                                    "body": ">why should influence on the mainstream be a metric for determining good and bad art (especially with hip-hop currently being under neo-colonial domination and having to appeal to settlers)?\n\nIt is true that ending up in a cult of \"spontaneity,\" where we determine what is good art as whatever is popular among the masses at a given time would be an error. But, in my opinion, a lot of the art pieces throughout history which were indeed revolutionary (both in terms of content and of form) and were acknowledged*, had an impact on the direction that said art went. Some of Marx's and Engels' favorite artists are also some of the most famous artists of all time (Dante, Cervantes, Shakespeare, Goethe, Dickens and Balzac retroactively in a way), and they all had a great impact on literature. I don't think that music that nobody likes and that people force themselves to listen to because it has \"important\" conscious lyrics (as some sort of penitence) can be any good. All this, of course, at the level of the individual listener; I understand that a communist party (especially one with state power) can promote artists that technically aren't that good for the purpose of founding a socialist artistic movement. Sort of as a \"beginning\". And, at the end of the day, the most important purpose of Art must be the way it serves the construction of socialism of course. But some of the greatest artists to come out of socialism, like Eisenstein, were indeed geniuses, and they too had an impact on art (including, in this case, on the art of the capitalist world).\n\n*A difference should be made between an artist which simply wasn't or is yet to be acknowledged, which means that the mainstream has simply not had any contact with the said artist (a truly underground artist); and an artist which has been acknowledged (in this case, been listened to), but has been ignored because the art of the said artist has nothing new artistically. Speaking of Fantano, the only album of Kanye that he has given a 10 is Kids See Ghosts (with Kid Cudi). It is probably the least impactful of Kanye's albums. At the same time, he gave a  5 to Yeezus, a much more interesting (in my opinion) and a much more impactful album.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "red_star_erika",
                                            "body": "most \"conscious\" hip-hop is uninteresting but I think even an artist who is good both musically and politically wouldn't necessarily reach the mainstream given what I said before. what is mainstream and what reaches the masses shouldn't be viewed as the same even if there is overlap.\n\nalso Yeezus is indeed not very good.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Otelo_",
                                                    "body": "Ok fair enough. I disagree about Yeezus, but I understand. Which rappers do you think are good?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "red_star_erika",
                                                            "body": "my answer would be boring since I don't listen to a lot of hip-hop so my knowledge is limited and what I consider to be the best of hip-hop is old head stuff that everyone already agrees is good like Public Enemy (which, while good, existed in a different musical landscape). also my skills at Marxist analysis of art are still novice especially when it comes to music. in terms of more modern hip-hop, I was casually into stuff like Denzel Curry, Lil B, and SpaceGhostPurrp in the 2010s and I think they have interesting aspects but are flawed (I think Denzel is a good rapper but his output is hit or miss). SGP's music is pretty reactionary and not just because of the obvious reason of the misogynistic and heterosexist lyrics, but also because the production style he is known for relies heavily on invoking nostalgia, although I think the production style on B.M.W is kinda cool. as I said, I am out of my depth here and you probably have better knowledge of the genre. though I don't think that disqualifies my opinion on Yeezus since I see it as quite comprador in its themes and it sounds like a migraine.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Otelo_",
                                                                    "body": "Yeah I agree Public Enemy is very good. Of older rappers I also like some NWA, Mos Def (Black Star too) and then rappers who mix (unfortunately) somehow good political commentary with religious talk like Outkast or Goodie Mob. Then there are rappers that I do listen to without them being explicitly political (althought there is always politics underneath) in their lyrics like UGK, Nas or even early Jay-Z (I know, I know). Of more recent ones I like Lupe Fiasco.\n\nBut what I am not sure about is whether artists must be explicitly progressive in the lyrics of their songs for us to consider their art good. For example, regarding other arts, if we read a book or see a movie where all the characters are reactionaries, we can understand that, throught the fascism of the said characters, a revolutionary image or a critique of capitalism can be constructed. Perhaps the same can be said of Hip-Hop (or music in general) where the politics of songs can go beyond what is displayed at face value in lyrics (or even beyond artists intentions).\n\nFor example, Jay-Z has always been a reactionary, that is true. But there is, in my opinion, some interest in seeing \"Black Capitalism\" as an ideology articulated so explicitly in his songs. When he says, \"I never prayed to God, I prayed to Gotti\", we see displayed the feelings of many (especially from opressed nations) young men, who see in mobsters the power and the wealth that they do not have in real life. In many of his songs (I'm mostly talking about his earlier albuns) he shows the violence and the malice that made possible him becoming wealthy through drug dealing. This is not a good picture, but it is unfortunately a real one. His cold \"Mafioso\" persona is also a challenge to the (of course false) stereotype that exists of black people as hotheaded: instead, when he portrays himself as a criminal (even if he was indeed a drug dealer in real life, its still a character) he is calm, never talks loud (Jay-Z basically never screams in his music) and a machiavellian planner. I think that too hmhas captivated admiration by some and hence why he became a model of \"sucess\". He is much more of a mobster (I would say that he resembles Michael Corelone) than a gangster. When he stopped with the criminal persona and changed to the self-made millionaire/billionaire, he retained many of these characteristics, although his music became less interesting, in my opinion.\n\nI think one could also see underneath Yeezus a critique through the obvious parody-like persona that he adopts throughout the album. The entire album has a more or less continuous sound and themes until we get to Bound 2, which seems completely out of place. The other songs (where he only talks about how many women he has had sex with, about not giving a fuck and even about being a god), are the shell that he built around him because he is scared of his true feelings, of the fact that he do gives a fuck and that he is in love.\n\nAll this are just my interpretations, of course, and I have also not studied the marxist theory of art, so what I said here can be wrong and I'll accept that. There is also the problem, as you mentioned it, of analysing production and determining which sounds are progressive or reactionary. I, also, am not equipped to talk about that, although your point about sounds that are nostalgic being reactionary is interesting and I believe true.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "doonkerr",
                            "body": ">Also something that should not be ignored is how well he has been assimilated by liberalism; this becamed even more visible after his beef with Drake and his Superbowl performance. Basically everyone has sided with Kendirck. I have even seen corporations make Tiktoks or whatever siding with Kendrick and making fun of Drake. Not something you would expect regarding a “revolutionary” rapper.\n\nI never understood how anyone could genuinely listen to Kendrick and think, “Wow! What a radical artist both politically and artistically.” Because, as you said, his music itself is nothing special, but even in the realm of practice, the “revolutionary” spirit of his music is so far disconnected from his practical choices. Not only is he a bare fanged misogynist (Big Stepper was literally him saying “I cheat on my wife so I’m sorry, but I can’t help it.”) but there’s such a clear disconnect from yelling “black power” in his music and being paid to play at the Super Bowl, a huge funder and recruitment tool for the U$ military.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Otelo_",
                                    "body": ">I never understood how anyone could genuinely listen to Kendrick and think, “Wow! What a radical artist both politically and artistically.\n\nBeing generous, I would say that there are a few songs of his that could maybe be seen as revolutionary. \"Mortal Man\" is interesting, especially his dialogue with Tupac (although the song, in itself, perhaps not so much). \"Alright,\" \"The Blacker the Berry,\" and a few others also have a politically positive, so to say, message. And there a few songs of his that are indeed good like \"Money Trees\".\n\nBut, like you said, I, too, don't see anything revolutionary in Kendrick. Specially right now. Yet, during the whole thing with Drake, the feud was presented as \"Kendrick, the guy who is for the culture and represents the roots of Hip-Hop\" versus \"Drake, the guy who makes Pop songs and who is the product of a corporation\". There was also a big deal, in my opinion, of misogyny surrounding the whole thing: unfortunately for Drake, he committed the unforgivable sin of being \"feminine\" (all the lightskin jokes have to do with that). You mentioned Kendrick's misogyny, and that is also a good point. All this, of course, doesn't mean that I have Drake in high regard or whatever, although I do listen to him more. However, It is interesting that Lupe Fiasco and Jay Electronica, two of the rappers in the \"mainstream\" with some of the most interesting political songs, prefer Drake to Kendrick.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sea_Till9977",
                            "body": "I dont think Kendrick is unoriginal. I think you have classified his rapping too simplistically. His rapping technique isn't just Lil Wayne copying lol. Doesn't matter, everything that I thought was somewhat redeeming back then doesn't exist anymore, except for flashes of good rapping here and there (I like a couple of his newer songs but do any of them have the bounce of Money Trees or the vivid lyricism that I honestly think he displayed before his dogshit Mr Morale and the Big Steppers). It's funny (in a sad way) because the 'reformed' and 'healed' version of Kendrick since 2022 is actually more misogynistic and condescending and just annoying with this lame ass political preaching.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": ">His rapping technique isn't just Lil Wayne copying lol.\n\nYeah that part is bizarre to me. Rap is a little too vast to make stylistic generalizations like that. I'm trying to think of any Kendrick song where he sounds like *Lollipop* or *Fireman* - hard to imagine. Of course, I think many of the 'viral' rappers of the last ten years owe a lot to Lil Wayne. But, they also owe the virality of rap in general to him anyway since he sort of transformed music releases putting out free mixtapes on Datpiff. I don't listen to much rap anymore (there's too much..), but I remember very distinct sounds between something like NYC rap and Memphis rap. Lil Wayne just sounded like Three Six Mafia to me when I was younger, for example. I'm not sure if geographic developments still occur with the era of streaming and virality and physical mixtapes don't exist anymore obviously. Someone genuinely good like Chief Keef can go viral and instantly there are a whole new crop of artists that pop up trying to mimic that sound, makes it very difficult to take any music seriously.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Otelo_",
                                    "body": "I'll reply here both to you u/Sea_Till9977 and to you u/PrivatizeDeez since you have both offered similar criticisms to me. Unfortunately I had written a very big reply to both of you, but I closed the app by mistake and now I feel a bit sad and unmotivated for having lost all that I had written. But I'll try to summarize what I had written in my comment:\n\n1) Firstly, I would like to say that Kendrick himself recognizes Wayne's influence on his style, particularly in terms of his flow. Also, he is such a big fan of Wayne that he released an entire mixtape whose beats are from a Lil Wayne album, Carter 4 (if I am to be totally honest, I only found out this now during my research to reply to you ahaha)\n\nhttps://youtu.be/8yfAUqc6ndI?feature=shared\n\nhttps://youtube.com/playlist?list=PLFvR2bZRQluxe1sa4-lpX8Q7u37ieaI81&feature=shared\n\n2) Secondly, I would like to say that it isn't all that important to my overall argument wether Kendrick's style is only influenced by Wayne or by other rappers too (like I said Tupac, or Andre 3000 or all the other rappers from Kendrick's region). I still think Wayne is the blueprint for most rappers and that means Kendrick too.\nBut the main point is that, in my opinion, he never (or rarely) goes beyond technically what had already been established. u/Sea_Till9977 in your opinion where do you find Kendrick to be original strictly from a technical point of view?\n\nAlso, u/PrivatizeDeez I don't think that Three Six Mafia have had that big of an impact on him. Perhaps only on his early work but he has later evolved since then. Or in a very general sense since that they basically invented trap, in which case that means that they influenced everybody.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sol2494",
            "body": "Does anyone here struggle with addiction? Trying to follow the 12 step plan on MIM’s website and wanted to see if anyone else has found it to be successful in treating their addiction?",
            "score": 16,
            "replies": [
                {
                    "author": "MajesticTree954",
                    "body": "'Addiction' as a concept should be interrogated. Most people abstract away from the object itself, so the differences between addiction to cigarettes, video games, heroin and sex are blurred, but more importantly the social context in which an object is repetitively consumed is ignored. Without that, it's hard to offer help or compare situations. \n\nI think the most valuable thing about 12 step programs in general is the social commitment. For the mainstream AA or NA programs, usually you're making a commitment to others that you're moving towards a new life of steady employment, perhaps religiosity, responsibility towards your kids, etc. And there's some accountability there, if you fail, you have to shamefully tell others that you've failed and make a plan for next steps. This is good. Where this goes wrong is when folks quit heroin and all their old problems (problems of capitalist society) are still waiting for them, these goals are unattainable - no job, no safe place to live, no family to help you get back on your feet (and why is it only your family whose responsible in the first place?). Point is: there's no \"revolutionary\" 12 step program without a revolutionary organization.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "IncompetentFoliage",
                    "body": "Have you read *Prisoners of Liberation*?  It is the account of two American spies who underwent thought reform in a Chinese prison.  It is not explicitly framed in terms of addiction, but I think the problems the authors and their fellow inmates dealt with were substantially the same as addiction.  They had entrenched patterns of harmful thinking and acting that were grounded in their social context.  I think the difference between this and addiction is that in their lucid moments addicts can recognize that their compulsions are harmful whereas the authors' ideas and habits were so socially normalized and fundamental to bourgeois ideology that they barely recognized or grappled with the harmful character of their actions, save for brief flashes of insight.  (On top of this, some of the inmates had more typical addictions.)  The book has its shortcomings, but it offers valuable insight into how harmful ideas and habits can be replaced with wholesome ideas and habits and how this was actually done on a mass scale in China.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Sol2494",
                            "body": "Is there a pdf available?\n\nEdit: https://archive.org/details/allyn-rickett-adele-rickett-prisoners-of-liberation-four-years-in-a-chinese-comm/page/n3/mode/1up",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "IncompetentFoliage",
                                    "body": "Yeah, that's the one I would have linked.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "turning_the_wheels",
                            "body": "I read this book a year ago and haven't seen too much discussion of it here besides recommendations when someone asks about how the prison system functioned in revolutionary China. What would you say are the shortcomings?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "IncompetentFoliage",
                                    "body": "The shortcomings mainly stem from the fact that it is written from the perspective of white, petty-bourgeois Americans. This means they interpret things through the lens of liberalism and are basically blind to settler colonialism. As they noted, the thought reform régime was not aimed at making them into communists, just at understanding that their espionage activities were criminal and wrong. So they do not come out of the book as communists, but as liberals, and it shows.\n\n\nOne of the worst lines in the book is where the warden says\n\n\n>There’s no conflict between the teachings of Christ and socialism.\n\n\nEven if the main thrust of the passage was fine, I don't think I need to expand here on how this statement is problematic and how easily it can be assimilated by revisionism.\n\n\nLet me quote another problematic passage:\n\n\n>Armed with their newly discovered theories and taking the course of the Chinese revolution as a universal example, they maintained vehemently in arguments with me that the United States must also some day go through a socialist revolution. Furthermore, since this change would undoubtedly be violently resisted by the present American rulers, whom they always referred to as Wall Street, the American people would be compelled to use force just as the Chinese had, in order to establish their new society.\n\n\n>I was willing to agree that when a society advanced to a certain stage public ownership of the means of production became necessary, and some form of socialism in the United States was inevitable. But I refused to admit that we would have to go through a period of bloody upheaval similar to that which the Chinese had experienced. After all, I argued, unlike China, we had a democratic tradition which provided a means for peaceful progress.\n\n\n>One day the discussion became heated. Ma especially, with his innate love for violence, insisted that my views were only the expression of reactionary bourgeois sentiments.\n\n\n>Finally, lips trembling with rage, I exploded. “We Americans are not going to have our country turned into a slaughter house like China was. We don’t need socialism that much.”\n\n\n>Ma’s eyes burned dangerously dark as he leaned forward to thrust his face close to mine, but before he could carry his attack further Jiang cut in, “Ma, I think you had better lay off Li Ko. You’re forgetting that he is an American. He had no right to interfere in China’s affairs and for that reason is in prison. But we Chinese also have no right to tell him how his country should be run.”\n\n\n>As Jiang’s soft, even tone had its calming effect on both Ma and myself he continued, “You're forgetting also that Marxism is not a dogma. We Chinese had to adapt its basic principles to fit our specific conditions and the Americans will have to do the same. I don’t know anything about the United States, but it is quite possible Li Ko is right.”\n\n\nWe can put Jiang's awful response partly down to ignorance of the US, which is understandable, but his non-interventionism is just bourgeois formalism.\n\n\nThen there's the epilogue.\n\n\n>With all that has transpired in the past year in terms of world events and our own experience it would be impossible for us not to have undergone some change and development in our ideas.\n\n\nThis was written in early 1957 and so is referring to Khrushchov's denunciation of Stalin.\n\n\n>We found to our relief that America’s democratic heritage had been rooted deeply enough to reject this development toward fascism and that McCarthy, as an individual, had been forced from the scene.\n\n\n...\n\n\n>To our minds, no matter how sincere in their purpose the authorities may be, in violating the principle of the right to know they are taking a dangerous step. It was the very fact that a small group was given the right to determine what people may or may not know which contnbuted to the abuses of Stalinism in the Soviet Union. One of the most encouraging recent developments in China has been a liberalization of this concept of a controlled press. The slogan “Let the various schools of thought contend” has led the newspapers and magazines to a much freer discussion of the pros and cons on a number of issues. In other words, the free and open discussion which had from the beginning existed on local issues is gradually being extended to the broad problems of national and international scope.\n\n\nThese are just a few examples, it's been a while since I read the book and I'm sure there are more. That said, I find more value in the book than harm and I personally enjoyed reading it.",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "IncompetentFoliage",
                                    "body": "By the way, since we're talking about this book, I've noticed that Chinese websites have been publishing some truly bizarre fabricated accounts of the Ricketts’ prison experience in recent years. If you've read the book, you may get a laugh out of this.\n\n\nhttps://www.sohu.com/a/461209430_121039293/?pvid=000115_3w_a\n\n\nIt basically claims that Rick's (nonexistent) sister Lisa mailed him some chocolate from America while he was in prison but the CIA used invisible tin foil to poison it. The Chinese prison staff took Rick to hospital and saved his life, allowing Dell to go visit him while he was recovering. Then for Christmas in 1953, Lisa was allowed to travel to China to visit Rick and Dell in prison. She would also meet them in Hong Kong when they were released together (in reality, they were not released at the same time). Somehow Rick and Dell forgot to mention all of this in their book.\n\n\nAnother interesting thing is that the book was translated and republished in China in 1958 under the title 两个美国间谍的自述.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "turning_the_wheels",
                                            "body": "Wow, that's incredibly bizarre. I'm not familiar with sites like this so I assume this is something like the equivalent of a tabloid website in the U$? Just trying to wrap my head around what appeal this has and what the purpose is.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Drevil335",
            "body": "I've recently been informally investigating dialectics, particularly as relates to the development of human social existence, which has given spawn to a question of potentially vast significance. Pre-capitalist modes of production, while having fundamental systematic tendencies, are generally defined by the simple appropriation of surplus (except in primitive communism, in which surplus labor doesn't exist, at least in its early stages); on the other hand, the capitalist mode of production has a clear emergence in its operation, by which a simple understanding of the production of surplus-value is clearly insufficient (if necessary) to understanding its motion and contradictions. This is clearly a result of the operation of the law of value (which is dominant in the capitalist mode of production, but not in prior or later modes of production), but what is the fundamental dialectical logic between the existence of exchange-value and the almost kaleidoscopic complexity (at least from my perspective, having read only ten chapters of *Capital* Volume 1) of the capitalist system? I wouldn't be surprised if  Marx wrote about this somewhere, so I'd definitely appreciate a link to that if it exists.\n\nAnother question I have has to relate to the persistence of semi-feudal productive relations in imperialist states. I especially have Japanese imperialism in mind here, which until the US occupation in the 40s still had a sizable rural landlord class, with the contradiction between it and the exploited peasantry becoming especially intense in the 1920s (the underdeveloped relations of production in Southern Italy in the same period is perhaps a similar phenomenon). Is this a result of the bourgeois revolution of the 1870s in Japan being incomplete (with the dissolution of the *daimyo* and *samurai* as a feudal class, but without majorly affecting the underlying rural mode of production), with it only being completed by the abolition of these semi-feudal relations under the auspices of US Imperialism in 1945? How did this affect the Japanese market's ability to absorb commodities, and from there, how did it affect the development of the Japanese imperialist system? I can't say that I've done much investigation on the development and tendencies of bourgeois revolution (I haven't even seriously investigated the initial French Revolution!), so this is certainly a subject that requires investigation. Reading, both on bourgeois revolution in general and Japanese historical development in particular, would certainly be appreciated.",
            "score": 10,
            "replies": [
                {
                    "author": "vomit_blues",
                    "body": "> Marx begins that work with an examination of the surface appearance of use value and exchange value in the material act of commodity exchange and posits the\nexistence of value (an immaterial but objective relation) behind the quantitative aspect of exchange value. This value is initially taken to be a reflection of the social\n(abstract) labour congealed in commodities (chapter 1). As a regulatory norm in the market place, value can exist, Marx shows, only when and where commodity exchange has become “a normal social act.” This normalization depends upon the existence of private property relations, juridical individuals and perfectly competitive markets (chapter 2). Such a market can only work with the rise of monetary forms (chapter 3) that facilitate and lubricate exchange relations in efficient ways while providing a convenient vehicle for storing value. Money thus enters the picture as a material representation of value. Value cannot exist without its representation. In chapters 4 through 6, Marx shows that it is only in a system where the aim and object of economic activity is commodity production that exchange becomes a necessary as well as a normal social act. It is the circulation of money as capital (chapter 5) that consolidates the conditions for the formation of capital’s distinctive value form as a regulatory norm. But the circulation of capital presupposes the prior existence of wage labour as a commodity that can be bought and sold in the market (chapter 6). How labour became such a commodity before the rise of capitalism is the subject of Part 8 of Capital, which deals with primitive or original accumulation.\n\nhttps://davidharvey.org/2018/03/marxs-refusal-of-the-labour-theory-of-value-by-david-harvey/\n\nThe way you should be looking at it is that Marx starts from appearance (exchange-value) then investigates its essence (value). Value has concrete effects on the world rather than being an accounting term, while exchange-value is only a reflection of those effects. The exposition of capital as a whole requires looking past appearance so we can ask other questions and dialectically move through the totality.\n\nFor example, how is value first invented, then created, and how does it circulate and self-valorize, becoming a real movement in society? Why does the value-form exist and how does the “freeing” of labor play into that? How was labor “freed” in the first place? How can value be invented by the labor process, the worker earn a wage which then re-encounters capital, while the value-product continues on in a value-chain until it’s final consumption of lack thereof; and, if the end result\nof the value-chain is devaluation or “de-use-valuing,” how does that then propagate backward and affect not only the production process but the entire circulatory apparatus built on top? Some portion of the wages earned continue circulating prior to the consumption of the value-product and its final value as its socially-necessary labor-time at the moment of reproduction, and in this they essentially form rudimentary debt instruments which (for many reasons, including a variety of turnovers and investments) can crystallize and cause massive crises. \n\nIn the figure of exchange-value, we have none of this, exchange-value is just that something acts in commensurate with another to a definite quantity; we lose the massive swirl which takes us through valorization, primitive accumulation, crisis theory, credit systems and fictitious capital, etc.\n\nApart from David Harvey’s monetaryism, he sums a lot of this up well enough. The article above was just the easiest thing I could cite, but Limits to Capital is better.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Drevil335",
                            "body": "So, can value simply be understood as an abstraction of accumulated human labor? If so, then it follows that capitalism is the qualitative level of development of human social existence in which the contradiction between the human capacity to consciously understand and mold reality, and the  practical shackling of human consciousness and action to the social conditions of its existence (both as a collective and manifested in individual humans, as an expression of the contradiction between the universal and particular), is most clearly realized.\n\nThe basis of the social existence of humanity is labor, and it is labor (the extent to which it can alter the world for human benefit, and the relations in which it is organized) that is the basis of all human consciousness; capitalism is the mode of production in which accumulated labor, manifested in the form of value, fully asserts itself autonomously as a social force: the contradiction, always latent through the entire existence of humanity (since the very acquiring, through labor, of its opposite aspect in this respect, consciousness, in the development of humanity as a species), is now here expressed in its fullest form. In short, the capitalist mode of production is the highest and most intense form of expression of the contradiction between labor and consciousness: the entire historical epoch is a crisis in the development of human social existence. Socialism, and its endpoint in Communism, is the resolution of this crisis, bringing the dissolution of the aspect of humanity's subjugation to necessity through enabling it to use its consciousness to *grasp* necessity, and to control it.\n\nFor all of human existence prior to now, the principal aspect was necessity, over consciousness: with socialism, the principal aspect shifts, with consciousness asserting itself over necessity, and coming to control it. This is the dialectical logic behind socialism being not only a qualitative break with capitalism, but with all of class society and prior human existence: it is the highest qualitative leap that humanity has ever experienced up to this point in its development, and will lead to the resolution of the principle contradiction of hitherto human existence.\n\nThis subject has subconsciously been bugging me for a while now, and now I can see it so clearly. Thank you for the spark.\n\nedit: I realize now that I'm actually just paraphrasing (or, rather, fully detailing the dialectical logic behind) Engels here, haha. Well, it's certainly a good thing that I'm able to autonomously reproduce one of Engels' most advanced ideas from *Socialism: Utopian and Scientific.*",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "vomit_blues",
                                    "body": "You’re falling into a trap. The end of capitalism doesn’t come about through a fundamental contradiction (which you incorrectly called a principal contradiction) between the transhistorical categories of labor and consciousness. Capitalism is a system that can never exceed its own limits without becoming radically transmogrified. It’s a limit to itself, immanently under its own rules. Surplus-labor isn’t transhistorical but is instead something shared between all societies with economic formations.\n\n> Labour is, in the first place, a process in which both man and Nature participate, and in which man of his own accord starts, regulates, and controls the material re-actions between himself and Nature. He opposes himself to Nature as one of her own forces, setting in motion arms and legs, head and hands, the natural forces of his body, in order to appropriate Nature’s productions in a form adapted to his own wants.\n\n...\n\n> The elementary factors of the labour-process are 1, the personal activity of man, i.e., work itself, 2, the subject of that work, and 3, its instruments.\n\n...\n\n> The labour-process, resolved as above into its simple elementary factors, is human action with a view to the production of use-values, appropriation of natural substances to human requirements; it is the necessary condition for effecting exchange of matter between man and Nature; it is the everlasting Nature-imposed condition of human existence, and therefore is independent of every social phase of that existence, or rather, is common to every such phase.\n\nhttps://www.marxists.org/archive/marx/works/1867-c1/ch07.htm\n\nLabor is directly subordinated to the material conditions upon which it acts in Marx’s formulation of the labor-process. This determination means that labor doesn’t exist as a category in the pure sense, but only contingently upon the social formation.\n\n> The basis of the social existence of humanity is labor, and it is labor (the extent to which it can alter the world for human benefit, and the relations in which it is organized) that is the basis of all human consciousness\n\nIt’s actually Marx himself who warned against the elevation of labor, isolating it from its subordination to nature and turning it into the uniquely human ability of creativity.\n\n> Labor is not the source of all wealth. Nature is just as much the source of use values (and it is surely of such that material wealth consists!) as labor, which itself is only the manifestation of a force of nature, human labor power. The above phrase is to be found in all children’s primers and is correct insofar as it is implied that labor is performed with the appurtenant subjects and instruments. But a socialist program cannot allow such bourgeois phrases to pass over in silence the conditions that lone give them meaning. And insofar as man from the beginning behaves toward nature, the primary source of all instruments and subjects of labor, as an owner, treats her as belonging to him, his labor becomes the source of use values, therefore also of wealth. **The bourgeois have very good grounds for falsely ascribing supernatural creative power to labor**\n\nhttps://www.marxists.org/archive/marx/works/1875/gotha/ch01.htm\n\n> capitalism is the mode of production in which accumulated labor, manifested in the form of value, fully asserts itself autonomously as a social force: the contradiction, always latent through the entire existence of humanity (since the very acquiring, through labor, of its opposite aspect in this respect, consciousness, in the development of humanity as a species), is now here expressed in its fullest form. In short, the capitalist mode of production is the highest and most intense form of expression of the contradiction between labor and consciousness: the entire historical epoch is a crisis in the development of human social existence.\n\nThe contradiction between the categories of labor and consciousness bring you to a vulgar humanism that imagines capitalism as a momentary interruption in the development of the species. This requires believing that there is a human essence that marches forward in the first place. Think more like Jameson: capitalism at one and the same time the greatest and worst thing to ever happen to humans. Communism isn’t the real movement to liberate the species but instead a violent rupture that, like the Messiah, saves exactly one class: the proletariat. \n\nHave you read Reading Capital?\n\nhttps://www.marxists.org/reference/archive/althusser/1968/reading-capital/ch02.htm\n\nI’m happy that you’re engaging and thinking through these things, but now may be time for an intervention to come to an understanding of what it means to be anti-humanist in Marxism and how that affects your understanding of the development of capital.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Drevil335",
                                            "body": "I appreciate the criticism, and I do admit that there's a petty-bourgeois impulse in an outsized attachment to \"human progress\" as opposed to the material liberation of the proletariat. At the same time, though, I probably wasn't clear enough in my initial formulation: I simply left some things, which I didn't think needed to be explicitly articulated, for granted.\n\nFor instance: obviously I don't believe that capitalism will \"transcend its limits\" due to a fundamental contradiction of human existence, without proletarian struggle and revolution. That would be absolutely monstrous revisionism, and I assumed that (since we're in a serious Marxist space), I didn't need to explicitly re-affirm one of the most basic theses of Marxism. Nor do I think that capitalism is a \"momentary interruption in the development of the species\". Perhaps I didn't make this clear enough, but I posited that the capitalist mode of production is that stage in the development of human social existence in which the fundamental antagonism that I suggested *is most fully realized*, not when it first comes to exist.\n\nWhen I write that capitalism is \"a crisis\", I didn't mean it in the sense that it's an interruption of prior development (which it is not; capitalism is of course a product of the past development of human social existence, particularly of the contradictions of the feudal mode of production); rather, I meant that, like how an overproduction crisis is a \"crisis\" because it's the most intense manifestation of the fundamental capitalist contradiction between social labor and private appropriation, capitalism is a \"crisis\" because it's the maximal intensification of the contradiction between the subjection of the motion of human social existence to the implications of its productive capacity, and the human (this is not negating the centrality of class contradiction within capitalism, and class society as a whole, or in any way \"humanistic\"; it just refers to the human mind's *capability* of grasping necessity, even if class necessity itself intervenes on the mind and prevents it from doing so) capacity to understand the social conditions of existence, and to change them.\n\nRegarding \"human essence\", I obviously don't uphold that metaphysical, bourgeois conception. Nonetheless, the social development of *Homo Sapiens* as a species, and the contradictions which define that development, can be scientifically understood. Likewise, while of course the socialist revolution is a proletarian revolution, and in the immediate to mid-term serves to liberate only the proletariat and other revolutionary classes, it's end state is the negation of class contradictions as a whole; through making all of humanity proletarian, the proletariat will cease to exist as a meaningful label as opposed to simply \"humanity\". How, then, is the proletarian revolution *not* a movement for the liberation of the spcies as a whole, even if said liberation can occur only in the long-term? Given the immediate tasks of the present, my fixation on this topic is very possibly a petty-bourgeois tendency, but how could it possibly be undialectical to investigate the contradictions which drive the development of human social existence in general (of which class society is only a period of)?\n\nAs regards your point on labor (while I did appreciate being reminded of the potential bourgeois mystification of labor), I think that my wording was unclear, which effected your interpretation of what I was trying to say (and this is something that deserves criticism: clarity is essential). What I meant was the human *capacity* to perform labor introduces the system of human social existence as a qualitatively distinct (if inevitably dialectically linked) process from the biosphere, and *also* spurs the development the enhanced human cognition (deriving from the need to master the labor-process) in deriving knowledge from practice. Upon reconsideration, I was wrong to consider the capacity to labor as being decisive in binding humanity to necessity (since non-laboring animals, after all, have their actions and development also determined by the contradictions of their environment), but this capacity to labor *does* introduce the possibility of a qualitative shift in this relation to necessity.\n\nI hope I have made myself clearer. I would definitely appreciate further criticism, especially if what I've just written doesn't actually break from the errors that you saw in the first post.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "vomit_blues",
                                                    "body": "Thanks for clearing so many things up.\n\n> Likewise, while of course the socialist revolution is a proletarian revolution, and in the immediate to mid-term serves to liberate only the proletariat and other revolutionary classes, it’s end state is the negation of class contradictions as a whole; through making all of humanity proletarian, the proletariat will cease to exist as a meaningful label as opposed to simply “humanity”. How, then, is the proletarian revolution not a movement for the liberation of the spcies as a whole, even if said liberation can occur only in the long-term?\n\nThe *species* is a difficult category to work with exactly because it leads to leaps like these. While it’s true that it’s correct to consider humans a species insofar as they are homo sapiens, homo sapiens as a category has nothing to do with class society and revolution, and the species isn’t the groundwork from which we make our analysis even of people after the dissolution of class society.\n\nHumans aren’t “proletarian” at least not in the pure sense, since we all contain internal contradictions and can shift between class perspectives and transform into our opposites. The proletarian class exists in the abstract and revolutionary potential is immanent from the proletarian worldview. To make everyone proletarian can only mean to abolish all non-proletarian classes, at which point classes cease to exist, but as opposed to this becoming two uniting into one, contradiction remains.\n\n> It is obviously incorrect to maintain as some people do, that the contradiction between idealism and materialism can be eliminated in a socialist or communist society. As long as contradictions exist between the subjective and the objective between the advanced and the backward and between the productive forces and the conditions of production, the contradiction between materialism and idealism will continue in a socialist or communist society and will manifest itself in various forms. Since man lives in society he reflects in different circumstances and to varying degrees the contradictions existing in each form of society. Therefore not everybody will be perfect, even when a communist society is established. By then there will still be contradictions among the people, and there will still be good people and bad people, people whose thinking is relatively correct and others whose thinking is relatively incorrect. Hence there will still be struggle between people though its nature and form will be different from those in class societies. Viewed in this light the existence of contradictions between the individual and the collective in a socialist society is nothing strange...\n\nhttps://www.marxists.org/reference/archive/mao/selected-works/volume-7/mswv7_466.htm\n\nSo even at the highest stage of communist development, people are still categorized in society not by anthropological terms but by whatever structural forces interpellate them. “Humanity” and “human” aren’t helpful in the overwhelming majority of Marxist analyses.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CoconutCrab115",
            "body": "Does anyone know any material on the Maoist faction of the NLF in South Yemen? Specifically on Salim Rubaya ‘Ali ",
            "score": 9,
            "replies": []
        },
        {
            "author": "None",
            "body": "Is there anything of import to take away from the German elections?",
            "score": 9,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -6,
                    "replies": [
                        {
                            "author": "turning_the_wheels",
                            "body": "How did a social fascist like yourself end up here?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "turning_the_wheels",
                                            "body": ">FDR was arguably the greatest president we’ve ever had. It’s truly a shame that we have now decided to blame the poor for problems created by the rich\n\n\n\n>I don’t disagree. But the Democrats do still have people fighting for democratic values. Bernie is one of them.\n\n\n\n>You’re still calling Biden “Genocide Joe” when Trump is legitimately calling for ethnic cleansing in Gaza? Biden was merely continuing a long policy of funding Israel. It isn’t by any means okay, but I’d so much rather have Biden or Harris right now.\n\nWhy wouldn't I think you're a social fascist? What's more interesting to me is how you thought your comment was welcome here and how you even came across this thread in the first place considering this is a subreddit for Marxists.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "Autrevml1936",
                                                            "body": "> But that doesn’t mean I don’t think reform can do some good to address things in the immediate short term.\n\nReform *for who*? Your entire ideology that you see Reforms through is from Settlerism and the position of the Petite Bourgeoisie and Labor Aristocracy **not** the international Proletariat. No Marxist is interested in reforming capitalism for Fascist Settlers, Communism is against our Class interests.\n\n> As for Bernie, he’s a social democrat, but at the very least he is doing something to stand up to the fascist coup taking place in the American government.\n\nHe's not doing anything against Fascism(in the diluted Amerikkkan use), Fascism has been here since 1776 against First Nations, Black People, and Chicane. The Petite Bourgeoisie and Labor Aristocracy is the Mass Base of Fascism and not revolution.\n\n> And I believe he does genuinely care about improving the living conditions for the working class.\n\n\"Working Class\" or in other words White people.\n\n> Nuance is important and we need to stop this culture of tribalism on the left\n\nBy \"Tribalism\" you mean Anti-revisionism, Scientific rigour, refusal to submit Marxism to Fascism.\n\nThe content of your Comments is still fascist and not at all Marxist. Read rule 7 or leave, we have no interest in \"platforming\"(to use the liberal phrase, as I forget better synonyms) Chauvinism.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "QuestionPonderer9000",
                                                                            "body": "Did you even read his comment? His whole point is that you shouldn't even start with Americans, because when you say \"the American working class\" you're referring to white labor aristocrats. Your goal is to find the actual proletariat here and not waste your time on people who have a material interest in capitalism. Would you go knock on Elon Musk's door and try to pitch him communism? Because if not, why would you pitch the same thing to other people who benefit from imperialism, even if it's less? I mean if you can actually find a correct revolutionary line that describes how white labor aristocrats as a class can be useful to revolution then go for it, you'd be the first one to do it though.\n\nreadsettlers.org\n\nAlso, are social democrats only social democrats because they don't understand theory? Or is there another reason they believe what they do (hint: their class)?",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": -4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "QuestionPonderer9000",
                                                                                            "body": ">How is the American working class aristocratic? Most people are wage earners in the United States. White people still suffer from capitalism too, although they do enjoy much more privilege than other groups, especially cis het white men.\n\nWages that are massively inflated by imperialism, which allow Americans to live relatively comfortably and eventually earn even more superprofits (by joining the petite bourgeoisie, buying a computer and becoming a content creator, investing in stock, etc.). This qualitatively makes them a different class because they earn more than what they produce and are not the revolutionary class who has nothing to lose but their chains. Like I'm typing this right now on a child labor machine made by the actual proletariat and I'm an average American, how could you possibly compare the two groups?\n\n>White people aren’t a “class” either. We can’t even agree historically or contemporarily who is considered white.\n\n  \nCorrect. I'm using that as shorthand for the labor aristocracy and also because when you say it that way it makes people realize how silly they sound, like yeah dude, let's go tell white Americans that they should go leave their suburbs and go join the people's war. Sure, some of them probably will (this subreddit is evidence of that, but of course, internet posting is way lower stakes than taking up arms so let's see how it actually plays out) but never as a full class. \n\nAnd yes, whiteness is expanded or limited, but that is not because we all collectively disagree on what whiteness is, but because the definition of whiteness changes depending on the needs of capitalism at the time (e.g. immigrants from Europe being integrated into whiteness).\n\n>For the SocDems, it depends. A lot of Americans, white and non-white, are social democrats because they believe in leftist policy but communism has been so demonized their whole lives that they don’t read theory. Others, like the FDR types, want to preserve the class structure.\n\nWrong, and SocDem/DemSoc policy is social fascism, not communist policy, so of course they support it. The actual answer is that these people are the aforementioned labor aristocracy/petite bourgeoisie (same thing basically, IMO there isn't really a meaningful line separating them that much, especially in consciousness, but maybe another user can correct me on that) and their inflated wages and settler position leads to a change in consciousness that manifests as social fascist policy (e.g. let's use the funds gotten from the Third World for free healthcare and do nothing else). \n\nAgain, the whole point of Marxism is that material existence as a class determines its social consciousness, a class' politics stems from where they stand in the material world. The people at the top (as a class, again, individuals might differ) have no reason to revolt, they only wish to reform the system to meet their needs, and you're confusing this for a lack of political education, rather than admitting that they perfectly understand where they stand in the world and what they want, even if they can't articulate consciously why.",
                                                                                            "score": 8,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "None",
                                                                                            "body": "> How is the American working class aristocratic?\n\nThis is the level of confident misunderstanding that you have to /begin/ at with white American 'marxists'. You do not know what 'labor aristocracy' is referencing and make an absurd assumption instead of simply Googling the term. It's such a waste of time.\n\n>White people still suffer from capitalism too\n\nNo, they actually benefit and have benefitted immensely. You can take the criticism and work backwards or you can keep replying with your double downs and continue to sound like the white chauvinist that you are.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "[removed]",
                                                                                                    "score": -4,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "QuestionPonderer9000",
                                                                                                            "body": "Do they even have a choice in what happens? I mean if 80% of the world rises up what can they even do about it? I mean, you wouldn't ask \"what do we do with the bourgeoisie\" right? They either assimilate or try to fight back and fail.",
                                                                                                            "score": 6,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PlayfulWeekend1394",
            "body": "I've been feeling rather pessimistic lately (even if I know from an objective standpoint that the victory of communism is inevitable) so if anyone has some good news they could share with me that would be great.",
            "score": 7,
            "replies": [
                {
                    "author": "doonkerr",
                    "body": "I don’t think pessimism is an inherently bad thing as long as it is able to compel you to communist action. I believe it was u/smokeuptheweed9 who has touched on this before, but I think that remembering Gramsci’s famous saying is important here.\n\n>You must realize that I am far from feeling beaten…it seems to me that… a man ought to be deeply convinced that the source of his own moral force is in himself — his very energy and will, the iron coherence of ends and means — that he never falls into those vulgar, banal moods, pessimism and optimism. My own state of mind synthesises these two feelings and transcends them: my mind is pessimistic, but my will is optimistic. Whatever the situation, I imagine the worst that could happen in order to summon up all my reserves and will power to overcome every obstacle.\n\nAs Marxists, we need to analyze reality soberly. If this means that the situation is a pessimistic one, we are confronted with the question of whether we give up or continue forward. This fundamental question has confronted every communist throughout history, and great communists are the ones who continue to struggle and move forward even in the most dire of circumstances. What comes to mind for me here is Lenin after the defeat of the 1905 revolution and during WW1 or Mao after the Shanghai Massacre. It’s not so simple to think ourselves out of being pessimistic. Contradictions in thought are the reflection of objective contradictions in reality, so we are brought to the task of changing our real conditions of existence to solve this contradiction in the mind. I can’t provide you a blueprint to accomplish this. It ultimately falls on you to confront whatever reality has presented.\n\nPerhaps this isn’t the answer you wanted to hear, as you asked for “good news” but for a Marxist, all news is “good news” in that we can draw lessons and learn from it.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "miquiliztlii",
                            "body": "I've been feeling pessimistic (bordering nihilistic some days) but this answer did help me, thank you",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "urbaseddad",
            "body": "What's up with the shitty cartoons and \"affirmations\" in the sidebar of r/communism101? I see McMillan was involved with the RCP (before it went full revisionist? Not sure) and I'm sure the cartoons have been there for a very long time so perhaps there is some history and reasoning behind them being there I'm not aware of. It's just as, as I said, I don't assess them as particularly good either in terms of their very existence or their content.\n\n\nu/smokeuptheweed9 tagging since you're the oldest active mod ",
            "score": 12,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "Before my time I'm afraid",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "Desperate_SkullMan",
            "body": "I live in north texas and dont really believe in the communist party usa. Am i wrong? Anyone know of another org i might join? ",
            "score": 3,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "Probably. Go to a mass protest about Palestine, if those are still happening, and see what's being offered. Use your own judgement to eliminate groups that are there to shill for the Democrats (or Republicans), those without any purpose except to recruit young people as a source of funds, those with no interest in what's actually going on around them and are just selling newspapers, those pushing the right-most line on others, and those that seem off at an instinctual level.\n\nThen use the power of the internet to eliminate from that the parties that seemed ok but were actually just better salespeople, those that have no vision except protesting, those with a fundamentally revisionist concept of Marxism, those with a history of internal sexual assault (though those should be eliminated in round one to a trained eye), and anything else you can find. I'm sure something will be left and, if not, it's better than joining a reactionary organization like the CPUSA. Though it may be that the org that's left is not a strictly communist organization but a single-issue one, in which case you'll have to build from the ground up. It shouldn't be too hard though, it's not like Palestinians solidarity activists haven't heard of Marxism before, they've just been disappointed by revisionists too many times to bother. \n\nE: this is all useless if you are not yourself able to distinguish between revisionism and revolutionary Marxism. Luckily you don't have to be an expert on philosophy, these differences play out in a very visible way on the ground and anyone with a brain can tell the CPUSA is fundamentally revisionist as you have (including its members - their problem is not a lack of intelligence). Still, you will save years of your life in the future if today you study Marxism now. Looking at your post history you're an aimless ball of rage which is necessary but not sufficient and easily rolled down the wrong hill. Even the best communist work will take a long time, you need to be able to distinguish political lines beyond merely rejecting electoral spectacle. I'm not sure what inspired you to post here for the first time but you should engage beyond treating this as the yelp of communist parties. We can't do this work for you and anyone who recommends a specific party is as trustworthy as anyone else on an internet review site.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Particular-Hunter586",
                            "body": ">groups that are there to shill for the Democrats (or Republicans)\n\nDo the latter exist?? I'm assuming you mean ACP-types, are there any actual wings of the Republicans that have tried to glom onto the pro-Palestine movement? I'm half grateful my city is simultaneously too blue and has too much of a history of actual semiradicalism for me to have encountered such groups, and half intrigued by how they'd present themselves rhetorically.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "smokeuptheweed9",
                                    "body": "It hasn't happened yet to my knowledge, more of an immanent possibility I'm accounting for over the next 4 years. Though I will say few expected Wagenknecht's movement, which is the most coherent attempt to generate a \"left\" wing of neo-fascism, to sputter and die so easily. So it's possible that it all comes to nothing and the future is mere irrelevance rather than a new coalition for the labor aristocracy. I guess the Republicans already have people like Bannon and Hegseth to act as the \"sheepdogs\" of the fascist right, they don't need the hand-me-downs of the Democrats' sheepdogs from a losing campaign.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Cardiologist-1936",
            "body": "https://old.reddit.com/r/communism/s/OZr6EdUjJO\n\nIt's so weird seeing so many threads made by and filled with people who do not participate in this subreddit, nor study Marxism or learn about the political line of this subreddit, yet claim that they are responding to some trend they see here while everyone in the comments acts the same. It's like a group going to a restaurant and pretending to be the customers, servers and owners for like an hour and then leave, much to the confusion of everyone who actually goes there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -3,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "https://www.reddit.com/r/leftist/comments/1irti7g/hitler_particles_radiating_from_the_communism/\n\nI assume everyone who posts in r/communism at this point buys into the moderation philosophy here* (since few of our posts get 100+ comments of complaints in an hour). So it's nice to be reminded of what the rest of reddit is like sometimes. Something to reflect on before it vanishes forever into the soup of common sense about how this subreddit is run by feds, is fascist, bans all dissent, etc.\n\n*I'll copy paste what I said to one of the people who immediately came here to complain and then, when forced to admit they had believed a lie, went into the classic abuse tactic of saying \"well the way you act made the lie believable, therefore it's really your fault\"\n\n>I'm not trying to punish you. This is a chance for you to reflect on the fundamental flaws in your concept of the internet (and really speech in general). You did not make that concept up, you inherited it from libertarians at the origin of the medium. But the basic idea that anyone should be free to post anything and the role of moderation is to be reactive and minimally invasive, and to do otherwise is to create a \"circle jerk\" or be \"ban happy\" is fundamentally flawed. As I pointed out already, words have consequences, and the result your ideas is harassment, manipulation by horrible people, repetition of lies as truth, and low quality discussion. This is common sense when discussing the Fox News tactic of \"just asking questions\" and the amount of energy and intelligence it takes to counter the most vulgar lies that, once asked, are already spread, but when it comes to your own lack of effort and credulity suddenly all speech must be tolerated.\n\n>What's fascinating is that these ideas, which simply substitute the word \"internet\" for \"free market,\" are so hegemonic that they are even more powerful among so called \"socialists.\" Fascists at least cynically understand how to manipulate the libertarian foundations of the internet for their own narrow interests.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "IncompetentFoliage",
                            "body": "Looks like they deleted all eight of their posts about this. Sorry you have to deal with people like that.\n\n\n>I also want to see if a single person who believed the OP apologizes to me or does any kind of self-criticism about the years of lies they uncritically parroted because it was harmless.\n\n\nThis is the closest thing I see to an apology. \n\n\nhttps://www.reddit.com/r/leftist/comments/1irti7g/comment/mdby2wc/\n\n\nOut of curiosity, do you ever unban users who apologize and self-criticize? I'm sure that is exceedingly rare but we did see something of the sort with u/Bademjoon just the other day.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "smokeuptheweed9",
                                    "body": "It is rare because they almost never have a post history in the first place and are mostly offended at the thought of being banned like it's a scarlet letter. It's also suspicious when someone wants to be immediately unbanned, if their penance can't even last a few days I doubt they have anything to contribute. And I am a bit biased against redditors. If you refuse to make a new account because you'll lose your karma, like, come on... It may be the case that the admins are more severe in banning double accounts recently, I haven't seen any evidence of it but if so I may have to be more forgiving. Considering the conversations about being banned are usually longer than their entire post history on this account made of random words and numbers, making a new one is the least you can do (though to any admins reading, I am not advocating making double accounts, simply acknowledging the reality that people who harass us do so because of your indifference so I can at least incorporate the inconvenience for my own purposes)",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "IncompetentFoliage",
                                            "body": "Thanks, that makes sense (although u/DashtheRed raises a good counterpoint about not creating a new account).\n\n\n>If you refuse to make a new account because you'll lose your karma\n\n\nDo people actually care about karma?  Why?  Does it have a function I am unaware of?  Votes don't mean anything because you don't know who's voting, any random reactionary can vote on your comments so it tells you nothing (actually if a comment gets a ton of upvotes I assume most of them were not from serious communists).  Personally, I use voting as a way of telling myself \"I have read this\" in case I go back to read old comments later.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Autrevml1936",
                                                    "body": "> Do people actually care about karma? Why? Does it have a function I am unaware of?\n\n\nMost petite bourgeoisie do care about karma(and similar voting systems), and for an interesting example you can look at what happened on a different website a few years ago. YouTube a few years ago decided to get rid of the dislike button counter and there was immense outrage by PB against this change.",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "IncompetentFoliage",
                                                            "body": "Good point, I guess it's an extension of the same individualist logic that motivates questions like that post today about \"accelerationism.\"",
                                                            "score": 11,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Chaingunfighter",
                                                    "body": "> Does it have a function I am unaware of? \n\nSome subreddits restrict your ability to make posts or comments based on a lack of account karma, as a spam prevention measure (much the same as restricting new accounts.) The bar is pretty low though - if you can’t deal with not being able to post in some places on this site for two weeks, are you really serious enough that you’re needed here?",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DashtheRed",
                                    "body": "> Out of curiosity, do you ever unban users who apologize and self-criticize?\n\n*raises hand*\n\nThough if I had known that:\n\n> If you refuse to make a new account because you'll lose your karma, like, come on...\n\nI would have made a new account ages ago when I was first banned instead of living in the trash and refuse of debatecommunism and the nine circles of the \"socialism\"-hells for a year.  Instead I thought the lesson was the exact opposite.  Having the integrity to be held accountable for the things that you said, the conviction to refuse to put on a different hat/mask and pretend to be someone new, and to actually put in the time and effort and thought to be worthy of redemption with something to back it up.  I never gave a damn about karma.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Labor-Aristocrat",
                                            "body": "You still seem to be dumpster diving even after being let back in, why?",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "DashtheRed",
                                                    "body": "A few reasons.  On some occasions, you actually do find an interesting topic or question or someone seeking an insight and for whatever reason failed to find their way here to get an actual answer, so it's an opportunity to intervene against the hegemonic responses of those subreddits.  And it's also a pretty good feeling when in a thread competing against a hundred identical liberal responses with dozens of upvotes, and your one post is there sitting at 2 upvotes and marked \"controversial\" when the OP comes back and says, \"you know what I think you are right.\"  Because actual revolutionary thinking can strike that resonance chord that awakens something in the people really looking for answers to explain reality.  I think I'm also masochistic, but it can be fun to try to single handedly take on the world in a reddit tavern brawl, like you're Wolverine and you just picked a fight with everyone in some Alaskan pub.  Some of my favourite threads I've ever participated in are the ones where I begin at a negative 100 upvote deficit having pissed off everyone, but as the thread drags on, and counter-points are exposed and overcome, by a half dozen or so posts later, the five or ten people still participating at length have switched sides and my point now stands unchallenged, like *Twelve Angry Men.*   Plus when you've spent time and effort there it's still fun to go back occasionally and participate, and even keep up with the couple of good users that you like there who also sometimes make brave, worthwhile, or interesting posts that dont succumb to reddit liberalism.  Also (though this may be veering too close to liberalism myself here), those subreddits are also the more likely landing zones for actual beginners, and simply presenting them with something more challenging and daring and radical than the safe and comforting posts they are being spoonfed might help to lead them here where they might end up with better ideas instead watching their communist-sapling left to rot among the revisionism with no pathway to escape.  But most of all, these subreddits sometimes do move too slowly (which isn't a bad thing objectively, only inconvenient subjectively, especially when one find themselves with free time at work and little else to do) and sometimes you really want to participate and share some insight you just learned and the only place that's open late at 3am with active threads is McSocialism, despite it's nutritional deficiency.",
                                                    "score": 19,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "IncompetentFoliage",
                                                    "body": "Yeah, u/DashtheRed, I've been wondering the same thing.  I appreciate the effort you put into your comments (they are pretty much the only thing I go to other subreddits for) but are they not out of place?  Are you actively trying to disrupt the mediocre discourse the structure of those subreddits produces (like a physicist going to flat Earth YouTube videos to post serious scientific critiques in the comments section) or is it less deliberate or just for your own purposes?",
                                                    "score": 17,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cyberwitchtechnobtch",
                            "body": "Jeez, what a shitshow. There's ridiculous stuff people say about this subreddit all the time but I've never seen it presented in such a gross spectacle.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Labor-Aristocrat",
                                    "body": "https://www.reddit.com/mdcmary?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2\n\nMy personal favorite part of that thread is this person admitting that they don't actually care about the accusation being false.\n\nEdit: Link broke, here's what they said:\n\n> Reading that video and how I was dealt with in 101, I’m still on OP’s side even if he fabricated some stuff. I don’t understand why mods have to be so aggressive instead of simply saying which rule and how it was broken.\n\n> You would think that if they supported the movement there would be a penalty box system so folks could figure out how to contribute more effectively instead of feeling rejected by the philosophy they are interested in.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "> penalty box system\n\nDo they think that getting banned by a subreddit means you are summarily executed in real life",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "Chaingunfighter",
                                                    "body": "Considering that liberals incorrectly believe that is what happened to every single person who was “purged” from real communist parties, it would not surprise me if the underlying fear is the same.",
                                                    "score": 17,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "supercooper25",
                                    "body": "The only unique thing about this particular incident is just how many people were fooled by an obvious lie in such a short amount of time. Doctoring screenshots of mod conversations to accuse us of bigotry has happened before, but most of the people who tried it were so incompetent they couldn’t even convince the average Redditor.\n\nOne such example: https://www.reddit.com/r/GenZedong/s/JxPS6ZDZB1",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AltruisticTreat8675",
                            "body": "This is super depressing. I'm trying to get everyone to focus on Southeast Asia (Thailand in particular), the Asian financial crisis and how it is related to the \"rise\" of China. Saddened to hear that another typical reddit drama affected this sub greatly.\n\n**EDIT**: I've been a victim of obviously doctored screenshots years before by some loser white sexpat before, but unlike you people I had no something to counter with because it's just a private message, not a modmail conversation. I ended up getting him suspended from reddit by talking to admins directly however.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "whentheseagullscry",
                                    "body": ">  the Asian financial crisis and how it is related to the \"rise\" of China.\n\nI'm curious about this. My understanding is China already \"rose\" before the crisis, and that's why it was able to weather the crisis compared to other countries.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "smokeuptheweed9",
                                            "body": "It's notable that the handover of Hong Kong occured at basically the same time as the Asian financial crisis. This is why the Chinese government kept both the Yuan and HK dollar stable against the US dollar whereas every other currency was devalued.\n\nTo your point, china could do this because the fundamentals were already sound for export growth (meaning it was still vastly underdeveloped compared to potential profits) whereas there was room for \"creative destruction\" in the rest of Asia, partially because Japanese finance was itself a bubble compared to its economic fundamentals (level of monopoly capitalist development). China was both more independent of Japanese finance and, through historical luck, was able to drain the forces of production from Hong Kong. Not to cry for the Hong Kongers, they got to become financial parasites and export manufacturing had already been in terminal decline before this. But the handover of Hong Kong is nevertheless significant and rare in history. Though it's not like the Chinese bourgeoisie took the forces of production from Hong Kong and brought them to the mainland as the USSR did with Easter Germany, all they did was continue the pattern of outsourcing to Guangdong that was already happening and make sure it continued. It would be like if China conquered the US and the only thing they did was restore Obama as a puppet president who had to restore free trade agreements and encourage Apple and ASML to stay in China. That's how narrow their vision is \n\nI bring it up nevertheless because the crisis greatly accelerated the pattern of Easter Asian neoliberalism and centralized the whole process in mainland China. That process is coming to an end, it is China that needs creative destruction and global manufacturing is again looking for a regional solution and China is looking to the past for alternatives, in this case to use the legal status of Taiwan to repeat the Hong Kong experience.\n\nAs for Thailand, which is u/AltruisticTreat8675's interest, I'll point out that simple gdp-per-capita data is not that useful. Looking at it you would think China has easily surpassed Thailand. But if you look more closely at the geographical pattern of manufacturing they are pretty similar. For example Rayong, which is where cars are manufactured for global companies, has a similar (or even slightly higher) gdp per capita to Beijing and Shanghai. The difference is the inability of Thailand to generalize the technology transfer in Rayong to a national system of proletarianization and interlinked export manufacturing. As the result BYD, which basically didn't exist 5 years ago, opened its first overseas plant in Rayong\n\nhttps://www.nationthailand.com/business/automobile/40039381\n\nWhereas Thailand has no equivalent IP of its own. However one should not overestimate China's accomplishments. The actual market for EVs without heavy state subsidies in the domestic Chinese market is at best highly speculative, this is not a repeat of Toyota or Hyundai (the latter of which was already a shadow of the former given Toyota became the high end of vehicles whereas Hyundai became the middle to low tier).\n\nhttps://www.lowyinstitute.org/the-interpreter/asean-countries-confront-chinese-export-glut\n\nAnd I mean speculative in the Asian financial crisis sense\n\n>The Kiel Institute recently found that direct and indirect (e.g., cheap land, credit and power) industrial subsidies in China are up to nine times greater than in the United States relative to overall GDP.\n\nThis is debt that will turn bad very quickly if it is not realized overseas, which I think there is little chance of happening given the fundamental basis is nonsense (that EVs will somehow affect global warming and are therefore objectively necessary, in reality capitalism itself is the cause of global warming and EVs are just a gimmick)\n\nEven if successful, Thailand is close to China's technology level so it competing in the same market would be a matter of years, not decades. Already Vietnam is competing in the EV space and is only a few years behind despite being significantly more undeveloped overall. \n\nAnd there is a more fundamental problem as that article points out\n\n>The gamut of affected sectors is much broader than higher-value-added goods du jour such as electric vehicles (EVs). In 2023, China’s President Xi Jinping made it clear that he wanted a “modern industrial system” to extend to traditional labour-intensive sectors such as apparel, toys and furniture. Instead of migrating offshore to lower-cost destinations, the risk is that these operations will remain in China in an increasingly automated form.\n\nThis is basically delusional, automation has already reached the level that is possible given the level of current technology, if labor from Bangladesh could be replaced with robots it would not have been outsourced in the first place. The CCP understands that to maintain those GDP per capita numbers to exceed Thailand (and prevent the economy from becoming a few export zones in a sea of rural stagnation) a few higher value added heavy industries are not going to cut it or replace the property bubble in restoring the rate of profit. Trying to keep the entire world economy, from cutting edge technology to simple light manufactures, in a single country is impossible even if there was an extra population of 200 million willing to migrate from the countryside to work in sweatshops (which there isn't). That's not to predict the collapse of China, there is clearly still room for growth and the Chinese market is so large that it feels the effects of the falling rate of profit much more slowly (though there is no longer a population able to repeat the initial stage of primitive accumulation that came with the weaponization of the Hukuo system by global capital, the majority of the population is still very poor). \n\nRather, the centralization of global manufacturing that followed the Asian financial crisis in China and brought to an end the Japanese ASEAN alternative is reaching the limit (though Japan remains humbled). This may come with the first crisis of Chinese capitalism, the profit reckoning that it avoided in 1997. Because we are politically hostile to China, economists constantly predict its collapse so there is pleasure in debunking these baseless ideas. But those of us who are more familiar with the fundamentals understand that predictions of immanent collapse are just as useless as predictions of forever growth, as was what was regularly claimed about Asia before 1997 and the \"developmental state\" as the perfect fusion of capitalism and state regulation (and all the nonsense about Japanese flying geese). Just as it was clear by 1993 that there had been a fundamental shift in South Korea's economy to everyone except economists, the fundamental shift in China's economy is again clear to everyone but them, who like Trotskyists will take credit for its crisis that they already predicted should have happened decades ago.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "AltruisticTreat8675",
                                                    "body": "> For example Rayong, which is where cars are manufactured for global companies, has a similar (or even slightly higher) gdp per capita to Beijing and Shanghai\n\nI've noticed this disparity between Rayong (including the \"Eastern Seaboard\" and industrial zones surrounding Bangkok) and the rest of the country, even before I became a Marxist. This is true for South Korea (the regional discrimination against Isaan paralleled SK's discrimination of South Jeolla, and both experienced communist rebellions) and this is why the South Korean experience must be interrogated whether or not South Korea is a core country or it's just the first third-world manufacturing hub, despite all its relative wealth. And why Thailand couldn't repeat the SK experience. \n\n> Thailand is close to China's technology level\n\nRight, this is true and the people who like to gloss over China's underdevelopment while they're bashing Thailand are not even Dengists, they are internet Chinese nationalists who intentionally cherry picked few examples like coastal cities and few high-value heavy industries to make up for its actual rural underdevelopment (Thailand is worse though since it involved regional and ethnic discriminations, not unlike when the capitalist roaders de-collectivized Chinese agriculture but the end results are the same).",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AltruisticTreat8675",
                                            "body": "It's my understanding that this particular model of outsourcing didn't really took off in China until the Asian financial crisis, before that it was basically the poorer version of Hungary or Yugoslavia where \"market socialism\" reigned supreme. Obviously it didn't survive 1989 and the Chinese bourgeoisie's response after the Tiananmen Square incident is to privatize the remaining state-owned enterprises even more, destroying \"TVEs\" in countryside to open the floodgate of labor and the deindustrialization of the Northeast. My interest is about Thailand specifically and why it was a failure, but the garbage theories bourgeois academia has spouted since 1997 doesn't inspire me any confidence.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MLMinpractice1917",
                            "body": "a few years ago I used to be a big poster on r/thedeprogram (I believe thats the name, havent been there in some time). I even once had a post I made featured on the podcast. yippee. I of course was banned from this subreddit and the other communism subreddit and would spend much time talking to my \"comrades\" about how evil the mods here are, but now I greatly appreciate the moderation here. and I appreciate people like me in the past not being allowed a voice to speak. because if being allowed to speak, I would have just attempted to justify my existence as a parasite of the proletariat. and I would have used any manner of vile revisionism to do. so thank you.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "smokeuptheweed9",
                                    "body": "Well I'm not sure I would personalize class that much, given all the posts I made a couple of days ago about the appeal of \"content\" I know it's not easy to break out of the cycle of instant gratification and \"viral\" collective belonging. The appeal of this subreddit is not immediately obvious, it's only when you've listened to hundreds of episodes of podcasts and read the whole list of recommendations and posted countless times about \"chad Xi keeps winning,\" only to realize you haven't gotten any closer to understanding history or the world around you (and you just get tired of the demands of virality which is measured in volume, not quality) that the accumulated effort here pays off. I understand we're not competing with thedeprogram for the same audience and if someone posts here, they are already inclined towards taking Marxism seriously because of objective circumstances in their life. \n\nStill, that doesn't mean thedeprogram is hegemonic. It is simply suited for social media. Actual communist politics are immune and continue to function in indifference. It is a matter of mismatched tempos (victories and defeats of the people's war simply don't have the same appeal, though perhaps online Maoists could be like \"5 policemen killed in Chhattisgarh, chad Ajith keeps winning\") and I talk about it because I assume the KKE or CPI(Maoist) have better things to do.",
                                    "score": 27,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Labor-Aristocrat",
                            "body": "Wtf are \"Hitler particles\" lol",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "DashtheRed",
                                    "body": "It comes from an old Trotsky quote:\n\n>Not every exasperated petty bourgeois could have become Hitler, but a particle of Hitler is lodged in every exasperated petty bourgeois.\n\nIt became a twitter meme (admittedly, a pretty funny one, at least the first time you saw it) where someone would take a news story about some petty bourgeois owner living up to the \"petty\" part of their class existence, and then someone would have a picture of a tricorder or a PKE meter and say something like \"detecting Hitler particle levels off the charts.\"  It doesn't really work as well on reddit without the imagery but that hasn't ever stopped redditors from participating in memes this way before.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "Labor-Aristocrat",
                                            "body": "Well, that explains the novelty. I had a feeling no one on that subreddit could come up with something that funny, despite Trotsky having a few 'hitler particles' himself. Thanks for sharing.",
                                            "score": 18,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Auroraescarlate44",
                                    "body": "I was perusing the awful comments on that post and the one that seemingly equates \"Marxist-Leninist-Maoists/Gonzalists, ultras, NatSocs/PatSocs, and feds\" is the most jarring to me: [https://www.reddit.com/r/leftist/comments/1irti7g/comment/mdbrsto/](https://www.reddit.com/r/leftist/comments/1irti7g/comment/mdbrsto/)\n\nThe \"Maoists are feds\" attack is old and tired by now but where did they get NatSocs/PatSocs from? Do these people simply lump together everything they don't like in one basket and throw around nonsense like this? Completely pathetic behaviour.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "DashtheRed",
                                            "body": ">TO BE ATTACKED BY THE ENEMY IS NOT A BAD THING BUT A GOOD THING\n\n>I hold that it is bad as far as we are concerned if a person, a political party, an army or a school [or a subreddit] is not attacked by the enemy, for in that case it would definitely mean that we have sunk to the level of the enemy. It is good if we are attacked by the enemy, since it proves that we have drawn a clear line of demarcation between the enemy and ourselves. **It is still better if the enemy attacks us wildly and paints us as utterly black and without a single virtue;** it demonstrates that we have not only drawn a clear line of demarcation between the enemy and ourselves but achieved a great deal in our work.",
                                            "score": 21,
                                            "replies": []
                                        },
                                        {
                                            "author": "StrawBicycleThief",
                                            "body": "All of these subreddits' true colours were out when Gonzalo passed. Truly disgusting stuff.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "urbaseddad",
                                                    "body": "Ashamed to say I remember it well because I participated in the revelry in GenZedong back in the day",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "StrawBicycleThief",
                                                            "body": "I remember before still thinking there was potentially a net benefit to the existence of some of these communities. But not after that. There were many positions I held that I realised were a result of a field of common sense, rather than actual investigation. Thankfully, the work on this sub unravelling the logic of the new \"Dengism\" that followed has made the whole thing comprehensible. What's impressive though is that this logic was becoming, if not already hegemonic back then on this subreddit, yet now anti-revisionism amongst core posters is consistently applied.",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Pleasant-Food-9482",
                            "body": "The amusing thing to me is that reddit (and discord too!) does not understand the problem is not in r/communism not being communist (because it is!). The problem is that reddit or discord are not leftist. It is only leftist in the western left sense. It saddens me that the brazilian left is following the same path online due to the hard gaping hand of the white petty-bourgeoisie on it, which is trying to turn everything into their idealized european and american image. And i do not say this chauvinistically: It would be far better to argue with left liberals and confront them in our politics than right liberals pretending as leftists. It still is better to argue with a anarchist that at least is not the image of western anarchism and follows some kind of \"platformism\" that rejects \"electoralism\" and voting, than with a anarchist who tails the government but posture as not doing it, while saying corny lines like \"it slows down \"\"fascism\"\" to vote on PT, and it is a way to fight for trans or black rights\".",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}