{
    "title": "Whoopi Claims That If Trump Can Deport Terrorists, He Can Deport ‘Any One Of Us’",
    "author": "thatrightwinger",
    "subreddit": "Conservative",
    "rank": 19,
    "score": 449,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 165,
    "url": "https://www.dailywire.com/news/whoopi-claims-that-if-trump-can-deport-terrorists-he-can-deport-any-one-of-us",
    "id": "1je6nhn",
    "selftext": "",
    "comments": [
        {
            "author": "thatrightwinger",
            "body": "Whoopi Goldberg thinks that she's exactly the same as illegal aliens who commit felonies.\n\nHow does she function in normal society?",
            "score": 295,
            "replies": [
                {
                    "author": "Sure-Wishbone-4293",
                    "body": "Whoopi has no plans to function in a normal society.",
                    "score": 88,
                    "replies": []
                },
                {
                    "author": "According_To_Me",
                    "body": "By sleeping on a bed made of money. She doesn’t live in what you refer to as “normal society.” She’s very rich. \n\nBut money can’t buy reason.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "TheIncredibleHork",
                    "body": "She has people to take care of the stuff that actually requires common sense. It free her up to do her money making 'acting' and bloviating.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "ObadiahtheSlim",
                    "body": "She's a paid actor who repeats the Establishment's talking points.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "According-Activity87",
                    "body": "I don't think she is as evidenced by her brain-dead take here.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Thats_Dr_Anthrope_2U",
                    "body": "Yeah, one touch of reality by dropping her off with them and she'd realize really fast she isn't like them at all.  \n\nOne time I was getting an oil change and a young girl (daddy's money is obvious) gets a call, disgusted she hangs up.  Looks right at me and asks how people in India could live with themselves calling and scamming people.  Having spent months in India and seeing the state of their country I look right at her and say \"have you ever *really* been desperate?\"  No response, just a puzzled gaze.  \n\nThat was the day I realized the American liberal are so spoiled they think the entire world works the way the US works, which is why their whining must be considered no more important than the incoherent babbling of a child",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheIncredibleHork",
            "body": "These people are causing fear by design to anyone they can. I have a friend who is terrified because he heard some lawyer say that people are showing up to renew their green cards and being deported right there. Why? No answer. Proof it's actually happening? None. Fear it's causing my friend? Palpable. Granted he's not in a great position when it comes to immigration but these people are fear mongering every chance they get. \n\nThey're half the reason we're fractured as a country right now.",
            "score": 95,
            "replies": [
                {
                    "author": "IAMAHORSESIZEDUCK",
                    "body": "Take a stroll through r/politics. It's really sad how they are fabricating every lie they can come up with. If I were a liberal I'd be scared too.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "LordRattyWatty",
                            "body": "I'm scared at the mental gymnastics they pull on the regular. These are people in everyday society.\n\nWho knows how far they will go?",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "intrigue-bliss4331",
            "body": "Ah Whoopi, always the victim, eh? She’s craving the limelight so bad, she’s got to make up stuff to freak out about. Poor old has-been.",
            "score": 49,
            "replies": []
        },
        {
            "author": "bw2082",
            "body": "Whoopi should have stuck to the movie business and kept her trap shut.  I liked her much better back then.",
            "score": 23,
            "replies": [
                {
                    "author": "thatrightwinger",
                    "body": "I never liked a single thing she did, except maybe Ghost.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Highwiind-D4",
                            "body": "She was very good as Guinan on Star Trek: TNG.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "thatrightwinger",
                                    "body": "I think she was tolerable. But I never once saw \"Guinan,\" I always just saw Whoopi Goldberg in a stupid hat.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Highwiind-D4",
                                            "body": "She has great scenes in I, Borg, The Measure of a Man and Best of Both Worlds—some of the best episodes of the series.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ChristopherRoberto",
                                    "body": "She'd have been the worst part of TNG if it wasn't for Wesley.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "ObadiahtheSlim",
                                    "body": "She wasn't that great outside of a handful of episodes like Yesterday's Enterprise.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bw2082",
                            "body": "I liked the first Sister Act.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "thatrightwinger",
                                    "body": "I thought it pretty stupid.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sure-Wishbone-4293",
                            "body": "She should go: poof!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hectoriu",
            "body": "Where would you even deport an American born in America to?",
            "score": 4,
            "replies": [
                {
                    "author": "thatrightwinger",
                    "body": "You and your stupid logic and reasoning skills.  If Whoopi says Trump can deport you, then she must know what she's talking about. 🙄",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mdws1977",
            "body": "Well, she could be a terrorist for all we know.  --- Just kidding.\n\nTrump can't deport people who are actually born here from US citizens.\n\nBut he can and will arrest US citizens who are terrorists, and deport non-US citizens who are here illegally and/or are terrorists.",
            "score": 27,
            "replies": [
                {
                    "author": "bozoconnors",
                    "body": "> Well, she could be a terrorist for all we know. --- Just kidding.\n\nI mean... spewing unjustified politicized fear on a nationally televised platform?...  eh...",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "KeyFig106",
                    "body": "And he can jail citizens in other countries. Just can't deport them. ",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pinot_Greasio",
            "body": "Room temperature IQs for every single member of the panel, but imagine the IQs of the people who watch this garbage.",
            "score": 21,
            "replies": []
        },
        {
            "author": "ReachLanky2676",
            "body": "This is true. I’ve always thought of The View hosts as terrorists.",
            "score": 17,
            "replies": [
                {
                    "author": "Wolf687",
                    "body": "They are certainly terrorists to our brain cells.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "BIG_BOTTOM_TEXT",
            "body": "We are living through mass psychosis on a truly historical scale.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Thats_Dr_Anthrope_2U",
            "body": "She is comically stupid.  Ironically, her only talent.  \n\nSpewing shit like this is why they have no credibility left.  They chose it.",
            "score": 10,
            "replies": []
        },
        {
            "author": "atomic1fire",
            "body": "The View should really change its name.\n\nAnd while I hate this style of online rhetoric I can't stand the view more.\n\n👏 FOUR 👏 WOMEN 👏 ON 👏 TV 👏 IS 👏 NOT 👏 A  👏 CONSENSUS 👏\n\nWhoopi Goldberg is no more an expert on public policy any more then she is an expert on the causes of the Holocaust.\n\nIf your TV show is called the talk, the conversation, the whatever and nobody's asking you for your opinion they're not speaking with you they're speaking at you. It's not a panel of experts, it's a panel of famous women who were picked because of what they represent, but none of them actually represent an average person because an average person doesn't have a publicist covering for them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CuppieWanKenobi",
            "body": "I'm getting so, so tired of the Left constantly imagining up yet another \"but Trump *miiiight*\" scenario.  \nIt's getting exhausting.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ILikestoshare",
            "body": "Please deport Whoopi. Please god, I will never ask for anything ever again.",
            "score": 6,
            "replies": []
        },
        {
            "author": "murderinthedark",
            "body": "Whoop a terrorist ig",
            "score": 3,
            "replies": [
                {
                    "author": "____IIIII___ll__I",
                    "body": "Terrorizing my eyes and ears, that's for sure.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "dottedoctet",
            "body": "Trust me Whoopi, if he could just report anybody he wanted. You wouldn’t be here.",
            "score": 3,
            "replies": []
        },
        {
            "author": "142Ironmanagain",
            "body": "Whoopi should be deported for the years of vile, disgusting, totally wrong and woke bullshit she’s been slinging on that stupid show!! Heard a rumor her and Joyless didn’t get their contracts renewed for the show, either. Please let that be true!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "caffeinatedgoober",
            "body": "It's difficult to believe anyone can be this dumb. Then again, people still voted for Biden and Kamala.",
            "score": 2,
            "replies": []
        },
        {
            "author": "H3nchman_24",
            "body": "#🤞",
            "score": 1,
            "replies": []
        },
        {
            "author": "JurassicParkFood",
            "body": "I hope she's paid to say stupid, biased, illogical things. Imagine ruining the country and at least not getting paid well",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikemaca",
            "body": "Very strange claim by Whoopi that she is part of some terrorist organization. Maybe she has Alzheimers?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wide_Fig3130",
            "body": "I can't with this hag anymore,  please, and ty for the love of sanity. Please do not post anything that has her name in it. TY",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imoldok",
            "body": "Intellegence isn't her strong suit else she wouldn't be on the view.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GentryMillMadMan",
            "body": "God if we could deport anyone it should be her.. despite her claims there are laws about that.. unless of course she is in the country illegally and is a terrorist…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tasty_Explanation_20",
            "body": "Didn’t she vow to deport herself if he won? Both times in fact? Maybe she should honor her vow and follow Rosie to greener pastures",
            "score": 1,
            "replies": []
        },
        {
            "author": "day25",
            "body": "Reminder Obama ordered the killing of a US citizen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "miscstarsong",
            "body": "I just don’t get why they don’t use common sense. Any thinking person would know that’s nonsense. And what’s  making things worse is she and the others are given this platform to spew it.  Yeah yeah free speech… but this is more along the lines of yelling Fire! in a theater.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capable_Obligation96",
            "body": "How does anyone with more than 62 IQ even give her a tenth of a second of thought?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beware_the_silent",
            "body": "I don't think this hag understands how deportation works.",
            "score": 1,
            "replies": []
        },
        {
            "author": "plastimanb",
            "body": "So if I appropriate a Jewish sounding name that should allow me to get more Hollywood gigs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "acreekofsoap",
            "body": "Whoopi. Whoopi + dumb",
            "score": 1,
            "replies": []
        },
        {
            "author": "martel197",
            "body": "If only!\nAnyways....",
            "score": 0,
            "replies": []
        },
        {
            "author": "indefiniteretrieval",
            "body": "She amazes me in how she constantly out-dumbs herself....",
            "score": 0,
            "replies": []
        },
        {
            "author": "OverResponse291",
            "body": "I don’t care about the opinion of an actor or actress.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Imissyourgirlfriend2",
            "body": "Fine! Go ahead!!! Deport me back to my country of origin!!!",
            "score": 0,
            "replies": []
        },
        {
            "author": "daspes1269",
            "body": "Whoopi… You can’t deport citizens.  No matter how much we wish there could be an exception made for you.  Unfortunately they still can’t.  \n\nUnless maybe if you renounce your citizenship?  Maybe we can work something out then to make you happy.",
            "score": 0,
            "replies": []
        },
        {
            "author": "SideWinderGX",
            "body": "Ahh, the old 'anyone can be anything' argument. Interesting. Stupid, but interesting.",
            "score": -3,
            "replies": []
        },
        {
            "author": "baseball_Lover33",
            "body": "One can hope\n\n![gif](giphy|KRxcgvd5fLiWk)",
            "score": -1,
            "replies": []
        },
        {
            "author": "ApricotNo2918",
            "body": "Start with her...",
            "score": -1,
            "replies": []
        }
    ]
}