{
    "title": "S.T.A.L.K.E.R. 2: Heart of Chornobyl - Stalkers! Patch 1.3 has arrived!",
    "author": "ZazaLeNounours",
    "subreddit": "pcgaming",
    "rank": 5,
    "score": 151,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 41,
    "url": "https://store.steampowered.com/news/app/1643320/view/831582351143207687?l=french",
    "id": "1jebk0k",
    "selftext": "",
    "comments": [
        {
            "author": "SireEvalish",
            "body": "Looking forward to playing this in like six months once it's finished.",
            "score": 86,
            "replies": [
                {
                    "author": "A_R_A_N_F",
                    "body": "The uncomfortable truth is the game is still not where it should be. I got it on day one to support the devs, played around 25 hours, and decided to wait till it improves. \n\nI am a huge fan of STALKER and it really lives up only to one thing, it being JDALKER(Jdal = to wait).\n\nWait for shaders to finish caching every time you start the game. Ah, and also wait for them to improve the game. Sucks to say all this but that's the truth.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "IMDEAFSAYWATUWANT",
                            "body": ">Wait for shaders to finish caching every time you start the game.\n\nWhile I understand you shouldn't have to mod to fix the game, there's a mod to fix this (I think it's just a line in engine.ini file)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zaphod4th",
                    "body": "true experienced gamer",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZazaLeNounours",
            "body": "Even longer patch note : [https://www.stalker2.com/en/news/patch-1-3](https://www.stalker2.com/en/news/patch-1-3)",
            "score": 25,
            "replies": [
                {
                    "author": "Every_Economist_6793",
                    "body": "What's the state of a-life?",
                    "score": 47,
                    "replies": [
                        {
                            "author": "adorablebob",
                            "body": "What I'm waiting for before I install it.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "Imaginary_Land1919",
                                    "body": "Same. And they better add freaking binoculars with it!",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RSG-ZR2",
                            "body": "Asking the important questions",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "HerbsAndSpices11",
                            "body": "I haven't played it, but I looked through the patch notes and noticed 3 tiny changes to a-life. This doesn't seem to be a big overhaul of the system, so it seems we will have to wait longer for that.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "theblasphemer",
                            "body": "Same, but apparently with some NPC behavior improvements. One of the devs replied in r/stalker to someone claiming no A-Life fix was in the works, and said they shouldn't make that assumption. Take that for what it's worth, I guess.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "polypolip",
                            "body": "All 3 major patches included improvements and fixes so hard to tell without actually launching the game.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "milkasaurs",
                            "body": "No gonna answer this?",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Construction2407",
                    "body": ">note\n\nYou mean novel",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Rewelicious",
                    "body": "Even longer is a slight understatement, it's massively longer ! Good job devs !",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "germy813",
            "body": "I think I'll give it another year before playing it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "nerf-IS6",
            "body": "No bino, No NVGs, No player stats, ai still disappear \\~100 away ( what's the point of snipers ) and ai still have basic behaviour compared to S1.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Sabedena",
            "body": "I think I'll wait for the 2.0 patch to drop before I get into this game. There are too many issues, and you can tell by the long changelog. It's still not ready, and it makes me sad. Good luck to the devs fixing it.",
            "score": 22,
            "replies": [
                {
                    "author": "yeeeew99",
                    "body": "I played it at version 1.1 and it was a fantastic experience.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "PabloBablo",
                            "body": "Yeah, it's nowhere near as bad as the doom and gloom from the top few posts. Just reddit negativity floating to the top, as always",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Sabedena",
                                    "body": "Nowhere as bad? Did you see the change log?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PabloBablo",
                                            "body": "Yes. \n\n\nI know when mutants twitch during turning animations its entirely game breaking. ",
                                            "score": -7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ronut",
            "body": "Does the game still drop to 5 fps after an hour of playing?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Nemetona",
            "body": "Anyone noticed that they removed Auto-Next-Item with X while looting? So inconvenient, you now have to move manually to next item or simply everytime loot all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rolf_Dom",
            "body": "I wonder if it's good enough now. Still not certain paying near-full price is justified with the state it is in. \n\nI'll probably wait another month, then get Gamepass for a month, for Expedition 33, and try to squeeze in Stalker 2 on top.",
            "score": 7,
            "replies": [
                {
                    "author": "Gromchy",
                    "body": "I think I'll wait even further, till this NOV / DEC.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "p3ek",
            "body": "This game gonna be so good on another year or two with some community work. Until then just wait",
            "score": 1,
            "replies": []
        },
        {
            "author": "james___uk",
            "body": "The number of fixes is unreal. I've not seen a patch fix so much since the unofficial Oblivion patch",
            "score": 1,
            "replies": []
        },
        {
            "author": "SupplyYourPips",
            "body": "I really feel like playing this game, but i feel like I'll benefit waiting for 2.0 and then some mods that give it the Anamoly / Gamma feel",
            "score": 1,
            "replies": []
        },
        {
            "author": "UncleBubax",
            "body": "Am I weird for thinking the devs of a single player game shouldn't be all excited about a new patch?",
            "score": -42,
            "replies": [
                {
                    "author": "ZazaLeNounours",
                    "body": "Yes.\n\nYou are weird.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "BottAndPaid",
                    "body": "Why wouldn't they be excited they got work and improvements done for their project and are continuing to support said project past the initial launch. That's great news.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "maybe-an-ai",
                            "body": "Because games should launch in a better state but that's not on the developers that's on the board of directors.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Gammelpreiss",
                                    "body": "well, the special situation in Ukraine right now is not helping, either",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "maybe-an-ai",
                                            "body": "No, but it's also not uncommon in teams under less pressure and playing something like Split Fiction reminds me it's 100% possible to release a game that doesn't have bugs and performance issues day 1.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "ryanvsrobots",
                                                    "body": "Isn't split fiction a small (in terms of game scale, not budget) very linear and limited story game published by one of the biggest publishers in in the industry? Pretty bad example.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LeoDaWeeb",
                            "body": "Because by the way you're framing it, you're lowering the standards for the state a game should launch. Yes it's hard work and yes it's appreciated but this shouldn't be necessary in the first place.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "UncleBubax",
                            "body": "I guess it's just a bit of a bummer because I was looking forward to the game but ended up not buying it because of how rough it was at launch. It's not like they are adding substantial things they are just working towards bringing their game out of early access. Oh well, guess I'm on my own in feeling that way.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "AsOneLives",
                                    "body": "I think most people that played the 1st STALKERS were pretty aware that it was likely gonna release in this state. You should be happy they're continuing to work on it. They could've released it and said \"eh, fuck it. You got the game.\"",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ModernLifeSucks",
                    "body": "They're publishing the result of a month's worth of hard work and dedication. Why shouldn't they be excited about it?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReallyGottaTakeAPiss",
            "body": "I really out of the loop, is there any mention of when the PvP mode will be out? I’m assuming 2.0?",
            "score": -5,
            "replies": []
        }
    ]
}