{
    "title": "Taree father who raped his children has sentence reduced by 18 years",
    "author": "B0ssc0",
    "subreddit": "australia",
    "rank": 16,
    "score": 401,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 161,
    "url": "https://www.abc.net.au/news/2025-03-18/taree-father-who-raped-daughters-sentence-reduced/105053052",
    "id": "1jdvqgx",
    "selftext": "",
    "comments": [
        {
            "author": "Loud_Register_5436",
            "body": "Don’t just talk about him. What about the psychological effects on the children over the years? It is \ndevastating and results in many problems that need to be addressed. They should never see their father again.",
            "score": 258,
            "replies": [
                {
                    "author": "Extra-Crunchy-1",
                    "body": "What about their mother who was present during times of assault? No mention of her punishment or current situation",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "JGQuintel",
                    "body": "> Some of these offences were committed in company with – or in the presence of – the victims’ mother.\n\nAnd what about the mother? Where is she?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jealous-Hedgehog-734",
            "body": "Well...let's just hope his child raping days are behind him in 17 years I suppose. 🤷🏻‍♂️",
            "score": 287,
            "replies": [
                {
                    "author": "B0ssc0",
                    "body": "It’s unfathomable how they ignore the effect on his daughters.",
                    "score": 65,
                    "replies": [
                        {
                            "author": "awiuhdhuawdhu",
                            "body": "I think this is a bit of a ridiculous claim, having skimmed the judgment. I’m guessing you haven’t?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "FuckwitAgitator",
                                    "body": "They're not after actual justice, they're just after \"our justice system is broken\" headlines that might make people vote Liberal or far-right.",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "B0ssc0",
                                    "body": "It’s certainly not about the daughters, but about him.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cutsdeep-",
                    "body": "Maybe he'll have seen rape from another perspective during his jail time and given it some thought",
                    "score": 50,
                    "replies": []
                }
            ]
        },
        {
            "author": "RubyChooseday",
            "body": "He needs that 18 years slapped back on for invoking the autism defence.",
            "score": 137,
            "replies": []
        },
        {
            "author": "IntsyBitsy",
            "body": ">The offender appealed the severity of his sentence \n\nSomeone who rapes their children and then argues what they did wasn't that bad and they should get off with a lighter sentence should have it increased. \n\nHow is this not an obvious sign that they will continue to be dangerous?",
            "score": 194,
            "replies": [
                {
                    "author": "Whatsapokemon",
                    "body": "That's not the argument at all. The appeal was based on the fact that the sentence given was more harsh than what was given in other similar cases. The criminologist interviewed in the article agreed the sentence was longer than what one would expect given the circumstances.\n\nAppeals courts are there to ensure that rules, procedures, and processes are followed fairly.\n\nRules and laws should be followed and imposed fairly and equally, not arbitrarily based on how much social media outrage it gets.",
                    "score": 84,
                    "replies": [
                        {
                            "author": "JASHIKO_",
                            "body": "Seems like more of a reason to review the other cases and add a solid few years to each and every one of them if you ask me.",
                            "score": 88,
                            "replies": [
                                {
                                    "author": "sciencenotviolence",
                                    "body": "Parliament sets the minimum and maximum sentences. The Courts follow statutes drafted by the politicians that the public vote in.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "GrizzlyGoober",
                                            "body": "Something I've never looked into but it's often seemed to be the case is the precedent sentencing does not approach the maximum even in extreme cases.\n\nThis occurred to me reading about the recent case in Melbourne where Xiaozheng Lin killed and robbed two women in the space of 24 hours, was sentenced to a maximum of 14 years in prison with a non-parole period of nine years. In terms of manslaughter cases, surely this is among the more heinous possible. The maximum penalty for manslaughter in Victoria is 25 years, begs the question how could you ever get sentenced to the maximum?",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "awiuhdhuawdhu",
                                                    "body": "How do you get sentenced to the maximum? Well 25 years is longer than the vast majority of murder sentences, so the culpability would have to be extreme, and the offender would have to show no remorse, not plead guilty, and have an extensive criminal record of serious offending, and have very few mitigating circumstances. The vast majority of individuals who commit crimes do have mitigating circumstances, so the maximum penalty is really a theoretical benchmark which will always be discounted from.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JASHIKO_",
                                            "body": "Correct, but there's no reason they can't re-evaluate their use of the min and max sentences to be a bit more consistant, especially in cases like this. I know cases can be complex but 99% of the time these people are scumbags through and through especially when the abuse has been ongoing over a period of time and not just a once off event.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "awiuhdhuawdhu",
                                                    "body": "When jurors are surveyed on what sentences they think \nthe offenders in their trials should get, they on average recommend a lower sentence than judges impose. A 30 year sentence is 4x the lower end sentence for a murder.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "IntsyBitsy",
                            "body": "I'm not commenting on the legal argument. This is the comment section of a reddit post, personally I don't think a repeat rapist who seeks to reduce their sentence is someone who should be on the streets.",
                            "score": 30,
                            "replies": []
                        },
                        {
                            "author": "neita555",
                            "body": "Piece of shit should have got 100 years in a normal prison where he would be killed within hours of people finding out what he did. Fuck the appeals courts and due process. Bloke is a degenerate piece of shit.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "GardeniaFrangipani",
                                    "body": "And what about the girls’ mother who was present during some of the rapes? It’s just beyond my comprehension.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hanse_moleman",
                            "body": "Maybe they should follow the rules and not rape their children.\n\n\nFuck off mate.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "PositiveBubbles",
                                    "body": "Why someone would rape anyone, let alone their own kids is beyond me",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Drunky_McStumble",
                            "body": "But you could just as easily use the same logic to argue that a longer sentence like this should be the norm, and it's actually the others that don't stack up. Whose to say that systemic leniency in sentencing for sexual assault convictions isn't a universal problem, and that this particular case represents an occasion when the courts actually got it right for once?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Substantial_Mud6569",
            "body": "If his autism caused such severe social impairment that he was unable to recognise the boundary of sexual assault against his own children multiple times, his autism would have been too severe to ever have a relationship and children in the first place.\n\nAlthough I do understand why they reduced his sentence to be more aligned with similar crimes. It’s just that specific part of his appeal was weak at best.",
            "score": 49,
            "replies": [
                {
                    "author": "B0ssc0",
                    "body": "Yes, and an insult to everyone else on the spectrum.",
                    "score": 31,
                    "replies": []
                }
            ]
        },
        {
            "author": "VolcanicBosnian",
            "body": "Taree's least criminal guy",
            "score": 72,
            "replies": []
        },
        {
            "author": "madcatte",
            "body": "I'm really starting get sick of this constant half-out-of-context fear mongering over 'people going unpunished for heinous crimes'. This guy had a 48 year sentence changed to a 30 year sentence to be more in line with other punishments handed down. I don't care what you think about this particular case, he deserves the same severity of punishment as others who committed similar crimes. And those who think 30 years in jail is some slap on the wrist seriously lack any understanding of how long each minute lasts in prison, how humans work, or how this broader structure is designed to work. Prisons are only partially there to keep offenders away from the broader public, and it costs a lot to do so. They are also there to at least attempt to rehabilitate and release. If you think 30 years down the drain over the most crucial decades of your life isn't serious or enough to make you think twice about your actions, you really lack imagination and need to calm the fuck down.\n\nEdit: to all of you mindlessly replying \"tell us you touch kids without telling us you touch kids\", you may be borderline illiterate. Keep your internal screeching internal please. Embarrassing",
            "score": 289,
            "replies": [
                {
                    "author": "Sys32768",
                    "body": "It's still out of touch with what the community would expect.\n\nRaping a daughter when they are a child under 10 should mean that they never get out again. I bet the vast majority of the population would agree",
                    "score": 330,
                    "replies": [
                        {
                            "author": "throwaway012984576",
                            "body": "I think this is far more deserving of life in prison than murder.\n\nA person who kills another can be justified in doing so but nobody can be justified in raping anyone let alone a child.",
                            "score": 129,
                            "replies": [
                                {
                                    "author": "Maverrix99",
                                    "body": "There’s a horrible logic that requires the sentence for rape has to be one rung lower than the sentence for murder. \n\nOtherwise you incentivise rapists to murder their victims.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Da_Pendent_Emu",
                                    "body": "I dunno. \n\nI reckon neither is justified hence we don’t have the death sentence. \n\nWhat do murderers get?",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "throwaway012984576",
                                            "body": "Life in prison. You can get it for defending yourself and killing someone in the process.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Da_Pendent_Emu",
                                                    "body": "Yup. \n\nThere’s been so many times evidence has shown wrongful conviction. \n\nToo late to say oops at that point with the death penalty. \n\nLock em up, be done with it.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "patgeo",
                                                    "body": "Just make sure you're driving a car when you do it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "recycled_ideas",
                            "body": ">It's still out of touch with what the community would expect.\n\nIt's actually not.\n\nEvery time the public are given actual cases with actual people they give sentences lower than the judges.\n\nIt's just in the abstract that we become vile vengeful cunts.\n\nNot to mention the fact that \"community expectations\" shouldn't be something we even consider during sentencing because people being vile vengeful cunts doesn't do anyone any good.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Sys32768",
                                    "body": ">\n\nIn general that is true but it is not the case for crimes such as this. This is a particularly heinous crime.\n\nSee figure 2 in the study below which shows jurors are less leniant than judges in sex crimes against children under 12.\n\n[https://www.utas.edu.au/\\_\\_data/assets/pdf\\_file/0019/1223830/Results-from-Vic-study-.pdf](https://www.utas.edu.au/__data/assets/pdf_file/0019/1223830/Results-from-Vic-study-.pdf)\n\nThere is a risk in generalising things when we are discussing a specific crime.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "AggravatingTartlet",
                                    "body": "\"vengeful cunts\"\n\nNah. It's about protecting the community. Those who have the least to fear from rapists are often the ones who care the least.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "recycled_ideas",
                                            "body": ">Nah. It's about protecting the community.\n\nNo, it's not. Protecting the community would be evidence based and this isn't. You want him locked up because you're angry and you want him punished not because you have evidence.\n\n>Those who have the least to fear from rapists are often the ones who care the least.\n\nOh, fuck right off.\n\nWe're not basing our justice system off your fear and we're not limiting conversation about how we handle rapists to only people with a vagina because that's insane.\n\nThe justice system serves three purposes, punishment, rehabilitation and separation. Thirty years is plenty for punishment, we're doing fuck all for rehabilitation and if we need separation because people can't be fixed it should be humane and not the shit show that is our prison system.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "AggravatingTartlet",
                                                    "body": "I am not angry. I'm afraid you hallucinated that.\n\n>Oh, fuck right off.\n\nOk, so you're having some angry feelings right now.\n\n>The justice system serves three purposes, punishment, rehabilitation and separation.\n\nThe justice system's most important function is protecting the community. You're using the word \"separation\" instead, but it means the same thing.\n\n>Thirty years is plenty for punishment, we're doing fuck all for rehabilitation and if we need separation because people can't be fixed it should be humane and not the shit show that is our prison system.\n\nIt's not punishment. But yes, 30 years might be in line with other such sentences.\n\nI agree the prison system should change. I have no desire for prisoners to be punished. If they're going to be in there for years or life, then that life should be meaningful and they should have meaningful work to do. And we should be keeping people from ever going to jail for minor offences who are just in there because they can't afford a lawyer.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "recycled_ideas",
                                                            "body": ">The justice system's most important function is protecting the community. You're using the word \"separation\" instead, but it means the same thing.\n\nNo, it isn't. It's just one of the purposes and locking people up forever is the default ask on this which is a massive human rights violation.\n\n>It's not punishment. But yes, 30 years might be in line with other such sentences.\n\nIf you think thirty years in prison isn't a punishment you have no grounds to be involved in this conversation.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "AggravatingTartlet",
                                                                    "body": "Why are you talking about locking people up forever? I made no such statement.\n\nIf 30 years in prison is what it needs to be to protect the community, then that's what it is.\n\nWe know that whenever someone is convicted of raping a child, there is often a string of  child rape offences accusations or convictions behind them. The community was not protected and now a child or children have a life sentence of pain ahead of them--that's if the victim's life is not cut short by them committing suicide.",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "recycled_ideas",
                                                                            "body": ">Why are you talking about locking people up forever? I made no such statement.\n\nWhat other possible outcome is there from your path of argument?\n\n>If 30 years in prison is what it needs to be to protect the community, then that's what it is.\n\nThirty years is what his sentence was reduced to and what people are saying is inadequate, it was originally 48.\n\n>We know that whenever someone is convicted of raping a child, there is often a string of  child rape offences accusations or convictions behind them.\n\nSure, is that the case here? Do you know what the situation of this prisoner is in particular? You don't and neither do I, but you're absolutely certain about what should be done.\n\n>The community was not protected and now a child or children have a life sentence of pain ahead of them--that's if the victim's life is not cut short by them committing suicide.\n\nAnd?\n\nNow instead of your own personal vengeance you're looking at someone else's vengeance. Vengeance does not make good criminal justice policy.\n\nNo one is denying that this guy committed a terrible crime. The question I'm raising is why people who have no fucking idea what is going on feel the need to constantly call for longer and harsher sentences.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AggravatingTartlet",
                                                                                    "body": "1. You're kind of making stuff up here by saying what other path can be possible from my argument. I stated clearly what my argument is.\n2. I'm not in control of what other people are saying.\n3. I was talking in general terms about child rapists when saying at the time of conviction, they often have other offences behind them. We do already know that in this case he raped two children over years. That's already multiple offences.\n4. I didn't call for a longer sentence. None of what I said is from a perspective of vengeance.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "recycled_ideas",
                                                                                            "body": ">1. You're kind of making stuff up here by saying what other path can be possible from my argument. I stated clearly what my argument is.\n\nYou've jumped on a conversation about how thirty years doesn't meet community expectations and doesn't protect the community. The alternative is life.\n\n>3. I was talking in general terms about child rapists when saying at the time of conviction, they often have other offences behind them. We do already know that in do know he raped two children over years. That's already multiple offences.\n\nYou're talking generalities to justify your anger and make it righteous. You don't know this situation you don't know anything about this case, none of us do. Maybe he should already be out, maybe he should never get out, but community expectations from vengeful assholes shouldn't determine that.\n\n>4. I didn't call for a longer sentence. None of what I said is from a perspective of vengeance.\n\nYes, it is. You've just convinced yourself that your argument is righteous and so you're not a bad person. That's why you quoted the vibe and brought up the victim because then we can all get angry and punish.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "AggravatingTartlet",
                                                                                                    "body": "I initially replied to this statement of yours, which is obvious because I quoted part of it:\n\n>Not to mention the fact that \"community expectations\" shouldn't be something we even consider during sentencing because people being vile vengeful cunts doesn't do anyone any good.\n\nMy point was that community expectations of protection should indeed be considered -- and that's pretty much the reason we even have prisons in the first place.  I made no mention of the length of the prison sentence.\n\nDude, I have no righteous anger. And I've stated multiple times I don't think punishment is the thing we should be going for. \n\nI'll leave this discussion here.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Internal_Run_6319",
                            "body": "Yeah I really struggle to understand how people can defend this guy.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "madcatte",
                                    "body": "It's literally nothing to do with this guy. It's about understanding the actual underlying statistics rather than just running with the deliberately inflammatory anecdote you are presented with, and caring to investigate why these cases look the way they do. I am just begging people to resist the blatant fear mongering that is designed to make you buy more expensive insurance and vote for even more tough on crime posturing that predominantly ends up harming non-offenders more than offenders.",
                                    "score": 72,
                                    "replies": [
                                        {
                                            "author": "Sys32768",
                                            "body": "And yet you defend the level of punishment meted out to this guy at length.\n\nIt's a strange choice of crimes to start sticking up for the perpetrator",
                                            "score": -39,
                                            "replies": [
                                                {
                                                    "author": "madcatte",
                                                    "body": "I defended its justification: for punishments to be equally applied across equal offences. That's what the article/post is about - the change to his sentence - not the original sentence or his crimes. I said nothing of whether the statutes need adjusting or the nature of the crimes. My response is partially to this post but fuelled mostly by the relentless barrage of this type of article across a range of crimes, ones which I have also made this kind of comment on. People don't read the actual article or understand the case but leap in to rage-scream at each other about how evil this person must be.\n\nA simple read of the article, which would be contain maybe 10% of the facts presented in court at most, shows that the defence successfully argued he had poor understanding of the impact due to where he was on the ASD spectrum and his own history of being sexually abused, for example.\n\nDoes this make it ok? No. Does it mean he should get a lesser sentence than typically applied? No. And to a million other of these questions, no. I would say and have said this about other much less severe contexts. Would I be in favour of increasing the statutory minimums for sexual violence and other such crimes, considering I do believe them to be worse or on par with murder? Yes.\n\nWill you all still bend over backwards to believe that I am simply mindlessly defending a paedophile because I love to touch kids? You bet. You don't know me or when/where I post, so it's funny to say \"and now THIS is what you get engaged over??\" as if you have any idea of what I engage with.",
                                                    "score": 29,
                                                    "replies": [
                                                        {
                                                            "author": "AggravatingTartlet",
                                                            "body": "The original sentence was probably too long to start with, in keeping with other such sentences. Cruel to put the victims of this man through thinking he would never get out -- to having those hopes dashed.\n\n>\".....successfully argued he had poor understanding of the impact due to where he was on the ASD spectrum and his own history of being sexually abused, for example.\"\n\nHow do you know where he was on the ASD spectrum from that article? And the judge said that the time he was sexually abused did not appear to be behind his offending. The article simply said he appealed on those grounds. It could be that he played up those angles simply to get an appeal, including convincing a psych he was less well-functioning than he actually was.\n\nEvery time someone rapes a child -- and I mean EVERY TIME -- that person says they did it due to any or all of these things: depression, being suicidal, mental health issues, under stress, ASD etc.\n\nYet instead of seeking help for these issues, the person decided to rape a child.\n\nThere is no connection there. None. The vast majority of people who have all or some of the above issue do not think \"I'm gonna rape a/my child today\".\n\nNope. The desire to rape a child is already there -- at which point no crime has been committed -- but then they decide to go ahead with it.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "madcatte",
                                                                    "body": "You may well be right - I don't know the full complexities of this case. I also don't know if I believe the claims. But I suppose my main purpose was to say, hey, at least read the context \\*\\*a bit\\*\\* before arriving at an opinion/outrage. My opinion on that front largely stems from studies suggesting that the genera public is way more lenient in sentencing than judges when they are both presented with the actual facts and human complexities of the case. The general public is harsher than judges when both see just a headline summary.\n\nTo specifically address your source question, what I said was based on this bit of the article:\n\n>The offender appealed his sentence on the grounds that he was sexually assaulted, that his mental health issues increased the need for specific deterrence,  and that the sentence was manifestly excessive.\n\n>His defence also argued autism spectrum disorder impaired his understanding of relationships, his ability to recognise non-verbal cues, and that he had fixated interests of abnormal intensity in regard to sexual activity.\n\nGiven that the judge seemed to agree with adjusting his sentence back to the usual 30 years, my interpretation of this was that the defence had been successful on this approach. Not necessarily on the specific sub-points (like, as you say, it says earlier in the article that the court did not agree with the ASD influencing things \"in a material way\" though the word 'material' there might be doing some heavily lifting), but that overall the court agreed that these were collectively mitigating enough to not warrant the extended sentence.",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AggravatingTartlet",
                                                                            "body": ">But I suppose my main purpose was to say, hey, at least read the context \\*\\*a bit\\*\\* before arriving at an opinion/outrage\n\nYeah that's fair enough. Most people only read the headline.\n\nThe weirdest thing is when people wish the offender rape/violence in prison. I mean, what are they hoping for, exactly? I do totally understand the eye for an eye feeling, but for it to happen, you need jails to have the kind of offenders who rape people to gain a sense of power--which already describes almost all rapists. What a thing to hope for! And why should violent rapists get to do what they want most?\n\n>...overall the court agreed that these were collectively mitigating enough to not warrant the extended sentence.\"\n\n  \nTo me, it seems like the sentence was too lengthy in the first place. But I'm no expert on the legal system and maybe they do that so that there is space to \"give some years back\" if an appeal with mitigating factors is launched, even if those mitigating factors are weak.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Whatsapokemon",
                                    "body": "It's not about \"defending this guy\", it's about defending the concept of a dispassionate and fair legal system that has rules and processes.\n\nThe guy committed a crime and is getting the correct punishment for that crime as defined by statute. That process should be followed for every convicted criminal fairly.\n\nIf you want to change it, go and petition for the statutes to be changed. But the whole point of courts and judges is to make sure the process is being followed correctly.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "pte_omark",
                                            "body": "He WAS sentences as per the statute, but because other judges are giving weak sentences he has to get a weak sentence too....",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Astillius",
                            "body": "With luck, the other inmates will solve it for us. Everyone hates pedos.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "madcatte",
                            "body": "Look, emotionally I agree of course. But locking people up for life is incredibly expensive (albeit not as much as capital punishment) and here compared to being locked up from ~25-55 I don't really think that extra spending would be worthwhile in terms of rehabilitation or community protection. It's just punitive, and a really expensive way to do so. The gut 'eye for an eye' type response, that almost every social mammal possesses including me, but logically doesn't hold up to the most basic scrutiny.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Particular_Shock_554",
                                    "body": "We could save enough money by not imprisoning people for nonviolent survival crimes to keep all the repeat pedos away for life.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "madcatte",
                                            "body": "Why would it be an either/or situation? If we saved money on both, we could spend it developing improved services and systems, which is one of the best ways of disincentivising crime",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Particular_Shock_554",
                                                    "body": "At the very least we need abundant cheap public housing so that people don't have to choose between sharing a roof with a pedophile and being a homeless single parent.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "No-Assumption-1738",
                                                    "body": "I don’t think you can disincentivise this type of crime in the same way you can things relating to poverty and trauma ",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Any-Management-2685",
                                            "body": "This. Decriminalise or legalise drugs, for example, and then there’s plenty of room for pedos",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "snow_ponies",
                                    "body": "It’s worth it for the victims peace of mind if nothing else",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "brianozm",
                            "body": "I kind of agree, but bear in mind that abusers go through hell in jail and even when he gets out his life will never return to normal.  Heart breaking that he would hurt his own kids like that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Sys32768",
                                    "body": "I still have no sympathy for him",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "aew3",
                            "body": "Personally, if we want to regularly start keeping people locked up for life I’d rather us start thinking about the death penalty.\n\nI’m not convinced by either solution, but I think I’m more willing to think about the death penalty then life without parole. While a huge issue with the death penalty is that you have badly handled cases that wrongly convict people, I think life imprisonment is a far, far more cruel sentence then death and as such I’m not behind it.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "foolishle",
                                    "body": "Life imprisonment is the death penalty carried out as slowly as possible.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "ConsultJimMoriarty",
                                    "body": "I’d rather people this locked up for life. Let them suffer.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "No-Assumption-1738",
                                    "body": "I don’t think rapists should get the death penalty, and definitely not without serving a fuck ton of time first. \n\nI’ve had severe mental health issues for more than half my life due to being assaulted as a kid, I had had a near successful suicide attempt before the age of 15. \n\n\nI don’t think we are creative enough, we still have jobs that slowly harm workers. \n\nGet em castrated and down a mine ",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "aew3",
                                            "body": "So the point of life long imprisonment is to inflict torture at a cost of what will end up being many MILLIONS of dollars to the taxpayer? Prison isn’t cheap. At that point we might as well hand them over to their victims to keep them in their basements.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "AggravatingTartlet",
                                                    "body": "I don't know if you're male or female, but from what I see, it's mostly men who argue that the cost of long prison sentences for rape are too great. \n\nIf there were guys around who were twice as big and strong as normal men who went around raping men, I bet men in general would have a totally different view of rape.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "aew3",
                                                            "body": "I mean, I was just arguing for the death penalty over life in prison. Most people from what I’ve seen judge the death penalty as more severe. Sometimes countries will refuse to deport people to countries where there is a risk they will recieve the death penalty. My argument is nothing to do with believing we should have less severe punishments and wholly that it is backwards to spend so much of our countries money on what is purely punishment if there is no desire to try and release that person.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Fit_Effective_6875",
                                                            "body": ">\nIf there were guys around who were twice as big and strong as normal men who went around raping men\n\nThere are rapists that target men",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Maximum-Cupcake-7193",
                            "body": "I presume you have written to your state MP as well as commenting on reddit?",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Witty-Physics9940",
                    "body": "There's is no rehabilitating a man who raped his own children. I worked with sex offenders for years. Sexually assaulting an adult woman is bad enough but to do it to children (and your own children at that) - repeatedly - there is no fixing a person that broken. It's not something you can just stop. They enjoy doing it. I guarantee if he hadn't been arrested he'd still be doing it.",
                    "score": 68,
                    "replies": [
                        {
                            "author": "Such-Seesaw-2180",
                            "body": "Having worked in child protection, I agree.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Any-Management-2685",
                    "body": "I think people would like all child rapists to simply get life in prison and nothing less. Child rapists can not be rehabilitated. We shouldn’t even try. They’ll always be a child rapist and unworthy of being in society. Given we sadly can’t put them to death, a life sentence is the only other thing we’d have. Courts will never. They’ll just pay lip service to the idea you can be rehabilitated after 30 years in jail, which is bullshit by the way. He’ll probably be worse.",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "daybeforetheday",
                    "body": "I do think sentences handed out should be consistent. That's one of the principles of a fair legal system.\n\n  \nI don't think raping your children means you can ever be rehabilitated. So the problem isn't with this case, it's with what the legal system considers fair.\n\n  \n(I don't think you, commenter, are a bad person, and you explained this very well.)",
                    "score": 10,
                    "replies": [
                        {
                            "author": "madcatte",
                            "body": "The challenge here to me is that in the article, which basically no one seems to have read, it says that the defence successfully argued that he should be given the \\*normal\\* punishment instead of the fuck-you-in-particular punishment (48 years instead of typical 30) because he did not fully understand the impact of his actions due to a) his own history of being sexually abused and b) where he was on the autism spectrum.\n\nNow, do I believe this wholeheartedly? No, I would have to see much more evidence before making my mind up (as the court probably did). Do I think this should mean we excuse or let him off easy? No, this was used to justify being given the \\*regular\\* punishment over the extra-severe one, which is not the same as being let off easy from the normal punishment.\n\nBut this does change the equation for possible rehabilitation. If it is true, then spending 30 fucking years thinking about why everyone got so mad at you for something that seemed not so bad in the moment, and being relentlessly abused by other inmates for it the whole time, are probably going to incentivise this guy to just not fucking do this type of shit again.\n\nOr not. Maybe he is just lying and/or malicious. Maybe there is no possible rehabilitation. Maybe being relentlessly abused by other inmates for this will make him less rehabilitatable. I don't know. The actual point I am trying to communicate is that every situation is more complicated than a headline can convey and in this case, I went from thinking he couldn't be rehabilitated to actually reading the article (shock!) and thinking ok maybe I don't actually know",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "XxLokixX",
                                    "body": "Your 3rd paragraph seems to imply that the prisoner is a normal sane person. This is generally not true. Someone that rapes children has different brain chemistry than someone like you or me. They are wired differently. They don't feel guilt or regret in the way that you're describing in your 3rd paragraph. I do agree with the rest of your comment though\n\nI will say that I don't have a legitimate source for this opinion, but this is speaking from the partner of someone who is building a career in criminology (more specifically forensics though), so it's something we chat about a lot",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OzzTechnoHead",
                    "body": "30 years is still decent for sure. \n\nPedophile rapists are scum of the earth though",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "hanse_moleman",
                    "body": "For what he did to those two little girls?\n It's certainly a fucking slap in the face",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Whatsapokemon",
                            "body": "How is it a slap in the face? The appeals court found that the lower court made a mistake according to established guidelines and the mistake was corrected so that the person convicted is now serving the correct sentence as established by historical cases.\n\nRules and processes should be followed faithfully. A legal system shouldn't be arbitrary when handing out sentences.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "hanse_moleman",
                                    "body": "Cos the cunt should be fucking dead",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "Whatsapokemon",
                                            "body": "We don't have the death penalty in Australia, our legal system is not based on medieval concepts of revenge and retribution. Countries with the death penalty tend to have higher crime rates than those who adopt more restorative and rehabilitative justice systems.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "hanse_moleman",
                                                    "body": "Never mentioned the death penalty.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "Fit_Effective_6875",
                                                            "body": "so you'd prefer a system of retribution rather than a system of justice?",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "hanse_moleman",
                                                                    "body": "Lol justice..what country are you living in mate?",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Fit_Effective_6875",
                                                                            "body": "I live in Australia mate",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "hanse_moleman",
                                                                                    "body": "\n\nFucking trash judicial system.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Fit_Effective_6875",
                                                                                            "body": "So then get organised and start a petition and take it to your local member but here you are on Reddit showing the world your real or imagined outrage because your too fucking apathetic to do so",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "hanse_moleman",
                                                                                                    "body": "Ow sad",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ACGkiller",
                    "body": "Sure let's focus on the guy who raped his children and make excuses for his sentence.\n\n\nThe law is what it is. Some laws need to be changed.\n\n\nWith that said, no amount of time in jail is enough for anyone who raped anyone.\n\n\nIt doesn't matter >how long each minute lasts in prison\n\n\nHe should have thought about that before comitting such a horrific crime.\n\n\nRapist and pedophiles don't deserve leniency. Ever. Under no circumstances.\n\n\nThey are the lowest form of species on this planet.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "madcatte",
                            "body": "Such a revolutionary opinion! I wonder why it's never worked in the past!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "comfortablynumb15",
                                    "body": "It worked fine in the past : they killed them.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "madcatte",
                                            "body": "So you're either advocating for the death penalty, which is a non-starter even just from its economic inviability alone, or for a return to even older times, in which case you can throw any concept of 'justice' out the window",
                                            "score": 17,
                                            "replies": []
                                        },
                                        {
                                            "author": "DeeDee_GigaDooDoo",
                                            "body": "An tell me more about the crime rates, rape rates and how effective that evidently was.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ConsultJimMoriarty",
                    "body": "Considering the lifetime of pain he’s caused, he still got off light.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AmphibianOk5663",
                    "body": "Important comment right here",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "leisure_suit_lorenzo",
                    "body": ">_If you think 30 years down the drain over the most crucial decades of your life isn't serious or enough to make you think twice about reoffending, you really lack imagination and need to calm the fuck down._\n\nHow much you wanna bet he's still wacking it off in prison thinking about what he did to his kids? There is no rehabilitating that.\n\nPerhaps when his daughters feel sufficiently rehabilitated from their trauma, and don't feel scared about the idea of their father getting released from prison... he can then be released.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "pte_omark",
                    "body": "No he doesn't deserve the same as others he deserves what is inline with the sentencing guidelines and the decision of the ruling judge.\n\nPrecedent is the reason we have such inadequate sentences - just because one dickhead judge gives a light sentence it affects the average and now all the others have to give lighter sentences further pushing the average down. \n\nLet's be honest, each offender victim and circumstance is individual and judging sentence by precedent is not acceptable. Judge them by the sentencing guidelines.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "madcatte",
                            "body": "Crazy that we both don't use precedent in the way you describe and that the personal-level adjustment you're asking for is literally what occurred in this case.\n\nFirstly, we legislate minimum and maximum sentences for crimes and then give the judge, not the jury, the responsibility of deciding where in that range the severity of each case falls. There is no common law precedent.\n\nSecondly, this guy was given basically the maximum within that range because that is how the judge felt about the severity of this case.\n\nWhat this article is about is them arguing that there were mitigating factors (ASD particularly but also prior history of being sexually abused) and that these should be grounds for a middle-of-the-road severity assessment rather than the extreme severity assessment. I don't know if that's true, but the court would have seen a mountain of evidence not in the article and used that to decide. They pointed out that the original severity of sentence had historically been given to people who, in the example, had 7 times the number of otherwise identical offences. \n\nThat's... related... to the concept of precedent, but not the same thing. Just an argument presented to the judge and totally non-binding. This is managed by legislation rather than common law so the concept of precedent doesn't apply here.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SiriusBlacksGodson",
                    "body": "Your arguments defending 30 years as a reasonable punishment are purely ad hominems and consequently totally unsubstantial. You can’t just say that people who disagree with you lack imagination, lack understanding, and lack any experience on the matter. Firstly, you don’t know that, and secondly, it doesn’t engage with an actual counterpoint. \n\nIf we allow your logic to stand, then anyone could simply respond to you by saying you lack empathy and therefore have no right to speak on this topic. You then either have to grant that they’re correct and shut up, or admit you’re both wrong and start again.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "madcatte",
                            "body": "That would be because it was very much not the point of my comment. My comment was about what this article itself is about - the adjustment of his sentence. On principle we need to give people equal sentences for equal crimes. I wasn't talking about whether the crimes or their initial sentencing were fair. If we want to have a conversation about increasing the statutory minimums for sexual violence or paedophilia we can, but I made no comments on that front other than in another comment where I said I would be in support of that.\n\n If you want to actually discuss how \"much\" 30 years is, or where the min/maxes for these sentences should be, then I would use actual arguments even though it's not a straightforward topic to empirically litigate. I'd start with pointing out that studies find general samples tend to hand down lesser sentences than the judges when presented with the facts and human-elements of the case, even though they vote for harsher punishes than judges without that context. That's not directly relevant to \"how much\" 30 years is or where the right number is, but it's still indirectly relevant /informative. Judges, on average, are harsher than the general public in their sentencing. People have a tendency to knee-jerk react when presented with the crimes devoid of context or the human complications in the situation.\n\nThe only thing I am trying to preach is that reality is complex and maybe we should chill on the whole \"everyone should be locked away forever\" type beats until we at least understand the context of the situations",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SiriusBlacksGodson",
                                    "body": "I understand that the main point of your comment was on the principle of equal sentencing, however you also preemptively responded to backlash with ad hominems. I thought it important to point out that your logic was flawed, hence my response.\n\nI don’t have an issue with the principle of equal sentencing and agree with you on that front, but we should adhere to fair and logical parameters when engaging in a discussion.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "madcatte",
                                            "body": "Fair enough, I'll take note. Saying how \"long\" 30 years is didn't really seem like something that could be logically argued or proven, just something you need to experience more or less, but I could be wrong I don't know. In part I am going off my experience from years back when I got a drunk and disorderly and the cops kept me in one of the cells for about 6 hours once I came back to consciousness from the night before. 6 hours in the abstract is nothing to me. But 6 hours staring at a blank wall after being stripped of everything including my clothes, there is literally nothing else to do other than think about what you did. That's the point. Back at that time remember thinking about how they wanted this to affect me and actively resisted self-reflection. I still left being suprised by how much I ended up thinking about my actions and feeling remorse after having everything else to think about taken from me.\n\nI'm not sure how to argue it, but 30 years seems like it would work the same. Not all that much in the abstract - hell even a century or a millennia isn't even that much depending on your framing. But in reality, 30 years of having nothing to do but stare at a wall and think for 23 hours a day is probably a lot different.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "felixkater",
                    "body": "Yeah he’s not that bad, at least he was raping his own children. Hopefully he picks up some good habits in prison and maybe even rehabilitates enough to take part in society again.\n\nHe may even be able to turn his love of children around and study to enter the childcare sector",
                    "score": -15,
                    "replies": []
                }
            ]
        },
        {
            "author": "slykethephoxenix",
            "body": "18 years each right?\n\n\n...Right?",
            "score": 3,
            "replies": []
        },
        {
            "author": "gfreyd",
            "body": "“Some of these offences were committed in company with – or in the presence of – the victims’ mother.”\n\nShe’s behind bars too, right?!",
            "score": 3,
            "replies": []
        },
        {
            "author": "CraigIsAwake",
            "body": "This is one of the few types of crimes where I would support capital punishment. What a waste of oxygen.",
            "score": 37,
            "replies": [
                {
                    "author": "AngusLynch09",
                    "body": "Then people will just kill their victims to reduce witnesses. ",
                    "score": 76,
                    "replies": [
                        {
                            "author": "Novae909",
                            "body": "Yeah. It just makes sense to just have a life sentence for that kind of crime. The death penalty is a very final measure and will inevitably result in someone who is innocent getting wrongly killed. That being said. They better have bloody good evidence to overturn this kind of conviction. But death is too permanent in a justice system where someone could take advantage of it",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "Sea_Suggestion9424",
                            "body": "Wouldn’t they do that anyway to avoid life in prison?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "comfortablynumb15",
                            "body": "which is the only justifiable reason why we don't still have an automatic Death Penalty for those crimes.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sternestocardinals",
                    "body": "It’s wrong to oppose capital punishment on the grounds that criminals don’t deserve to die, because then you’ll always be confounded by situations like this where they obviously do. \n\nA more principled opposition would be based on the fact that in places where capital punishment exists, the state sometimes makes mistakes and sends innocent people to their death, and it’s probably better to allow people like this to live their life behind bars to ensure that doesn’t happen.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "MrSquiggleKey",
                            "body": "Also, when a capital punishment is on the cards, it increases the rate of crimes escalating to include killing the victim, and makes no measurable impact of reducing crime from occuring to begin with.\n\nSo bringing in death penalty cause cause accidentally killing innocent people.\nIncreases the severity of crime\nAnd doesn't reduce the incident rate of crimes occuring.\n\nLoses on all 3 accounts of where it should matter for the innocent population.",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "TranscendentMoose",
                            "body": "The state should not be allowed the power of life and death and state sanctioned murder is still murder",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Whatsapokemon",
                                    "body": "Agree. I think this is an under-rated reason for disliking the death penalty.\n\nI'd be uncomfortable being in the kind of society that feels like it can levy the sentence of execution upon its citizens.\n\nThe argument for self-defence is that you typically have no choice because you're coming down to a life-or-death situation already and you're using force to protect yourself. That's fine. However a state-sanctioned execution is _not_ that at all - it's a cold-blooded and unnecessary killing of someone who is in custody.\n\nEven in the case of the worst criminal ever who is convicted with undeniable guilt, you're essentially warping your society into one which pursues revenge and retribution rather than one which is based on moral principles and goodness.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CraigIsAwake",
                            "body": "Quite true. If it were somehow up to me, I'd have a higher threshold for evidence for it. If the crime is repeated many times and has many pieces of corroborating evidence, you can be sure that some people really are guilty. In reality, the number of cases that would meet those criteria are probably too small to justify having procedures for it anyhow.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Any-Management-2685",
                    "body": "Same, but I also think states can’t be trusted with having that power. Ultimately life in jail is probably an even worse punishment",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ghos5880",
                    "body": "Prison as a known pedo might actually be worse than capital punishment...",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MrSquiggleKey",
                            "body": "Nah they just live in the boneyard nice and protected.\n\nYou're more likely to have negative interactions in prison if you're in for assaulting someone who abused your kid then the person who did the abuse",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Any-Management-2685",
                                    "body": "Yeah. It’s sadly a bit of a myth",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "MadnessEvangelist",
                                    "body": "I follow an Australian  influencer on Instagram who used to be a correctional officer and now spreads awareness about how child predators groom people. She says the inmates that offended against children do not get put in gen pop and because they keep their noses clean they get good behaviour and the better prison jobs. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AggravatingTartlet",
                            "body": "But that to happen, you'd need to have violent rapists there in jail who get kicks out of raping men.\n\nSeems like not such a good thing to hope for.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mac-train",
                    "body": "I copped a 3 day ban for similar comments after someone reported them.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PositiveBubbles",
            "body": "Father rapes his own children??? The fuck",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gustav666",
            "body": "The mother should also be jailed.",
            "score": 2,
            "replies": [
                {
                    "author": "PositiveBubbles",
                    "body": "She was in the company when he raped his own daughters... that's just fucked up",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "B0ssc0",
                    "body": "Perplexing, isn’t it?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HalloweenJ",
            "body": "Death penalty. Either state mandated or rough justice",
            "score": 4,
            "replies": []
        },
        {
            "author": "welcomefinside",
            "body": "Let's see if he even lasts that long in prison",
            "score": 2,
            "replies": []
        },
        {
            "author": "Few-Professional-859",
            "body": "He will be very welcome in the US White House. This sub showed in my feed right under this cringe post https://www.reddit.com/r/Fauxmoi/s/4GjEzzNSgt",
            "score": 1,
            "replies": []
        },
        {
            "author": "Screambloodyleprosy",
            "body": "Isn't this the dude that played in the trad metal band Lord?",
            "score": 1,
            "replies": []
        },
        {
            "author": "bruceycat",
            "body": "This crap light sentences for rapists is a massive problem. The courts and judges should be held accountable",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wolfmuller",
            "body": "Bring back the death penalty for rock spiders!\nThey never rehab,just about always re- offend.\nThey destroy someone soul,so they should have there's destroyed in return!!!\nFUKN magget",
            "score": 0,
            "replies": [
                {
                    "author": "B0ssc0",
                    "body": "They should be confined to protect others. I don’t agree with the death penalty but.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "knowledgeable_diablo",
            "body": "Don’t wanna waste that precious jail space on pedophiles who rape their kids when there are so many non-violent drug users roaming the streets harming no one but potentially themselves.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Yung_Jack",
            "body": "Child offenders are treated so badly inside these facilities, he'll probably get lasagne put in his ass",
            "score": -30,
            "replies": [
                {
                    "author": "MRSAMinor",
                    "body": "Or he could be in a deeply segregated population. This idea that there's material justice performed by inmates is pure violent fantasy. First, every case and country is different, and second, every correctional facility does things its own way.\n\nAll we can do is monitor the hell out of these people who have a high risk of recidivism. The most important focus should be on educating and providing resources for extended monitoring and prevention.\n\nNo matter how long this dude is in jail, the people he's hurt are likely to suffer. I'm much more interested in making sure we're ready to return offenders to the general population without them victimizing anyone else.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "daybeforetheday",
                    "body": "No matter what a horrible person someone is, **rape is always wrong**. No one ever deserves it. No one.",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}