{
    "title": "It's officially the worst time of the year for Aussies, when Hass avocados disappear and Shepard are all you can get",
    "author": "Cooper_Inc",
    "subreddit": "australia",
    "rank": 6,
    "score": 1780,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 172,
    "url": "https://i.redd.it/kffx7sy3edpe1.jpeg",
    "id": "1jdwbc4",
    "selftext": "The worst. How they still exist and are on shelves escapes me. ",
    "comments": [
        {
            "author": "fraze2000",
            "body": "Are Shepherds the ones that are rock hard and stay that way until they suddenly go rotten?",
            "score": 665,
            "replies": [
                {
                    "author": "bassoonrage",
                    "body": "They scientifically known to only have a 14 min and 9 second period of ripeness before going off. They're pretty much the Mission Impossible briefcase of avocados.",
                    "score": 442,
                    "replies": [
                        {
                            "author": "Toby_O_Notoby",
                            "body": "Wasn't it Andy Warhol who said, \"In the future, every avacado will be ripe for 15 minutes\"? \n\nMan was a visionary.",
                            "score": 65,
                            "replies": []
                        },
                        {
                            "author": "a_can_of_solo",
                            "body": "They're basically like waiting for the NBN guy to show up",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "DoubleDecaff",
                                    "body": "~~Sorry~~ we missed you.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "elteza",
                                    "body": "The Australia Post of avocadoes",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "actionjj",
                    "body": "They honestly are not that bad, dependent on where you live.\n\nHass are great down in Victoria, and so Victorians wax lyrical about how good they are. Come up to Queensland and Hass go bad fast and get stringy and brown spots inside while the Shepherds up here seem to last longer. I ate Hass all the time in Vic, and Shepherd in QLD, maybe something to do with the humidity.",
                    "score": 92,
                    "replies": [
                        {
                            "author": "Heruuna",
                            "body": "I live in Central Queensland and I feel like Shepards hold up better too. Used to only buy Hass because everyone else said I should, but got so fed up with crapshoot quality and them being unusable after a couple days. More than once, I ended up with internally rotten Hass from the supermarkets. Ended up trying Shepards when it was only thing available, and was pleasantly surprised. I actually think Hass is too soft and mushy for me even when perfectly ripe...",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "XxLokixX",
                                    "body": "Like anything, I guess it depends on where you get them. We got a couple Hass avos early last week. We were going to have them in a dinner but didn't end up doing that, so I just ate one about 10 minutes ago as a snack. It was still perfectly ripe, no brown spots, not mushy. That's 6-7 days of ripeness, not to mention it would've been in the supermarket and transport for a day or 2. They definitely don't go unusable in a couple days",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cooper_Inc",
                            "body": "I'd smash brown spots any day over a Shep.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "actionjj",
                                    "body": "I’m sure plenty of people would be happy for you to eat the brown spots out of their Hass.",
                                    "score": 57,
                                    "replies": [
                                        {
                                            "author": "Waasssuuuppp",
                                            "body": "Lol",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Cooper_Inc",
                                            "body": "So I've heard",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "askvictor",
                    "body": "No. Shepherds are not meant to be spread like Hass. They are very tasty (IMHO have more flavour than Hass) when hard, you just need to slice instead of spread. And they have a much longer ripeness window than Hass, and don't bruise as easily.",
                    "score": 84,
                    "replies": [
                        {
                            "author": "Rizen_Wolf",
                            "body": "You write truth therefore I upvoted you. But we are a nation of smashers, for good or ill.",
                            "score": 50,
                            "replies": [
                                {
                                    "author": "askvictor",
                                    "body": "I, too, was once a smasher. And given Hass, I still smash. But I have seen that there is another way. And that way is good.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Rizen_Wolf",
                                            "body": "Good enough. I smashed a Shepherd today for breakfast, it was in its 3 minute ripe-smash window.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "An_Account_For_Me_",
                            "body": "Yes. Also, if you're used to Hass you can get a similar effect with a Shepherd in my experience: basically need to let Shepard go a lot more 'soft' before they're roughly equivalent and can be spread. But then they last much longer than a Hass does.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Europeaninoz",
                            "body": "I like them too!🤷‍♀️I eat them mostly in salads and they are great for that and don’t turn into a mushy mess.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Influence_4968",
                    "body": "Chuckem in the fridge when they ripen, you'll get a week of preserved ripeness.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "trowzerss",
                    "body": "And even if you do manage to get them at the perfect time, they still taste like shit.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "yolk3d",
                    "body": "Yes.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "wetmouthed",
                    "body": "The very same",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "mysqlpimp",
                    "body": "yes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OkBookkeeper6854",
            "body": "Would it be too much to ask for some proper toys inside? I am SO sick of the stupid wooden balls",
            "score": 539,
            "replies": [
                {
                    "author": "alpha77dx",
                    "body": "Do you know of a good anti fungal agent that I can use to kill the mould inside?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "OkBookkeeper6854",
                            "body": "I’m a book keeper not an anti fungal agent recommender. Good luck though.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "alpha77dx",
                                    "body": "Its okay, will try toilet cleaner.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lessons_learnt",
                    "body": "They really don't bounce very well either. Useless they are.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "EmperorJake",
                    "body": "My wooden ball wasn't even solid, it was hollow and squishy",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "aew3",
            "body": "I actually prefer shephards but they are damn hard to get ripe. You basically have to buy them a week before you want them and store them with your bananas. They also ripen evenly and more reliably then hass.",
            "score": 154,
            "replies": [
                {
                    "author": "Molladu",
                    "body": "Gotta get the sacrificial bananodes.",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "Bob_Spud",
                    "body": "And they don't turn black inside as easily as the wrinkled ones.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "great_red_dragon",
                    "body": "Yeah Hass always go off at the second corner",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Not_Not_Matt",
                            "body": "r/formuladank",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "decidedlyjo",
                    "body": "Yep! I find they ripen just fine alongside bananas though. Hass are terrible if you don't eat the whole thing and try to save some for later.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "askvictor",
                    "body": "You eat them harder than Hass.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "CHudoSumo",
                    "body": "Except they have practically 0 flavour.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "chellectronic",
                    "body": "and they don't oxidise as quickly, so you can bung half in the fridge and eat it in a day or two without the brown bits",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jammasterdoom",
            "body": "I like em.\n\n\\*ducks behind chair",
            "score": 146,
            "replies": [
                {
                    "author": "ockhams_beard",
                    "body": "Most problems with Sheps are user error. They're not Hass, and they [ripen differently](https://theconversation.com/whats-the-difference-between-hass-and-shepard-avocados-its-not-just-the-colour-233243). Once you master the Shep, they're brilliant!",
                    "score": 40,
                    "replies": [
                        {
                            "author": "gravityholding",
                            "body": "I like them too. I just buy a few at once to ripen, and then put them in the fridge as soon as they're soft... they last quite a while once you get them in fridge. Also, if you have left over guac, or only want half an avocado, they don't seem to go gross and brown nearly as quickly!",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "snowmuchgood",
                                    "body": "Was just going to say that. On the window sill to ripen, straight in the fridge and they last well.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RunningOutOfCharacte",
                            "body": "This is actually such a good read, thank you!",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "LoudTomatoes",
                            "body": "Yeah it took me a long time to figure it out, but now I prefer them to hass. I've spent the last couple of months desperately waiting for them to come back.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "alpha77dx",
                            "body": "Give us the shep cheat sheet?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ShreksArsehole",
                                    "body": "\"Shepard avocados are very soft when ripe. What might feel overripe when handling a Hass will likely be ideal ripeness if it’s a Shepard.\"",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "CrispyBirb",
                                            "body": "I opened one that was starting to get soft. Thought alright should be ready now. Nope. It was like rubber.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zeugma888",
                    "body": "So do I. They don't seem to bruise the way Hass avos do so you usually can eat the whole thing rather than having to chop out all the bruised bits.",
                    "score": 83,
                    "replies": [
                        {
                            "author": "Sufficient_Bat8057",
                            "body": "For real. The flavour isn’t quite as good as the hass, but no bruises makes up for it imo",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Pure-Mix-9492",
                                    "body": "Flavour may not be as good, but I do enjoy the texture of Shepherds more than Hass",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cooper_Inc",
                            "body": "You buy a hass possibly bruised for immediate consumption, or an unbruised hass in preparation for a perfect avo delight within 2 days. Shepard are powdery and always tasting, \"raw\".",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "decidedlyjo",
                                    "body": "I don't know about this powdery thing. Shepards don't go all mooshy and gross on you 0.2 seconds after you've cut them. If you actually let them ripen with some bananas, let them become tender, they're lovely.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kittensmittenstitten",
                    "body": "They’re literally the most delicious avocado. #imnotlikeotheravocados",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Touchthefuckingfrog",
            "body": "If it ain’t Hass then it is ass",
            "score": 172,
            "replies": [
                {
                    "author": "SlytherinPaninis",
                    "body": "I love this",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Touchthefuckingfrog",
                            "body": "I am not taking credit. Someone I love who knows me bought me a pin with this saying and I have since lost it.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "broccollinear",
                    "body": "If shepherd’s my avo, then I don’t want it bro",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Touchthefuckingfrog",
                            "body": "If it isn’t Hass then I pass?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jykaes",
            "body": "On the plus side, with a reduction in smashed avo on toast, the housing crisis should self-resolve.",
            "score": 22,
            "replies": [
                {
                    "author": "Okidokee321",
                    "body": "In this economic climate? Avocados will have to be gone for life 🤪",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "oneofakind_2",
                    "body": "No eggs to poach either. Time go buy a ranger and a jet ski.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_No_Juice",
            "body": "I used to be like you, but now I appreciate the consistent quality of a Shepard. Whilst Hass is a superior taste, their window of quality is much much smaller. I like the extra nuttiness as well.",
            "score": 46,
            "replies": []
        },
        {
            "author": "Porridge_Mainframe",
            "body": "This is our version of seasonal depression",
            "score": 48,
            "replies": []
        },
        {
            "author": "kortmarshall",
            "body": "What's the update on those huge eggplant sized avocados that the lady grew in Australia?",
            "score": 15,
            "replies": [
                {
                    "author": "hroro",
                    "body": "Involved in a mysterious plane crash. Big avo couldn’t have us normies knowing that such monstrous sizes are possible",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "LastLadyResting",
                    "body": "Jala avocados. You can buy the plants from various nurseries, but I don’t know if anyone is trying for a commercial crop yet.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Budget_Shallan",
            "body": "Public service announcement: Shepards stay green even when they’re ripe. \n\nYou can gently press the tops (where the stalk was); if it is soft, it is ripe. The rest of the avocado remains turgid and firm even when ripe and ready to go (just the way I like it).\n\nIf you think your Shepard still isn’t ripening fast enough, stick it in a plastic bag with a ripe banana. The ethylene gas oozing from the banana will speed up the ripening process.",
            "score": 14,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "They still taste shite when they're ripe.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Factal_Fractal",
            "body": "\"\n\n# It's officially the worst time of the year for Aussies",
            "score": 73,
            "replies": []
        },
        {
            "author": "mpfmb",
            "body": "No Hass and no Pink Lady.\n\nThis truly is the worst time of the year.",
            "score": 9,
            "replies": []
        },
        {
            "author": "dats420",
            "body": "What’s wrong with them I prefer them more green and gold",
            "score": 31,
            "replies": [
                {
                    "author": "slipslikefreudian",
                    "body": "They hard as rocks",
                    "score": 40,
                    "replies": [
                        {
                            "author": "dats420",
                            "body": "Like all avo’s when there not ripe",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "slipslikefreudian",
                                    "body": "These cunts are never ripe I could commit homicide with one",
                                    "score": 25,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dontlikeagoldrush",
                    "body": "they taste like glue",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ClassyLatey",
            "body": "Isn’t Hass an all year round avo??\n\nAlso - my local IGA had a million hass one evening and the next day they were replaced with Shepard.  What did they do with all the Hass??",
            "score": 6,
            "replies": [
                {
                    "author": "mangosteen_lover",
                    "body": "Hass are actually (rather oddly) available almost year-round. There’s just a 2 month period (around Feb-April) when they’re ‘out of season’, which is when Shepherds take over",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "theshaqattack",
            "body": "Shepard is underrated.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Morning_Song",
            "body": "Apparently Australia is the only country in the world that grows Shepards commercially. The rest of the world knows better",
            "score": 33,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "I hope this is true because I'm gonna be telling people as though it is true",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "mdem5059",
            "body": "Yeah, I bought one the other week.. I still have half in the fridge.\n\nTell me how the fuck the top half can be as hard as a rock but the bottom be mush. Fucking hell.",
            "score": 6,
            "replies": []
        },
        {
            "author": "lessons_learnt",
            "body": "Wake me up when Shephards end.",
            "score": 6,
            "replies": []
        },
        {
            "author": "rawker86",
            "body": "Literally every time we get an avocado: “I should try planting the seed, free avocados!”  \n\nI have meant to many times, I have tried once, I have not been successful.",
            "score": 11,
            "replies": [
                {
                    "author": "Royal_Acanthaceae693",
                    "body": "Unfortunately avocados hybridize every time they're pollinated and you never know what the result would be. All Hass are grafted.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "snowmuchgood",
                            "body": "Can someone skilled in plants tell me what this actually means? I have heard it before but don’t really get it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "h-ugo",
                                    "body": "They don't 'breed true' so it won't look or taste the same as the avocado you ate, you have to cut a bit of an avocado plant that exists and do a graft (basically a limb transplant for trees) onto some avocado roots you've grown. So when you grow from a seed you are taking a gamble on if the result will be good to eat or not (and they usually are not good to eat).",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zeugma888",
                    "body": "I've got one growing in a pot it'll be half a metre tall soon.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "rawker86",
                            "body": "Nice! I’m assuming you need a couple for them to produce fruit?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "zeugma888",
                                    "body": "I should check up on that. Also how old they have to.ve to fruit.\n\nThey are quite nice looking plants, if you've got space try one in a pot.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "chriswhitewrites",
                                    "body": "Just one I believe - there's one growing in a park near me that sets fruit with no companion nearby, although it could also depend on varieties, like it does with apples.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SpamOJavelin",
                    "body": "I have one grown from seed in Tasmania, in a pot. I just got a seed and just covered it with soil and watered it. It's close to a metre tall after two summers. But not being grafted means it will take much longer to produce any fruit. I will be taking it indoors this winter, I think the leaves were frost damaged last year.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "rawker86",
                            "body": "I’ve done the same with a lemon seed. I didn’t ever expect it to fruit and like you I never grafted it, but after about five years it’s started to bear fruit and the lemons are delicious. I’d heard that there was no guarantee the fruit would be similar to the original but I seem to have lucked out.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ozias_leduc",
            "body": "OH FUCK ME I went to buy a Hass avocado today and was faced with this shit. AvocadNO",
            "score": 4,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "Dunno if you're being sarcastic. But I did this same thing and didn't buy the Shepo today, one thing is not like the other",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ozias_leduc",
                            "body": "Not being sarcastic!! I also did not buy the Shepo haha. I've made that mistake too many times before! Your thread is very timely, I was complaining about this a couple of hours ago",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Cooper_Inc",
                                    "body": "I like you.   \nI've bought the shep sub so many times, it'll be fine, give it time. No. It's never fine. No time is enough. The shep sucks. I will die on this hill.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mysqlpimp",
            "body": "Aren't they the absolute worst, especially after the awesome season on the Hass",
            "score": 4,
            "replies": []
        },
        {
            "author": "chimpos",
            "body": "I’m glad someone else noticed.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Odd-Sprinkles6186",
            "body": "Strong agree",
            "score": 3,
            "replies": []
        },
        {
            "author": "PorkChop15",
            "body": "No way, I love Shepard and hate the Hass",
            "score": 3,
            "replies": []
        },
        {
            "author": "Oberyn_TheRed_Viper",
            "body": "My toddler is not going to be happy.",
            "score": 3,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "What's their thoughts? Cos I feel they will really nail the definition vs the rest of us (I'm not taking the P1$$)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Oberyn_TheRed_Viper",
                            "body": "If it doesn't look and taste exactly as it should, ie Hass, then he'll know and just flat out refuse. \"It's not the same\".  \n  \nHe's 4, that's the best explanation we're going to get.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Cooper_Inc",
                                    "body": "That should be their campaign",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "missmiaow",
            "body": "Shepards are great! You just have to keep an eye on them for ripening (same for Hass tho), and once ripe they keep in the fridge well and don’t go brown when cut!\n\nlove being able to eat part of an avocado and hav3 rest still look good later.",
            "score": 3,
            "replies": []
        },
        {
            "author": "imapassenger1",
            "body": "I had a Reed avocado, the ball shaped one, which has come from a local tree near Bega, NSW. Best I've tasted but never found it again as it's never in season when I'm there.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bangkok_Dave",
            "body": "Just waiting for the Jala to become more commercially widespread",
            "score": 2,
            "replies": []
        },
        {
            "author": "unconfirmedpanda",
            "body": "If you don't buy Hass, it'll taste like ass.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Slow_North_8577",
            "body": "Thank you! Shepard avos are absolute bullshit",
            "score": 2,
            "replies": []
        },
        {
            "author": "speterdavis",
            "body": "Well why don't I just eat fucking dirt",
            "score": 2,
            "replies": []
        },
        {
            "author": "mujum",
            "body": "Tastes like bloody wax as well 🤮",
            "score": 2,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "That half in the middle of the pic. The white part. I feel the whole damn avo tastes like that waxy white part",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "the68thdimension",
            "body": "Shepards are superior for their buttery texture and I will die on this hill.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Transientmind",
            "body": "I’m very amused that they’ve bought radio ads to try and convince us that green avocados aren’t gross through the power of, “no they’re good, actually! Really!”",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Recognition5047",
            "body": "Shepard avos are good though",
            "score": 2,
            "replies": []
        },
        {
            "author": "Okidokee321",
            "body": "💯%  Don't 👏🏽even👏🏽 get 👏🏽me 👏🏽started👏🏽",
            "score": 2,
            "replies": []
        },
        {
            "author": "Choosewisley54",
            "body": "Much prefer dat Hass! Old Shep is way too soft and sloppy. \nBtw, if you want to get any hard avocado ripe, put them in a brown paper bag at room temperature, and she'll be sweet in no time.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SandWitchBastardChef",
            "body": "Where’s the bacon variety",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mundane_Range3787",
            "body": "oh no, the good kind that...might be ripe by the time you get one. rather than rotten.",
            "score": 1,
            "replies": []
        },
        {
            "author": "superhypemusic",
            "body": "I had a good one like two times!",
            "score": 1,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "Probably only one really good time then",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IntsyBitsy",
            "body": "I'm just going to say it, I prefer shepard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UpTheRiffLad",
            "body": "Keep em in a paper bag with bananas. Bananas give off a gas called ethylene that makes other fruits ripen faster",
            "score": 1,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "It's not even about ripeness - even when ripe and good for the eating', they cut a fine line between being tasteless and powdery or just palatable",
                    "score": 1,
                    "replies": [
                        {
                            "author": "UpTheRiffLad",
                            "body": "Little seasoning never hurt anyone\n\n(Don't ask anyone who isn't European)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BGP_001",
            "body": "Buy Hass on sale, dice them, freeze them in individual portions. Works a treat.",
            "score": 1,
            "replies": [
                {
                    "author": "Cooper_Inc",
                    "body": "Really? This is the first time I've ever heard this is possible... gonna give it a try, thank you!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BGP_001",
                            "body": "Yep, really: https://imgur.com/a/SUpYUNK\n\nThaws fast, not quite as good as fresh but still bloody good. Welcome to the world of year round creamy avo!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "John_Johnson",
            "body": "Sucks, yeah... but at least in Woolworth you can get ripe ones. Coles only sells green rocks.",
            "score": 1,
            "replies": [
                {
                    "author": "VLC31",
                    "body": "I bought one from Woolworths that was supposed to be “use now” it was as hard as a blood rock.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DrSpeckles",
            "body": "I don’t mind at all. I leave them out till slightly starting to soften, then in the fridge. No issues at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiniSkrrt",
            "body": "God forbid you were planning to eat something that required an avocado that very day",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aus3-14259",
            "body": "Have you ever seen an advertisement that shows Jass avocado?\n\n\nI didn't think so.\n\n\nShepherd are proper Avocadoes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AccountantDistinct33",
            "body": "no way i thought it was just my local coles and woolies with no hass avos",
            "score": 1,
            "replies": []
        },
        {
            "author": "chezibot",
            "body": "I once tried to cook one to make it ripe. It didn’t work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible-Safety292",
            "body": "Preach",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedundantCapybara",
            "body": "Shitpards. It's a no from me, dawg",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iuvenesco",
            "body": "Bought a Shepard avo the other day, waited 3 days for it to be ripe for a guac. Tried and tried to mash it today and it absolutely refused. Tasted like underripe apple and so stringy. Straight in the bin and never again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Uruz94",
            "body": "I was so confused buying them the other day, thought they werent ripe lol even with a few days with the “eat now” sticker lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dazzling_Selection21",
            "body": "I didn’t get one good Hass avo last year, everyone of them was riddled with bruising. Shepherds all the way!",
            "score": 1,
            "replies": []
        },
        {
            "author": "nida_jaza",
            "body": "I'm not sure what's going on this season, but all 4 Shepard avos I've had recently have been ripe and creamy. All purchased from different places. We might be in luck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aishas_Star",
            "body": "I paid $5.50 for a rock solid shepherd yesterday. Not happy",
            "score": 1,
            "replies": []
        },
        {
            "author": "kjusielvi",
            "body": "No, Hass is trash.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pandifer",
            "body": "I always bemoan the end of Shepard season.  I much prefer them to Hass. Theyare fab in salads orsandwiches and love being paired with a dressing made from olive oil (lite in my case, dont like the taste of the full blown olives) pepper and salt.  Cutting or slicing is much more civilised than smashing.  UGH.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit_View_3656",
            "body": "Shepherd Avocados are underrated - they take longer to ripen but if you get your rotation right then it's fine (at least in south coast NSW).",
            "score": 1,
            "replies": []
        },
        {
            "author": "UndeadDragon",
            "body": "I thought the same but know I prefer them. They don’t bruise or oxidise as easily. The trick is to eat them when they feel ‘rotten.’ They have a thinner skin so when they feel like a rotten hass they are perfect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TelosLogos",
            "body": "Prefer shepherds to hass actually",
            "score": 1,
            "replies": [
                {
                    "author": "pulpist",
                    "body": "They're ok, but at $2.70 each in our local discount green grocers, fuck that for a joke.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emergency_Cherry_914",
            "body": "Shepherd is being used for guac for my chilli tonight.  It's fine if you add other flavours!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ResponsibleMethod69",
            "body": "I like them. They have a more cheerful colour and they're less stringy than Ass avocados",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwcounter",
            "body": "they suck for spreads but they make acceptable slices in a sando, given a sharp enough knife",
            "score": 1,
            "replies": []
        },
        {
            "author": "AussieGirl27",
            "body": "Honestly, they are the fetch of avocado's, stop trying to make them happen",
            "score": 0,
            "replies": []
        },
        {
            "author": "Oz_Dingo",
            "body": "When Hass is out of season, I just chew on a plastic bag, taste the same as a Shepard",
            "score": -2,
            "replies": []
        },
        {
            "author": "CactusWilkinson",
            "body": "Such a shame that these are the only two varieties that are readily available in this country. There’s so many others that would be incredible to access!",
            "score": 0,
            "replies": []
        },
        {
            "author": "MysticMungbean",
            "body": "\"Prime season for young & entitled Australians to ditch the smashed avo (on toast) and save for a little while, for a house deposit\"\n\n\n~ Spokesperson for Okay Boomer Federation ",
            "score": 0,
            "replies": []
        },
        {
            "author": "Footbeard",
            "body": "Eat seasonal",
            "score": -1,
            "replies": []
        }
    ]
}