{
    "title": "NSW psychiatrist quit when workload threatened patient safety, court hears",
    "author": "Expensive-Horse5538",
    "subreddit": "australia",
    "rank": 19,
    "score": 156,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.theguardian.com/australia-news/2025/mar/18/nsw-psychiatrist-quit-when-workload-threatened-patient-safety-court-hears-ntwnfb",
    "id": "1jdyp1q",
    "selftext": "",
    "comments": [
        {
            "author": "coniferhead",
            "body": "In Parramatta alone 2 mental hospitals will have been demolished to build University of Western Sydney campuses.\n\n* Rydalmere psychiatric hospital was allowed to fall into disrepair before becoming the Rydalmere campus.\n\n* Cumberland mental hospital - a perfectly functioning facility - is slated for demolition to build yet another.\n\nUWS doesn't need more university campuses - they already have 13.",
            "score": 70,
            "replies": [
                {
                    "author": "AlooGobi-",
                    "body": "A lot of their exams are online, some classes can be taken online and even lectures are recorded and uploaded online. All of my exams last year were online. 13 campuses is excessive, I’ve not heard of other universities having satellite campuses of that degree. ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "joshlien",
            "body": "If anyone is wondering, it's worse now, and patients are being subjected to unfair and grossly inadequate conditions. The government continues to state they are \"unable\" to come up with the funds to resolve the situation.",
            "score": 22,
            "replies": [
                {
                    "author": "cojoco",
                    "body": "> The government continues to state they are \"unable\" to come up with the funds to resolve the situation.\n\nHow do we get a government which makes provision of lifesaving services the priority we all know it should be?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "An_Abyss_",
            "body": "\"In January, 206 psychiatrists in NSW threatened to resign: 62 have resigned, while others await the IRC outcome.\" That's so fucking dire.",
            "score": 6,
            "replies": []
        }
    ]
}