{
    "title": "Tens of thousands of children attend childcare centres that fail national standards",
    "author": "Kangaroo-Poo",
    "subreddit": "australia",
    "rank": 10,
    "score": 28,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/australia/comments/1jeg70b/tens_of_thousands_of_children_attend_childcare/",
    "id": "1jeg70b",
    "selftext": "https://amp.abc.net.au/article/105062514\n\n\nVisas available now in Australia for untrained people from overseas with bogus qualifications ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This post has been marked as non-political. Please respect this by keeping the discussion on topic, and devoid of any political material. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/australia) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "hoopnet",
            "body": "As someone who worked as union organiser in the early childhood education sector, I can confirm that the best centres were the council run centres. The for-profit ones were awful to workers which always then impact the children, whereas that was in ratio numbers, facilities, turnover ect. We need to get for-profit centre, our children are too important!",
            "score": 25,
            "replies": [
                {
                    "author": "Kangaroo-Poo",
                    "body": "Have you watched the 4 Corners show. I can’t believe the child abuse. It’s distressing to say the least and I’ve seen a lot over 33 years of nursing.\nIt’s the same as the aged care system . Backed by equally incompetent regulators and a government who doesn’t care. \nThese people employed here are only here for a visa not because they want to care for children.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Intro_Vert00",
            "body": "Unfortunately, in today’s world, it seems you can no longer rely on anyone but yourself to care for your children, loved ones with disabilities, or aging parents.\n\nThere are individuals who show little regard for others, and both private and government-run care providers often prioritize profits over the well-being of those they’re supposed to support. It’s deeply troubling how corrupted these industries have become, leaving vulnerable people at risk.",
            "score": 2,
            "replies": [
                {
                    "author": "Kangaroo-Poo",
                    "body": "It’s the governments fault for not funding government run child care centres. Watch the program and see how many multi millions these owners are making. It’s an industry not a calling for these people.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}