{
    "title": "How come wing root engines aren’t as common?",
    "author": "real_pasta",
    "subreddit": "aviation",
    "rank": 4,
    "score": 1343,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 202,
    "url": "https://i.redd.it/o4bwqnlzwgpe1.jpeg",
    "id": "1je7uxu",
    "selftext": "How come you don’t see this type of engine configuration that often? Is it just due to maintenance or are there other downsides as well?",
    "comments": [
        {
            "author": "Mr_Chode_Shaver",
            "body": "They're low bypass and loud as hell,  harder to service, more vibration on the wing-fuselage joint, and intrude on fuel capacity.\n\n  \nBut they do look super cool.",
            "score": 2114,
            "replies": [
                {
                    "author": "Nikon_D750",
                    "body": "Hard to service is an understatement",
                    "score": 689,
                    "replies": [
                        {
                            "author": "Gripen-Viggen",
                            "body": "I knew a tech who would just nope on these.\n\nHe was a slight statured guy who would literally crawl into jet engines (early jet days) and said he'd just had it with this configuration.\n\nBasically, he said you couldn't service them without breaking something else in the process.",
                            "score": 315,
                            "replies": [
                                {
                                    "author": "SocraticIgnoramus",
                                    "body": "This is also a common complaint on a lot of low bypass or pure turbojet engines in U.S. military service. I understand the A-10 to have been similarly difficult to service despite being a turbofan, mechanics often said they had to work purely by feel owing to very tight spaces.",
                                    "score": 105,
                                    "replies": [
                                        {
                                            "author": "MarshallKrivatach",
                                            "body": "Dunno what you are talking about, the A-10's TF34s are some of the easiest engines in the fleet to service since they are fully accessible by opening a door.\n\nThey are as easy to access as a CRJ or any similar rear engine airliner.",
                                            "score": 47,
                                            "replies": [
                                                {
                                                    "author": "cbarnett97",
                                                    "body": "Same engine as a CRJ except for the stuff to allow inverted flight",
                                                    "score": 20,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SocraticIgnoramus",
                                                    "body": "Fair enough. I’ve never worked on any aircraft, can only go by what some of my buddies have said in the past.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Battlejesus",
                                                            "body": "I worked on helicopters in the U.S. Army. The Kiowa was kind of a pita, and the t55s on the Chinook sucked for many reasons, accessibility wasn't one. The Blackhawk and Apache powerplants were modular and stupid easy to work on.",
                                                            "score": 10,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Gutter_Snoop",
                                                            "body": "Might be some of the other stuff that's a pain to work on, not the engines. When your goal is to make the smallest target you can, I'd think a lot of stuff would end up stuffed in very small spaces. Especially since it's a nearly 50 yr old design that's likely gotten some edits through the decades.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "the_last_third",
                                            "body": "I am not maintainer but for a attack a/c the A-10 engines are about accessible as it gets.",
                                            "score": 48,
                                            "replies": [
                                                {
                                                    "author": "snjcouple",
                                                    "body": "Definitely",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "_Californian",
                                            "body": "I'm just avionics on the A-10 but I've helped engines out a few times, they're super quick to take off the aircraft. Also the cowls(?) Open up and you can get to most of the components pretty easily with it mounted on the jet, beyond that idk.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Specialist_Reality96",
                                            "body": "That's just combat aircraft things, commercial aircraft are vastly different as down time is money.\n\nFrom direct experience the difference between a pig (F-111) and an Orion which was based on an airliner was significant.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "xlRadioActivelx",
                                                    "body": "Not always the case, try changing a VSV actuator on a CFM engine, good fuckin luck, unless extra extra small gloves fit you loosely you’re not going to be able to reach most of it",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "xlRadioActivelx",
                                            "body": "As an aircraft mechanic who has worked on 400 seat passenger aircraft, attack helicopters, float planes and lots in between… you are often working by feel alone. So often I can either see that I’m working on, or get my hands on it, but not at the same time, and sometimes you can’t see it at all.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "OriginalGoat1",
                                    "body": "I’ve heard of F-5 techs having to crawl into the engine intake.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "widgeamedoo",
                            "body": "Can someone tell me where the wing spars run on this sort of configuration?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "LightningGeek",
                                    "body": "[The spare works the same as any other wing spar, but it has holes in so the engines can be slid in and out of position.](https://www.candemuseum.org/sites/default/files/archives/marville/photos/planes/comet-9.jpg)\n\n[Mentour pilot mentions it in one of his videos as well.](https://youtu.be/-DjnG74DDno?t=725)",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "747ER",
                            "body": "Most fighter jets have engines embedded in the fuselage that simply slide out; surely it wouldn’t be too difficult to do the same for an airliner?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Prof01Santa",
                                    "body": "Nope. Wing roots are some of the most highly stressed & lowest lifed parts of an airframe. Punching tunnels through the spars were no longer practical once bypass ratios got past 1.\n\nThis was even less desirable once designers figured out that engines on pylons would __reduce__ wing root stress.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "747ER",
                                            "body": "Thanks, I appreciate your answer!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Vast-Combination4046",
                                    "body": "You gotta get the engine in somehow, might as well make it simple for service. It's not like you don't have to do routine maintenance on them..",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "747ER",
                                            "body": "True, but fighter jets also require routine maintenance :)",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Catholic_AMT",
                                                    "body": "In the words of a buddy of mine who's an F-15 propulsion tech; \"fighters fucking suck\" [to work on].",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "F1Avi8or",
                    "body": "From a pilot perspective, if an engine catches on fire, I’d rather it be on a pylon than in my wing.",
                    "score": 356,
                    "replies": [
                        {
                            "author": "Yoghurt42",
                            "body": "Engine on fire! You must construct additional pylons!",
                            "score": 199,
                            "replies": [
                                {
                                    "author": "imanAholebutimfunny",
                                    "body": "*zerg rush intensifies*",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "seanular",
                                            "body": "Ļ̵̢̛̜̱̘͇̪̭̅̅̏̂̌̈̈́̊̈̃͋̓̃͆̏̀̓̑̾̀̃̈́̄͑̿̓̈́̚͝͝ͅį̷̹̞̺͍̰͕͖̝̪͍̦̖͕͖̟͙̹̇̄̋̅̍͐̏̅̊̃̇̽̓̾̂̊́̓̕̕̕͘͠͠ͅv̷̤͇̫͙̠͂̃̏̓̇̐̈̓̈́̋̀̄̉́́̅̌̃̒̍͐͑͂̈́̔̽̇̚͠͝ͅͅę̸̗̞̥͎̺͕͎̞̘̪̻̘̘̦͕̗̭̜̭̼̮̬̹̹̫͋́̏͑̔͛̕͘͜͜͝ ̶̢̢̢̹͙͚͖̪̝̯̲͔̪̠̰̹̗̞̹̼̰̪̦͈̱͎͙̯͗̒̃̽͊̀͆̒̈́̏̅ͅf̸̡̨̧̧̖̖̟̖̤͖̤͉̲͕̥͙͇̼͈͓̥̦͙̠̹̜̖̿͗̈́̅̎͗̇̄̈́̆̈́̋̏͜͠ǫ̷̧̧̨̻̗̰̦̭̞̮̹̯̗͈͓̪̻̞̻̬̭̉̋̊̈́̋̑͑̋̇̀͛̀̏͒̏̕͘͝r̷̨̰̼͉̜̮̩̱̥̪̰̞̰̫̳̠̼̩̼̜̽̀͆́͆͗̃̄̉͛̑̽̕͝͝ͅ ̵̢͙̭̭̦̮̳̯̙̺̝̰̺̠̳͎̟̫͔̋͜͜͝ͅţ̶̛̭͇̥̫̣̠̯̲̩̖͔͈̮̩̳̽̋̿͐͛̈́̎̉̌̆̇͆͊͐̅̏̚̚͠͝h̶̡̛͎̞̗̩͖̦͙̘͔͖̪̹̱͎̭̰̲̩͎̰̳̗̙͖͓̺̑̿́́̃͆̈́̃̓̉̃̀̋̈̋̆̋̌͌̃̉̿̌͋͌̂͝͠͠ͅè̴̛̯̣̗̦͇͖͙̱̦͇͍̝͙̪̭̥͓͕̇͛̋̀̎̓͊̀̄͐̅̇̽̈͋̈̐͐̋͛͋̎͝͝ ̵̧̡̢̣͉͈͙͙̦̫͈̼͔͎͍̜̘̺̜͉̘̲̳͊̀̊̂̋̈́̓̍̈́͋̋̋́̀̋͗̆͂́̈́͛̈̌̅̃̚͜͠ͅͅs̵̨̢̛̹̹͖̺͓͉̰͍̝͈͎͙͖͓̺̝͓͕̠̲͍̐̂̈́̋͜͠͝w̶̢̢̭̗͎̜̫̥͖̟͓̖̘̬͓̆̑͋̍͌̄͐̑̈́̑̑̈́̒̆̈́̕͝͝͝͠a̸̧͇̟̘̭̺͈̤̬̗̲̟̲̝͙̤͇̙̬̖͎̬̅̔̆̑̓͒̋̌̀͂̀̊̿͆̅̒̑̕̕̕͝r̴̡͚̣̆̂̓͋͂͝m̵̢̧̧̛̛͓͍̭̹̟̰̫͙̩̻̱̫͉͍̰̏̂͂͊̈̏͆̇̔͌̈́̀̈́̂̈́̋̔̏̈́͐̄͑̕͘",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "seanular",
                                            "body": "Ļ̵̢̛̜̱̘͇̪̭̅̅̏̂̌̈̈́̊̈̃͋̓̃͆̏̀̓̑̾̀̃̈́̄͑̿̓̈́̚͝͝ͅį̷̹̞̺͍̰͕͖̝̪͍̦̖͕͖̟͙̹̇̄̋̅̍͐̏̅̊̃̇̽̓̾̂̊́̓̕̕̕͘͠͠ͅv̷̤͇̫͙̠͂̃̏̓̇̐̈̓̈́̋̀̄̉́́̅̌̃̒̍͐͑͂̈́̔̽̇̚͠͝ͅͅę̸̗̞̥͎̺͕͎̞̘̪̻̘̘̦͕̗̭̜̭̼̮̬̹̹̫͋́̏͑̔͛̕͘͜͜͝ ̶̢̢̢̹͙͚͖̪̝̯̲͔̪̠̰̹̗̞̹̼̰̪̦͈̱͎͙̯͗̒̃̽͊̀͆̒̈́̏̅ͅf̸̡̨̧̧̖̖̟̖̤͖̤͉̲͕̥͙͇̼͈͓̥̦͙̠̹̜̖̿͗̈́̅̎͗̇̄̈́̆̈́̋̏͜͠ǫ̷̧̧̨̻̗̰̦̭̞̮̹̯̗͈͓̪̻̞̻̬̭̉̋̊̈́̋̑͑̋̇̀͛̀̏͒̏̕͘͝r̷̨̰̼͉̜̮̩̱̥̪̰̞̰̫̳̠̼̩̼̜̽̀͆́͆͗̃̄̉͛̑̽̕͝͝ͅ ̵̢͙̭̭̦̮̳̯̙̺̝̰̺̠̳͎̟̫͔̋͜͜͝ͅţ̶̛̭͇̥̫̣̠̯̲̩̖͔͈̮̩̳̽̋̿͐͛̈́̎̉̌̆̇͆͊͐̅̏̚̚͠͝h̶̡̛͎̞̗̩͖̦͙̘͔͖̪̹̱͎̭̰̲̩͎̰̳̗̙͖͓̺̑̿́́̃͆̈́̃̓̉̃̀̋̈̋̆̋̌͌̃̉̿̌͋͌̂͝͠͠ͅè̴̛̯̣̗̦͇͖͙̱̦͇͍̝͙̪̭̥͓͕̇͛̋̀̎̓͊̀̄͐̅̇̽̈͋̈̐͐̋͛͋̎͝͝ ̵̧̡̢̣͉͈͙͙̦̫͈̼͔͎͍̜̘̺̜͉̘̲̳͊̀̊̂̋̈́̓̍̈́͋̋̋́̀̋͗̆͂́̈́͛̈̌̅̃̚͜͠ͅͅs̵̨̢̛̹̹͖̺͓͉̰͍̝͈͎͙͖͓̺̝͓͕̠̲͍̐̂̈́̋͜͠͝w̶̢̢̭̗͎̜̫̥͖̟͓̖̘̬͓̆̑͋̍͌̄͐̑̈́̑̑̈́̒̆̈́̕͝͝͝͠a̸̧͇̟̘̭̺͈̤̬̗̲̟̲̝͙̤͇̙̬̖͎̬̅̔̆̑̓͒̋̌̀͂̀̊̿͆̅̒̑̕̕̕͝r̴̡͚̣̆̂̓͋͂͝m̵̢̧̧̛̛͓͍̭̹̟̰̫͙̩̻̱̫͉͍̰̏̂͂͊̈̏͆̇̔͌̈́̀̈́̂̈́̋̔̏̈́͐̄͑̕͘",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SoyMurcielago",
                                    "body": "Do we require additional vespene gas?⛽️",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Nice_Classroom_6459",
                                            "body": "No, but you must construct additional pylons.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "theaviationhistorian",
                                    "body": "For Auir!",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "SpontaneousKrump92",
                                            "body": "En Taro, Adun!",
                                            "score": 20,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Metallifan33",
                                    "body": "[https://youtu.be/T4Ox2t5c4As?si=hqOjbjiXxeRd5glc](https://youtu.be/T4Ox2t5c4As?si=hqOjbjiXxeRd5glc)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LateralThinkerer",
                            "body": "More that that, you can find plenty of cases where a pylon-mounted engine has grenaded (and a few where it's fallen off completely) with the aircraft able to make an emergency landing.  That's not going to happen if it shears the wing spars and perforates wing tanks as it makes a firey exit.",
                            "score": 64,
                            "replies": []
                        },
                        {
                            "author": "ficzerepeti",
                            "body": "From a passenger perspective, if an engine catches on fire, I’d rather it be on a pylon than in my wing.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "sherzeg",
                                    "body": ">From a passenger perspective, if an engine catches on fire, I’d rather it be on a pylon than in my wing.\n\nNot to worry. FAA regulations require two wings so that you always have one in the case of an incident.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "buldozr",
                                            "body": "True, you just engage a prayer and come back in.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Funkytadualexhaust",
                            "body": "Would be crazy if you could safely jettison one in flight, lol",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "elvenmaster_",
                                    "body": "And shifting the balance of the aircraft by several tons. Not (always) unrecoverable, but you don't want to be in the plane when this occurs.\n\nNot to mention these several tons landing uncontrollably somewhere, potentially on inhabited area since quite a lot of engine issues occur at low altitude, close to the airport.",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "Gripen-Viggen",
                                            "body": "That's a Donnie Darko scenario.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "wally-whippersnap",
                                            "body": "Yeah, this ain’t SpaceX.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "Miixyd",
                                                    "body": "Believe it or not SpaceX is the company with the most controlled landings ever. Usually rockets become ecosystems for fish",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "DietCherrySoda",
                                                            "body": "Really, SpaceX? I would have thought American Airlines or something.",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Croaker-BC",
                                                            "body": "Poland says hello ;P",
                                                            "score": -9,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Chipdip88",
                                            "body": "Well, problem one is solved by just simply ditching the engine on the opposing side at the same time. No imbalance!\n\nAlthough..... That does cause problem #2 that you mentioned to be exactly twice as bad so.....",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "ShaemusOdonnelly",
                                                    "body": "It's not only about the lateral imbalance, but also longitudinal. If your near the rear CG limits and and an engine located in front of the CG is ditched, that can put you out of the envelope.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Yuukiko_",
                                                    "body": "clearly we should rig all the engines with explosives so that we can detonate them in mid air in case we have to jettison them",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Lampwick",
                                            "body": "> shifting the balance of the aircraft by several tons. Not (always) unrecoverable, but you don't want to be in the plane when this occurs.\n\nYep, this config was unintentionally tested by American Airlines flt 191 in 1979 with a DC-10. [Didn't work out great in that particular instance...](https://upload.wikimedia.org/wikipedia/en/5/53/Aa191_ohare.jpg)",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Funkytadualexhaust",
                                            "body": "Hey now,  I qualified my statement with safely and crazy!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Go2FarAway",
                                    "body": "Bolts are breakaway",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Prof01Santa",
                                    "body": "Brilliant. Zero weight bay doors & fail-safe bomb shackles for prime reliable engine mounts. Why didn't we think of that?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "theaviationhistorian",
                            "body": "Worst case scenario with pylon, engine drops from pylon.\n\nWorse case scenario here, plane turns into Roman candle.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "CrazyCletus",
                                    "body": "[American Airlines Flight 191](https://en.wikipedia.org/wiki/American_Airlines_Flight_191) would like to disagree with your first point.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "theaviationhistorian",
                                            "body": "American Airlines Flight 191 happened because of improper maintenance of using an adhoc forklift which caused extra fatigue on the rear bolts of the pylon. This is what caused the engine to swing upwards and rip off along with the wing hydraulics.\n\nEngines are supposed to safely detach from the pylon when they become unstable, such as [Kalitta Air flight 825.](https://asn.flightsafety.org/wikibase/322526)",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "CrazyCletus",
                                                    "body": "I understand that. The normal scenario would be for engines to safely detach from the pylon when they become unstable. In the worst case scenario (and I don't think it's recurred in the almost 46 years since it happened), the pylon detaches during takeoff, dooming the plane. That's what a worst-case scenario is all about.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "LightningGeek",
                                                    "body": "Except the engines don't always detach cleanly, [see El Al Flight 1862, where the No.3 detached, damaged the leading edge and then went into the No.4 engine.](https://en.wikipedia.org/wiki/El_Al_Flight_1862)\n\nAlbeit, this was a freak accident, and I do agree with your original comment that wing root engines are more dangerous with uncontained engine failures.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Far_Dragonfruit_1829",
                                            "body": "My father flew investigations regarding if the DC-10 was recoverable under the accident conditions. They concluded that it was, but that the time available to recognize the situation and reconfigure was very short, on the close order of five seconds.\n\nAnd, like most aviation disasters, there were multiple causes combining to cause the loss. In particular, the integral wing spar at the front of the wing tank, which had the relevant hydraulic lines exposed ahead of the spar, instead of behind the spar, in front of the tank.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "jawshoeaw",
                            "body": "right? what other dumb places can we put combustion? cockpit? baggage compartment?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "freneticboarder",
                                    "body": "Pressure vessel, passenger cabin...",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "superspeck",
                                    "body": "Lavatory wastebasket…",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NF-104",
                            "body": "Plus, if the engine suffers an uncontained failure, the farther it is from the wing structure, the better.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Mulligey",
                            "body": "On the flip side, if u eat a bird and lose an engine but don’t get a fire, the engines being closer to the fuselage means asymmetric thrust is less of an issue. It’s all trade offs",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MultiGeek42",
                                    "body": "I think a slightly bigger rudder is a far better solution.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NoShirt158",
                            "body": "I know right. Just jettison that thing into the Atlantic! \n\nCant do that with your wing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "theaviationhistorian",
                    "body": "TBH, it was cool when the Royal Navy modified them with RR BR700 turbofans. But the Nimrods had too many problems to keep them around.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "LightningGeek",
                            "body": "The Royal Navy had nothing to do with the Nimrod MRA.4 modifications. That was all done by BAe due to the RAF requesting a newer/improved Maritime Patrol Aircraft.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "r0verandout",
                            "body": "MR2s maybe, pretty much the only commonality for the MRA4 was the relifed cigar tube. And the name, which might have been the final nail in the coffin. But at least the UK got to spend another £3bn to buy the same capability from the US...\n\nI'm still bitter!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RealRedditModerator",
                    "body": "Also, you have a hole going straight through your wing, which means you sacrifice rigidity in the wing itself.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Bobbytrap9",
                            "body": "The loss in rigidity is compensated for by structural design. But to make it stronger they need to add more weight.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mpokora",
                    "body": "Can you explain what you mean by 'low bypass'? Thanks!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Mr_Chode_Shaver",
                            "body": "[https://en.wikipedia.org/wiki/Bypass\\_ratio](https://en.wikipedia.org/wiki/Bypass_ratio)",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "DesiArcy",
                            "body": "All of the aircraft with wing root engines have had either turbojets or low bypass turbofans. There isn’t really ROOM in the wing root for the comparatively enormous frontal fan of a high bypass turbofan.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "everfixsolaris",
                    "body": "The moment (rotation) generated by having under wing engines significantly increases fuel efficiency.  Planes naturally want to pitch down and a large elevator is wasteful.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LigerSixOne",
                    "body": "Surely the spar engineering is an issue as well.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "drrhythm2",
                    "body": "Umm also if one throws a turbine blade that’s bad. Or catches fire as previously mentioned.  Or any number of other issues.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HadTyphus-GotBanned",
                    "body": "I can’t stop thinking about his Chode. \n\nThank you for the concise answers!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Voltron6000",
                    "body": "Also, if they fail, you lose the entire wing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Qikslvr",
                    "body": "They also tend to take the wing with them when they fail. Modern jets can fly with one engine but not with one wing. \n\nBut they do look cool as hell.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Arctica23",
                    "body": "The low bypass thing is important, you lose so much efficiency this way",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Stunning-Screen-9828",
                    "body": "F-14s and A-6 Intruder's didn't even look cool, but they sounded cool on approach.  Way, way different than a cruising F-4.  Or far different than an F-15 or an F-18 cruising by. ",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Stunning-Screen-9828",
                    "body": "Hey, F-111's and RA-5Ç's have bomb bays that are big like with F101s, F-105s and F-106s, so a billionaire could buy one, put in chairs & a table, maybe.  Especially, if there's hardly any FAA (NTSB) around.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zerbey",
            "body": "Modern engines wouldn't fit, and we've learned it's far simpler to have them hanging off the wing when it comes to maintenance. Gorgeous jet, though.",
            "score": 266,
            "replies": [
                {
                    "author": "flactulantmonkey",
                    "body": "Haha they do look so goddamn cool right?",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Quality_Cabbage",
                            "body": "The Handley-Page Victor is the best looking of this type of aircraft.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Schnitzelschlag",
            "body": "Turbofans are too big to fit there.",
            "score": 428,
            "replies": [
                {
                    "author": "Stoney3K",
                    "body": "And you need another place to put the fuel.",
                    "score": 160,
                    "replies": [
                        {
                            "author": "FarButterscotch4280",
                            "body": "Put the fuel on pylons below the wing.",
                            "score": 97,
                            "replies": [
                                {
                                    "author": "plastimanb",
                                    "body": "mmm gimme some droptanks.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Horror-Raisin-877",
                                    "body": "🤣",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RaccoNooB",
                                    "body": "Beat me to it",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "Far_Dragonfruit_1829",
                                    "body": "Innovative!!",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Yoghurt42",
                            "body": "just make the wings a lot thicker, duh! Solves both problems. /s",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "UFO64",
                            "body": "Add a second wing.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mjordan73",
                    "body": "Definitely limiting but not impossible. They re-engined the Nimrod with more modern engines (for the MRA4 version that was ultimately scrapped) but only managed to shoehorn what are basically business jet turbofans in there (RR BR710, which are of the same family that will eventually be fitted to the B-52).",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Militant_Worm",
                            "body": "Man, really wished the MRA4 version could have survived.\n\n\nGrew up around Nimrods at St Mawgan and then Kinloss and couldn't get enough of them.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "mjordan73",
                                    "body": "I grew up under the approach to BAe Woodford where they were made and even got to see the similarly ill-fated AEW3 version on a near-daily basis for the few years that was in development.  I've got some pictures somewhere of the MRA4s on the tarmac there a day or so before the official cancellation came through and they were swiftly smashed to bits.  Very sad day as that was basically it for the site too (its a housing estate now).\n\nWoodford didn't get the MRA4 refit work initially until someone realised the existing fuselages were basically all one-offs of slightly different sizes here and there and that it wouldn't be as easy to refit them as initially thought.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "-Space-Pirate-",
                                    "body": "I sat under the approach at Kinloss and watched nimrods come in 30ft above my head. As a kid my mind was blown. Amazing aircraft.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Realistic-Muffin-165",
                                            "body": "Theres still one there on display just inside the perimeter fence.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hot_Net_4845",
            "body": "They look sleek, but god forbid you need to do maintenance.\n\nThis thread has quite a bit of information:\n\nhttps://www.secretprojects.co.uk/threads/podded-engines-intakes-and-wingroot-intakes-can-they-still-be-relevant-today.35041/",
            "score": 111,
            "replies": []
        },
        {
            "author": "Toombu",
            "body": "I've also heard that wing root engines can become quick detachable wings in the event of catastrophic engine failure.",
            "score": 46,
            "replies": [
                {
                    "author": "freneticboarder",
                    "body": "Quick release wing assembly?",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "SensitivePotato44",
            "body": "Really complicates the wing spar design. Also needs a lot of armour to prevent red hot engine fragments from getting into the passenger cabin in the event of an engine failure",
            "score": 72,
            "replies": [
                {
                    "author": "discombobulated38x",
                    "body": "For what it's worth you'd need that armour if a modern turbofan goes bang in the same way",
                    "score": 19,
                    "replies": [
                        {
                            "author": "pjakma",
                            "body": "The big problem is fire really. An engine in a separated pod has at least that pylon's worth of separation from the wing and rest of the structure. An engine inside a wing-root bay, or even a bay directly attached to the wing, does NOT.",
                            "score": 49,
                            "replies": []
                        },
                        {
                            "author": "suredont",
                            "body": "I'd expect that an engine close to the cabin would hit it with many more fragments than an engine hanging from the wing would. Just as a matter of percentage of arc.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "discombobulated38x",
                                    "body": "Oh definitely, but a third of a disc is a third of a disc, and will do catastrophic damage if it smashes through the fuselage.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "discombobulated38x",
                                    "body": "Oh definitely, but a third of a disc is a third of a disc, and will do catastrophic damage if it smashes through the fuselage.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "482Cargo",
                            "body": "Nonsense",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "discombobulated38x",
                                    "body": "Er, it very much isn't nonsense.\n\nIf the casings can't contain the failure then a hangar wall and the wall of the hangar next to it likely won't contain the debris.\n\nSee also uncontained failures on 737s killing passengers in the last decade.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "mz_groups",
                                            "body": "Modern turbofans are designed so that the fan cowl serves as the \"armor\" to contain blade failures. In fact, they are tested to show that the cowl will contain a blade failure. Here is video of such a test.\n\n[https://www.youtube.com/watch?v=l8jgGoTc1Fc](https://www.youtube.com/watch?v=l8jgGoTc1Fc)\n\nIf you're referring to SWA 3472 or 1380 (the only two accidents that come up in the 2010s when I search \"737 uncontained engine failure\"), neither one was \"uncontained\" in that the fan containment was not breached. In fact, the SWA 3472 final report specifically says, \"The fan case had no through-hole penetrations and showed no evidence of an uncontainment.\" Also, SWA 1380 is commonly, but erroneously, described as an uncontained failure, despite being, by FAA definitions, a contained engine failure. Subsequent damage to the cowl caused a piece of it to impact the fuselage, which led to airframe damage and decompression that resulted in the death of one passenger.\n\nLet me quote the SWA 1380 investigation report:\n\nFAA Advisory Circular (AC) 33-5, “Turbine Engine Rotor Blade Containment/Durability,” was issued on June 18, 1990, to provide guidance on acceptable design and test methods for compliance with Part 33 requirements regarding turbine engine fan blade containment. According to the AC, “contained” was defined as “no fragments are released through the engine structure, but fragments may be ejected out of the engine air inlet or exhaust.” Also, the AC defined “engine structure” as the “structure surrounding the main rotors and extending from the forward-most case flange through the rear-most flange, as defined by the type design.” In addition, the AC provided the engine configuration, conditions, and acceptable results for fan blade containment tests.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "discombobulated38x",
                                                    "body": ">Modern turbofans are designed so that the fan cowl serves as the \"armor\" to contain blade failures. In fact, they are tested to show that the cowl will contain a blade failure.\n\nI am aware. It doesn't always work though, and it's absolutely impossible for a fan disc to be contained by the casing. These old slim jim engines had the same containment requirements, engineers didn't just suddenly wake up in the 70s and realise containing fan blades would be a good idea. And before anyone says \"but discs are designed not to fail\", that is 1) Not correct (extremely remote =/= never) and 2) doesn't guarantee they don't (see QF32 and AF66 for two highly publicised recent examples). \n\n>If you're referring to SWA 3472 or 1380 (the only two accidents that come up in the 2010s when I search \"737 uncontained engine failure\"), neither one was \"uncontained\" in that the fan containment was not breached. \n\nTechnically yes, neither were uncontained. However both generated high enough energy secondary debris to penetrate the fuselage, and in one case cause a death as a result. Both of those failures, had they occurred during an FBO test, would have constituted a failure of an FBO test. The FAA ordered Boeing to redesign the parts responsible for the failure chain.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "482Cargo",
                                            "body": "Modern engines are required to be able to contain their debris and are tested to do so. All the recent failures of the most recent generations of GE, CFM, RR and P&W engines, none of which were uncontained, are testament to this.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "discombobulated38x",
                                                    "body": "Ooof, ya really want to claim QF32 (RR), AF66 (GE/PW) and Southwest 1380/3472 (CFM) were all contained?\n\nThose are just the well publicised ones, all on modern engines.\n\nI can 100% assure you that while failed blades must be contained, and uncontainable components such as discs must be shown to be extremely unlikely to fail, neither of those things are a guarantee.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "482Cargo",
                                                            "body": "None of those are the latest generation of engines. All those engines were developed in the 90s",
                                                            "score": 0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "482Cargo",
                                                            "body": "None of those are the latest generation of engines. All those engines were developed in the 90s",
                                                            "score": 0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "482Cargo",
                                                            "body": "None of those are the latest generation of engines. All those engines were developed in the 90s",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "discombobulated38x",
                                                                    "body": "The certification regs for turbine engine debris containment are broadly unchanged between 1990 and now. Those engine types are continually  reassessed to the regs as they are today.\n\nThe technology in the discs has broadly not changed in 3 decades.\n\nThey are statistically as safe as an engine being designed in the 2020s.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "482Cargo",
                                                                            "body": "But the technology has marched on. Note that the recent CFM Leap, RR Trent XBW and PE GTF failures had no parts penetrating the fuselage. And that’s despite a much bigger fan whose parts have much greater kinetic energy.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "discombobulated38x",
                                                                                    "body": ">But the technology has marched on. \n\nIt has and it hasn't\n\n>Note that the recent CFM Leap (a 12 year old design, still only half as new as that Trent 900/GP7000)\n\nHP Turbine blade failures, easily containable and have been since  the 50s, and also sub-surface flaws in critical parts that are uncontainable that have been luckily caught in time.\n\n> RR Trent **XWB** (sp) (a mid 2000s design, not modern, only 3/2 years younger than the Trent 900/GP7000 you said was ancient tech)\n\nCompressor (not fan) cracking earlier than expected - not necessarily a containment issue and more of an in flight shutdown risk. Eminently containable, but meaningless if your engine dies. And then the Malaysia fire - appears to be fuel system related based on the ADs published, no high energy parts that need containing here but a more obvious problem.\n\n>and PE GTF (also a mid 2000s engine, also two decades old at this point)\n\nA full third of the fleet of which are grounded because of disc cracking issues, the technology may have marched on but having to ground a fleet because your discs are cracking at a tenth of the life you predicted is a story as old as gas turbines.\n\n>had no parts penetrating the fuselage.\n\nAny cracking or failures to critical parts should not occur before first full overhaul, and yet here they are happening at a level requiring unplanned maintenance on two of the three examples you cite, causing huge disruption.\n\n>And that’s despite a much bigger fan whose parts have much greater kinetic energy.\n\nWell all of them have passed FBO tests so that's utterly meaningless, especially considering not one of the examples given involves the fan.\n\nI admire your confidence in the belief that in the space of 3 years the big 3 (plus snecma) eliminated the risk of uncontained failure entirely from all future designs, but it simply isn't true.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "482Cargo",
                                                                                            "body": "You’re cherry picking. We’ve had fan blade failures on these motors. They are much bigger and heavier than in past engines. And there’s been a lot more than three years development work that went into these.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "discombobulated38x",
                                                                                                    "body": "If by cherry picking you mean picking the examples that actually require ADs because of their severity which fan blade failures typically don't then yes, I am.\n\nBut so are you. This has never been about containing fan blades, that has been my point repeatedly.\n\n>And there’s been a lot more than three years development work that went into these.\n\nI am aware. But you can't in good faith argue that the GP7000 is an engine from the 90s when it first ran in 2004, and somehow the Purepower or XWB is a modern engine when they first ran within 2-3 years of the same.\n\nThen again you continually ignore my points about it being impossible to contain some failures, claim that an uncontained failure happening on modern engines is nonsense, and cite the most heavily tested failure for which containment is a requirement for certification in defence of this, so I don't actually think you are arguing in good faith, or don't actually know much about certifying critical parts.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "482Cargo",
                                                                                                            "body": "Ok. Sure. Whatever buddy. Nothing has changed since the Comet. Flying is horribly dangerous and engines will explode shrapnel into the cabin. \n\nI’m done wasting my time with you.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dinkerdoo",
                    "body": "Was going to say, putting an engine and all of the associated plumbing, avionics, etc right in the middle of THE structural joint connecting wings to fuselage is complicating things way more than any aero advantages would give.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SizzlinSeal",
            "body": "They aren’t nearly as efficient. Modern engines are huge in order to maximize the bypass ratio. The bypass ratio, in a nutshell, is the ratio between the volume of air that’s moved outside the engine core (but still inside the engine) and the volume of air that’s moved inside the engine core. Moving volume outside of the engine core is more fuel efficient.\n\nLook at the engines on the 737-200 vs the engines on the 737 MAX, or the engines on the 757-300 vs the engines on the 787",
            "score": 23,
            "replies": [
                {
                    "author": "Overload4554",
                    "body": "This\n\nThe engines on a Max are about the same diameter as the first engines on the 747\n\nIn ‘68 They would have said that you were nuts if you wanted to strap a JTD6 on a 737\n(And perhaps they wouldn’t have been all that wrong)",
                    "score": 9,
                    "replies": [
                        {
                            "author": "NiCrMo",
                            "body": "My understanding is this change also led to the 737 MAX crashes, as the MCAS was added because the engine position had to be changed (forward and up) to fit under the wings which were designed for smaller engines of the past.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "SubarcticFarmer",
                                    "body": "Part of it, but even Airbus ran into some issues due to the lower center of thrust with their larger engines on the NEO.  They had to decommission one of the seating configuration options for it that resulted in no aft galley due to the aft CG.   They may have fixed it by now but for a while the aircraft configured that way couldn't have the last few rows occupied.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "CallOfCorgithulhu",
                                    "body": "Any plane that's re-engined with larger diameter engines that require even the slightest reposition of engine center of thrust will require an MCAS-like system. It'll need some way to compensate for the fact that engine thrust is pushing from a different point than the previous engines. It's not just that the planes had MCAS that was the reason for crashing, rather it was a combination of two critical flaws:\n\n1. The pilot training for the new MCAS dynamics was minimal to avoid extensive and expensive training. They wanted airlines to be able to pick up a Max and keep pilot training time down to let them start flying the new planes ASAP. This wasn't enough training to understand how to overcome a system when flaw 2 appeared.\n2. MCAS only received input from one external sensor. In both crashes, the sensor was knocked off (bird strike IIRC), causing MCAS to erroneously control the pitch of the plane. Due to flaw 1 above, the pilots couldn't overcome the system's bad inputs before the crashes. I believe there are other instances where pilots were able to overcome/override MCAS and safely continue flying, before the lawsuits and re-engineering of the system.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "F1shermanIvan",
            "body": "Fire. \n\nPodded engines are designed to burn off if the fire doesn’t go out with an extinguisher.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Kanyiko",
            "body": "This was an easier concept with narrower turbofan engines, but it became almost impossible to implement with bypass engines.  Just imagine how thick the wing cord would have to be for a Trent 1000 engine!\n\nNot to mention that maintenance was horribly complicated, with relatively narrow access panels giving access to the engine, and replacing an engine was an even more complicated and time-consuming procedure compared with podded engines.",
            "score": 11,
            "replies": [
                {
                    "author": "elprophet",
                    "body": "\\> imagine how thick the wing cord would have to be for a Trent 1000  \n  \nHonestly I kinda want to see that, someone has to have it mocked up in solidworks...",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Kanyiko",
                            "body": "I think if somebody did it, at that point it would almost be worth making some passenger suites inside the wing root inboard of the engines, Junkers G38-style.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Swan2Bee",
                                    "body": "While we're at it, let's make in a flying wing. Might as well, anyway. ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HeruCtach",
                            "body": "I wouldn't be surprised if it was made as apart of the \"why don't we make planes like these?\" meme that went on for like a month over at r/aviationmemes",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ILatheYou",
            "body": "I'd rather catastrophic engine failure to result in rapid unscheduled disattachment rather than Rapid Wing Loss.",
            "score": 9,
            "replies": []
        },
        {
            "author": "noodleofdata",
            "body": "Something I don't think has been mentioned here yet is that the closer to the wing root you are, the higher the lift (at least for tapered wings like on airliners). So having engines there means you're reducing lift over the part of the wing that generally creates the most lift, so you have to compensate for that in the rest of the wing. \n\nSo likely the outer portions of the wing will need to be somewhat larger, which also means heavier. Now you have heavier wings, further out from the attachment point as well as the higher loading from the outboard lift also being further out, so now you have to beef up your wing root attachments.",
            "score": 9,
            "replies": [
                {
                    "author": "urple669",
                    "body": "Another related reason is that the wing will have a tendency to flex up due to lift the further out you go, so putting an engine outboard can help balance that for your design condition. Also can act as a dampening mass to deal with flutter",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "McCheesing",
            "body": "If theres a fire, youre f’kd ….. TMK modern engine pylons are designed to contain the fire  away from the wing superstructure and let the durn thing fall of if need be",
            "score": 7,
            "replies": []
        },
        {
            "author": "Swisskommando",
            "body": "Because of the cost of replacing the engines, and you can’t fit more efficient wider diameter turbofans as others have mentioned. As a result they’re bloody loud and multiple stops required. The comet had to stop a few times en route to Singapore to refuel. Modern turbofans can go all the way from London to Sydney direct these days.",
            "score": 8,
            "replies": []
        },
        {
            "author": "HungryCommittee3547",
            "body": "Structural integrity of the wing is more difficult when you have a hole right through the middle of it.  Easier to hang the engine under it or on the fuselage.",
            "score": 7,
            "replies": [
                {
                    "author": "freneticboarder",
                    "body": "I think Jerry Rig Everything did a video about this using an iPad Pro...",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "KYresearcher42",
            "body": "Bigger fans=more power and range, also an engine fire that close to the seats is bad, lets have those fires out on the pylons….",
            "score": 7,
            "replies": []
        },
        {
            "author": "My_useless_alt",
            "body": "Somewhat relatedly, but these things were actually flying up until 2011. T[he Hawker-Siddley Nimrod](https://en.wikipedia.org/wiki/Hawker_Siddeley_Nimrod) anti-submarine aircraft was a heavily-modified de Havilland, complete with wing-root engines. They were actually planned to still be flying, but in 2010 the UK government cancelled it's plans to overhaul the fleet in favour of buying P-8 Poseidon aircraft from Boeing instead. Apparently they served in Afghanistan and Iraq (Though in an intelligence-gathering role not anti-submarine).\n\nMost of the aircraft that got to retire were scrapped, but a few are still around on display around the UK",
            "score": 6,
            "replies": []
        },
        {
            "author": "baigish",
            "body": "Low bypass, less fuel, more engine heat transferred to the airframe / fuel, difficult to service and in the event of an engine fire or explosion, it is much much more likely to be catastrophic and end in the loss of the aircraft.",
            "score": 6,
            "replies": [
                {
                    "author": "BogNakamura",
                    "body": "Never tought about bypass",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DabOnsUmHoesz",
            "body": "Repairs is a good thing. Having them mounted on the wing makes it 1000x more difficult. Engine fires become a nightmare because wings are where the fuel is. Also structure of wing could be a cause for concern. Lastly from what I understand airliners don’t buy everything from the same place. Ie: Boeing plane, Rolls Royce engine, etc",
            "score": 4,
            "replies": [
                {
                    "author": "Over_Variation8700",
                    "body": "It is from the same place. They order a Boeing plane and Boeing installs the wanted engine, either  Rolls Royce or GE for example for the 787, and the engine may not be changed to the different make later. For the 737 MAX there isn't even optiond for the airline to choose",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KingStar2000_",
            "body": "If you have fire in your engine, your also fire on your wing... Bad idea, unfortunately",
            "score": 5,
            "replies": []
        },
        {
            "author": "Zathral",
            "body": "The main advantage is lower drag. \n\nThere are many disadvantages. Harder access, severely limited fan size and hence bypass ratio for turbofans, potential damage implications in the event of engine failures, etc",
            "score": 4,
            "replies": []
        },
        {
            "author": "Rocketman_8591",
            "body": "In addition to the solid reasons outlined in the other comments, engines mounted in under-wing pods help to dramatically reduce wing flutter.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Donleon57",
            "body": "In addion to what the rest says they also take up space for fuel in the wings",
            "score": 5,
            "replies": []
        },
        {
            "author": "Nannyphone7",
            "body": "It makes upgrading the design with newer engines nearly impossible,  for one thing.",
            "score": 4,
            "replies": []
        },
        {
            "author": "RedditVirumCurialem",
            "body": "A bit tricky to fit a GE90 in the wing root - but cometh the hour, cometh the man..",
            "score": 3,
            "replies": []
        },
        {
            "author": "dredeth",
            "body": "I would say, there's a reason why when you're holding a hot mug youre holding it by the handle not directly grabbing the mug with your fingers.\n\nBut they do look sleek AF.",
            "score": 3,
            "replies": [
                {
                    "author": "BogNakamura",
                    "body": "Best example. Scorching hot mug risking to explode",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BigJellyfish1906",
            "body": "Because if an engine goes BOOM, you want it handing down off the wing. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "cpav8r",
            "body": "Because an uncontained turbine failure will ruin your whole day, and that of all your passengers.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HorizonSniper",
            "body": "Ridiculously complex wing reinforcing, high chance to stall at high AOA, low bypass and if something happens, it happens *inside* the plane's only lifeline - the wing.\n\nAlso, they're loud as hell, and guzzle a lot of fuel relative to power output.",
            "score": 3,
            "replies": []
        },
        {
            "author": "1213Alpha",
            "body": "Two words: Maintenance Nightmare",
            "score": 3,
            "replies": [
                {
                    "author": "DamNamesTaken11",
                    "body": "I can only imagine how much gin and beer the poor maintenance engineer needed after starting the process of having to replace one of those engines. \n\nAt least the modern ones can be detached and reattached easier than those suckers.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gochesse",
            "body": "Imagine getting a bird strike.\n“damn time to take the whole wing off for maintenance again”",
            "score": 5,
            "replies": []
        },
        {
            "author": "TacohTuesday",
            "body": "Because the industry learned an important lesson in the years after this design was built:\n\nKeep the high speed spinny things that sometimes go \"boom\" as far from the wing and fuselage as possible.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MoccaLG",
            "body": "Stress, Vibration and Airflow.... further more bypass problems with bigger ratios...",
            "score": 2,
            "replies": []
        },
        {
            "author": "frodfish",
            "body": "Engine on a pylon was considered a huge technological leap forward.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Festivefire",
            "body": "While they are nice and low drag, they have a negative impact in lift and wing performance, and are not at all practical or even really possible with high bypass engines, the intakes are just too big to be integrated into the wing root.",
            "score": 2,
            "replies": []
        },
        {
            "author": "imonarope",
            "body": "hard to service, hard to upgrade, loud for passengers",
            "score": 2,
            "replies": []
        },
        {
            "author": "Azurehue22",
            "body": "Maintenance issues, mostly. They looks very stylish, but honestly the pod engines make more sense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Smooth-Apartment-856",
            "body": "Wing root engines only work for turbojets, which are highly inefficient in subsonic flight.\n\nIn order to maximize fuel efficiency, modern airliners use high bypass turbofan engines with a *very* large compressor rotor that does double duty as a ducted fan, allowing most of the compressed air to bypass the turbine core, creating more thrust and acting as a muffler to dampen the exhaust noise of the turbine core.\n\nThere is absolutely no way to make a high bypass turbofan small enough to fit in the wing root.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PDXGuy33333",
            "body": "Airflow off the nose and near the fuselage has got to be a consideration in placing engines outboard from that zone.",
            "score": 2,
            "replies": []
        },
        {
            "author": "myfingersaresore",
            "body": "Engine fire? Jettison that wing!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ecstatic_Bee6067",
            "body": "You don't want the engine sucking in boundary layer",
            "score": 2,
            "replies": []
        },
        {
            "author": "Grouchy-Insect-2516",
            "body": "Maintenance",
            "score": 2,
            "replies": []
        },
        {
            "author": "ear2theshell",
            "body": "Crazy inefficient in so many ways... in _all_ the ways",
            "score": 2,
            "replies": []
        },
        {
            "author": "Strangebird03",
            "body": "It was done. Fatigue cracks in the wing spar were common. It wasn't done afterwards.",
            "score": 2,
            "replies": []
        },
        {
            "author": "spacegenius747",
            "body": "1. More complicated to maintain\n2. Heavier \n3. More vulnerable to engine failure/explosion\n\nBut they look sick as hell.",
            "score": 2,
            "replies": []
        },
        {
            "author": "agha0013",
            "body": "they are a pain to maintain, they cause major structural issues in wings to accommodate, especially larger modern turbofans. \n\nJust a whole lot of complication that pod engines don't need to worry about, and you avoid some interesting aerodynamic issues related to how the engines ingest air especially in critical phases of flight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bloregirl1982",
            "body": "The engine pylon mounts in modern engines are designed to shear and let the engine fall away in case of an uncontrolled fire . \n\nIn the earlier scenario the engine fire would burn till the entire aircraft crashes ( kind of similar to what happened to concorde, although in that case it was a fire in the wild itself)",
            "score": 1,
            "replies": []
        },
        {
            "author": "brongchong",
            "body": "Because when one grenades it takes out the other.  Plus one big one is now more efficient vs. two small ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "linx0003",
            "body": "If you read Joe Sutter's book 747, he explains the logic of putting turbofan engines in the wing.  During the era of multi-engine prop planes, the engines were all mounted midline to the wing root. This increased efficiency as it help drive air over the wing surfaces. This thought carried through to the first generation of turbofan commercial airliners ala the BOAC comet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vau8",
            "body": "Got rated, too sexy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MicaTorrence",
            "body": "Far more complex to design and manufacture the wing structure than with engines on a pylon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "roger_ramjett",
            "body": "Absolute PITA to work on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Successful_Score_237",
            "body": "It’s because the wing creates a boundary layer of air and with the engine being in the wing it’s starves the engine of air",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShakyBrainSurgeon",
            "body": "Question to OP: Was this picture taken in Hermeskeil at the P. Junior Museum in Germany? Very cool place to visit btw\n\nEdit: Did a quick search: yes it was. Damn I should be a geoguesser...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Realistic-Muffin-165",
            "body": "My dad was on nimrods. PITA to do the engines apparently.\n\nOne did go on fire although not on dad's watch. [https://en.wikipedia.org/wiki/1995\\_Royal\\_Air\\_Force\\_Nimrod\\_R1\\_ditching](https://en.wikipedia.org/wiki/1995_Royal_Air_Force_Nimrod_R1_ditching)",
            "score": 1,
            "replies": []
        },
        {
            "author": "samnfty",
            "body": "I know this plane! Is it in a museum in Western Germany? Near the Nurburgring perchance?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TropicFreez",
            "body": "Totally off subject, but I miss how the old 737's looked before they changed engines.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBBP",
            "body": "The move towards high bypass turbofans means engines became larger, and these aircraft could not be upgraded later in the aircrafts lifespan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "r2k-in-the-vortex",
            "body": "Those are basic jet engines, very loud, very inefficient. Modern turbofans wouldn't fit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DamNamesTaken11",
            "body": "Smaller, and lower bypass than modern counterparts, but also heaven help you when you need to do maintenance, especially a replacement. \n\nModern engines are still cumbersome to maintain and replace but at least you can “pop” it in and out a lot easier than having to dig into the wings.",
            "score": 1,
            "replies": []
        },
        {
            "author": "morningphyre",
            "body": "Could be they tried and it just didn't take off. \n\nI'll see myself out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "2beatenup",
            "body": "Try dismounting one for maintenance or replacement…\nUnforeseen benefit the whole aircraft gets an annual because of engine compressor replacement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GreatAnnouncement",
            "body": "Have you seen how large modern turbofan engines are? You want to make the wing that thick just because you think its cool?",
            "score": 1,
            "replies": [
                {
                    "author": "ky420",
                    "body": "It would look really cool....really really cool.  As a a&p tho sound like a nightmare to work on",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MarshallKrivatach",
            "body": "I find it funny that people here just don't know that the Xi'an H-6 exists with full sized turbofans in the wing roots.\n\nIt's not common because twin engine underwing designs are just ubiquitous at this point, to the point where it's actively hampering innovation since we've not had a new design concept for years now.\n\nBoom aerospace is the first company to actually do something beyond said twin engine design today.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mike-Phenex",
            "body": "Because ‘Nah, Commercial aircraft shouldn’t be sleek or fast. They should all look the exact same and create as much drag as humanely possible. If we could, we’d make them all biplanes’\n\n- Boeing and Airbus",
            "score": -3,
            "replies": []
        }
    ]
}