{
    "title": "J36 Triple Afterburners",
    "author": "nol88go",
    "subreddit": "aviation",
    "rank": 1,
    "score": 1274,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 147,
    "url": "https://i.redd.it/g2ipnsq5bipe1.jpeg",
    "id": "1jeest1",
    "selftext": "Source: https://www.twz.com/air/chinas-j-36-heavy-stealth-fighter-seen-flying-for-second-time\n\n\nJuicy looking triple afterburns in the bottom left pic!\n\n",
    "comments": [
        {
            "author": "Isord",
            "body": "Are there any other fighters that have had three engines? I can't think of any.",
            "score": 396,
            "replies": [
                {
                    "author": "elvenmaster_",
                    "body": "It only means they can't make an engine powerful enough to make it a twin jet.",
                    "score": 711,
                    "replies": [
                        {
                            "author": "Isord",
                            "body": "I did have that thought but I also have no idea what the requirements for this design were. I know it's been said it is a 6th gen air superiority fighter but it's pretty obviously not fulfilling that role within usual design parameters.",
                            "score": 168,
                            "replies": [
                                {
                                    "author": "CFCA",
                                    "body": "I actually don’t agree that it’s an air superiority fighter. I think that’s most people’s default assumption when they see a fast looking angular jet of that size. \n\nGiven its size and likely high power requirement requiring a third engine and the ranges of the pacific. I think it’s more likely a long range stealthy strike aircraft for rapid response strikes.",
                                    "score": 80,
                                    "replies": [
                                        {
                                            "author": "afito",
                                            "body": "Air superiority fighter with no canards no rudder sounds pretty trash tbh I really don't see that being the case. Big strike fighter like F35+ so to say, yeah maybe, but this layout just doesn't lend itself to air superiority. You can't quickly rotate in any direction really, even the outter engine intake isn't positioned for any type of climb or turn rate, being obstructed from above with no variable intake from what I can tell.\n\nStrike fighter would also make a lot of sense in the modern world tbh as well as sound reasonable for Chinas potential needs around the Soth China Sea. Who knows.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "CFCA",
                                                    "body": "I think what we are looking at is less strike fighter and more tactical bomber ala F-111/SU-34. \n\nIt’s also entirely possible that this isn’t meant to go anywhere near production and is just a test bed for more exotic design features.",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "Got_Bent",
                                                            "body": "Thats my call. Just a technology demonstrator.",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "afito",
                                                            "body": "> strike fighter and more tactical bomber \n\npossible, though I feel like advancements in missile tech have sort muddied the waters a bit anyway I feel like. What is strike, was is fighter-bomber, it's ✨multirole✨ now",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "CFCA",
                                                                    "body": "In this instance, I would argue it’s more a bomber that is capable of self escort, just as how the F-18 concept of operations started as a light attacker that could self escort, and then with technological development, feeding into tactical development, became more of a multi role aircraft in its function. \n\nI wouldn’t expect this thing to stand and fight more so shoot its way out of a bad situation",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "antariusz",
                                                            "body": "F117 replacement",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "CFCA",
                                                                    "body": "Eh similar in role. I wouldn’t use it as a direct comparison because the F-117 was a very specific tool for a very specific mission which was deep penetration, pinpoint strikes against high value targets that were otherwise untouchable. It’s more than likely that stealthier is just a feature because radar reduction is the bare minimum for survivability these days.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "OptimisticMartian",
                                                    "body": "Anything with enough missiles is an air superiority fighter isn’t it?   Didn’t we try to load up the B-1 with enough AMRAAMs to take down most smaller airforces?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "WOOKIExCOOKIES",
                                                            "body": "Ideally, an air superiority fighter can also evade the missiles being shot back at it.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Got_Bent",
                                            "body": "Fuel storage for 3 engines with no external hardpoints for drop tanks and you can't use all of your bomb bay or you cant carry a war load.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Marco_lini",
                                    "body": "Requirement: we want so much maintenance after each sortie, we need to hire a couple of thousand new mechanics for this type alone.",
                                    "score": 140,
                                    "replies": [
                                        {
                                            "author": "memeboiandy",
                                            "body": "Unemployement rates for mechanics post release: 📉",
                                            "score": 66,
                                            "replies": [
                                                {
                                                    "author": "OttoVonWong",
                                                    "body": "Mechanix diamond hands",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Got_Bent",
                                            "body": "And train them to at least basic proficiency.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ResortMain780",
                                    "body": "Enlighten us, what are the usual design parameters for a 6th gen fighter?",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Plebius-Maximus",
                                            "body": "Whatever a Redditor wants to pull out of their ass basically",
                                            "score": 61,
                                            "replies": []
                                        },
                                        {
                                            "author": "Sivalon",
                                            "body": "Uh, stealth, sensor fusion, datalinks to everything for situational awareness, supercruise(?), optionally manned, helmet-mounted cuing, thinking in Russian",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "airfryerfuntime",
                                                    "body": "Supercruise as well.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Stunt_Merchant",
                                                    "body": "Thinking in Russian, lol, nice one, hah.  Gave me a laugh :)",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Free_Possession_4482",
                                                    "body": "To say nothing of landing on arctic pack ice.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Isord",
                                            "body": "No what I'm saying is this looks so vastly different from any previous fighter that I don't think you can compare it directly.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jet1392",
                                    "body": "When has anything Chinas claimed about its weapons capability ever been true? The only way you'd even entertain the thought is by reading too much CCP propaganda that circulates in American social media bc they don't seem to care about regulating it. Every time one of their systems goes up against American sensors the myths are debunked. It's predictable at this point.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "raphaelj",
                                            "body": "J-20 stealthness is reportedly pretty decent from what I read. Far better than SU-57 in anycase. Do not ask for sources, I don't have any.",
                                            "score": 53,
                                            "replies": [
                                                {
                                                    "author": "gefahr",
                                                    "body": "I saw the test results on TikTok, can confirm. And yes the J-20 is in the room with us right now. It's just that stealthy.",
                                                    "score": 21,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Prestigious-Mess5485",
                                                    "body": "Do we have any data on this or any reliable sources? Honestly wondering.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ExpensiveBookkeeper3",
                                                    "body": "Sure, but that's not saying much. The SU57 has stealth that's just a little better than the B1.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "YannAlmostright",
                            "body": "It can also mean they chose to put 3 small engines to still get enough trust when needed, and still have IR \"stealth\" when need by using only 1 or 2 engines.",
                            "score": 98,
                            "replies": [
                                {
                                    "author": "Smiley_face_bowl",
                                    "body": "This is surely why.\n\nI'm also guessing you could spool the outer 2 engines on electrical power with the main thrust from the centre to ensure quicker mixing of the hot engine exhaust to mask the IR signature - not sure if it'll work but they definely know more than we do!\n\nAlso you can fit 3 engines with an equivalent mass flow in a smaller vertical area than a single - it'll be less propulsively efficient but if they are very constrained in the height of the airframe for RCS then it'd be a definite advantage (if a painful one from an operations view).\n\nThey could also be running all 3 engines off a single compressor but multiple turbines and outakes to again cool the thermal signature,  this would be even more wild but could offer some odd advantages (effectively cooler T41 temps, more efficient space, shorter spooling times) very unlikely and can't really see why, but could be!",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "am6502",
                                            "body": "> \n> \n> They could also be running all 3 engines off a single compressor but multiple turbines and outakes to again cool the thermal signature, this would be even more wild but could offer some odd advantages (effectively cooler T41 temps, more efficient space, shorter spooling times) very unlikely and can't really see why, but could be!\n\nThat would be pretty nice actually. Perhaps with two piston powered backup -power engines to power the outer fans in case the centre turbine fails. \n\nThis may work out better on an airliner, to achieve high efficiency (not for the IR-stealth mixing idea you propose). With heavy lift bombers probably two or three jets is a power that can be put to use, and militaries don't really care about efficience except that it affects range.",
                                            "score": 21,
                                            "replies": []
                                        },
                                        {
                                            "author": "makatakz",
                                            "body": "This sounds like pure cope...China simply can't build decent jet engines.  No designer would opt for more engines if they could do it with less.  F-35 wins this game with a single engine more powerful for its size than anything China could ever build.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Pklnt",
                                                    "body": "> China simply can't build decent jet engines.\n\nBecause China can't manufacture something better/equal than the F135 doesn't mean they can't build decent jet engines.\n\nThem having the WS-15 indicates that they're clearly way past that point.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ExpensiveBookkeeper3",
                                            "body": "Doubt it, this engine/intake/exhaust isn't very advanced. They wouldn't go through all this trouble to raise RCS and still not have a very advanced IR stealth signature. \n\nIt's obviously because they don't have a engine to power everything if only two are used.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "avgprius",
                                            "body": "Has the single compressor multi turbine ever been done b4? This is the first time ive heard of it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "makatakz",
                                                    "body": "It's bonkers...having multiple interconnected engines so that one failure could disable all three.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cipher_ix",
                            "body": "Why do people always ignore the most likely requirements for the three engines: speed and power generation.\n\nThe plane is massive, larger than any fighter jet today, and seems to be pretty damn heavy looking at the bogie landing gears. Three engines would be needed to achieve supercruise. The PLA also likely to consider the need for ungodly amount of electrical power for next generation sensors and electronics and create room for future upgrades. This would be useful for future things like directed energy weapons.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "SirLoremIpsum",
                                    "body": "> Why do people always ignore the most likely requirements for the three engines: speed and power generation.\n\nCause it's Chinese haha - always have to make the excuses as to why it's bad.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "agha0013",
                                            "body": "people love to dismiss a nation that has few political hurdles and has crammed 250 years of industrialization into 50. China has had issues in tech development but when you consider their tech history, they are a serious and rapidly growing military threat. \n\ntheir aircraft and naval projects are crazy and starting to make the US look asleep at the wheel",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Geebus_Hentai_Christ",
                                                    "body": "As far as their Navy was concerned, I thought they were going with quantity over quality? A fleet of paramilitary \"fishing\" vessels that could swarm the entire horizon",
                                                    "score": -3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "drjellyninja",
                                    "body": "Why could those design goals not be achieved with two larger engines?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LaserChickenTacos",
                                            "body": "how far does that logic go? Are the F-15’s engines too weak because there are 2 of them?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kneegrowpengwin",
                            "body": "If you follow this logic then all twin-jet fighters have engines that weren’t powerful enough for a single-jet design…",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "SnitGTS",
                                    "body": "Not necessarily. Twin jets have built in redundancy that single engine planes don’t have.  \n\nIt’s one of the reasons the Navy and Canada hesitated to adopt the F-35, they typically wanted a twin jet for redundancy over the huge expanses their planes fly.",
                                    "score": 38,
                                    "replies": []
                                },
                                {
                                    "author": "elvenmaster_",
                                    "body": "Except there is a legitimate reason to go twin engine instead of single engine.\n\nIt's called engine failure, which very rarely happens twice on the same plane.\n\nAnd with every war plane lift-to-drag ratio, no running engine means immediate ejection and airframe loss.",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "Beanbag_Ninja",
                                            "body": ">which very rarely happens twice on the same plane.\n\nCorrect! For instance, no F-16 or Mirage 2000 has ever had two engines fail at the same time.",
                                            "score": 103,
                                            "replies": [
                                                {
                                                    "author": "beneaththeradar",
                                                    "body": "big, if true.",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "RepresentativeOfnone",
                                                            "body": "No no no it’s B1G if true",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "hoppertn",
                                                                    "body": "B-52 is like, “I lost an engine?  I hadn’t noticed.”",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "memeboiandy",
                                                                            "body": "The dreaded 7 engine short final 😭",
                                                                            "score": 21,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Yesthisisme50",
                                            "body": "You’re also 2x as likely to have an engine failure in a twin engine jet",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "supereuphonium",
                                            "body": "But I have also heard that 2 engines means maintenance on 2 engines which means twice the chance of maintenance screwups.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FXcheerios69",
                                    "body": "That’s a reductive view. It’s depends on the parameters of the plane you are designing. At the time of the Lockheed designing the F-22, they couldn’t achieve their performance goals from a single engine. That doesn’t mean a single F-22 engine couldn’t power a smaller, less capable plane.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "DEEP_SEA_MAX",
                                    "body": "The logic is: China bad, then he work backwards from there.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "afito",
                                            "body": "China has come a long way but it's safe to assume China is still a few years behind the US & EU in terms of engine design. They're learning at a rapid pace considering they started off 40 year old Russian designs, but it's not \"China bad\" to suggest that in this one case, one of the most challenging engineering tasks on our planet, their 10 years of experience isn't fully up to par with the Wests 70 years of experience.\n\nThese current designs are the first ones fully done in China, and your first successful projects will simply always be a step or two behind. This isn't even China related really. We see the same with their commercial planes, it's getting there, they will be on par in maybe a decade idk, but as of today it's not quite even with all the espionage in the world.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Debesuotas",
                                    "body": "Yes, there is a difference when you have 50/50 power ratio for each engine, rather than 33/33/33. And going 3 engines with that power ratio doesn\\`t look efficient and logical. Because you need extra wiring, extra control units, extra everything that adds up to the weight. On top of that you get extra faulty points, On top of that each engine is not efficient so you get more weight over power ratio, for example 3 engines will most likely weight more than 2 engines and will provide very similar or not really needed power gains compared to the two engines. Also this is not a fighter jet, this is a bomber. So they need to be as efficient as possible to carry huge loads over long distances. 3 engines mean more jet fuel used... \n\nFrom my point of view this design has too many illogical things about it.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "proudlyhumble",
                                    "body": "Two engines equals redundancy. The logic doesn’t extend.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "frigginjensen",
                                    "body": "Or reliable enough",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Crazy__Donkey",
                            "body": "Or a single....\n\nAnd in that case, also not reliable enough.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DarkArcher__",
                            "body": "It does not, no. That's only one possible reason among a whole myriad of them.\n\nThe official word is that the third engine is there mainly for power generation to feed the hungry electronics.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "megaduce104",
                            "body": "Perhaps this is future proofing for direct energy weapons. Three engine with multiple generators may be enough for lasers\n\nJust a thought",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "doubletaxed88",
                            "body": "People think the configuration is meant to lower the straight on cross section profile while allowing  for a sizeable weapons bay between engines 1 and 3.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OhUhUhnope",
                            "body": "She's running hot, Captain!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OkBubbyBaka",
                            "body": "And that just means they can’t make an engine powerful enough for a monojet.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "besidethewoods",
                    "body": "I don't think it's a fighter. Probably medium strike platform like an F-111. Maybe it has an air to air capability but it's all just guesswork.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "aether_42",
                    "body": "A couple of concepts, like the North American NA-349, but nothing that ever made it to production.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "EvieGHJ",
                            "body": "Well, that depends. Are we specifically looking for three engine in a typical tri-jet configuration (eg, all the engines have intakes in front and nozzles at the back to push the jet forward), or just ANY combination of three engines on a plane that's designed as a fighter?\n\nBecause in the later case, the Yak-38 did make it to production, deserved or not, and as far as I can see it did have three engines.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "aether_42",
                                    "body": "I read the question as referring to a typical, all three engines dedicated to forward propulsion, trijet arrangement, but if we open up the question then the Yak-38 does indeed fit!",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cruel2BEkind12",
                            "body": "Damn dude, that thing was probably going to be rapid. Guzzle down fuel too lol.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mexchiwa",
                    "body": "The Martin XB-51 bomber had three engines.  It played a fighter in a movie.  \n\nDoes a P-51 with ramjets count?  Or, for that matter, an I-153 with ramjets?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "killnaytor",
                    "body": "Does the plane from Swat Kats count?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Isord",
                            "body": "The Turbokat is actually a 7th gen fighter.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GorgeWashington",
                    "body": "Swat Katz",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "afterburners_engaged",
                    "body": "The turbokat from swat katz",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "VispilloAnimi",
                    "body": "I read somewhere that it's believed they had problems with engine vectoring, so they opted for 3 engines to compensate.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Isord",
                            "body": "I'm not fully understanding how 3 engines compensates for vectoring but I'd certainly believe it is some kind of compromise.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Euhn",
                    "body": "A5 had a 3 engine variant floated around, dont think it was ever built.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KspDoggy",
                    "body": "Yak-38 and Yak-141.\n\nTechnically two of those engines were facing the wrong way for VTOL reasons but still, 3 engines.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thissexypoptart",
                    "body": "Seems pretty silly frankly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RobertWilliamBarker",
            "body": "That thing isn't air superiority with duckerons. Better have out of this world radar and avionics and a cloaking device if it wants to be in the ball game.",
            "score": 65,
            "replies": [
                {
                    "author": "JaredsBored",
                    "body": "China has AESA radars in their top of the line fighters. Are they as good as US radars? No, they’re not. However with a big ass jet, you can carry a big ass radar. \n\nI’m not inclined to just write off the Chinese fighter improvements. Yeah China produces a lot of cheap shit, but that’s not to say everything they do militarily (even if it’s stolen US tech) is going to be garbage and can be laughed off. They’re not Russia fielding su-57’s with sheet metal screws sticking out (joking but only barely)",
                    "score": 22,
                    "replies": [
                        {
                            "author": "40mm_of_freedom",
                            "body": "We all thing that China makes cheap shit, that’s because we want to buy cheap shit.  \n\nThey can make high quality parts as long as you’re willing to pay for it.\n\nI’m not going to discount their military production capability and say it’s trash, but I don’t think it’s as good as the latest from the US.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "subject133",
                    "body": "China produce 96 percent of he world total production of gallium, instead of worrying about Chinese radar, you should probably worry about how America is going to build any radar without gallium from China.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "makatakz",
                    "body": "It surely doesn't have those features...so not a player.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LordOfHamy000",
            "body": "That's looks... Inefficient",
            "score": 172,
            "replies": [
                {
                    "author": "am6502",
                    "body": "it doesn't look fast and I at first thought this would be a slow subsonic heavy lifter (slow stealthy bomb truck). Hence it surprised me to read people are speculating about supercruise, wiki, as of today,  states:\n\n>   The wing sweep angles indicate aerodynamic optimization toward supercruise.\n\n (and the above quote is a number references).",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Adjutant_Reflex_",
                            "body": "The thinking that I’ve seen is that it’s filling a “heavy fighter” type role that’s not *really* part of the western philosophy. And that its role is to be a long range and long loitering missile truck that can push back the USAF tankers.",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "senorpoop",
                                    "body": "> a long range and long loitering missile truck\n\nThat doesn't sound realistic to me with three afterburning engines on a stealth platform (no external stores in steal configuration).",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Rampant16",
                                    "body": "I mean, it's speculated that NGAD will be in a similar direction. Improvements in stealth, range, speed, and weapons capacity over 5th gen fighters. That points to a physically large fighter.\n\nChina is building stealth tanker killers. Which means NGAD needs to be able to operate with less tanker support than current fighters.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Independent-Mix-5796",
            "body": "I feel like this could be a case of bad requirements.\n\nA trijet configuration definitely means that a two-engine configuration was considered severely inadequate. That in itself is eyebrow-raising, as a third engine (especially an embedded one) is a shit ton more maintenance.\n\nIf I had to guess (and of course, I’m no expert on this), the Chinese want the J-36 to be both a heavy lifter AND a dogfighter AND stealthy. In a two-engine configuration, they probably found it impossible to achieve all three at once:\n\n- larger, more efficient turbofans can achieve the higher MTOWs and lower IR signatures, but won’t be durable enough for high-G maneuvers\n- smaller diameter engines might be able to be able to technically achieve the MTOW and can better withstand maneuvers, but have to operate at higher power settings (i.e. hotter) during normal cruise, compromising stealth\n- and obviously running smaller diameter engines at a lower setting results in a failure to haul the loads required\n\nHence, why I think the J-36 uses three engines. If it were up to me, they should be developing a dedicated deep-strike steath bomber (like the B-21), rather than a(nother?) multirole strike fighter (which is what this looks like to me).",
            "score": 98,
            "replies": [
                {
                    "author": "AvalancheZ250",
                    "body": ">Hence, why I think the J-36 uses three engines. If it were up to me, they should be developing a dedicated deep-strike steath bomber (like the B-21), rather than a(nother?) multirole strike fighter (which is what this looks like to me).\n\nThey actually seem to be developing all *three* simultaneously.\n\nYes, 3.\n\n* The (continually delayed, I might add) H-20 is their strategic stealth bomber for deep-strikes.\n* The J-36 seems to be their \"Star Destroyer\" (totally wasn't inspired by the menacing underside view) doing all you've described above. Multirole to the point of being a Main Battle Aircraft concept.\n* The J-50 is their more conservative, air-superiority design. It has 2 engines to be safe, but similarly lacks vertical stabilisers to maximise stealth. Its probably also their only carrier-capable option.\n\nIt doesn't seem like a problem with development focus because they somehow have the budget to explore all options at the same time.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Independent-Mix-5796",
                            "body": "That’s insane, honestly. I’m a bit skeptical that they’ll pull off all three (especially this one given that China still seems to be somewhat behind in terms of engine development), but if they pull all this off that would be *scary*.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Powergamer420",
                    "body": "Maybe the IR signatures are less visible with three smaller engines, one engine produces one huge exhaust plume while three small ones produce only small signatures that can be covered more easily with bodywork",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Spudsicle1998",
                            "body": "I'd doubt that 3 smaller engines make that much difference to one big one. They still put out a ton of heat and plumes. That and the maintenance on those engines would be a nightmare I'm sure. ",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LiGuangMing1981",
                    "body": "They are also developing something akin to the B-21, IIRC. H-20 or something like that.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SkyMarshal",
                    "body": "> the Chinese want the J-36 to be both a heavy lifter AND a dogfighter AND stealthy.\n\nPretty sure dogfighting is not a requirement.  The plane is huge, even bigger than the J-20.  And its flying-wing design will bleed off 100% its energy after just the first maneuver.\n\nRather it seems the Chinese design goals, for both the J-20 and the J-36, are for them to be long-range intercepters:\n\n* Cover the large distances of the South China Sea theater with speed and stealth.\n* Launch a salvo of big long-range missiles at high-value targets like AWACS, refuelers, ships, land bases.\n* Return to base in mainland China (or SCS island), refuel, rearm, repeat.\n\nThe J-36 is just a bigger, longer-range variant of the J-20, halfway in between fighter and bomber size.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jeb_hoge",
                            "body": "This is as much of a fighter as the F-111B.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jav_2225",
            "body": "okay... not going to lie... this looks pretty damn cool. i hope we get a cool reveal from chengdu sometime soon with some actual high quality images. sadly we might have to wait a few years.",
            "score": 55,
            "replies": [
                {
                    "author": "adoggman",
                    "body": "Yeah, I don't care if it's not the stealthiest or fastest or whatever, it just looks fuckin cool. Like the B2, that thing could be a massive waste of money and accomplish nothing and it'd still be iconic to me.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "giantzoo",
                            "body": "it looks like a piece of paper cut up with scissors, the B2 looks like missing textures in a skybox",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "iUberToUrGirl",
            "body": "honestly good for them for coming up with something original",
            "score": 33,
            "replies": []
        },
        {
            "author": "Durable_me",
            "body": "Can it be that the middle one is thrust vectoring? So you can use 2 cheaper engines and only the middle one for vectoring",
            "score": 28,
            "replies": [
                {
                    "author": "Crazy__Donkey",
                    "body": "You invest billions on research and espionage,  the last thing you get cheap on is 2 thrust vectoring kits.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "am6502",
                            "body": "not really. you just raise unit cost and maintenance, and see very little in return. \n\nbut it wouldnt be the only reason they chose this configuration. \n\nyou could achieve much higher range with a slower speed cruise using just the single centre engine. (turn of the outer engines while cruising over the pacific. \n\nthe other possibility is that future variants might have outer engines being ramjets.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Maximus560",
                                    "body": "Or vice versa - two outside engines are traditional jets, interior is the ramjet only used at high speeds",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "makatakz",
                                            "body": "The fact that it was operating at subsonic speeds disproves your theory.  Bottom line: it's got three shitty engines.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Maximus560",
                                                    "body": "I'm just following on the other guy's comment lol don't come for me",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "frigginjensen",
            "body": "Are they vectored or does it rely only on aero control surfaces?",
            "score": 5,
            "replies": []
        },
        {
            "author": "am6502",
            "body": "thumbs up that trijets make a comeback.",
            "score": 8,
            "replies": []
        },
        {
            "author": "PraetorAudax",
            "body": "Too, Fat to be fighter most likely just really inefficient missle carrier like  Douglas F6D Missileer!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Mike-Phenex",
            "body": "Welcome back SM.79",
            "score": 2,
            "replies": []
        },
        {
            "author": "NonadicWarrior",
            "body": "The reason for 3 engines could be due to power generation as advanced sensor suite is meant to he incredibly power hungry. And also to improve ferry range with 3 engines on lower thrust than 2 on high power. Bit who knows, just guesses.",
            "score": 3,
            "replies": [
                {
                    "author": "Giggleplex",
                    "body": "Good assessment. Both seem quite plausible, especially the power generation one.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "throw_me_away3478",
            "body": "Ah yes a Chinese Jet, time for the Reddit experts to point out every single flaw.",
            "score": 10,
            "replies": [
                {
                    "author": "Robust-yo-ass",
                    "body": "At least this time they get originality points",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Debesuotas",
            "body": "Should have added a third wing as well, it would serve as an additional fuel tank to run those three engines efficiently.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Peregrine7710",
            "body": "That’s a lot of flaps!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SirLoremIpsum",
            "body": "No tail is just.... so odd... it's gonna take me a while.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CloudMafia9",
            "body": "His does one tell from a picture, and a blurry one like this, that afterburners are being used?",
            "score": 1,
            "replies": []
        },
        {
            "author": "JointStrikeFritters",
            "body": "This is like the Civic Type R triple exhaust",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeakCelery5000",
            "body": "For a stealth fighter, we sure see it a lot ;).\n\nI wonder if the mission of this aircraft is to make western intelligence agencies divert resources to figure it out. It seems so odd and weird, that it is probably making a lot of analysts ask \"why the heck did they make it like that?\" and focus on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutisticToasterBath",
            "body": "lol that ain't ever making production.",
            "score": -3,
            "replies": [
                {
                    "author": "Fabri91",
                    "body": "RemindMe! 2 years",
                    "score": 18,
                    "replies": [
                        {
                            "author": "RemindMeBot",
                            "body": "I will be messaging you in 2 years on [**2027-03-18 20:47:32 UTC**](http://www.wolframalpha.com/input/?i=2027-03-18%2020:47:32%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/aviation/comments/1jeest1/j36_triple_afterburners/mii530t/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Faviation%2Fcomments%2F1jeest1%2Fj36_triple_afterburners%2Fmii530t%2F%5D%0A%0ARemindMe%21%202027-03-18%2020%3A47%3A32%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201jeest1)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "RocketKnight71",
                            "body": "You can set it for 20 years if you like, it still won’t be in production",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "NonadicWarrior",
                                    "body": "As china shits out J-20s by their dozens every other week.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "RocketKnight71",
                                            "body": "They are no where near the capability of the F-22 or the F-35, so they can shit out as many as they want. Cool looking shitty Chinese aircraft are still shitty Chinese aircraft.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "rsta223",
                                            "body": "TIL that 4 planes is \"by their dozens\".\n\n(Their production rate is around 2 a week)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "username001999",
                                    "body": "Put your money where your mouth is. $250k bet, we can escrow it with a third party. This hits production.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Flyingdutchman2305",
                                            "body": "What kind of production? Like Su57 level or Temu level , both are shit quality mind you",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rawb19",
                    "body": "*pauses writing check* ‘YOU WANT HOW MANY TURBINES?’",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eaglepursuit",
            "body": "Looks like a plane that will spend 3/4 of its existence in the maintenance hangar",
            "score": 1,
            "replies": []
        },
        {
            "author": "Animal__Mother_",
            "body": "Weeeeeee Wooosh. There goes the sidewinder. lol",
            "score": -2,
            "replies": []
        },
        {
            "author": "Advanced_Writer9367",
            "body": "LOL send in a F22 and see how fast that Chinese plan is shot out of the sky",
            "score": 0,
            "replies": []
        },
        {
            "author": "Unfair_Cry6808",
            "body": "Every man's ultimate fantasy.",
            "score": 0,
            "replies": []
        },
        {
            "author": "avi8tor",
            "body": "sexy as fuck",
            "score": -7,
            "replies": [
                {
                    "author": "Wolfie_142",
                    "body": "Heck no that's things ugly af nothing like the F-14 or 747",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "slavabien",
            "body": "So future. Very wow.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Advanced_Writer9367",
            "body": "LOL send in a F22 and see how fast that Chinese plane is shot out of the sky",
            "score": -1,
            "replies": []
        },
        {
            "author": "tadeuska",
            "body": "Why does anyone think it is a real picture?",
            "score": -16,
            "replies": [
                {
                    "author": "Dragonsbane628",
                    "body": "Because we have actual footage of it not only from December but also two days ago which match all photographs most of which are screen grabs from the videos.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Quiet_Zombie_3498",
                    "body": "Because there is no evidence indicating it is not a real photo... why would anyone just assume it was fake when there are actual videos of it flying lol.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "tadeuska",
                            "body": "A video of a plane is one thing. This picture is not related to that. There are details in the photo that don't make sense. Also we know all of it is carefully and intentional leak. They would not show this side, not yet.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}