{
    "title": "It happened.",
    "author": "Boring_Albatross_354",
    "subreddit": "recruitinghell",
    "rank": 19,
    "score": 389,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 48,
    "url": "https://www.reddit.com/r/recruitinghell/comments/1jdsakj/it_happened/",
    "id": "1jdsakj",
    "selftext": "So this was just luck tbh, very very very lucky. \nI interviewed with a company went through 3 interviews, and the position went to someone else. I was legit bummed because I really liked the place and the people it seemed like a really really good fit and they were really open and honest with me and I was with them. They asked me how my job searches were going and I mentioned how the ghosting was the worst part etc. So a few days ago I got a call and they said they had an opening for another position they haven’t been able to fill and it was in the exact same line of work I was doing when I was laid off, they said they were really impressed with me and they also thought I was a good fit as well. I go in the next day to have a chat with the person in charge of this other department and we all just hit it off, and later in the afternoon they sent me an offer. I counter offered and they countered again ever so slightly lower than my counter and I accepted this morning, all for a job I didn’t even apply for! I’m speechless and excited.\n\nI want all of you to know I’m rooting for you, I have no magical steps or guidance but just don’t give up. I know it’s tough out there, just keep your head up, you got this!\n\nEdit: Thanks everyone, it means a lot! I’ll still be here to root for you all!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DopeGrandma",
            "body": "Congratulations",
            "score": 20,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "Thank you",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Secrown",
            "body": "I love this story. \n\nUniversal divination!",
            "score": 9,
            "replies": []
        },
        {
            "author": "Final_Prune3903",
            "body": "Congrats!!! That’s a great recruiter to find a spot for you elsewhere - that was one of the most rewarding things I ever did fir candidates when I was a recruiter. Cheers to you on your new adventure!!",
            "score": 8,
            "replies": []
        },
        {
            "author": "BrainWaveCC",
            "body": "Congrats to you.",
            "score": 7,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "Thank you",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Triple_Nickel_325",
            "body": "WOOT!!👏👏 That's how it should be, kudos to you and your new org!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Rick_Sanchez_C-5764",
            "body": "Congratulations, success is like lightning, sometimes it strikes when you least expect it. I was just offered a job about a week & a half ago. I'm presently waiting for them to onboard me, but I'll be working on yet another spacecraft program for a large space company. Unfortunately it's a contracting job, but any port in a storm & I just got a call last week about a job I had previously interviewed with that same company but didn't get that other job. This is a different manager than before so there might be a chance to score another direct-hire position & continue my financial goals of buying a house sometime soon. They're doing some interesting work in my academic wheelhouse, semiconductor device physics, so it might be a good fit, I just got submitted today. I hit it off with both the recruiters I spoke with for their agency, so they're enthusiastic about pushing me to the company. So to recap, I've already got a job & no I'm waiting to maybe get a better job, all within the space of 3 weeks. A month ago, I didn't really have much going on, a lot of applications, but no solid replies.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jumpy_Tumbleweed_884",
            "body": "So I have to say, negotiating at all in this market was a VERY bold move. This time it worked out for you, but for *most* unemployed jobseekers, you should take what is offered with a smile. So so many cases of rescinded offers. Hate to say it but there’s a little bit of knowing one’s place when job seeking in 2025, and not doing so will anger many/most employers",
            "score": 3,
            "replies": [
                {
                    "author": "Welcome2frightnight",
                    "body": "I countered and it got me 8000 dollars extra. And I was unemployed. When you get an offer letter the same day or the next, the company really wants you. That was OPs scenario. If the employer got “angry or upset”, probably not someone\\company you wanna work for anyway.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "zachary_alan",
                            "body": "Thank you. Why would you not counter? Most companies are expecting it. When I was a hiring manager I did. If a company knows you're desperate they are almost always going to low-ball you and try to screw you over. I feel like countering is a much better look than immediately jumping at something. You nailed it, why would you want to work for a place that's actively trying to screw people over?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "All-Username-Taken-",
                    "body": "For all. If you're unemployed, you need something.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beneficial_Dish_1987",
            "body": "This is so great to hear! Congrats that’s awesome. :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Familiar-Range9014",
            "body": "Congrats 🎉🎉🎉",
            "score": 2,
            "replies": []
        },
        {
            "author": "richardlpalmer",
            "body": "This is fantastic news! Thank you for sharing with us and encouraging everyone to not give up. It's much appreciated.\n\nHere's to things going awesomely with your new role!",
            "score": 2,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "Thank you! There were definitely times I wanted to give up and then I would see a post just like mine, luck of the draw and them also telling us not to give up, so I persevered. I just want the same for all of you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tricky_Signature1763",
            "body": "I had a similar experience, I got reached out to about an opportunity, interviewed 2x for it, they offered it to someone else but that candidate declined, they then offered it to me, hiring manager liked me more but the other candidate has about 1-2 more experience than me. I countered and they re countered for slightly less than my counter and I also accepted! Congrats! Your officially out of purgatory haha",
            "score": 2,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "Thanks! I’m still making lower than I was before but you know what at this moment in time I am OK with that",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sn0wInSummer",
            "body": "So damn exciting! I love hearing these stories. Congratulations and I wish you much luck and success with the new job.",
            "score": 2,
            "replies": []
        },
        {
            "author": "queenB_east",
            "body": "Congratulations. All the best for your new role",
            "score": 1,
            "replies": []
        },
        {
            "author": "chronoler",
            "body": "Congrats bro, now keep it up!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rena_1965",
            "body": "Congrats!",
            "score": 1,
            "replies": []
        },
        {
            "author": "goobstah33",
            "body": " We need more of these posts on this sub. Don’t give up hope!",
            "score": 1,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lifelong1250",
            "body": "Congratulations!  Getting hired certainly feels random right now.  I often wonder, out of 100 targeted applications sent, how many are even seen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Former-Intention-292",
            "body": "Congratulations!! 🎉🎊💗🎉🎊",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beautiful_Hedgehog47",
            "body": "🎊🎉",
            "score": 1,
            "replies": []
        },
        {
            "author": "BitsOfPuzzle",
            "body": "Congrats! It's nice to hear given how hard it is out there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "outdoorszy",
            "body": "yeah, I got this lol",
            "score": 1,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "YEAH YOU DO!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "outdoorszy",
                            "body": "No, you have this. I was being sarcastic.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kazzy_zero",
            "body": "Good for you!  Happy this worked out.  I was in a similar situation that I almost got offered my dream job but they went with someone cheaper and stayed in touch.  That other job never happened because of the DOGE interference, and it's now been cancelled.  :( Happy for you though!",
            "score": 1,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "I had a few of those, state jobs at a university fall through because of the well you know.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "misty0207",
            "body": "Congratulations and I wish you the best of luck",
            "score": 1,
            "replies": []
        },
        {
            "author": "silvachr",
            "body": "Congrats.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fearlessfroot",
            "body": "Love this!!! Big congrats to you. Gives me a sliver of hope",
            "score": 1,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "You got this! I know it’s overwhelming and feels hopeless, but you’ll find something.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fearlessfroot",
                            "body": "Thank you :,)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Holiday-Card-9077",
            "body": "Congratulations!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outrageous-Minute685",
            "body": "When you say counter offered , you mean you negotiated your pay ?\n\nIs this salary ?",
            "score": 1,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "Yes I negotiated my pay.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Inevitable_Story3208",
            "body": "Congratulations. Good luck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Critical-Lemon7218",
            "body": "What industry do you work in?",
            "score": 1,
            "replies": [
                {
                    "author": "Boring_Albatross_354",
                    "body": "Import/export, logistics, contracting and sometimes quality. \n\nIt was a role I kind of accidentally fell into as I’m an excellent problem solver and creative thinker, a masters in art is not a waste of time most people I have met cannot work their way around a problem with creative thinking at all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pharmdtwenty22",
            "body": "Finally, something positive.  Congratulations on the new position!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Biomeeple",
            "body": "3 interviews? Ain't nobody got time for that! I don't bother when corporations play games like this. Obviously they're more interested in staying busy on their end than offering an actual position.",
            "score": 1,
            "replies": []
        }
    ]
}