{
    "title": "Job hunting in 2025",
    "author": "joemama123458",
    "subreddit": "recruitinghell",
    "rank": 0,
    "score": 4182,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 128,
    "url": "https://i.redd.it/c60495kuygpe1.jpeg",
    "id": "1je83ye",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreeXiJinpingAss",
            "body": "Unfortunately Unfortunately Unfortunately",
            "score": 417,
            "replies": [
                {
                    "author": "FlimsyRabbit4502",
                    "body": "Is it really unfortunate though?? Because if it were so “unfortunate” then why didn’t you hire me??? Also it’s not even “fortune” when YOU MADE THE DECISION",
                    "score": 105,
                    "replies": []
                },
                {
                    "author": "thebig3434",
                    "body": "i just stop reading and delete the email when i see the word unfortunately",
                    "score": 45,
                    "replies": [
                        {
                            "author": "disruptioncoin",
                            "body": "I finally got an email asking me to come in for an interview the other day and it started off just like the rejection emails, ie \"thank you for applying.... After careful review\" etc,  I got pissed, skimmed it and then put my phone back in my pocket. Then my brain registered that I didn't see the word unfortunately in there. I pulled my phone back out and realized that I almost made a big mistake lmfaoooo",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CornedBeef1980",
                    "body": "I set up a filter to auto flag these and mark as read.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "FlimsyRabbit4502",
                            "body": "I need to do this as well",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rainyserenity",
            "body": "“We regret to inform you”",
            "score": 272,
            "replies": [
                {
                    "author": "ChestNok",
                    "body": "just think about how much of actual regret in those words lmao",
                    "score": 90,
                    "replies": [
                        {
                            "author": "FlimsyRabbit4502",
                            "body": "I’m convinced that they ENJOY getting your hopes up only to completely crush them",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "D_Ethan_Bones",
                                    "body": "There seems to be theme of maximizing the amount of time and effort people spend on getting nothing.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "BoardGamesAndMurder",
                                    "body": "I don't know, maybe HR types. As a hiring manager, I fucking hate telling people they didn't get the job. I feel horrible every single time",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fritzbigbiceps",
                    "body": "I swear to God this shit will give me ptsd in 20 years from now.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "x_nsored",
                            "body": "I'm already there.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "thebig3434",
                            "body": "nah.. in 20 years this will give me a good laugh as i sit in the ceo chair of the company i applied to on indeed that kept me and gave me the number one leadership position spot, right? ..right?",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Throwaway--2255",
            "body": "Or worse, going through multiple rounds of interviews and being rejected wasting your time.",
            "score": 181,
            "replies": [
                {
                    "author": "Ok-Tax-8165",
                    "body": "With take home projects.\n\nTo get the feedback that engagement during the presentation was what differentiated the other candidates. So only Adderall infused nepo babies living at home win interviews now. If you're appropriately depressed about the situation you're unhirable.",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "Character-Signal5378",
                    "body": "i spent 120 pounds, to book the ticket to go for the third interview and got rejected. mannn i'm broooke",
                    "score": 28,
                    "replies": [
                        {
                            "author": "xSlappy-",
                            "body": "Missed a day of work for an interview!",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SkinNoises",
                    "body": "Or being offered the role, signing the offer letter, and being told two days before your start date that the role is no longer needed, then seeing a LinkedIn notification a week later of a new job posting for that same exact role.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "BeerluvaNYC",
                            "body": "is that legal? what if you had another job and quit for the new one?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "SkinNoises",
                                    "body": "Yeah it’s legal, it’s just a contract that you or the employer can terminate at any given moment.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mental_Department89",
                    "body": "Especially when they don’t even reply lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "orpheusoxide",
            "body": "I made custom event graphics for an application that included a CEO quote from their newsletter, speaker photos and color matching to their logo to show my enthusiasm. Never clicked the portfolio link despite asking for samples and got the standard \"thanks for the application\" email. \n\nCustom anything is a joke now. However people still want to complain that we aren't \"doing enough\" to get a job.",
            "score": 103,
            "replies": [
                {
                    "author": "Character-Signal5378",
                    "body": "i feel you brudda, i really do",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pldgofallegnce",
            "body": "I stopped doing cover letters.  Not going to waste my time on something someone probably will not read.  Is it hurting me? Possibly. Is it not hurting me? Probably.",
            "score": 82,
            "replies": [
                {
                    "author": "ripzipzap",
                    "body": "submit a cover letter that starts normal but transitions to moby dick halfway through",
                    "score": 45,
                    "replies": [
                        {
                            "author": "mannydurnoP",
                            "body": "Hahaha. \n\nBetter yet just start giving instructions on how to make a peanut butter sandwich.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "getsome75",
                            "body": "It was the best of times but mostly the worst of times",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cuddols",
                    "body": "I just reuse one which is generic but sounds custom lmao. In the same way marketers write stuff that sounds individualised but doesn't mean anything to anyone \"for the trailblazers\".",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "aintnoprophet",
                    "body": "It's super easy to get chatgpt to draft you one though.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "joemama123458",
                            "body": "Exactly\n\nMight as well do it, even if it increases your chances from 0.00001% to 0.00002%",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Exciting-Pizza-6756",
            "body": "Unfortunately...their FAVORITE WORD",
            "score": 61,
            "replies": [
                {
                    "author": "FlimsyRabbit4502",
                    "body": "If I had a dollar for every “unfortunately” I received I would be a millionaire",
                    "score": 15,
                    "replies": [
                        {
                            "author": "StandardFaire",
                            "body": "If I had a dollar for every “unfortunately” I received I wouldn’t need to apply for a job",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Exciting-Pizza-6756",
                            "body": "Same! I would be rich",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Round-Ad1046",
            "body": "“Your background is interesting, unfortunately, unfortunately, unfortunately, unfortunately“ is like a fucking bell everytime I read that shit. I’m being shafted because recruiters or hiring managers want employees with experience and qualifications. \n\nIt’s a fucking catch 22, I can’t get a job because I don’t have experience, but for me to get experience I need a job, in losing my fucking mind here.",
            "score": 52,
            "replies": [
                {
                    "author": "Vlad_The_Great_2",
                    "body": "Even with the exact experience they are looking for, you will still get shafted. They want someone overqualified willing to take a slave wage.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Round-Ad1046",
                            "body": "Amen to that brother. Tech industry for entry level is fucked",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Vlad_The_Great_2",
                                    "body": "It was easier for me to get a tech job years ago with zero experience than it is right now with experience and certifications. Nothing makes sense.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "joemama123458",
                                            "body": "I got more interviews two years ago when I had no degree, no certs, and no experience",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Round-Ad1046",
                                            "body": "I have no idea what to do. No wait that’s a lie, I very tempted to get a job in a pub or something. Need money somehow with this dumpster fire of what we call an economy.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Hammered4u",
                                            "body": "You can thank Covid and every \"coding bootcamp to 6k figure bootcamp\" online ad for that.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thebig3434",
                    "body": "wait.. you actually believe you would be hired even if you had experience? thats pretty hilarious",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "FarConsideration8423",
            "body": "Thats why I don't even read the emails I just look out for the key words \"Unfortunately\", \"We regret to inform you\", \"We will not be moving forward\", \"After careful review\"",
            "score": 50,
            "replies": []
        },
        {
            "author": "Frosty-Welder8465",
            "body": "\"After careful review, we have decided to repost the ghost job listing. lol\"",
            "score": 34,
            "replies": []
        },
        {
            "author": "FlimsyRabbit4502",
            "body": "This current job market is my villain origin story in the making",
            "score": 30,
            "replies": [
                {
                    "author": "getsome75",
                    "body": "I hear that, maybe a bot net would fill out some ATS forms and get things moving",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "HWY1CA",
            "body": "Although your skills are impressive…..we’ve decided……that closely matches….its like B please.",
            "score": 24,
            "replies": [
                {
                    "author": "artistichic",
                    "body": "😂😂😂",
                    "score": 5,
                    "replies": [
                        {
                            "author": "HWY1CA",
                            "body": "😂😂😂😂 they just lie so badddd!!!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Inevitable-Drag-1704",
            "body": "Why I suggest people to just spam out applications instead of investing our precious emotional energy into the process.\n\nFolks on career boards always say \"...noo you need to tailor the resume\". Please.",
            "score": 22,
            "replies": [
                {
                    "author": "stonkon4gme",
                    "body": "Yes! Do this! Bombard the fuckers - you ain't getting a job anyways, so might as well make things as uncomfortable as possible for the fuckers who refuse to hire you in the meantime.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rich-Pomegranate1679",
            "body": "I once got the \"After Careful Review\" email a few minutes after I applied.",
            "score": 18,
            "replies": [
                {
                    "author": "EvilTonyBlair",
                    "body": "You didn’t meet the AI’s high standards which is why I try to have AI write as much as possible for me when applying for jobs. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Broninkai",
            "body": "Man, i have a useless stem degree that has never worked out for me   I'm between jobs\n\nInterviewed at a fucking grocery store today, they point blank asked me like \"why aren't you looking for work in your field\"\n\nBitch im 9 years out of college and it's never amounted to shit\n\nThey also lost interest in me because they assume I'll just flake once I find something better\n\nI don't care what I do.  It was full time   it paid well.\n\nI've spent most of the last year as a glorified bed delivery guy.\n\nLike holy shit I know I'm ranting but I just feel so worthless I've amounted to nothing.  The best thing I've done is work for the post office part time and for a courthouse as a clerk for a few years.\n\nI have no marketable skills, I can't afford to go back to school to get a tech certificate.  \n\nIt's all just so frustrating\n\nI'm three weeks out of work.  I got fired more or less for asking for a pay raise.   Unemployment claim is like three months wait time.  I can't afford to keep paying my stupid rent that high\n\nI have a wife.  I'm in my thirties.   I hate so so much I can't stand on my own two feet.  That I have to rely on my grandmother's generosity to get by.  \n\nI have tried so fucking hard.  I don't want to be someone, I just want to be enough to survive.  And that's somehow a mountain.  \n\nI don't know where I'm going.  What I'm doing.  What my goals are.  I'm drifting and I just feel so lost.",
            "score": 16,
            "replies": [
                {
                    "author": "Cuddols",
                    "body": "Whatever you do don't try the 'get into tech' route. At least go for sales or something as a direction change because at least stuff like that getting your foot in the door just amounts to someone going 'yeah customers will like that guy probably' and it hasn't got loads of study as barriers to entry if you fail to get in.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "EvilTonyBlair",
                    "body": "Bro sounds just like me! I was banging by head against the wall for all of my twenties and then finally gave up and joined the post office. I don’t recommend the path I took. The mental exhaustion and endless torture of job hunting plus the rejection will crush your ego to a level of insignificance you never could have imagined existed. Bro, the number of times I would stare at a certain utility pole while driving to and from my shitty retail job. It’s a very bad place to be in. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RIP_Greedo",
            "body": "I know the trend is heading away from remote work but perhaps one counterbalance could be companies not wanting actual offices for disgruntled, jokerfied job-seekers to ram a trunk into.",
            "score": 9,
            "replies": []
        },
        {
            "author": "bbusiello",
            "body": "At this point, they should just ghost me. \n\nI'll probably forget that I ever applied.\n\nThe rejection is just a terrible reminder.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Dman_C",
            "body": "In an employer’s perspective:\n“Unfortunately you are not a nepo-baby with unique connections so we won’t be moving forward with you”",
            "score": 9,
            "replies": [
                {
                    "author": "Cuddols",
                    "body": "\"You also aren't downtrodden enough that we can parade you like a zoo animal in promotion materials as an example that we don't only hire the above\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaliforniaExxus",
            "body": "Jobs get mad because people mass apply, but they mass reject without even reading a resume, and that’s supposed to be ok",
            "score": 7,
            "replies": []
        },
        {
            "author": "bub2000",
            "body": "\"we have gone with an internal candidate\"",
            "score": 7,
            "replies": [
                {
                    "author": "joemama123458",
                    "body": "“Whom we knew we were going to pick from day one but had to post the job listing anyway for regulatory purposes”",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Illustrious_Novel305",
            "body": "Thank you for your interest but unfortunately…..",
            "score": 6,
            "replies": [
                {
                    "author": "EvilTonyBlair",
                    "body": "Honestly I would rather they just take me out into the fields and beat me like the shitty printer from Office Space.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaryTriviaDude",
            "body": "I'm convinced at this point that word of mouth and connections are literally the only way to land a job right now.  Got laid off last summer but I have connections in my field, so landed a new gig within the week.  Meanwhile a buddy of mine in IT has been hunting for a new job for half a year now and has had zero luck even with a good resume and solid creds",
            "score": 5,
            "replies": [
                {
                    "author": "Level9TraumaCenter",
                    "body": "Fwiw, the friends-and-word-of-mouth thing has been said to be the most likely venue for about 30 years, as per the old standby \"What Color is your Parachute\" book.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "joemama123458",
                    "body": "Bingo",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CaryTriviaDude",
                            "body": "I'm just dumb lucky there that I have always managed to make and maintain connections with people.  I hate it for friends who are better workers than me but just aren't the social types.  It really sucks out there",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChestNok",
            "body": "Like 2024 was incredibly better",
            "score": 10,
            "replies": []
        },
        {
            "author": "Murky-Ad4697",
            "body": "The only job i've found is as a substitute teacher, but it might lead to a full time position as a high school teacher.",
            "score": 6,
            "replies": [
                {
                    "author": "stonkon4gme",
                    "body": "**might**",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Murky-Ad4697",
                            "body": "It's still a positive direction.  I'm happy to be employed at least.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "EvilTonyBlair",
                                    "body": "**at least** \n\nI’m kidding! Congrats on your success and here’s hoping to your continued success. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ViceCatsFan",
            "body": "I've got so many copies and revisions of my cover letter and resume that I've attached to applications. I've legit probably put in hundreds of hours on applications for a grand total of 1 phone interview that ended up ghosting me anyways. What's the point? This time I'm spending just mindlessly applying and re-entering the same information over and over again, I could be out panhandling and at least making money. I can't help but feel useless.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Nick60444",
            "body": "“While we enjoyed…”",
            "score": 3,
            "replies": []
        },
        {
            "author": "crabadabba",
            "body": "Thanks for taking the time to complete the assessment. It was great getting to know you better. You have some great experience however after reviewing your application we’re sorry to tell you that we won’t be moving forward with your application.\n\n5 mins after submitting assessment",
            "score": 4,
            "replies": []
        },
        {
            "author": "Olympian-Warrior",
            "body": "This is how it felt trying to break into my field post Master’s degree. Lol.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Martian-Sundays",
            "body": "I just skip to the bottom then archive.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Igniszephyrus",
            "body": "I got pretty good at spotting the word \"unfortunately\" without reading the mail",
            "score": 3,
            "replies": []
        },
        {
            "author": "2smart4u",
            "body": "The hands applying the costume should be Indian because that's who's taking the jobs",
            "score": 13,
            "replies": [
                {
                    "author": "torib613",
                    "body": "EXACTLY 💯 💯.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "And1007",
            "body": ":-(",
            "score": 2,
            "replies": []
        },
        {
            "author": "Olympian-Warrior",
            "body": "This is how it felt trying to break into my field post Master’s degree. Lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chrisfit",
            "body": "Is it bad to go into debt for an MBA? I’m about to",
            "score": 2,
            "replies": []
        },
        {
            "author": "angeltay",
            "body": "“You should be editing ur resume for every single job u apply 2” Uhh how? My resume literally just has my name, the places I went to school, and the places I worked. Those three don’t magically change depending on where I’m applying",
            "score": 2,
            "replies": []
        },
        {
            "author": "joldsworth04",
            "body": "Unfortunate Lee",
            "score": 2,
            "replies": []
        },
        {
            "author": "69foryourthot",
            "body": "They be saying the same shit smh",
            "score": 2,
            "replies": []
        },
        {
            "author": "Key_Crab_5780",
            "body": "After no review and quick keyword skim…",
            "score": 2,
            "replies": []
        },
        {
            "author": "JackReedTheSyndie",
            "body": "Best they get is AI made cover letters",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mental_Department89",
            "body": "You guys are getting responses??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Floofy-beans",
            "body": "Every time I see a “noreply@“ email.. even worse if it’s from a company email with a name so for a split second you think it’s a real person contacting you 🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "PokerBear28",
            "body": "Your first mistake was thinking you had a chance",
            "score": 2,
            "replies": []
        },
        {
            "author": "pogoli",
            "body": "😔",
            "score": 1,
            "replies": []
        },
        {
            "author": "artistichic",
            "body": "Where is the lie? 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "mmancino1982",
            "body": "I have never provided a cover letter and get plenty of traction on my resume.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accountant-101",
            "body": "Yall write cover letters? I haven't written one in years",
            "score": 1,
            "replies": []
        },
        {
            "author": "splash07s",
            "body": "thats why chat gpt writes all my cover letters. I mean, if AI is going to review my resume and cover letter it might as well review its own work.",
            "score": 1,
            "replies": [
                {
                    "author": "joemama123458",
                    "body": "Oh yeah, ChatGPT does all my work for me… and everyone else… and that’s precisely why we’re all cooked",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fattdoggo123",
            "body": "Just use chatgpt to make your cover letter and then review it and change a few things to make it sound more natural. They're using AI to review their applications anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jkid",
            "body": "Its basically a life chores, alone side with dealing with emails with job offers which are actually commission only sales and outright check deposit scams.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kripposoft",
            "body": "I'm so sick of it. I just feed my CV into chatGPT and finetune the \"personal\" letter it spits out. They're using AI to dismiss me, I'll use AI to apply.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperCoupe",
            "body": "Same",
            "score": 1,
            "replies": []
        },
        {
            "author": "KingAmeds",
            "body": "🫠🫠🫠",
            "score": 1,
            "replies": []
        },
        {
            "author": "Talmiam",
            "body": "I'm sorry to see it's happening to people with Master's Degrees too. I was thinking about just going back to school for a master's but I suppose that won't really fix anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Landpuma",
            "body": "Experience over education all day long when I’m hiring people.",
            "score": 1,
            "replies": [
                {
                    "author": "joemama123458",
                    "body": "Yep, got years of that too\n\nDoes everyone else have decades??",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Landpuma",
                            "body": "Nah too much experience is a bad thing actually, that means they want or expect more pay. What role are you applying for?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joemama123458",
                                    "body": "Mid-level IT roles, 3 YoE",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Landpuma",
                                            "body": "I work with middle management a lot as I am change management / digital transformation specialist myself. We haven’t been doing any hiring for the past 3 years and I work for a Big 3 global consulting firm. Do you have any people leadership skills? Or are you more front line local IT support?\n\nEdit: just looked at your post history and see you’re in networking and security.\n\nYou may need to apply for a jr role first. Are you applying for roles that require 3-5 year experience? Saw you have 3 years of experience but between 2 different companies so that’s kind of a red flag. Why the change in such a sort period of time?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "joemama123458",
                                                    "body": "1st role wasn’t IT enough it was more of a tech/repair role\n\nNow I’m in IT, no doubt, but it’s way too easy for my skill level and I need something more\n\nI’ve applied for many junior roles",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Landpuma",
                                                            "body": "What would your ideal role be? What’s your passion in IT. For example I started off as service delivery. Local IT / break fix / new hires / migration of devices etc… now I am still in IT but assist Managers and Directors with communication and adoption strategies for IT projects and it’s much more challenging and enjoyable than doing actual IT work. I’ve been at the company for 12 years and slowly worked my way into my role by following my strengths and spike areas. If I were you I would try understand what is it about you that you’re great at doing and try to get a job doing that.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EffectiveSet4534",
            "body": "Oofda. I hope this doesn't happen to me😬",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible-Gur-8238",
            "body": "They’ve moved forward with other candidates who fit their requirements more closely than you\nMy friend….. despite the fact you ticked every box and had more years experience then they were looking for….\n\nWhat they mean is, someone was willing to do it cheaper.\n\nThis market is nonsense and I feel your pain. \n\nKeep going. Because if nothing you do matters, then what you do is all that matters.\n\nOk I stole that from Buffy (or maybe it was Angel) but it rings true.\n\nKeep going guys!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moonrocks321",
            "body": "I had a filter on my inbox for a while that would send any email with “unfortunately” in the body to a rejection folder.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Caroline_Baskin",
            "body": "Hot take - you are doing it wrong. before anyone gets triggered I am not selling anything and not writing a book. Just trying to help.\n\nMy team and I did a passion project to understand what happens to resumes, and how recruiters open them etc,etc... We sent in +100k applications, analyzed +56,000 of them interviewed 112 recruiters and audited 32 ATS. The portion of the study that relates to your post is this:\n\nOn average, 64% of all resumes sent for a job application remain unopened and automatically get rejected + the average amount of time recruiters spend on a resume is 7 seconds. That's because every job (especially if it's remote and pays +$100k) gets 600+ resumes per day for any given position - So multiply that by the # of days a job is open, add to that the fact that the same recruiter sourcing for that job has 15 other jobs to source for, 20 followups a week 12 screenings, 6 trackers to keep up to date and is paid $30/h to take shit from a hiring manager who expects him/her to find Steve Job's love child...you get your answer.\n\nThe only proven way we found to improve the rejection rate is to apply early (within 6h of a job being posted) with a tailored resume, and apply to as many jobs as humanly possible or use AI for that. I hope this helps.",
            "score": 1,
            "replies": [
                {
                    "author": "joemama123458",
                    "body": "Every position I apply to is on-site and has less than 10 applicants",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Caroline_Baskin",
                            "body": "A lot to unpack:\n\n1. Maybe you are not qualified for those jobs - I know that we always think we are but maybe recruiters don't think so.\n2. Applying on Linkedin is the least recommended way to do it. if you are seeing a job on linkedin, chances are it's pretty old. Linkedin is an aggregator and as much as 40% of jobs on linkedin are ghost jobs that go nowhere.\n3. Also the number of people applied on linkedin is just the number of clicks on that button it means absolutely nothing. It's very possible the job was published somewhere else and got 1000 applicants not tracked by linkedin.\n\nIf you don't mind me asking, what kind of jobs are you going for and in which field?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joemama123458",
                                    "body": "Based on the job descriptions I’m more than qualified for 90% of the ones I apply to\n\nI’m in IT, applying for mid-level roles after being in entry level for 3 years now",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ThaPhilosopherKing",
                    "body": "Since you say LinkedIn is old postings is there a site you’d recommend?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EnoughWarning666",
                    "body": "AI is the big takeaway here right now. It's still early enough with AI that I don't think the vast majority are using agents to automate applications. Right now is THE sweet spot for this since you'll get massively more exposure than people that aren't.\n\nEventually this won't work at all since everyone will be doing it. Ride it while you can!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Current_Process_2198",
            "body": "Never go into debt for a grad degree",
            "score": 1,
            "replies": [
                {
                    "author": "joemama123458",
                    "body": "I didn’t\n\nKnow plenty of people who have though",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Present-Wonder-4522",
            "body": "Hate to be a boomer, but my current job I got by handing my resume straight to the manager\n Interview right away. Hired in the car ride home.",
            "score": -5,
            "replies": [
                {
                    "author": "stonkon4gme",
                    "body": "Erg, fucking boomers. 🤮",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Present-Wonder-4522",
                            "body": "I'm not a boomer tho...I start next week. Bye bye shitty old job and it's struggles, hello new job and new shitty struggles.\n\nSalary increase, and increased responsibilities. Several engineers will report to me. The manager said that he's never seen that and likes the type of personality that has the courage to do that. I had nothing to lose, and it turns out I beat all the online applicants-they didn't even get to interview.\n\nBut you do you, hooe it works out.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}