{
    "title": "Let the smiting commence",
    "author": "ExactlySorta",
    "subreddit": "facepalm",
    "rank": 17,
    "score": 16687,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 408,
    "url": "https://i.redd.it/pqhd576qwape1.png",
    "id": "1jdlcc7",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Superb_Temporary9893",
            "body": "It’s amazing how fast Trump can turn any unknown person into a full blown monster in a short period of time.",
            "score": 3234,
            "replies": [
                {
                    "author": "Anxious-Sir-1361",
                    "body": "It looks like he just gave her a chance to be who she dreamed of being... :/",
                    "score": 1496,
                    "replies": [
                        {
                            "author": "Suzuki_Foster",
                            "body": "It's pretty easy to see that she's a shitty person, and she's more than happy to shout it from the rooftops. ",
                            "score": 619,
                            "replies": [
                                {
                                    "author": "Anxious-Sir-1361",
                                    "body": "As an atheist, I don't want to come down on believers, but a subsect of them can be VERY judgemental. She seems to be from that subset...",
                                    "score": 253,
                                    "replies": [
                                        {
                                            "author": "Hates_escalators",
                                            "body": "There's no hate like Christian love",
                                            "score": 202,
                                            "replies": [
                                                {
                                                    "author": "Serious-Maximum-1049",
                                                    "body": "You beat me to it LoL",
                                                    "score": 25,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "KlatuuBarradaNicto",
                                            "body": "I was raised in that “belief”. They are the most condescending, patronizing, judgemental group you will ever have the misfortune of meeting.",
                                            "score": 33,
                                            "replies": []
                                        },
                                        {
                                            "author": "hadmeatwoof",
                                            "body": "Anyone who is voting for Trump is *not* a follower of Jesus. Trump would absolutely crucify him. And they would all be cheering for it.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "Ramtamtama",
                                                    "body": "Crucify? Not deport?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "hadmeatwoof",
                                                            "body": "That’s another possibility, I just thought crucify was the more poetic choice. \n\nIf he were to amass a following as told in the Bible, or probably even call himself a king, I’m sure Trump would feel threatened enough to want to make a public display of power over him. But if he just existed and expressed his beliefs.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Ramtamtama",
                                                                    "body": "Crucify someone with a following like Him and all you'd do is create a martyr",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hadmeatwoof",
                                                                            "body": "Yeah…that’s kinda how the story goes.   🤦🏻‍♀️",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Electromotivation",
                                            "body": "She represents herself as a believer for political points. She doesn’t follow or perhaps know about a single tenant of the religion she claims. If she were told about Jesus’ teachings out of context, she would say it’s hippy communist bs.",
                                            "score": 60,
                                            "replies": [
                                                {
                                                    "author": "_BannedAcctSpeedrun_",
                                                    "body": "You're just describing the average American Christian.",
                                                    "score": 31,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "lexm",
                                            "body": "I’m always saying, if heaven is full of these assholes, I’ll take my chances somewhere else.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "anjowoq",
                                            "body": "I'll do it for you. Belief is a disease that more often brings suffering to the believer and those around them. They judge others against unreality, with disastrous consequences.\n\nFuck 'em.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "jaxonya",
                                                    "body": "Wear a condom and pullout if you do fuck em'... Cuz you don't want to be stuck with crazy for 18+ years",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "thecraftybear",
                                            "body": "I'm not very christian these days, butni sincerely hope there is a hell, if only for all those assholes to burn in forever.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "RaiseEuphoric",
                                            "body": "As a Former-Atheist turned into Spiritual-Agnostic, with a mostly rational worldview (but with some room for Mysticism / Cosmic Karma / Manifest Destiny - whatever you wanna call it - to explain things that are beyond our grasp), I find myself actually wishing for the After-Life: for Heaven & Hell & Purgatory (Limbo) to actually exist. I hope all of it is real.\n\nJust so that the Orange Moron, his band of Sycophantic Yes-Men, his Eccentric Rich Spoiled Sidekick Muskolini, this joke of a Press Secretary & the millions that voted for him - either out of spite: to \"own the libs\", or out of bigotry, or out of selfish \"I want mine, screw everything else\" narrow agendas, or one-issue-voters (like Abortion), or being gullible morons to fall for some flimsy brainwashing & propaganda - I want all of them to go to Hell for eternity! ... I want Hell to exist simply for this Schadenfreude to happen!",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "hcneyfreckles",
                                            "body": "honestly crazy because these people would hate jesus seeing as he wasn’t white 🤷🏼‍♀️",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TGIIR",
                                    "body": "Yep, just a snarky, shitty person.  No shortage of them around, especially the brand with the Jesus crosses.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "outlawsix",
                            "body": "Yeah she clearly enjoys being a huge stupid bitch",
                            "score": 68,
                            "replies": []
                        },
                        {
                            "author": "Stark_Reio",
                            "body": "That's what it boils down to imo. It turns out this country was always full of trash, and trump allows that trash to fully reveal itself. I guess this is the freedom they spoke off. And yes, a lot of religious people are simply so to justify their own horridness.",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "hollycrapola",
                            "body": "He got her best out of her",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FallOutShelterBoy",
                    "body": "She ran for the House in 2022 and lost. So she’s just a fucking loser trying to sound like a tough guy up there",
                    "score": 128,
                    "replies": [
                        {
                            "author": "inf3ct3dn0n4m3",
                            "body": "DEI hire",
                            "score": 86,
                            "replies": [
                                {
                                    "author": "Thick_Aside_4740",
                                    "body": "She had some gender affirming cosmetic care as well",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kholmz",
                    "body": "I am curious as to how someone learns to be a monster like that at such a early age? POS Spin Class 101?",
                    "score": 63,
                    "replies": [
                        {
                            "author": "almstAlwysJokng4real",
                            "body": "\"The years before 5 last the rest of their lives.\" \n\nThe answer is, Parents.",
                            "score": 69,
                            "replies": []
                        },
                        {
                            "author": "bullwinkle8088",
                            "body": "They are raised like that.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Perryn",
                    "body": "MAGA's appeal is inviting the worst people to stop pretending they're not.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Shafter-Boy",
                    "body": "Apparently this bitch is only 27.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "300A_450",
                            "body": "Yeah and her husband is 30 or 32 years older than her ... True love right there.... True love of the money the dude has.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "PoopyMcFartButt",
                                    "body": "Dude must not have that much money if that’s what he ended up pulling",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "CherryCrafty7800",
                                    "body": "My gut feeling is child bride. But I have no proof of this. And am not making an accusation. But that is my current head canon.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Suzuki_Foster",
                            "body": "I'm 45, and she looks older than I do. Hate really ages a person. ",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "Marshmallow2218",
                                    "body": "Really? I'd say she looks about 30.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Marshmallow2218",
                            "body": "She looks her age to me.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EvilBillSing",
                    "body": "I doubt that she wasnt that to begin with. Now she has the stage for everyone to see it.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "SonofaBridge",
                    "body": "He hired them because they’re monsters. Trump didn’t make them that way, he just made it ok to show their true face.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "McDaddy-O",
                    "body": "They took the term \"Bully Pulpit\" literally.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "andrew_kirfman",
                    "body": "They were always monsters.  Trump just gave them a microphone and a platform to spread their already evil selves.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Syntaire",
                    "body": "He has no such superpower. He DOES however have an uncanny ability to attract the most shamelessly despicable, viciously racist pieces of shit masquerading as humans to take into his circles. He's like a beacon in the sea of shit, attracting the most vile creatures the universe has ever conceived.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "TheZippoLab",
                    "body": "![gif](giphy|xT9IgMTULwLjKnFl04)",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "GrandNibbles",
                    "body": "what else can you do as a monster. middle management?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Anteater4746",
                    "body": "Ik it’s really flawed but the Stanford prison experiment showed humans can be fucking ghouls with no consequences",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "capital_bj",
                    "body": "for a lot of them they know their time is short. they got to go hard in the paint to secure that next cush job",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Jimmy_Christ",
                    "body": "She’s the type of Christian that makes it easy to be an atheist.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "catladywithallergies",
                    "body": "No, they were always like that. Trump just made it easier to be their true selves.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AttakZak",
                    "body": "A single man unhinged can take the whole door off.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gundam1945",
                    "body": "By giving someone power, most people can be turned into monsters right away. Look up the Stanford prison experiment",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "therealbonzai",
                    "body": "Trump has the special ability to bring the worst in everyone to surface.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Miserable-Lawyer-233",
                    "body": "Didnt Democrats do that with the DOGE team?",
                    "score": -7,
                    "replies": []
                },
                {
                    "author": "urallphux",
                    "body": "Just because you want your country to be secure, does not make you a monster",
                    "score": -26,
                    "replies": [
                        {
                            "author": "EverAMileHigh",
                            "body": "Oh right, THAT'S what's happening. 🤣🤣🤣",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "backwardbuttplug",
                            "body": "The bitch is a racist, just like the rest of MAGA.  The \"security\" thing is an excuse, nothing more.  \n\nAnd if Trump wanted the country to be secure, he would have had those in charge find a border wall design that wasn't so damn easy to climb... or even had the wall completed.  Neither of which happened.  So go tell your lies elsewhere.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "teddy1245",
                            "body": "And you assume this person cares why?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ConfoundingVariables",
                            "body": "Prove that she just wants her country to be secure.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SirChancelot11",
            "body": "Jesus must be proud",
            "score": 718,
            "replies": [
                {
                    "author": "Dragonfly_pin",
                    "body": "It makes me almost wish he was real, so she would shout ‘Lord, Lord! Haven’t I done many wonders in your name!’ and get to hear him say ‘Yeah, I never knew you. Go away, you who practiced lawlessness.’ as he turns away from her and dismisses her screams of eternal damnation with a shrug.\n\nAlmost.",
                    "score": 223,
                    "replies": [
                        {
                            "author": "UnhappyStrain",
                            "body": "and then he goes to party witth prostitutes",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "WatchAndFern",
                                    "body": "Musk tries to come in. Jesus responds “try getting a camel through the eye of a needle, mother fucker! And I never meant some really tiny alleyway in Jerusalem, I meant a literal camel through a little eye of a needle”",
                                    "score": 41,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Trey-Pan",
                    "body": "I don’t think she even understands who Jesus is or cares about his life philosophies. Anyhow, she has a new cult leader, just it’s the devil incarnate (or maybe something worse?).",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "mingy",
                    "body": "To be fair, Christianity has always aligned itself with wealth and power. Yes, there have been good Christians but the religion has an incredibly brutal and bloody legacy. There is nothing they are doing today in the US which is inconsistent with Christianity as practiced throughout history. All else is marketing.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "TheFirstAntioch",
                            "body": "I would say those in power weaponized Christianity.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mingy",
                                    "body": "It is definitely symbiotic. The churches have contempt for their members and respect for power and wealth. They are more than happy to sacrifice members for power and wealth.\n\nThere are many examples but consider Mussolini, an avowed atheist. He agreed to undergo a public conversion for the support of the Vatican, and granted them statehood and other significant advantages for their support. They were happy to work together because their aims aligned.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "timelord-degallifrey",
                    "body": "So many reasons why I don’t believe in the god of the Bible, but this administration is quickly rising to the top of the list.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "thebendavis",
                    "body": "The way these troglodytes worship trump, jesus may have been a gigantic sack of shit too.  History just did its thing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BludStanes",
                    "body": "Poor Jesus, having to share a birthday with Christmas, that has to suck",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "uey01",
            "body": "If Jesus Christ came back to life, she’d encourage him to self-deport too.",
            "score": 779,
            "replies": [
                {
                    "author": "Groomsi",
                    "body": "![gif](giphy|3o7TKBDXK8zBbmkK8U)",
                    "score": 156,
                    "replies": []
                },
                {
                    "author": "WeakDiaphragm",
                    "body": "Jesus was an illegal immigrant as he journeyed through the middle east teaching love strangers and the poor",
                    "score": 52,
                    "replies": [
                        {
                            "author": "lahimatoa",
                            "body": "Are you in favor of making all immigration legal?",
                            "score": -27,
                            "replies": [
                                {
                                    "author": "hadmeatwoof",
                                    "body": "Jesus would be.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "Azair_Blaidd",
                                            "body": "As would the Founding Fathers, considering it *was* in their day",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Snaccbacc",
                                                    "body": "America was literally built on immigration lmao.\n\nThe irony of Republicans telling people to get out of their country, mf you give “your” country back to the Native Americans first.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dragonfly_pin",
                    "body": "She’d be first in line to throw a stone at his head.",
                    "score": 75,
                    "replies": []
                },
                {
                    "author": "FallOutShelterBoy",
                    "body": "The right wouldn’t believe it was really Jesus because he’d look more like a brown Palestinian rather than a white muscle Chad with flowing locks",
                    "score": 55,
                    "replies": [
                        {
                            "author": "uey01",
                            "body": "And because if they heard him speak, they’d think he was a communist, socialist, liberal, Marxist or whatever.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "bodenheizung",
                                    "body": "Why are you listing the same thing four times?\n\n/s",
                                    "score": 27,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "phuckin-psycho",
                    "body": "Sorry jesus, no room at the inn 🤷‍♀️",
                    "score": 12,
                    "replies": [
                        {
                            "author": "backwardbuttplug",
                            "body": "Sorry jesus, please use the side entrance.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "backwardbuttplug",
                    "body": "Keep Jesus brown!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Mediocre_Daikon6935",
                    "body": "Well, he isn’t an American, he is an Israeli.\n\n\nAnd Jesus lead by example and did self deport, if you remember your Bible.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Excellent_Buy7370",
                            "body": "My favorite true statement that you could wear on a t-shirt and likely provoke a violent reaction is “Jesus was Asian”.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Mediocre_Daikon6935",
                                    "body": "I suppose if you consider the Middle East Asia.\n \n\nI wouldn’t, but there is an argument to be made, sure.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Excellent_Buy7370",
                                            "body": "Its geography, not an argument",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Mediocre_Daikon6935",
                                                    "body": "Geography is not cut and dry.\n\nFor example.\n\nHow many oceans are there?\n\nBecause we don’t agree on that.\n\nIs europe its own continent?\n\nBecause there is disagreement about that.\n\nWhat about north and South America? One continent? ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Excellent_Buy7370",
                                                            "body": "What continent is Israel a part of?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Idrisdancer",
                            "body": "And he’s likely brown skinned",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Mediocre_Daikon6935",
                                    "body": "*shrug* \n\nWe all agree that he had gorgeous flowing brown hair and a 8 pack.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "9-FcNrKZJLfvd8X6YVt7",
                            "body": ">And Jesus lead by example and did self deport, if you remember your Bible.\n\nIf you remembered your Bible, you'd have known that Judas betrayed Jesus with a kiss for thirty pieces of silver.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Mediocre_Daikon6935",
                                    "body": "Which is relevant to the conversation how?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "9-FcNrKZJLfvd8X6YVt7",
                                            "body": ">And Jesus lead by example and did self deport, if you remember your Bible.\n\nYour completely misremembered anecdote about the Bible.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Miserable-Lawyer-233",
                    "body": "Well yes, he'd be subject to the same laws and requirements",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KnottShore",
            "body": "Voltaire:\n\n* \"Of all religions, the Christian should of course inspire the most tolerance, but until now Christians have been the most intolerant of all men.\"",
            "score": 843,
            "replies": [
                {
                    "author": "13endix",
                    "body": "Voltaire is becoming increasingly relevant. Just a shame the people who could benefit the most from reading his work, neither care nor know how to read.",
                    "score": 213,
                    "replies": [
                        {
                            "author": "Faesarn",
                            "body": "Another French author worth reading after hundreds of years is Jean Jacques Rousseau. He wrote 'Du contrat social' in 1762. Basically he explains how a society works and how being a member of a society is like having a contract with the other members to support and defend each other. As soon as a member is attacking another member, he is not covered by the contract anymore and can't use it as an argument to defend himself.\n\nI think this is particulary relevant today as we ear more and more people saying that 'leftists are the most intolerant people' because they don't tolerate other 'opinions' (said opinions being racism, homophobia,..). Jean Jacques Rousseau figured it ou in 1762, not tolerating the intolerable isn't intolerance.\n\nThe saying is true. History will repeat himself if people don't learn from it.",
                            "score": 122,
                            "replies": [
                                {
                                    "author": "Crabbyrob",
                                    "body": "Learning about Rousseau in high school was something I'm very happy I learned.",
                                    "score": 32,
                                    "replies": []
                                },
                                {
                                    "author": "Hearsaynothearsay",
                                    "body": "If Americans read the sources of liberal thought that this country was founded on, we'd be a more prepared polity and some dumbass who references a mythological treatise that they've never read or only cherry picked would be back benched.",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "Stark_Reio",
                                    "body": "> not tolerating the intolerable isn't intolerance.\n\n\nSo many people don't get this. \"You're just propagating hate!\"\n\nNo dumbass, they're protecting society by cutting off the infected limbs.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "13endix",
                                    "body": "Agreed. It’s outstanding, and wild how these core principles remain ever relevant because they can’t be taken for granted. Wrote a paper in law school on Hobbs (leviathan), Locke and Rousseau. \nMight have to dig it out and reread, haha.",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "dopalopa",
                                    "body": "Swiss author 😉 we do have some nice people ☺️",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Faesarn",
                                            "body": "Oh damn you're right, my bad ! Born in Geneva and died in France.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "geraltofrivia783",
                                    "body": "If we truly study his social contract essays, we arrive at communism. As far as I remember, Marx’s work is influenced by the Rousseau’s. \n\nAs a commie, I am elated to hear you name drop ma boi JJR",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "camshun7",
                            "body": "The fucking thing with a world class philosopher such as Voltaire, is that a maga brain is too smooth to understand \n\nMuch",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Hearsaynothearsay",
                            "body": "Crazy is sexy AF - wish Marquise d'Sade had said. Her craziness is screwing with my libido!",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "13endix",
                                    "body": "Snap out of it brother! - Alexander Dumas (probably) Plenty of crazy on the right side of history.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "backwardbuttplug",
                                    "body": "Bet ya money she's horrible in bed.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PrimalBunion",
                    "body": "As a Christian, Voltaire ain't wrong!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Mediocre_Daikon6935",
                    "body": "Voltaire had zero experience with any non Christian religion, and his personal experience was almost entirely with Catholicism, which a vast majority of Christians do not consider a Christian faith.\n\n\nSo there is that. ",
                    "score": -23,
                    "replies": [
                        {
                            "author": "13endix",
                            "body": "It’s almost strictly a US thing to not consider catholics Christians.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "hadmeatwoof",
                                    "body": "And that’s because Christians in the US do not follow the teachings or the example of Jesus.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Mediocre_Daikon6935",
                                    "body": "Perhaps. \n\nBut that is what happens when multiple colonies are founded specifically so people can flee from catholic persecution in Europe.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "rmwe2",
                                            "body": "They were fleeing Anglican, Lutheran, Anabaptist and Calvinist persecution too. Read some history, its fun. ",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "Responsible-List-849",
                                            "body": "You should read the history of Maryland.  You might find it interesting.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "KnottShore",
                            "body": ">zero experience with any non Christian religion\n\nVoltaire wrote the play “Fanaticism” in 1742 where he attacked Islam, and claimed that women are forced to accept the Islamic faith. \n\nLater in his life, modified his initial thoughts on Islam.  In 1751, in his book “Essay on the Manners of Nations”  he defended Muhammad as a judicious political thinker.  In 1765, he wrote “ A Treatise on Tolerance” where he praised Islam. He said that Muhammad, Confucius, and Zoroaster were the greatest lawmakers of the world.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Mediocre_Daikon6935",
                                    "body": "And?\n\nHe had no experience with it. He spent his entire life in one isolated European country.  A country universally and throughout history as being noted for it’s self centered belief it was the center of the universe and pinnacle of human social evolution, despite any evidence to the contrary.\n\nIt is possible he met a few mohammedans in his life, perhaps representing the Ottoman Empire. But he never traveled to, let alone lived in, an Islamic state, or among their people.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "9-FcNrKZJLfvd8X6YVt7",
                                            "body": ">He spent his entire life in one isolated European country.\n\nThere's a proverb: \"It is better to keep one's mouth shut and be thought a fool than to open it and remove all doubt.\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "-Robbert-",
                            "body": "Catholics also think that other christians aren't true christians.\n\nSo there is that.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "Hearsaynothearsay",
                            "body": "This statement is completely devoid of facts historical or otherwise.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Mediocre_Daikon6935",
                                    "body": "Oh? What was his experience with Anabaptists? Quakers?  Anglicans? Lutherans?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "rmwe2",
                                            "body": "If those are genuine questions, I think youd really enjoy reading some history of Voltaire or his own writings. Youd learn so much. Start here:\n\nhttps://en.m.wikipedia.org/wiki/Voltaire\n\nYou can read about his ambassadorship to Protestant Netherlands, which had become a haven for all manner of protestant sects, his love affair with a Protestant French woman in exile, his own exile to Anglican England, his personal correspondence with the Protestant King of Prussia and his lifelong study of religion and extensive travels throughout europe to see different systems of religious and political practice. \n\nIts really a fun read.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "UnhappyStrain",
                            "body": "it certainly does not deserve to be called a faith",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Colonel-Mooseknuckle",
            "body": "They literally do think the videos are fun. Many people say Don Jr. beats off to these videos into his leopard skin socks.",
            "score": 170,
            "replies": [
                {
                    "author": "Anxious-Sir-1361",
                    "body": "LMAO! Oh man, I want to credit this hilarity to one person, YOU! I'll take you at your word, though, if \"many people\" say it...\n\nHe has a gusher if Eric is beside him doing it at the same time. (my own addition!)",
                    "score": 16,
                    "replies": [
                        {
                            "author": "powdered_dognut",
                            "body": "They do this-https://youtu.be/XmmkJ-Y5Y_I?si=c3M9GfLJaih0OCDs",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Anxious-Sir-1361",
                                    "body": "LMAO - Donnie: \"No more playing Siamese twins! You know we only play triplets!\"",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pianoflames",
                    "body": "Dumb question: what fun videos? I feel like I missed something.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ReneeHiii",
                            "body": "These people are referencing videos of people being chained up, deported, held in prison cells, etc. They claim all are illegal immigrants or criminals. Either way, it's sickening how they laugh and think it's fun to dehumanize human beings, even if they're illegal immigrants.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ElPlatanaso2",
                    "body": "I mean it was obvious sarcasm. If it went over your head I'm not sure what to tell you",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Colonel-Mooseknuckle",
                            "body": "My comment was obvious sarcasm. If it went over your head I'm not sure what to tell you.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ElPlatanaso2",
                                    "body": "You either genuinely missed the sarcasm in the video or you didn't and you're fanning the flames. Both no good, imo",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Colonel-Mooseknuckle",
                                            "body": "I don't think you understand how sarcasm works, and now you're fanning the flames. That's no good, imo.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Outrageous_Credit_96",
            "body": "The cross is made out of plastic. It’s the only way they can call themselves Christians and not have the cross burn their skin.",
            "score": 123,
            "replies": [
                {
                    "author": "KennyMoose32",
                    "body": "What’s wild to me is that she’s so *young*\n\nShe’s 27 and looks about 40 and talks like a boomer.\n\nI only wish her and her family the worst, forever. Fascists deserve all the pain they get.",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "Petrivoid",
                    "body": "Or the cross is a meaningless symbol used to signal membership in the \"in-group\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "knightriderin",
                    "body": "Plastic melts into the skin. Nasty stuff.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doctor-Waffles",
            "body": "“Fun videos”\n\nFuck her…",
            "score": 49,
            "replies": []
        },
        {
            "author": "Good_Zooger",
            "body": "This 27 year old is going to look 50 by May.",
            "score": 152,
            "replies": [
                {
                    "author": "captain_sticky_balls",
                    "body": "Trying to look like her husband.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "NoPantsSantaClaus",
                            "body": "He's 60. \n\nHe's her retirement plan. ",
                            "score": 38,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Starman1001001",
                    "body": "But she’ll score on a book deal and will never have to worry about health care.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "NoPantsSantaClaus",
                            "body": "Doubtful. \n\n- MAGA's don't read books, only bumper stickers. \n\n- She couldn't even ghostwrite a book. ",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "glassceramics1963",
                            "body": "\"Barbie Stepford Talks Tariffs \"",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VoidMunashii",
            "body": "\"Christians\" like this, and organized religions wonder why less people believe in a creator deity?",
            "score": 32,
            "replies": []
        },
        {
            "author": "ernapfz",
            "body": "Any chance she will one day realize she's in a fun video?",
            "score": 89,
            "replies": [
                {
                    "author": "mishma2005",
                    "body": "I can bet she has a few with her \"old man\"",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "AGuyWhoBrokeBad",
            "body": "“I can’t vote for Harris cause both side are the same.” /s",
            "score": 99,
            "replies": [
                {
                    "author": "ManlyEmbrace",
                    "body": "Then they would congratulate themselves on what an enlightened free thinker they are.",
                    "score": 28,
                    "replies": []
                }
            ]
        },
        {
            "author": "Responsible-Pain-620",
            "body": "Absolute psycho woman",
            "score": 51,
            "replies": [
                {
                    "author": "PoopyMcFartButt",
                    "body": "I hate this bitch so much",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mighty_joosh",
            "body": "There's no hate quite like Christian love",
            "score": 22,
            "replies": []
        },
        {
            "author": "Biscuits4u2",
            "body": "What a piece of disgusting trash this bitch is.",
            "score": 20,
            "replies": []
        },
        {
            "author": "No-Giraffe-8096",
            "body": "Vile. I hope there’s a hell so all of these “Christians” can burn in it.",
            "score": 30,
            "replies": []
        },
        {
            "author": "Sky-Soldier0430",
            "body": "Changing the commandment to love thy white neighbor only",
            "score": 13,
            "replies": [
                {
                    "author": "hadmeatwoof",
                    "body": "Thou shall have no other gods besides me and Trump.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "HalfCatTheMan",
            "body": "Proof that there is no God, and if there is, they are certainly an asshole!",
            "score": 13,
            "replies": []
        },
        {
            "author": "Dragonfly_pin",
            "body": "I was reading about how the Nazis ‘encouraged people to self-deport’ as well.\n\nThe famous children’s book ‘When Hitler Stole Pink Rabbit’ by Judith Kerr is about ‘self-deportation’, or as it is more commonly known, ‘running for your life from Nazis’.",
            "score": 15,
            "replies": []
        },
        {
            "author": "KaleidoscopeOk5763",
            "body": "Just an actual demon",
            "score": 11,
            "replies": []
        },
        {
            "author": "FunKyChick217",
            "body": "“Fun videos” hateful twat.",
            "score": 15,
            "replies": [
                {
                    "author": "drdalebrant",
                    "body": "Seriously disgusting thing to say.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "FunKyChick217",
                            "body": "Her or me? She is a hateful twat.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "drdalebrant",
                                    "body": "Oh, her obviously",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "remarkablewhitebored",
            "body": "People have stormed gates for less, I think.",
            "score": 13,
            "replies": []
        },
        {
            "author": "rickshaiii",
            "body": "The fact that these \"Christians\" haven't been punished by God is pretty good proof against their own beliefs.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Ok-Abbreviations543",
            "body": "Such cruelty. She’s seems to have a deep respect for the Rule of Law. Except for the fact that she works for a convicted felon and adjudicated rapist. I guess she is a little more flexible in that area of her life.",
            "score": 9,
            "replies": [
                {
                    "author": "backwardbuttplug",
                    "body": "It's always whatever means to get their ends.  These are the same people who drive around with thin blue line flag stickers but will happily attack police once they're in the way.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CountPeter",
            "body": "I feel like I'm going nuts, but I don't see a cross?",
            "score": 9,
            "replies": [
                {
                    "author": "Remarkable-Laugh9762",
                    "body": "im with you.  there's no cross in the photo and it's fucking with me",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnazzyCazzy1",
            "body": "Is it crazy to say i hate and despise her more than Trump? She is one of the least educated people i have seen in Politics in such a long time and she comes out with such an ego like she earned her position. Idk, i just hate her more than the 🍊",
            "score": 9,
            "replies": []
        },
        {
            "author": "poeticdisaster",
            "body": "How incredibly embarrassing for a White House Press Secretary to behave the way she has been.  The combativeness and outright lies.... the US is so fucked.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Archhanny",
            "body": "You keep calling yourselves Christians... I don't think it means what you think it means.",
            "score": 8,
            "replies": [
                {
                    "author": "mimimemi58",
                    "body": ">I don't think it means what you think it means\n\nlol that's every Christian.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Groomsi",
                    "body": "And she's using the talisman around her neck as a shield.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pinksamuraiiiii",
            "body": "She’s pretty disgusting and aloof",
            "score": 8,
            "replies": []
        },
        {
            "author": "Penfold_for_PM",
            "body": "Over the decades I've watched many Press Secretaries at the podium, this one is a real Christian rapture drunk tool asswipe. When we watch from overseas & see this, it's hard not to shake the head in disbelief.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Fantastic-Ice-1402",
            "body": "Vile human being. The goons in Trump's cabinet are the lowest of the lowest levels of human being. Stephen Miller and this lady are the most disturbing and perfect fits for someone like Trump.",
            "score": 7,
            "replies": []
        },
        {
            "author": "OGGuitarsquatch",
            "body": "Anybody can be deported now.\n\nThey're not talking to foreigners or illegal immigrants anymore. \n\nThey're talking to the American people.",
            "score": 6,
            "replies": []
        },
        {
            "author": "coffeeplease1972",
            "body": "Repulsive and an embarrassment not just to my country, but human decency",
            "score": 25,
            "replies": []
        },
        {
            "author": "mfyxtplyx",
            "body": "> How that cross doesn't burn into her chest is the real miracle.\n\nShe's old school and prefers to burn crosses manually.",
            "score": 5,
            "replies": []
        },
        {
            "author": "imaneyeguy",
            "body": "There’s not hate like Christian love…",
            "score": 4,
            "replies": []
        },
        {
            "author": "mindguru88",
            "body": "What a fucking bitch, both the one in the Oval and this fascism Barbie.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Impressive_Wish796",
            "body": "What’s with MAGA women and all these gold crosses? It’s total blasphemy!!",
            "score": 8,
            "replies": [
                {
                    "author": "PissSphincter",
                    "body": "Lower case \"t\" s. It's the first letter of their diety's last name.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "bluddystump",
            "body": "She will be in for a surprise when she is sent off to the breeding stables.",
            "score": 6,
            "replies": []
        },
        {
            "author": "HailToVictors21",
            "body": "Damn Trumps administrators are such immature kids. Act like you are part of the best country in the world and a government official. This JR High shit they pull is exhausting to listen to or read.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Elmer-Fudd-Gantry",
            "body": "She is such a pos. Repulsive.",
            "score": 4,
            "replies": []
        },
        {
            "author": "exotic_floral_tea",
            "body": "Nothing to see here, just history repeating itself.\n\n![gif](giphy|xdLH51eNWZAHrwy5mf)",
            "score": 4,
            "replies": []
        },
        {
            "author": "Over-Reflection1845",
            "body": "I hope she is eaten by a meth-addled crocodile on her next visit to Mar-a-Lago.",
            "score": 4,
            "replies": []
        },
        {
            "author": "_nixon_vibe_",
            "body": "Individually, any one of these crazy fucking stories would be headline news, careers would be over, people would be fined or prosecuted, become social pariahs. \n\n\nThere issue is, they’re occurring dozens of times a day under this administration and it’s all getting watered down with all the other bat shit crazy, no one seems to be picking up on this cesspool of absolute insanity. \n\n\nHow are the American people okay with this and just being like “ohh well”.",
            "score": 4,
            "replies": [
                {
                    "author": "Iwasanecho",
                    "body": "And every comment is pushing the republicans up and the Dems down. It's a mono narrative that is sadly successful.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OTGbling",
            "body": "Fun videos?? These MAGA culstist are actually getting off on this shit.",
            "score": 5,
            "replies": []
        },
        {
            "author": "djandyglos",
            "body": "Fun video is a nasty turn of phrase",
            "score": 6,
            "replies": []
        },
        {
            "author": "Fit_Debate_5890",
            "body": "I was just cooking dinner and my elderly mother had on Fox News. The absolute bullshit they were spewing is bonkers beyond belief. Suggesting \"tattooed, rapist, drug dealing, illegal immigrants\" don't deserve due process even though it's clearly written in the constitution. Defending Trump's golf trips because they were on weekends. \"Dumb-ocrats\" every ten seconds. Trump delusional syndrome or whatever the fuck they're calling it. The lack of decorum and logical reasoning is mind-blowing. I've been seeing a lot of misinformation going around Reddit and I try to call it out every time, but I am confounded by how an actual \"news\" organization is just blatantly lying to people and they're sucking it up.",
            "score": 4,
            "replies": []
        },
        {
            "author": "fancysauce_boss",
            "body": "How the fuck did someone not interrupt her and ask her to clarify what she meant as “fun videos” and if that was the official stance of the president and White House, and then follow up asking what about them was fun.",
            "score": 3,
            "replies": [
                {
                    "author": "Iwasanecho",
                    "body": "Like everyone in his government, step out of line and you lose. Dictatorship",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dramoriga",
            "body": "She really embraces her role as Sauron's mouthpiece, huh?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Psychological_Tap187",
            "body": "You know I don't like to rundown my fellow woen, but she s an exception.  She is a  A horrible individual.   A psycho hose beast, a b with a capital B.   She is the B all the little b's strive to be like.   I hate her face as much as I do trumps.",
            "score": 4,
            "replies": []
        },
        {
            "author": "azraels_ghost",
            "body": "Aren’t these the same people who expect to be judged for their actions when they reach a certain set of gates?",
            "score": 3,
            "replies": []
        },
        {
            "author": "whiskeytown2",
            "body": "LOL. \"Actively self deport\" 🤡",
            "score": 3,
            "replies": []
        },
        {
            "author": "GreyBeardEng",
            "body": "How much have we spent on deporting 137 people?",
            "score": 3,
            "replies": []
        },
        {
            "author": "ladybug68",
            "body": "Her time is coming in this life or the next. God doesn't like ugly, and Karma doesn't play.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FaraSha_Au",
            "body": "I swear, she is Kluxer bitch.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SpellslutterSprite",
            "body": "The fact that she’s not getting smote by righteous divine fury leaves me only two options to believe in:\n\n- there is no God in the Christian sense, or\n\n- there is a God, and He deeply, deeply hates us all",
            "score": 3,
            "replies": []
        },
        {
            "author": "remembertracygarcia",
            "body": "No greater demonstration of the gods’ apathy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NIN10DOXD",
            "body": "I'm sure cross burning is her favorite pastime.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SpecificBeyond2282",
            "body": "It’s even funnier that she hasn’t worn the cross as often after everyone started making fun of her💀",
            "score": 3,
            "replies": []
        },
        {
            "author": "Scribe_Data",
            "body": "Because the devil runs the world now. I’m convinced the rapture happened well before our time and this is purgatory.",
            "score": 3,
            "replies": []
        },
        {
            "author": "slipped-my-mind",
            "body": "Fun videos hmmm 🤔",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rae-O-Sunshinee",
            "body": "I have never been more embarrassed to be an American citizen.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Adventurous_Ocelot90",
            "body": "Funny videos.....remember all these words  immigrants....when they come and ask anything of us...make sure we all answer with the same smug way they have.....let's all remember this...",
            "score": 3,
            "replies": []
        },
        {
            "author": "Spiritual-Hawk-6575",
            "body": "Horrible person.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BrinedBrittanica",
            "body": "Elon and Melania - she’s talking to you both",
            "score": 3,
            "replies": [
                {
                    "author": "hadmeatwoof",
                    "body": "I thought Melanie already did…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "duskrat",
            "body": "She's deport Jesus in a hot minute. Maybe she already has.",
            "score": 3,
            "replies": []
        },
        {
            "author": "tawwkz",
            "body": "They deported a surgeon, a specialist for kidney transplants, professor at a university, with a valid work visa. \n\nFreedumb!!! \n\nP.S. thoughts and prayers for your kidney function.",
            "score": 3,
            "replies": []
        },
        {
            "author": "IamGodHimself2",
            "body": "Evil piece of dogshit",
            "score": 3,
            "replies": []
        },
        {
            "author": "FH-7497",
            "body": "Man, she makes his last one seem like a peach lol Kaylie McAny or whatever her name was at least looked uncomfortable when parroting vile shit lol this bitch here revels in it",
            "score": 3,
            "replies": []
        },
        {
            "author": "baltosteve",
            "body": "The Sociopathology ain’t a bug with this crowd. It’s a feature.",
            "score": 3,
            "replies": []
        },
        {
            "author": "rainprayer",
            "body": "aint no hate, like Christian love.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TObias416",
            "body": "Cruelty is the point. They're \"getting revenge\" because they're \"the victims\", righteous in their self vindication and unbound by decency and traditional human rights, nor by Christianity's historical \"turn the other cheek\" tradition,",
            "score": 3,
            "replies": []
        },
        {
            "author": "Bluetoes1",
            "body": "It’s just a prop to trick the gullible",
            "score": 3,
            "replies": []
        },
        {
            "author": "Separate-Owl369",
            "body": "I stand corrected… women can be dickheads.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Armpitlover33",
            "body": "So does the Orange Turd actually employ women? That’s fucking woke. She should be in her kitchen, cooking for her 70 year old master and pumping babies from her vagina until her shelf life expires.\n\nDEI hire!\n\n/s before perma-banned to hell",
            "score": 3,
            "replies": []
        },
        {
            "author": "GWPulham23",
            "body": "Actual evil, in real time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GWPulham23",
            "body": "I thought televising human misery for entertainment was the stuff of dystopian nightmares - until the arrival of American fascism. It'll take decades for this filth to wash off.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Queen_of_dogs_01",
            "body": "*\"Fun videos\"* I feel like throwing up rn",
            "score": 3,
            "replies": []
        },
        {
            "author": "BackgroundNPC1213",
            "body": "Deuteronomy 10:19, as told by Supply Side Jesus:\n\n>And you are to offer those foreigners the opportunity to self-deport, for you were once foreigners in Egypt but your own immigration was justified because Manifest Destiny.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beeeeater",
            "body": "Can we ask Karoline Leavitt to please self-destruct?",
            "score": 3,
            "replies": []
        },
        {
            "author": "GovernmentKind1052",
            "body": "And I thought Huckabee was bad…",
            "score": 3,
            "replies": []
        },
        {
            "author": "mamazena",
            "body": "L\n\n![gif](giphy|9HLhzss53Vg40)",
            "score": 3,
            "replies": []
        },
        {
            "author": "toongrowner",
            "body": "Let me guess. Every self reported Person also get a nice little Star they can Put in their clothes",
            "score": 3,
            "replies": []
        },
        {
            "author": "smokedalabaster",
            "body": "I feel like she idolizes Dolores Umbridge\n\n![gif](giphy|briDeU1X4LIYw)",
            "score": 3,
            "replies": []
        },
        {
            "author": "chaostheories36",
            "body": "“Fun videos.” Ah, yes. The joy of watching your neighbor being ripped from their home and family to be sent who knows where. \n\nGood ole’ fashion American values. \n\nBecause your neighbor is stealing your money, not >![redacted by rich people].!<",
            "score": 5,
            "replies": [
                {
                    "author": "RyanOz66",
                    "body": "They aren't my neighbor, they're the seat squatters that jumped in when I was up to get a beer at thr stadium.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "thenamelessone888",
            "body": "What an evil c**t.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Memysterious7567",
            "body": "A whore",
            "score": 7,
            "replies": [
                {
                    "author": "bear843",
                    "body": "Using your alternate account I see. So brave.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Memysterious7567",
                            "body": "You saw it wrong, kid. This is the only account I got💀",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "bear843",
                                    "body": "I appreciate the correction, old timer. However, I’m not sure I agree with your original assessment.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Memysterious7567",
                                            "body": "You got no idea how ruined my day just got, young one",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bear843",
                                                    "body": "My apologies, Father Time.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "Memysterious7567",
                                                            "body": "I'll try to survive, youngling",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "jpow_did_it",
                                                                    "body": "Both of you just stop it",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bear843",
                                                                            "body": "He started it 🤣",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Memysterious7567",
                                                                                    "body": "You came here crying kid",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "bear843",
                                                                                            "body": "The fact that I’m a kid has nothing to do with this. I just don’t think women deserve to be treated the way you were apparently raised to treat them. Do better. Provide actual criticisms of her. Don’t just use vulgar name calling. Act your age",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Memysterious7567",
                                                                                                    "body": "I was raised to treat with respect people who are worthy of it. Anyone that makes fun of mass deportation is unworthy of respect. Trump is a whore. Elon is a whore. Rubio is a whore. Don't go about commenting things you know little about, youngling.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "bear843",
                                                                                                            "body": "Must drive you nuts that they just keep getting away with it. These next 4 years will be a real struggle for you. If you need someone to talk to I’m here for you.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Memysterious7567",
                                                                                                                    "body": "I can't be deported, and don't work at the federal government. My issue is with people other than myself. A trait some people are better raised to understand than others. Won't expect anything from a child on this regard, or any other, though",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "bear843",
                                                                                                                            "body": "I know, right? Those darn republicans and their preferred way of doing things. We should hold an election and let the American people decide what they want.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "weardofree",
            "body": "This woman will burn in hell if thier is any after life but pepole should help her discover which one she will enf up in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mikey06154",
            "body": "Thank her god that Egypt did do the same to her Jesus ,Mary, and Joseph when they illegally fled into Egypt fleeing violence.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Elegant-Raise",
            "body": "That might require her having a soul.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BlueberryUnique5311",
            "body": "Having this government rise to power and their support definitely seems like the plot of some satanic takeover",
            "score": 2,
            "replies": []
        },
        {
            "author": "Awkward_Bench123",
            "body": "She’s young, she’s nasty and she’s blond, so she represents the president to a tee.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mmarshall32",
            "body": "\"Did I say death camps? I meant happy camps.\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "bofoshow51",
            "body": "“We are encouraging criminals to self-arrest to maybe save themselves from being beaten and killed by the cops”\n\nI hate this timeline, I want off this ride, there are no adults in the room anymore.",
            "score": 2,
            "replies": []
        },
        {
            "author": "aKaRandomDude",
            "body": "Propaganda Barbie.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wise-Panda944",
            "body": "Is it just me or is this b**** gives off firecracker from the boys vibes",
            "score": 2,
            "replies": []
        },
        {
            "author": "blackpearl1477",
            "body": "Shouldn't they deport themselves? After all they themselves are descendents of Europe. \n\nOw wait... Even the Europeans don't want MAGA idiots there. 🙄",
            "score": 2,
            "replies": [
                {
                    "author": "Groomsi",
                    "body": "Send them to Russia, all MAGA, confederates and GOP.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "WoodpeckerHorror3099",
            "body": "Because she is the embodiment of Jesus, she is doing the lords work….*he said dripping in sarcasm *",
            "score": 2,
            "replies": []
        },
        {
            "author": "cobaltsteel5900",
            "body": "Nothing has quicker convinced me of no omnipotent higher power than them using the name of that supposed higher power to do the most evil shit and… nothing…\n\nIf I were a higher power I’d be pissed about all this being done under the cover of my name, especially if I told my creations not to do that shit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KinklyGirl143",
            "body": "She’s such a C! And no, I don’t mean Christian.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chillpickle17",
            "body": "She from NH. Wouldn’t shock me if she’s somehow related to the people that accused women of being witches and needlessly burned them at the stake.\n\n![gif](giphy|yP7nkODXhxx8ePDOE1|downsized)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kenji1912",
            "body": "They wear the cross with pride, but are devil incarnate",
            "score": 2,
            "replies": []
        },
        {
            "author": "DuskelAskel",
            "body": "Best proof that Christian or whatever monotheist god doesn't exist is those people Honestly.\n\nIf something exist, it mist be a omnipotent pile of tentacles somewhere on the multiverse, and we have nothing to do with it",
            "score": 2,
            "replies": []
        },
        {
            "author": "Onlypaws_",
            "body": "She finds it insulting that you’ve suggested that you know more about jesus than she does. And she now regrets having given a question to the associated press.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeloresDelVeckio",
            "body": "God is My Scapegoat.",
            "score": 2,
            "replies": []
        },
        {
            "author": "anjowoq",
            "body": "What a team of complete fucking assholes. \n\nI wish the absolute worst misery and agony for all of them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SchmartestMonkey",
            "body": "I wouldn’t piss on her if she was on fire.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Healthy-Winner8503",
            "body": "She things WWJD means Whom Would Jesus Deport",
            "score": 2,
            "replies": []
        },
        {
            "author": "Desperate_Move_5043",
            "body": "Please god, if you’re out there, smite these heathens.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SinistralGuy",
            "body": "Not only is that stupid, but the US government is holding people who are also actively trying to leave the country. Efficient use of American taypayers' money right there",
            "score": 2,
            "replies": []
        },
        {
            "author": "Intelligent_Ad6619",
            "body": "Something that these people don’t understand is once these 4 years are up, they’re practically done. Imagine going to an event, dinner, family gathering or anything where you’re not in your closed circle. Life is going to be hell for these people and I’m so happy. Trump only has so much left and he is okay with staying in his golf world where he wins his own tournaments and gets sucked off behind his wife’s back. But for these younger people trying to get on this train is truly eye opening and can’t wait tilll all this comes full circle and she can’t even eat at a restaurant or go to a sports game like a normal person. Can’t wait for these 4 years to be over and watch them all try and distance themselves. What they are doing is great because they are labeling themselves for future administrations to specifically target. I saw the more they show who they are, the bigger chance we have of getting rid of these scum fucks and watch them go into hiding once their daddy is done talking.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Decaf17",
            "body": "She’s Catholic?   They love torture and pain.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Soggy_Bid_3634",
            "body": "She’s going to be a star when the revolution is televised!",
            "score": 2,
            "replies": []
        },
        {
            "author": "psychoacer",
            "body": "Yeah you don't want to be in a video with Dr. Phil. Anything he's in will get you laughed at.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThoughtsandThinkers",
            "body": "Just the cruelty that is so apparent from the Trump administration. \n\nThe sheer hypocrisy of the importance of rules. It’s Whilhoit’s Law: For these kinds of  conservatives, laws exist to protect but not bind in-group members who can rape, steal, lie, and worse. At the same time, laws exist to bind out-group members (non-White, women, LGBTQ, etc) but not to protect them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MissTalullah",
            "body": "Ah a future female Hitler in the making. How charming.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Miserable-Lawyer-233",
            "body": "That's fair.  I don't see anything wrong with that statement.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bazil2point1",
            "body": "So people in the USA hear the words coming out of her mouth and aren’t appalled and forced to action ?\nEven if you wanted those being deported out you should have a problem with this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KlatuuBarradaNicto",
            "body": "They gloat and revel in the suffering of others. They make jokes about people’s pain. You have to be a special kind of slime mold for that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lavacadotoast",
            "body": "Who  TF is Fred Wellman and why am I just now agree/laugh/chugging in his honor?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mr_GoodbyeCruelWorld",
            "body": "Her cross is there to remind Jesus what’ll happen if shows up",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sandman64can",
            "body": "It doesn’t burn because it represents something not real.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fedora_and_a_whip",
            "body": "Fun videos? Imagine being the proud of being that shitty.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jorgerine",
            "body": "A very nasty mouthpiece",
            "score": 2,
            "replies": []
        },
        {
            "author": "Biannual_salamander",
            "body": "I don't normally condone trashing women for their looks, but jfc she looks like a blow-up sex doll",
            "score": 2,
            "replies": [
                {
                    "author": "Tank-Pilot74",
                    "body": "I’d rather fuck a fleshlight I found on the beach",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LuckyComedian",
                    "body": "![gif](giphy|Yc0QV015pAID0twqh0)\n\n![gif](emote|free_emotes_pack|joy)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Careless_Writing1138",
            "body": "I always thought they would rely on self deportation.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Top-Sandwich-2215",
            "body": "It doesn't burn her, because religion is utter bollocks, dumb fuck.\n\nFUCK",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lobo9498",
            "body": "This bitch needs to get what's coming to her.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Conscious-Coconut-16",
            "body": "The cross doesn’t burn into her chest since God isn’t real.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lonezomewolf",
            "body": "The answer is... there is no god...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Immediate-Loquat-878",
            "body": "The World changed so fast ..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intrepid_Freedom_652",
            "body": "By far, the least religious administration ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "digidave1",
            "body": "May they rot in hell ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoTheRightThing1953",
            "body": "Oh the Christianity!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProfessionalSky2087",
            "body": "Wearing a cross, knowing full well that if Jesus himself came back and showed up in America, she would cheer, watching him get deported. This regime, everyone involved, including their voters are absolutely trash.",
            "score": 1,
            "replies": []
        },
        {
            "author": "travturn",
            "body": "\"Saint Anselm College, a place that is infused with the Catholic and Benedictine values of community, hospitality and love\" -President Joseph A. Favazza, Ph.D.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dashKay",
            "body": "I don’t see the cross",
            "score": 1,
            "replies": []
        },
        {
            "author": "mmcallis1975",
            "body": "She has to be the most ignorant c*nt I’ve seen. Yes I know that’s a harsh word but I feel that it fits the situation",
            "score": 1,
            "replies": []
        },
        {
            "author": "FuzzyMcBitty",
            "body": "Can you “self-deport” the without valid documents?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MakeththeMan",
            "body": "Just because you’re a Christian doesn’t mean you are a good person. Growing up a close friend a very earnest Christian went away to a youth camp with other like minded people, because they didn’t think he was cool,  no one spoke to him all weekend and he came home and attempted suicide.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yellow_LedBetter2020",
            "body": "🤣cross burning on her chest! 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "6dp1",
            "body": "The cross is not a holy symbol",
            "score": 1,
            "replies": []
        },
        {
            "author": "kaztrator",
            "body": "If you truly want to encourage them to self deport then start a program where non-citizens can schedule free airline tickets, paid by the government, to their home country once no questions asked. No need to show papers, no need to talk to ICE, just hop onto American Airlines or Delta or wherever, click that you’re a self deporting non citizen, put in your info, get your free ticket and get out. The airline then just bills the government for all the self deporting tickets at a negotiated price per ticket and that’s that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kjacobs03",
            "body": "If god was real, it would",
            "score": 1,
            "replies": []
        },
        {
            "author": "TopTopp",
            "body": "It has already begun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PaddyDelmar",
            "body": "Hmmm Jesus was an illegal immigrant that deserved birthright if I remember the Bible I have read",
            "score": 1,
            "replies": []
        },
        {
            "author": "Large-Lack-2933",
            "body": "I wonder what Trump's former press secretary from the 2017-2021 era is up to these days?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shad0XDTTV",
            "body": "Just further proof that religion isn't real",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iwasanecho",
            "body": "She's made from the same cloth he is. She enjoys winning against the reporters. She's clever, she can spin anything and make it sound good. Devoid of heart though. Utterly. If this horrid regime continues over a number of years shes the kind that would end up being president, president evil.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight-Extreme-966",
            "body": "They all pay lip service to religion because its where idiots lurk that have been proven to be pliable with stupidity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scorpio83G",
            "body": "Let’s not pretend her religion doesn’t condone genocide and slavery",
            "score": 1,
            "replies": []
        },
        {
            "author": "vShotaku",
            "body": "I don't think you understand what \"illegal\" means, they're illegal for multiple reasons reasons, legal immigrants are not the problem here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jk8fan",
            "body": "If there is hell, she's taking the express. No matter what she does for the rest of her life, she's rotten to the core and this stuff will live on forever. I hope it haunts her in life. I hope it tortures her in the afterlife",
            "score": 1,
            "replies": []
        },
        {
            "author": "appa-ate-momo",
            "body": "Am I blind? She isn’t wearing a cross?\n\nLike I get the joke, but…",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdministrativeTrust5",
            "body": "This is the real TRUMP DERANGEMENT SYNDROME.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Understanding-Fair",
            "body": "I'd love a reporter to ask her a question using Jesus' words on immigrants. Just watching her completely implode would give me so much joy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "isanyofitreal",
            "body": "🤦‍♀️🤦‍♀️",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrindBastard1986",
            "body": "Why do people think Christians are supposed to burn up when they do or say smth that others regard as un-Christ-like? 2,000 years of propaganda, that's it.\n\nJesus was never a nice guy or the socialist people portray him as. Jesus is a character people attach their own BS to, to make it matter. \n\nMatthew 10:34-36\n>34 “Do not think that I have come to bring peace to the earth; I have not come to bring peace but a sword. 35 For I have come to set a man against his father, and a daughter against her mother,\nand a daughter-in-law against her mother-in-law,\n36 and one’s foes will be members of one’s own household.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "knightriderin",
            "body": "She's getting more smug from day to day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SadRoxFan",
            "body": "The Demon of Babylon disguises themselves with the coat of the righteous",
            "score": 1,
            "replies": []
        },
        {
            "author": "fivegenerations",
            "body": "I would get her pregnant just to abandon her",
            "score": -1,
            "replies": []
        },
        {
            "author": "Savings-Cry-3201",
            "body": "This is what Christians are, the lie has been that they’ve been anything else this whole time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aduecan",
            "body": "Shouldn't be an illegal immigrant then.",
            "score": -12,
            "replies": [
                {
                    "author": "teddy1245",
                    "body": "Incorrect",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bitter-Cockroach1371",
            "body": "![gif](emote|free_emotes_pack|joy)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Altruistic_Finger429",
            "body": "Are people in favor of or against illegal immigration into their country?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Lyrail",
            "body": "Best White House speaker in 30 years\n\nLove the way she delivers",
            "score": 0,
            "replies": []
        },
        {
            "author": "arkhamknight001",
            "body": "Just rename this subreddit to r/america or r/politics already",
            "score": -4,
            "replies": []
        },
        {
            "author": "PaulLee420",
            "body": "How is that not a novel plan? Self deport so you don't get an immigration ban, and come back to the United States legally just like many many other families have throughout history?",
            "score": -10,
            "replies": [
                {
                    "author": "teddy1245",
                    "body": "So is it that you can’t learn or won’t?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mediocre_Daikon6935",
            "body": "The Bible is pretty clear about not being a criminal.",
            "score": -8,
            "replies": [
                {
                    "author": "rmwe2",
                    "body": "Yeah, like that gang affiliated refugee Jesus and his illegal immigrant parents who defied Herods legal order to turn their infant into the authorities. ",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Mediocre_Daikon6935",
                            "body": ":-)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "snowlynx133",
                    "body": "Jesus himself was a criminal lmfao",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Mediocre_Daikon6935",
                            "body": "Not according to Roman Law.\n\nOr, for that matter, Jewish, since he was in fact the Christ Prophesied ",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "snowlynx133",
                                    "body": "If he wasn't a criminal, why did the Romans prosecute him?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Mediocre_Daikon6935",
                                            "body": "They specifically washed their hands of it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheSaultyOne",
            "body": "She hot af",
            "score": -9,
            "replies": []
        },
        {
            "author": "sedtamenveniunt",
            "body": "You know people are supposed to follow the law in Christianity, right?",
            "score": -12,
            "replies": [
                {
                    "author": "snowlynx133",
                    "body": "Then why didn't Jesus crucify himself?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "rmwe2",
                    "body": "Thats not what the bible says. Jesus was an illegal refugee, led a gang of treasonous heretics, intervened to stop completely legal law enforcement against adulterers and supported prostitutes and thieves. He did also preach non-violence, but himself violently and illegally assaulted money changers and denied them their legal right to set up shop in temples.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "NHiker469",
            "body": "She’s just the best. Love her to pieces.",
            "score": -9,
            "replies": []
        },
        {
            "author": "Notforyou1315",
            "body": "At this point, I actually feel sorry for her. She has to go out there, in front of the world, and sell her soul a little bit more each day. I know it is her job, but for the rest of time, it will be her face and name attached to these stupid things she has to say. I can't help but feel pity for her. In 4 years, when all of this is over and done with, the next president cleans up the mess, she can't ever go back to being just a normal citizen. She will have to constantly explain to people that, yes, she was that person that said all of those things. \n\nLike, she actively has a choice in this. She can stand up for herself and start actually researching the things she is saying. She could practice in front of others to get opinions on how dumb these things sound. Instead of doing the grown up thing, she chooses to bury her head in the sand and just do as she is told. It hurts my soul to think that she is choosing to ruin her life a little bit each and every day. \n\nSo, yes, I feel bad for her.",
            "score": -6,
            "replies": [
                {
                    "author": "TieMelodic1173",
                    "body": "Did you feel bad for Jean Pierre who had to go out and there and lie for 4 years?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}