{
    "title": "Not skilled!",
    "author": "HealthyMolasses8199",
    "subreddit": "facepalm",
    "rank": 9,
    "score": 1438,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 18,
    "url": "https://i.redd.it/maa8egqflfpe1.jpeg",
    "id": "1je2hcw",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Farnsen",
            "body": "r/TrumpCritizesTrump",
            "score": 84,
            "replies": []
        },
        {
            "author": "Kiss-a-Cod",
            "body": "A tweet for every occasion",
            "score": 37,
            "replies": []
        },
        {
            "author": "TrippKinky",
            "body": "Now buy my beautiful, new, very effective Trump Home Pregnancy Test. It's the greatest, most-reliable pregnancy test on the market, more reliable than fraudulent Plus-One pregnancy test or useless and not-very-easy Clear Blue Easy pregnancy test. Trump Home Pregnancy Test will show you the truth for only $39.95! Hurry up and order because for a limited time, we'll throw in this MAGA onesie. Very cute and probably going to be a collector's item and worth much more in the future.",
            "score": 24,
            "replies": [
                {
                    "author": "BackgroundNPC1213",
                    "body": "If I didn't have a conscience I'd absolutely be buying cheap Trump merch and selling it at a 500% markup. Gotta afford eggs somehow",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Quicker_Fixer",
                            "body": "Don't forget to produce them in China, ship them from Vietnam and have them stick on a label saying \"Made in the USA\".",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BG_fourteen",
            "body": "“Inability to negotiate properly- NOT SKILLED”\nHad to dumb it down for his followers",
            "score": 9,
            "replies": []
        },
        {
            "author": "smiffer67",
            "body": "Did Obama do anything to Iran? I thought it was trump that did that, taking out the general with his blades bomb thing and took all the credit. Same with the Isis dude he killed like a dog.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fraggnetti_",
            "body": "The man said he was the President of Peace Or did he? Can't remember.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Positive_Owl_2024",
            "body": "It is a downright lie. Obama signed a major nuclear deal with Iran.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hoopy_Dunkalot",
            "body": "He only uses the best words when threatening Iran.",
            "score": 1,
            "replies": [
                {
                    "author": "chameleon_123_777",
                    "body": "And Iran would only use their biggest and best bombs in return.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Hoopy_Dunkalot",
                            "body": "Not a chance because they are so sacred of the strong beautiful boy with the bigliest words.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dabaptist121",
            "body": "It is impossible to underestimate Donald Trump, just enough braincells to stop him from eating his own leg",
            "score": 1,
            "replies": [
                {
                    "author": "Groomsi",
                    "body": "Mr Bonespurs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Charming-Command3965",
            "body": "Did not age well",
            "score": 1,
            "replies": []
        }
    ]
}