{
    "title": "Trump humiliated as Putin keeps US President 'waiting over an hour'",
    "author": "RodBoron",
    "subreddit": "facepalm",
    "rank": 3,
    "score": 2346,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 181,
    "url": "https://www.msn.com/en-gb/money/other/ukraine-live-trump-humiliated-as-putin-keeps-us-president-waiting-over-an-hour/ar-AA1B8lxM",
    "id": "1je83d5",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "-SaC",
            "body": "I hope Trump said 'thank you'.",
            "score": 1,
            "replies": [
                {
                    "author": "RemarkableArticle970",
                    "body": "Thank you sir\nMay I wait some more sir?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Anxious-Sir-1361",
                            "body": "\"Appreciate it sir, I needed a few more minutes to collect my thoughts.\" \n\nThey look at each other and both simultaneously burst out laughing! \n\n\"Ok, ok... I don't have any thoughts other than how bad of a boy Joe Biden is. Here's the deal tell me everyone in Russia thinks crooked Joe is dumb and I'm the best president in US history and you can have the Ukraine.\" \n\nPutin: \"Done, comrade Trump.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "taytrapDerehw",
                                    "body": ">comrade Trump\n\nKraznov*",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "glibbed4yourpleasure",
                                    "body": "*chef's kiss*",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "taytrapDerehw",
                                    "body": ">comrade Trump\n\nKraznov*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "subterfu9e",
                            "body": "And no thanks to the tea",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "YPVidaho",
                                    "body": "And \"I'm good, over here by the door. You can have the window seat.\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NaivePermit1439",
                    "body": "Humiliated by both Putin and Musk.\n\n What a guy, a real good guy with a beautiful body and policies., yes real policies, not like that Obama Biden guy. He never had policies. They were illegal. Europe sucks. They are illegal too. Europe is totally illegal and I am going to deport all of them. \n\nThe USA has lost the plot. I am of the belief that Americans are indoctrinated from a young age ( made to say the pledge of allegiance in school. Made to sing the National anthem at every mundane event etc.\\] and now they are torn about doing what is right and fear of being called a traitor.\n\nAmerica was founded in a rebellion against what they saw as tyranny. I hope to fuck you find that courage once again.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jaxonya",
                            "body": "America basically is split 70/30 and the only thing we really agree on is that we don't agree on basically anything. The most unified we e been in the last 60 years was right after 9/11.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fuschia_taco",
                                    "body": "Don't forget Epsteins ~~murder~~ suicide. Everyone pretty much agreed on that too.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kreios007",
                                            "body": "Not that it yielded a damn thing. Epstein was swept under the rug along with his files.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LouFrost",
                                    "body": "That unity, unfortunately, didn’t last too long for some people.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "korkkis",
                            "body": "What Musk did now?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Slow_Pay_7171",
                    "body": "Maybe he forgot his suit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "9lobaldude",
                    "body": "Gotta wait for the boss",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Pen_dragons_pizza",
                    "body": "Likely dropped to his knees when putin walked in more like",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SecretPrinciple8708",
                            "body": "“Oh, no, thank you, DumbOld. I don’t want to do *that* this time. I don’t want to smell like bad hamburger, catchup, and old man breath again.”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hawkwise83",
                    "body": "Trump said it after he wiped the cum off his face.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IronRakkasan11",
                    "body": "After going down on Putin, I bet he did say thank you",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Speedvagon",
                    "body": "And asked for more",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "h20poIo",
                    "body": "First a 4 year old humiliated Trump, now Putin follows suit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "earthspaceman",
                    "body": "Was he wearing the nice suit?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Brave_Nerve_6871",
                    "body": "\"Thank you boss for speaking to me\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LuckyGonosz",
                    "body": "It's impolite to speak with your mouth full",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "erublind",
                    "body": "\"I am Reek\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fakeymcfakey18",
            "body": "“Well you know, I wanted to leave but the guy is my boss” Donald Trump",
            "score": 1,
            "replies": [
                {
                    "author": "Ask_bout_PaterNoster",
                    "body": "Honestly with all the hatred trump stoked and the harm he does by extorting businesses and exploiting workers, keeping trump locked away for an hour might be the nicest thing Putin’s ever done. Well, I guess the extorting and exploiting continues in his absence, but at least there’s less sexual assault",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Smart-Journalist2537",
                    "body": "Boss with an extended edition cut of compromised video of trump with 2 hookers",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "patrickvand",
            "body": "He’s so being played 😂\nThinks he’s the king, but really he’s the jester.",
            "score": 1,
            "replies": [
                {
                    "author": "zoinks690",
                    "body": "Jesters are entertaining.  He's a boob.  Ok boob's are entertaining too.  He's a poorly educated rich kid that has gotten his way too often for no good reason",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Designer_Emu_6518",
                            "body": "Boobs are cool. And better to look at.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rage_melon",
                    "body": "That is offensive to jesters my sir !",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MVP2585",
                    "body": "At this point he’s the kings wiper.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Minimum_Run_890",
            "body": "Power move",
            "score": 1,
            "replies": [
                {
                    "author": "claymore2711",
                    "body": "Remember Trump's \"Power handshake\"?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Reasonable-Aide7762",
                            "body": "What? No? How?   Is it because his hands are so small it makes everyone else feel “bigger”?   Lmao",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Supremagorious",
                                    "body": "Trump's \"power handshake\" is that when he shakes someone's hand he typically yanks them toward himself to throw the other person off balance. It's meant to be a \"total power move\" but just makes him seem like an overbearing asshat.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "lemmeseeyourkitties",
                                            "body": "Yeah, like shoving old ladies out of your way because you don't like walking behind a queen",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "planetpluto3",
                    "body": "Truth.  Russian power move they have long used.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jaxonya",
                            "body": "They have another power move that involves a window. Maybe Putin pulls that ole trick out one day",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BoursinFreak90",
                                    "body": "Would love to see Trump try to spell defenestration",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "richincleve",
            "body": "Sometimes it making someone wait for an hour.\n\nSometimes it's letting his dog roam around during a meeting.\n\n[https://edition.cnn.com/2016/01/12/europe/putin-merkel-scared-dog/index.html](https://edition.cnn.com/2016/01/12/europe/putin-merkel-scared-dog/index.html)",
            "score": 1,
            "replies": [
                {
                    "author": "Apple2727",
                    "body": "Putin has a small dick confirmed.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Real_Nugget_of_DOOM",
                            "body": "Do you think that's how he and Donny mushroom bonded? In a support group for tiny, deformed peckers?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ABeard",
                                    "body": "Makes sense w Elon in it also.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SuccessValuable6924",
                    "body": "Sometimes it's politely pouring water in her glass:\n\n\nhttps://www.cda.org.ar/img_articulos/images/avatar/Prensa/FotosNotas/putin_cfk_rus.jpg",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RandomStuffGenerator",
                            "body": "If it had been tea, maybe we wouldn’t had ended up with Milei",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PrscheWdow",
                    "body": "When I look at those photos, I feel bad for Merkel AND the dog. It's like the dog knows she's being used for intimidation purposes and feels bad about it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CarinReyan",
            "body": "So ironic. If it were anyone else, Trump would quickly take to his stupid 'troof social' and post some CAPTALISED GARBAGE word spaghetti about poor leadership, low IQ and how \"nasty\" the person who made him wait was.  \nBut since it's Putin I suspect we'll just some some bullshit about how successful he thought the meeting was.",
            "score": 1,
            "replies": [
                {
                    "author": "winnipesaukee_bukake",
                    "body": "Poop* Social",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JR_1985",
                    "body": "‘Troof sential’",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MoRoDeRkO",
            "body": "Putin has other shit to do than listening to another rambling from a governor of America Oblast’",
            "score": 1,
            "replies": []
        },
        {
            "author": "Different_Net_6752",
            "body": "The world's biggest bitch. \n\n\nOf course he waited for an hour. ",
            "score": 1,
            "replies": [
                {
                    "author": "SheetPostah",
                    "body": "His little mushroom was probably hard the whole hour, with the anticipation of being pissed on by Daddy Vladdy.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KidKilobyte",
            "body": "I believe Trump likes to do this to other non-Putin officials. Expect many meetings to be made to wait on Trump soon to repair his ego.",
            "score": 1,
            "replies": [
                {
                    "author": "Tall_Taro_1376",
                    "body": "I had a commander in the Army who was a textbook malignant narcissist. He would have his secretary call someone on the staff and tell them to report to the commander immediately.  If they weren’t there in 1-2 minutes, he gave them hell. If they arrived promptly, he’d leave them waiting for an hour and then spend 30 seconds with them to pass on some trivial bit of information or ask a simple question. I beat his system by becoming friends with his secretary and would spend the time bantering with her. He was bothered that she seemed to enjoy talking with me so I’d always make sure to laugh a little louder than normal so he could hear. If she wasn’t there I always had something to read and would sit there enjoying the break. After a few episodes he quit playing the game with me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bebop_Rocksteady27",
            "body": "But was he wearing a suit?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ginsoda13",
            "body": "That’s what little bitches do, they wait for daddy. You won’t hear Trump complain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Ad7798",
            "body": "I doubt very much that trump has enough sense to be humiliated.",
            "score": 1,
            "replies": [
                {
                    "author": "JohnGazman",
                    "body": "Hopefully the media will report it like this and he'll spend the day screaming at the news.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Apprehensive-Yard-59",
                    "body": "You are probably right. He has humiliated himself countless times, but he seems to be completely unaware of it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nonamanadus",
            "body": "Fuck Trump's knees must have been sore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HanIylands",
            "body": "Would love for that bastard Reagan to see this 🤣🤣🤣🤣",
            "score": 1,
            "replies": [
                {
                    "author": "mdavis360",
                    "body": "He’s currently burning in hell but maybe they gave him an hour off to watch this.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HanIylands",
                            "body": "I’d hope so. His zombie corpse rage-slapping Drumpf is top of my 2025 list of not to be missed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Old-one1956",
            "body": "Putin is notorious for keeping people waiting it is his way of showing dominance this has happened to many world leaders and businessmen, not surprised at all",
            "score": 1,
            "replies": []
        },
        {
            "author": "ohiotechie",
            "body": "Hilarious. Putin is literally the ONE person on the face of the planet that Trump is openly subservient to and who he never, ever, under any circumstances criticizes or bullies on social media.\n\nWhatever Putin has on him it must be good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jah_Rules",
            "body": "![gif](giphy|HQdi5i0cowDuksH8GW)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shielo34",
            "body": "Hopefully Trump retaliates by making Putin wait 2 hours on the next call, and so on, until 4 years goes past without incident.",
            "score": 1,
            "replies": [
                {
                    "author": "Boxofmagnets",
                    "body": "That will never happen",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "aeolus811tw",
            "body": "we all knew Trump is putin’s bitch, same as musk",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotACyclopsHonest",
            "body": "“Thank you for calling the Kremlin. Your call is very important to us. Please continue to hold.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "NameCorrect",
            "body": "Battle of the cluster b. Always entertaining.",
            "score": 1,
            "replies": []
        },
        {
            "author": "steveschoenberg",
            "body": "“Let’s not forget who is the boss.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "timelord-degallifrey",
            "body": "He probably has a humiliation kink.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shinji_Okami",
            "body": "Of course, a puppet must obediently await its master after all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "25StarGeneralZap",
            "body": "I mean most subordinates have to wait for their boss so….",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoopTransplant",
            "body": "How many Big Macs is that?",
            "score": 1,
            "replies": [
                {
                    "author": "jpm0719",
                    "body": "Not enough...wish he would finally find the number that does him in.  A guy can hope right?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Public-Scientist3940",
            "body": "Did Trump at least thank Putin for granting him an audience?",
            "score": 1,
            "replies": []
        },
        {
            "author": "2stinkynugget",
            "body": "One of the most important things to Putin, is to humiliate the USA.  Trump is going to be humiliated by Putin on a historic level.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zealousideal_Dirt_13",
            "body": "Did he give Alaska back to Russia?",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Wonder_Weasel",
            "body": "Did trump chew him up for it? If he didn't, he is owned by Putin. Not like it was ever a guess, but confirmation is nice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infamous-Salad-2223",
            "body": "Lmao, a classic Putin's move.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Furitaurus",
            "body": "Nothing new here really, putler does this to pretty much every leader he's supposed to meet with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "M3r0vingio",
            "body": "New order for agent krasnov",
            "score": 1,
            "replies": []
        },
        {
            "author": "5141121",
            "body": "To be humiliated would imply the capability to feel shame.\n\nWe already know he doesn't have that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sane-asylum",
            "body": "Hilarious that a country with a supposedly vaunted military (since disproven) that can’t win a war against a (supposedly) weaker opponent can still make the leader of the free world wait.  I really hope this pisses off President Fuckwad and he gets mad enough to overfund Ukraine",
            "score": 1,
            "replies": []
        },
        {
            "author": "satnam14",
            "body": "lmfao he got alpha-ed",
            "score": 1,
            "replies": []
        },
        {
            "author": "pcpgivesmewings",
            "body": "That is a long time to wait to suck someone off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "goodbyegoosegirl",
            "body": "“I shall call you Reek.” Putin",
            "score": 1,
            "replies": []
        },
        {
            "author": "Boombabyfor333",
            "body": "Not uncommon. I make my pet wait for me too",
            "score": 1,
            "replies": []
        },
        {
            "author": "--crazy1--",
            "body": "Trump: \"Putin let me wait for one hour. He must have more cards than me. I will remain submissive. \"",
            "score": 1,
            "replies": []
        },
        {
            "author": "ITGuy107",
            "body": "Putin doesn’t respect Trump but Trump is a Fanboy of Putin. Trump is being led as a bitch and he doesn’t know it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BobTheViking2018",
            "body": "That's a test.",
            "score": 1,
            "replies": [
                {
                    "author": "Boxofmagnets",
                    "body": "And America failed",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StrengthDazzling8922",
            "body": "Breaking news, Putin has also demanded as part of any peace agreement with Ukraine, that Donald Trump gets Greenland and the Panama canal. Putin’s way of saying thank you to Donald for bringing him a piece of Ukraine, excuse me, peace in Ukraine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amerlis",
            "body": "Humiliated? That presumes a nonexistent parity. This is merely the hired help reporting as ordered and the boss will see you when he fucking feels like it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CardiologistFit1387",
            "body": "The real question is...who brought the lube?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrogLock_",
            "body": "Classic power play from putin, did the same to American journalists when he spoke to them. He is showing trump he owns him, that his time matters less than his masters",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdScary1757",
            "body": "He let a country with a GDP smaller than Texas treat him like a Lil bitch.  Again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sunshinehair76",
            "body": "He was waiting longer if what I saw on Fox last night is accurate. I was up late, 2am pacific time, and decided to scroll Fox to see what those goofs are up to. I saw a headline blasting ‘Happening Now!’ about this phone call. So 5am DC time and 12pm Moscow time. It made me laugh because that means Trump had to be on the line before dawn while Putin got a reasonable midday call time. I clicked and read some comments, read another few articles. Then back on the home page I notice the headline changed to ‘Happening Today!’. I woke up at about 8:30am and out of curiosity I pop back over and the headline is screaming ’Happening Now!’ again. True story.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gentiscid",
            "body": "He spent that hour watching baby X while Elon giving some american intel to the russians.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gnzofbrixton",
            "body": "I’m familiar with that. My boss keeps me waiting too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit_Strength_1187",
            "body": "Wait, Putin kept Musk waiting over an hour? How does that humiliate Trump?",
            "score": 1,
            "replies": []
        },
        {
            "author": "K3rat",
            "body": "lol, was that disrespectful enough?  Did Putin choose to wear casual clothes too?",
            "score": 1,
            "replies": []
        },
        {
            "author": "cloudy_ft",
            "body": "If there is anything I learned about money and power is, the people who have it are clearly not normal... The ability to just disconnect from the impact of the decisions have on everyone and yet they troll or want to have some type of dick measuring contest really tells you something. \n\n  \nThe difference in leadership I've seen over my life is insane. To have such a lack of empathy for other human beings can only be explained by some type of serious mental disorder.... Similar to serial killers... \n\nHearing **actual stories** of people who are impacted by the layoffs and the lack of empathy due to the false-characterization by Musk and Trump is pure batshit evil and greed at its worse. \n\nMAGA would rather protect people who will ultimately fuck them, instead of the people who are supporting the  government to **actually** help them out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DerZappes",
            "body": "Vladimir showed his puppet who's boss. Rather typical behaviour for the guy, actually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComeOnCharleee",
            "body": "Damn. That's like... at least 2 diaper changes",
            "score": 1,
            "replies": []
        },
        {
            "author": "gohabssaydre",
            "body": "The art of the deal!",
            "score": 1,
            "replies": []
        },
        {
            "author": "queuedUp",
            "body": "Probably waiting until Trump had his diaper changed",
            "score": 1,
            "replies": []
        },
        {
            "author": "bungholio99",
            "body": "Putin did this always, but Merkel made it an bad hour later for him when he arrived.",
            "score": 1,
            "replies": []
        },
        {
            "author": "burnerfemcel",
            "body": "He should have Elon call and see if Putin moves faster for him. Then he'll know where he stands",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tall_Taro_1376",
            "body": "He accepts that there boss’ time is more important so he doesn’t feel humiliated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "namotous",
            "body": "nah! Trump is honoured that Putin had time for him lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Potential-Run-8391",
            "body": "The ring wraith was happy to wait for its master. ",
            "score": 1,
            "replies": [
                {
                    "author": "Kwaterk1978",
                    "body": "Fat gollum…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Orangesteel",
            "body": "Can I have the tape back now. I want to watch the golden shower footage in the Oval Office with Leon Skum.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bald_Man_Cometh",
            "body": "The Michael Scott approach.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Friendo_Baggins",
            "body": "Any Negan fans?\n\n“I stuck my dick down your throat and you thanked me for it.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mrrrrggggl",
            "body": "That's what servants do, they wait on their masters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "les2moore350",
            "body": "Is the war over? He promised he'd end it today.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial_Cheetah875",
            "body": "Haha Putins bitch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EarlGrey1806",
            "body": "He doesn’t realize that he  thinks  he’s the adoring dog  who wants to sleep by the Master but really is just a mongrel who lives outside in the cold.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoggedStooge",
            "body": "Ah. So it wasn’t that the call was long, just that Putin was forcing on Trump (again).",
            "score": 1,
            "replies": []
        },
        {
            "author": "lococo72",
            "body": "If I was a president that would never happen what a shame !",
            "score": 1,
            "replies": []
        },
        {
            "author": "gr8hanz",
            "body": "Like the dog that he is. Yet Trump was pissed at the British Prime Minister for treating all the other EU members with respect. He wanted to think he got special treatment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MVP2585",
            "body": "“We are sorry, but all our operators are busy at the moment. So please be a good little bitch and stay on the line until Putin decides you are worth his time.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jd234512",
            "body": "Putin likes his men weak",
            "score": 1,
            "replies": []
        },
        {
            "author": "Basil-Economy",
            "body": "It was ok for Trump to do it to Queen Elizabeth, though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Car_is_mi",
            "body": "Donald was overheard saying \"I would have waited longer. Double. Triple the time even. To get my orders from my daddy.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Contribution-138",
            "body": "Wow, is Trump and the MAGA supporters really going to take this disrespect? \n\nGuess we really know who the little bitch is. I mean, we knew all along, but I’m sure MAGA will continue to cosplay like they are the alpha. Meanwhile they happily swallow all of Putin’s salty offspring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cappin",
            "body": "Too bad he kept the Governor of the US waiting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tgvyhb505",
            "body": "What a shame. Donny had to be on the phone at 9:00 am, so he had to get up early for this too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zbignich",
            "body": "![gif](giphy|t1P1MgBLHAm6Wa0Fst)",
            "score": 1,
            "replies": []
        },
        {
            "author": "gol10",
            "body": "“I am your apprentice, what is thy bidding master”",
            "score": 1,
            "replies": []
        },
        {
            "author": "FromTheCaveIntoLight",
            "body": "Power move by Putin and Trump can’t play hardball to his daddy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Primo131313",
            "body": "I don't wait 5 min for anyone.  What a beta",
            "score": 1,
            "replies": []
        },
        {
            "author": "5footfilly",
            "body": "Are we sure Putin was keeping the MAGA Maniac waiting, or was he just giving the little bitch enough time to lube?",
            "score": 1,
            "replies": []
        },
        {
            "author": "lnc_5103",
            "body": "Did Trump not say thank you?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BreweryStoner",
            "body": "Putin pulled a trump lmao 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "darose",
            "body": "He came for his annual review.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darose",
            "body": "He came for his annual review.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darose",
            "body": "He came for his annual review.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crawdadicus",
            "body": "When Putin did have time for the Orange Shit Stain, Trump was made to sit with his ass hanging out of an open 4th story window.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SecretPrinciple8708",
            "body": "Must’ve been a bad, little boy, and made Daddy Putin angry.\n\nThere’s your strongman, Republicans.\n\nLOL DumbOld’s li’l simps are in their feels. Love to see it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting_Tone6532",
            "body": "Trump was there bending over, bum hole in the air waiting for over an hour for his master to penetrate him.\n\n🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "brukental",
            "body": "Getting his marching orders so they can coordinate the bullshit they will feed to Fox News tomorrow! The master can keep him waiting however long he fucking wants",
            "score": 1,
            "replies": []
        },
        {
            "author": "maddrummerhef",
            "body": "Good",
            "score": 1,
            "replies": []
        },
        {
            "author": "blkpingu",
            "body": "Trump just wanted Putin to notice him :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "AMonitorDarkly",
            "body": "Reminds me of the scene in Succession where Logan let the phone ring for just long enough so the President knew he was being made to wait.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rdldr1",
            "body": "*Stalin* move.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dman45EVA",
            "body": "He got on his knees after that hour wait.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Then-Raspberry6815",
            "body": "Pathetic ",
            "score": 1,
            "replies": []
        },
        {
            "author": "captcraigaroo",
            "body": "You just know Putin calls him \"little bitch boy\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fast-Damage2298",
            "body": "Wait until Putin decides Trump gets no war spoils from Ukraine. Trump will roll over and take it, like a true simp.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lothleen",
            "body": "Putin actually just forgot \"spring ahead, fall back\" since the USA is the only dumb country that has daylight savings switch... /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "saundra79h",
            "body": "![gif](giphy|l0MYOUI5XfRk4LLWM|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "LostDragon1986",
            "body": "But Putin has said how he respects comrade Trump so hugely much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spudman14",
            "body": "If you don’t have the Jewish backing you won’t get elected as simple as that. Now who runs the government. Always behind the curtains.",
            "score": 1,
            "replies": []
        }
    ]
}