{
    "title": "150 seconds of extreme rampart gameplay",
    "author": "VirtualToilet",
    "subreddit": "apexlegends",
    "rank": 5,
    "score": 193,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 55,
    "url": "https://v.redd.it/ohws76chlgpe1",
    "id": "1je6sw8",
    "selftext": "",
    "comments": [
        {
            "author": "HoosierDadddy",
            "body": "Always the craziest part of Toilet clips is the 'No Damage Counter' aspect - literally don't know a single person that does this. Feel like it's helpful for so many reasons!",
            "score": 50,
            "replies": [
                {
                    "author": "garfieldswilly",
                    "body": "Not only is it helpful, this guys making seem like hes just \"better\". If you watch top corner alot to see how much dmg hes doing, plent of those mfs were at/under 100 hp. Its also to hide any 16 dmg shots as better ones. He then also turns it off up there in the corner. Lame as shit",
                    "score": 6,
                    "replies": [
                        {
                            "author": "throwaway19293883",
                            "body": ">He then also turns it off up there in the corner. Lame as shit\n\nLol mixtape just doesn’t display that for certain game modes, he isn’t turning it off",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "BruceLee312",
                                    "body": "Health bars made the game a lot easier for everyone, it would be cool if there was no health bar in ranked. \n\nI like less shields in the game personally I watched some old clips I had from support meta and holy shit I can’t even count the clips thrown at the other team before a we could wipe them looooool it was wild",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "throwaway19293883",
                    "body": "I’ll turn off the damage numbers occasionally so I can focus solely on the target and my aim. I only do it in mixtape though when practicing, the info is too important in BR",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Lower_Preparation_83",
                    "body": "I miss no-healthbars Apex so much. \n\nI remember how much everyone hated them, but everything became quiet over time. It's so depressing. The worst addition they've ever made to apex since the 25 base shield reduction.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "All_hail_Korrok",
                            "body": "Yep people just grow compliant and any anger dissipates because there's so many things wrong with the game.\n\nFor me, everything is so cluttered. The UI is horrible and point of interest before a game is atrocious. I have no idea why they thought covering your entire screen like that was helpful.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Mastiffbique",
                            "body": "A lot of people still hate them and comment about it.\n\nVisible HP bars and now the low TTK has made the game a lot less fun, IMO.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dry-Response8134",
            "body": "wtf i thought u were hitting no regs n then i realised u have damage numbers off lol",
            "score": 20,
            "replies": []
        },
        {
            "author": "Drekkel",
            "body": "Nice clip bro you really showed those default skin players lol",
            "score": 8,
            "replies": []
        },
        {
            "author": "dz_greka",
            "body": "150 of superglide script",
            "score": 34,
            "replies": [
                {
                    "author": "Robo56",
                    "body": "autoexec cfgs (the base for superglide scripts) were disabled by respawn over a year ago now. This is not a script lol. He even has the keyboard overlay on.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Resident-Hedgehog-25",
                    "body": "Just because you Can’t do movement doesn’t mean no one can. “sCrIpTs”",
                    "score": -33,
                    "replies": [
                        {
                            "author": "KrToph",
                            "body": "I also randomly press \"P\" and \"J\" before my non scripted super glides :)",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Altruistic-Listen-76",
                                    "body": "He uses rdfg instead of wasd, so yeah pressing p and j isn't crazy",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "VirtualToilet",
                                    "body": "Good observation. P, J and O are actually mapped to my mouse side buttons. For holstering weapon and weapon 1, 2 respectively. Very important for using movement in a fight.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IWillFlakeOnOurPlans",
            "body": "Babe wake up, Toilet’s new bullying people on mixtape post just dropped",
            "score": 3,
            "replies": []
        },
        {
            "author": "Konzilla435",
            "body": "Your clips make me wanna play apex again ngl",
            "score": 5,
            "replies": []
        },
        {
            "author": "Mysterious-Length308",
            "body": "??? Its not even BR",
            "score": 3,
            "replies": []
        },
        {
            "author": "Illogical_Saj",
            "body": "Seems a little extreme",
            "score": 5,
            "replies": []
        },
        {
            "author": "CHICAG0BEARS",
            "body": "Should be ban for the wheel exploit.",
            "score": 7,
            "replies": [
                {
                    "author": "Mastiffbique",
                    "body": "wheel exploit?\n\nIf you mean using scroll wheel to tap-strafe, then you might as well ban every MnK player.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MMS-",
                    "body": "Go play Halo buddy. Sounds like its more your speed",
                    "score": -22,
                    "replies": []
                }
            ]
        },
        {
            "author": "bRomanticore",
            "body": "Get new material.",
            "score": 6,
            "replies": []
        },
        {
            "author": "JaceUpMySleeve",
            "body": "Slowly destroying the player base one super glide at a time.",
            "score": 4,
            "replies": [
                {
                    "author": "IWillFlakeOnOurPlans",
                    "body": "Yup, I’m all for advanced movement but this is just a dude sweating his ass off in the most casual playlist in the game, it’s lame as fuck.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Lower_Preparation_83",
                    "body": "If you get mental breakdowns from facing better opponent you shouldn't be playing videogames in the first place.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "Suspicious-Engine412",
                            "body": "No, just annoyed that you have to sweat in every aspect of this game.\n\n\nApex is tiring and boring to play knowing you're just clip fodder to nerds like this.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Lower_Preparation_83",
                                    "body": "don't play then?:)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JaceUpMySleeve",
                            "body": "Thanks for the heads up.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DrBloodBomb",
            "body": "Where is the toilet avatar 😔. Nice clip btw",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jchantra85",
            "body": "Any advice on how to do backwards/sideways/boomerang super glide?\n\nI can do super glides just fine. Just doing what you're doing in the videos is mind boggling. 😵‍💫",
            "score": 2,
            "replies": [
                {
                    "author": "NoRiskNoGainz",
                    "body": "Play on pc. Can’t be done on console im pretty sure.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sad-Ad7796",
            "body": "bro what are your keybinds, you go to D key then jump striaght to P key i cant make sense of it",
            "score": 1,
            "replies": []
        },
        {
            "author": "random_interneter",
            "body": "I hate Sheila more than the next guy, but I was really hoping for some carnage when you spun it up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "umdv",
            "body": "No sheila slide action = bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "stanelope",
            "body": "Superb gaming.",
            "score": 1,
            "replies": []
        },
        {
            "author": "This-User7635",
            "body": "the best rampart main ever, all of your clips are absolutely insane :)",
            "score": 1,
            "replies": [
                {
                    "author": "Useful-Newt-3211",
                    "body": "any rampart above a diamond shits in this guy's toilet",
                    "score": -6,
                    "replies": [
                        {
                            "author": "This-User7635",
                            "body": "I haven’t had the pleasure of meeting many movement Ramparts in Diamond as her pickrate in that particular rank is only about 1%, and the percentage of those with crazy superglides and tap strafes is bound to be even lower.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Altruistic-Listen-76",
                            "body": "No? This guy uses his walls perfectly, has insane aim and movement, and has good positioning. Like he might be the best rampart in the world",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Impressive-Koala4742",
            "body": "Good gameplay man, people like you are the reason why casual players like us can't even relax in LTMs",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoctorRageAlot",
            "body": "I love that you only survived because of superglides in the beginning. Almost like it’s an exploit",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoRiskNoGainz",
            "body": "Yeah that movement is bullshit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Karamubarek",
            "body": "Man, I need to learn that backwards cover-jump",
            "score": 0,
            "replies": []
        },
        {
            "author": "avidmuffin",
            "body": "Such a beast",
            "score": 0,
            "replies": []
        },
        {
            "author": "ExoShaman",
            "body": " I humbly request you bring back the googly-eyed toilet on the screen you used to have Mr. u/VirtualToilet \n\nThank you for the awesome clips regardless",
            "score": -2,
            "replies": []
        },
        {
            "author": "MichiganSucks14",
            "body": "My girlfriend started playing this game a few months ago, her first ever shooter; mixtape is her favorite but she hates getting stomped by sweats - which tends to happen frequently. She has already debated uninstalling a few times. Anyways, that was a totally unrelated comment I thought I'd share with you for no reason at all.",
            "score": -1,
            "replies": [
                {
                    "author": "PoliteChatter0",
                    "body": "ill coach her just because I hate Michigan too",
                    "score": -1,
                    "replies": [
                        {
                            "author": "MichiganSucks14",
                            "body": "She doesnt want coaching she just wants to not die to the same sweaty movement chuds 12 times in the same match - as I imagine most new players would desire",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PoliteChatter0",
                                    "body": "then she should continue to debate to uninstall the game because Apex never gets easier, its why its so much fun",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DesiresAreGrey",
            "body": "no hitmarkers no damage numbers no healthbar how do you play without those",
            "score": 0,
            "replies": []
        },
        {
            "author": "imainVox",
            "body": "Nah you would’ve died in my lobbies wtf was that 😭😭 no offense but you could afford to Whif way too many shots",
            "score": -3,
            "replies": []
        },
        {
            "author": "JustKoKoS",
            "body": "Noooooooo where is the toilet pic",
            "score": -1,
            "replies": []
        }
    ]
}