{
    "title": "The worst mechanic in the game is you get slowed when you get hit",
    "author": "Littlescuba",
    "subreddit": "apexlegends",
    "rank": 6,
    "score": 64,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 46,
    "url": "https://www.reddit.com/r/apexlegends/comments/1jee9cp/the_worst_mechanic_in_the_game_is_you_get_slowed/",
    "id": "1jee9cp",
    "selftext": "The amount of times I just get shot and can't slide is so frustrating. I really wish they would just remove that. Don't really see how it adds gameplay value",
    "comments": [
        {
            "author": "House_of_Gucci",
            "body": "Yeah super punishes all the legends who don’t have a get out of jail card ability",
            "score": 61,
            "replies": []
        },
        {
            "author": "nairxx02",
            "body": "Not sure if this is a popular opinion but the slow from getting hit is actually pretty good. It punishes people who likes to stand/run in the open. It teaches them, including me and if they/I can learn, how to prioritize cover.",
            "score": 49,
            "replies": [
                {
                    "author": "lleyton05",
                    "body": "Yea I agree but I also think with the new lower ttk it’s a tad too punishing now.  I actually think the biggest issue with the lower ttk is that the games inner mechanics (like bullet slow) and map design just aren’t designed for it",
                    "score": 30,
                    "replies": [
                        {
                            "author": "huggybear0132",
                            "body": "But... the game originally had similar ttk when people dropped without shields and such... it literally was designed for a faster ttk than we have had in recent seasons",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "kelleroid",
                                            "body": "Yeah, for over a year since the game's launch you dropped into the match with absolutely nothing - no armor, no small heals, no KD shields, no anything! And even if you found a Level 1 armor there was no EVO system, so if you wanted more max health you had to go searching for it... or for someone who found it before you. Adding any sort of a starting loadout was an entire experiment.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Littlescuba",
                    "body": "Thats a good point, but I would say this game makes people want to move around and slide and be more mobile and the slow down goes exactly against this idea.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "nairxx02",
                            "body": "Here's a simple advice if you want to move around and slide efficiently. Put yourself into position where you are the one that gets to shoot first as much as possible. If the enemy shoots back, take cover and you can move as much as you can with the space you have.If you watch a lot of good players, they are moving just fine.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Littlescuba",
                                    "body": "Good players dead slide all the time. The problem isn't moving around between cover. its during fights. There are constantly people saying they can't move and they dead slide. Look at someone like faide is he constantly saying he can't move",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Fallout76Fox",
                            "body": "I agree. I think it’s punishing enough that you get shot while you are in the open. I don’t believe you need a slow as well to ensure your demise. Feels very in opposition to “movement-shooter”",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "xybur",
                    "body": "Some people never learn",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Diezombie757",
            "body": "Its purposeful to encourage not diving people in the open",
            "score": 15,
            "replies": [
                {
                    "author": "Wattsonian",
                    "body": "Yeah, we get it's purpose, but the game would be more fun without this mechanic.  You'll still get wrecked out in the open i promise.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Diezombie757",
                            "body": "It'd make chasing people down much more tedious, imagine chasing an ash who can dash then tap strafe into a slide around a corner while still eating bullets.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Slimshade16",
                                    "body": "No need to imagine anything - I live this reality every damn game lol",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Littlescuba",
                    "body": "In what sense do you mean? Wouldnt it open up more counter play if you could slide no matter what as long as you got to sprint speed?",
                    "score": -7,
                    "replies": [
                        {
                            "author": "Diezombie757",
                            "body": "Every fight should be taken behind cover. Theres no skill in running around in the open with no penalty. Game has buildings and boxes for a reason, otherwise it would just be a flat field.\n\nif you need to move in the open be aware of nearby cover, be ready to use whatever wall/dash/heal ability as soon as you're shot, counter strafing is also good way to make someone else mess up their tracking.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Littlescuba",
                                    "body": "Thats true, I'm talking more in close range fights when you are strafing back an forth and need to throw a slide in or if you are moving between cover and one bullet stops you from sliding.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Enlowski",
                                    "body": "No penalty? The penalty of running around in the open is you get shot and die because you don’t have cover.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Diezombie757",
                                            "body": "If you don't get a movement penalty then you're way more likely to make it out, if you get caught out in the open without abilities or teammates you should 100% die in every scenario where the opponent is competent. Anything less is the game forgiving the worse player of the two for a mistake thats very easily countarable otherwise.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wattsonian",
            "body": "The game would feel better and be more fun without this mechanic.  Just like its better and more fun without aim punch.",
            "score": 2,
            "replies": [
                {
                    "author": "Littlescuba",
                    "body": "Oh man if this game had aim punch too. would be so frustrating. I couldn't not even the imagine the raid people would have",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MYSTONYMOUS",
            "body": "I couldn't agree more. It wouldn't be so bad if it didn't cancel your ability to slide, though I also hate when I'm about to turn around a corner and get shot right before I get to the corner and then faceplant into the wall. It messes up your ability to judge distances and makes movement feel inconsistent and unreliable.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Xplissit666-",
            "body": "Nothing more infuriating than getting shot just as you slide and you just get stuck standing still like a bot. I honestly think they need to improve the slide system, slightly decreased the time needed running before you can slide.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rSur3iya",
            "body": "I can understand that being in br it’s simply how they designed the game had to come in terms with that long ago but I do not understand why that is in the other modes like tdm and so on it just feels so awful over there especially with how fast u die now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fartboxco",
            "body": "Imagine, getting shot as being able to move as if nothing happened. Lol. \n\nThis mechanic is to stop ridiculous aggressive pushing with no cover. \n\nYou should be punished for not utilizing cover. \n\nBut you are right, characters like ashe that have a built in dash is broken as fuck because of this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwawayxj10",
            "body": "leg damage is worse imo. You could be winning a fight and all your bullets suddenly do less damage because a horizon is bhopping.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectionBasic2505",
            "body": "The worst is the 4th party enemy, miles away who hits you with one shot and kills your momentum from the original fight",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Korrus_",
            "body": "This is why i play caustic",
            "score": 1,
            "replies": []
        },
        {
            "author": "xybur",
            "body": "It's worse because players who practiced/have access to movement tech and circumvent that slow down effect by using wall jumps and other tech which otherwise maintains their momentum.",
            "score": 0,
            "replies": []
        },
        {
            "author": "touchermr",
            "body": "stoping running & diving into the open OP.",
            "score": 1,
            "replies": [
                {
                    "author": "Littlescuba",
                    "body": "whos doing that? that would be silly",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "SimplyViolated",
            "body": "It's like real life. Bigger bullets have more stopping power. It's realistic. Use cover.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Imaginary-Length8338",
            "body": "I am pretty sure if you were shot in real life you would be moving a bit slower. To people taking this literal, it is a shooting game, most shooting games when you are shot, you are impacted. Notice how you loss health in apex? If you are an alien, robot, animal and get shot, slowing down is basic mechanic that a ton of games use and it makes sense.\n\nOP made this post because he is getting lit up in the middle of a field and gets downed. Rather than think about his strategy, he would rather blame the game. It is a stupid post.",
            "score": -9,
            "replies": [
                {
                    "author": "xybur",
                    "body": "Yeah but I'm also not a robot with a grappling hook, nor do I  have the ability to leap 50 feet in the air with an instant dash.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Littlescuba",
                                    "body": "No thats not why I made the post. I think it would add more gameplay if people could move around more in a gunfight than be slowed to be honest. I also don't think many games have that mechanic. I can name quite a few that down actually",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DoctorRageAlot",
                    "body": "Pretty sure in real life I don’t have an EVO shield and can fall from 150 feet into a slide off a rock then wall bounce to sprint",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SamDrawsThingsPoorly",
                            "body": "but have you tried to fall 150 feet then wall bounce into a sprint? ya never know",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dr_Shenanigans24",
                    "body": "I don't think apex has been going for any type of realism up to this point lol",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Littlescuba",
                    "body": "Why do people always say this? it's a damn video game. We don't have to obey any of the rules of real life. Also there are plenty of way to explain why that wouldn't happen",
                    "score": 7,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Littlescuba",
                                    "body": "yikes",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NotUrSub",
                    "body": "Bruv its Apex Legends not a Milsim game.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "memorial_mike",
            "body": "Well if you want to be slow all of the time instead, play a fortified legend. Honestly though it’s a common game mechanic, just learn to be near cover if you’d prefer it to be less detrimental. Not entirely sure the value of this post as this has always been in the game.",
            "score": -5,
            "replies": [
                {
                    "author": "IncomingZangarang",
                    "body": "Fortified legends run at the same speed as everyone else",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Littlescuba",
                            "body": "fortified doesn't even exist any more either haha. Not sure what they were talking about",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "IncomingZangarang",
                                    "body": "Oh really?? I’ve been away from the game for over a year, not sure when/if I’ll return. Game seems a little eh these days",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Littlescuba",
                    "body": "Cause its a discussion if it really adds anything to the game or not. Its just seems like a frustrating thing to play around and that's it",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}