{
    "title": "[Mike Keegan] Sky Sports have urged their pundits not to 'make snap judgements' and to 'stick to the facts' before commenting on the forthcoming verdict in the Premier League's legal battle with Manchester City.",
    "author": "mavsmcfc",
    "subreddit": "soccer",
    "rank": 13,
    "score": 1902,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 322,
    "url": "https://www.dailymail.co.uk/sport/football/article-14508601/Sky-Sports-warning-roy-keane-gary-neville-man-city-115-charges.html",
    "id": "1jdy70g",
    "selftext": "",
    "comments": [
        {
            "author": "HeFreakingMoved",
            "body": "They've spent 30 years training their pundits to talk in sound bites and make snap contrarian judgements. Now they have to actually ask them to use facts lmao",
            "score": 3010,
            "replies": [
                {
                    "author": "JmanVere",
                    "body": "Looks like somebody received a threatening phone call with a voice modulator last night",
                    "score": 875,
                    "replies": [
                        {
                            "author": "WhyBee92",
                            "body": "That was not a modulator, it was just Haaland",
                            "score": 427,
                            "replies": [
                                {
                                    "author": "BellyCrawler",
                                    "body": "\"Stay factual eh.\"",
                                    "score": 449,
                                    "replies": [
                                        {
                                            "author": "Boring-Working-5509",
                                            "body": "Man City downfall on their legal charges incoming.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "lost-mypasswordagain",
                                                    "body": "Ha!  The PL and the arbitrators have rolled over for belly rubs and agreed to a “very serious fine” to an organization that can shit money. \n\nI’d bet every last [whatever the currency is in UAE] on it.",
                                                    "score": 24,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "pedalhead666",
                                            "body": "He was just promoting his debut disco album, which goes by that name.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "7hru",
                            "body": "Ah, nurturing dependence",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "NIRossoneri",
                            "body": "Probably from their own lawyers.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "mug3n",
                            "body": "\"Don't make us drag you to a Saudi embassy\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "my_united_account",
                    "body": "Sky must have gotten a lot of brown envelopes from UAE",
                    "score": 131,
                    "replies": [
                        {
                            "author": "hybridtheorist",
                            "body": "I think it's more likely legal threats. If Man City are found not guilty and Keane or Carragher say \"bollocks, they're clearly cheats\" then they could be legally in trouble. ",
                            "score": 135,
                            "replies": [
                                {
                                    "author": "bigmt99",
                                    "body": "Yeah this reads a lot more like “please do not make us deal with infinite libel lawsuits, keep it objective” more than it’s some corrupt alignment with the gulf states",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "lost-mypasswordagain",
                                            "body": "A thing can be two things. Sportswashing has both carrots and sticks.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HeWasAGoddamnWarHero",
                                    "body": "Yet another win for billable hours",
                                    "score": 26,
                                    "replies": []
                                },
                                {
                                    "author": "ManchesterDevil99",
                                    "body": "Pundits should just slag them off and then add \"in my personal opinion\"",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "hybridtheorist",
                                            "body": "It depends a bit. I mean, imagine if they said \"I reckon Benjamin Mendy raped those women\", it might be their opinion but saying \"IMO\" isn't a get out of ~~jail~~ litigation free card. \n\n\n If they say \"IMO Man City are cheats\" that's probably iffy if they've been found not guilty on all counts. \n\n\n\"regardless of the legal outcome, I'm my opinion they must have broken the spirit of the rules\" I'd assume would be OK. \n\n\nBut even that could get them sued and be a headache that drags on for months and costs thousands in legal fees even if theyre found to have said nothing wrong (obviously I'm not a lawyer, that could be entirely fine to say that and there'd be no threat of litigation).\n\n\nI think Sky are more worried they'll speak without thinking/saying something for clicks and say something litigious, rather than wanting to gag them altogether. ",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UpsetKoalaBear",
                    "body": "Same guys who actively salivate at the mouth when Neville goes on a rant about United as well.",
                    "score": 109,
                    "replies": [
                        {
                            "author": "worotan",
                            "body": "These posts that use the tone of Stalinist denunciations about ordinary things are really weird.",
                            "score": -55,
                            "replies": [
                                {
                                    "author": "Hot-Masterpiece9209",
                                    "body": "Which ones?",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "UpsetKoalaBear",
                                            "body": "I think the phrase “salivating” but I’m not too sure how that’s Stalinist. I am probably amongst the least Stalinist brothers out there.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "NateShaw92",
                                                    "body": "Only thing I can think of is they mean sensationalist or something phonetically similar, and just completely flubbed the word.\n\nLike saying sausages instead of hostages.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Niobaran",
                                                            "body": "Isn't salivating the process producing saliva? I am not a native speaker, but that's what I'd assume reading it.\n\nEdit: nvm, they weren't speaking about that but stalinist.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "NateShaw92",
                                                                    "body": "We're discussing the random use of the word \"stalinist\"",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Niobaran",
                                                                            "body": "Oh boy, now I get it. I am so sorry that went right over my head.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "NateShaw92",
                                                                                    "body": "It's ok haha it was so left field it kinda does throw for a loop.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "worotan",
                                                            "body": "No, I meant that they used the tone of Stalinist language. You know, the actual words that I wrote.\n\nIt’s great that my post is showing how thick the people who like that kind of language are.",
                                                            "score": -11,
                                                            "replies": [
                                                                {
                                                                    "author": "TheUltimateScotsman",
                                                                    "body": "> No, I meant that they used the tone of Stalinist language.\n\nMaybe explain what it is which gives that tone. Because apparently you are the only one who reads it that way",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "worotan",
                                                    "body": "I said it had the tone of a Stalinist denunciation. It uses that language.\n\nI’m sure you’ve just copied people you thought were cool, but it just sounds weird. Glad I’ve pissed off all the self-righteous kids who think over-the-top sneers are the natural way to express yourself, though.",
                                                    "score": -14,
                                                    "replies": [
                                                        {
                                                            "author": "FreshMutzz",
                                                            "body": "Bro heard Stalinist Denunciation used recently and decided he must use it.\n\n>Glad I’ve pissed off all the self-righteous kids who think over-the-top sneers are the natural way to express yourself, though.\n\nA little ironic, no?",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "worotan",
                                                                    "body": "No, not at all ironic.\n\nI’ve pointed out regularly-used over the top language in one post, and I’ve used a term which exactly describes it.\n\nWhen people are behaving in a way that copies the language of an historic totalitarian state, is it really over the top to describe it as that?\n\nIn your world, no one could criticise anyone else for fear of being criticised themselves. It’s a very Trump way of behaving, to try and stop people from pointing out weird behaviour. \n\nI mean, look at you sneering that I must have just heard that term and wanted to use it. Despite it perfectly fitting the use I made of it.\n\nIt’s just kids trying out nasty, playground bullying because they see people like Trump getting away with it.\n\nReally happy to upset all you silly kids using thoughtless meme phrases.",
                                                                    "score": -8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "FreshMutzz",
                                                                            "body": "Small over exaggerations like what was used are fine. You can criticise it, but you sound like a dumb ass by saying its stalinist denunciations. Talk about over the top exaggeration to describe a pretty mundane turn of phrase.\n\nEspecially when the original comment is trying to get a particular point across, so they over exaggerate a bit to do so.\n\nThis is true r/iamverysmart behavior.",
                                                                            "score": 13,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "UpsetKoalaBear",
                                                                            "body": "“Salivating” is a meme phrase?\n\nWhat phrase would you have used? \n\n“Same guys who are eager to see Neville go on a rant about United as well”\n\nMate if you’re deducting some next level analysis of a simple comment, I don’t know what to say. What the fuck is a “Stalinist tone”\n\n> Glad I’ve pissed off all the self righteous kids\n\nIt was a completely useless comment that added nothing to the discussion, *you* felt the need to come here and raise an issue with a harmless comment so no doubt you’re going to get slack for it. \n\nTouch grass.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No_Parfait_5536",
                    "body": "Don't worry, Gary Neville won't stop his annual \"there's something wrong with X club, I don't know what it is, but something doesn't feel right\" for one of the top 6 clubs other than United at the start of the season.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Keegan2424",
                    "body": "They don't want to be fighting City's legal counsel that's why lol. \n\nHonestly, their best bet is to do what they've done on those fan debates and just bring in an expert. Ask them questions that represent your opinions and typically you get a refined answer.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheLimeyLemmon",
            "body": "Just let Jamie Redknapp lead all the pundit discussions from now on. You won't have to worry about City's charges coming up when Jamie's got the lads three rounds deep in to ranking flavours of Kettle Chips.",
            "score": 1050,
            "replies": [
                {
                    "author": "Cottonshopeburnfoot",
                    "body": "Salt and vinegar\n\nSour cream and chive\n\nSweet chili\n\nCheese and onion\n\nPlain",
                    "score": 275,
                    "replies": [
                        {
                            "author": "Ass_Eater_",
                            "body": "You've got your honey dijons, your mature cheddars, your jalepenos",
                            "score": 168,
                            "replies": [
                                {
                                    "author": "adscott1982",
                                    "body": "Breast",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "unfvckingbelievable",
                                            "body": "Jalapeno Brest",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Longjumping_Excuse_1",
                                            "body": "Micah, put ya phone down lad.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lurker4yearz",
                                    "body": "In your opinion are they better than ass?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Money-Commission9304",
                            "body": "How do you not have jalapeño on this list?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "KawarthaDairyLover",
                                    "body": "It's my #1",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Cottonshopeburnfoot",
                                    "body": "I forgot. Excellent point. They’re class.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "s1ravarice",
                            "body": "Salt and vinegar are you having a laugh?\n\n*now you can see how well such shit topic generate discussion*",
                            "score": 111,
                            "replies": [
                                {
                                    "author": "pekingsewer",
                                    "body": "Lol this made me laugh cause I was about to start defending salt and vinegar",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "s1ravarice",
                                            "body": "All flavour are worthy, it’s just personal preference.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "pekingsewer",
                                                    "body": "I was laughing at your second sentence cause it's so true. Pundits would sit there and debate about anything not important to the sport they're supposed to be commenting on",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "theriverman23",
                                                    "body": "Staying with the facts eh?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "s1ravarice",
                                                            "body": "Is this a continuation of the shit topic discussion?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "theriverman23",
                                                                    "body": "Sure is",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "s1ravarice",
                                                                            "body": "Well I don’t agree with that",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "greg19735",
                                    "body": "Salt and vinegar are weird as i'd never get a bag.\n\nBut if someone offers mea  few they're amazing. but i only want 2 or 3.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "s1ravarice",
                                            "body": "this is... exactly how I also feel",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CalFlux140",
                            "body": "1-min. Let me just slip-on my sketchers slip-ons.\n\nNar fr they look comfy af but I can't be found dead in them before age 70",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "_brokenzoo_",
                            "body": "What about salt and black pepper?",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "FoxesFan91",
                                    "body": "easily the best flavour",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "Dropkoala",
                                    "body": "It's up there with the best of the most boring flavours. ",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "B_e_l_l_",
                                            "body": "It's the Valverde of crisps.\n\nWorld class and you'd always find room for them.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "Dropkoala",
                                                    "body": "Interesting anaolgy, to me they're like the Darren Fletcher of crisps. Perfectly decent, you can rely on them to be eaten at pretty much any occasion, someone will put them out during the Champions League final and they'll do a perfectly acceptable job. But everyone will think you're a bit mental for not picking prawn cocktail.",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "B_e_l_l_",
                                                            "body": "See I would say that Skips and the like are a great crisp and should be celebrated but when it comes down to it, you're not going to want a full cupboard of them.\n\nSalt and Pepper are always appreciated. You want them in your cupboard. When you've got mates coming over, you want to be able to open your cupboard and see them in there.\n\nThey might not have the flair that prawn cocktail provides but you know they'll get the job done. They're the Didier Drogba of crisp in that they always turn up when needed.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Dropkoala",
                                                                    "body": "Nooo, Drogba is flame grilled steak all day. Great flavour, absolute winner, posh enough to get a place at the top table but also strong and bold enough that you know he'd be a favourite with the likes of Sean Dyche and Sam Allardyce.\n\n\nSalt and Pepper are *fine* in that you won't really go too far wrong with them, they complement other things well enough, not perfectly but they're ok, everyone knows that they can be improved upon and they're not world class but you'd take them.",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Action_Limp",
                                                                            "body": "What ever else about the rest of this joke discussion, your Drogba Grilled Steak analogy is perfect.",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dropkoala",
                                                                                    "body": "Haha, thank you, I was quite pleased with myself with that one so I'm glad someone else enjoyed it. ",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Nostracarmus",
                                                                            "body": "Salt and Pepper are definitely the James Milner. Boring, predictable yet completely reliable.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dropkoala",
                                                                                    "body": "See, I debated comparing them to Milner or even Henderson tbh but I thought that was a bit of an insult to both of them. I thought Fletcher was a bit more apt as he was perceived in the same way, probably also a little unfairly but he wasn't quite as good as either of those. I did also think of Danny Drinkwater but that might be harsh on the crisps.\n\n\nMilner for me is cheese and onion, solid, dependable, rightly a classic, never going out of fashion but though everyone knows they're a little boring you can't deny they're very good.\n\n\nHenderson is roast chicken for me, they're a great flavour no matter what anyone else says, will always be one of my absolute favourites and anyone that says they're boring has never seen them get an assist with a rabona or nutmeg a defender and curl the ball into the top corner, they are an absolute staple of any proper crisp selection but deep down I know they aren't ~~Gerrard~~ as good as something like salt and vinegar or McCoys thai sweet chilli.\n\n\nI hate how much thought I'm putting into these and how much I'm actually enjoying it.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "B_e_l_l_",
                                                                                    "body": "Sorry but no connoisseur would ever call Salt and Pepper boring.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ribulation",
                                    "body": "Right fucking here",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Cottonshopeburnfoot",
                                    "body": "Not a fan. At all.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "B_e_l_l_",
                                    "body": "Arguably the best flavour in all of crisps.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "my_united_account",
                            "body": "Salt and Vinegar is elite and I will hear no slander against them",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Cottonshopeburnfoot",
                                    "body": "You know crisp.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Action_Limp",
                                    "body": "Nah, they suffer a terrible set back in that the best Salt & Vinegar crisps are those which are absolutely lacing their crisps with that flavouring, but then, those world class crisps can only be eaten in moderation, as huge dollops of Salt & Vinegar, eventually burn the mouth and gums. \n\nIt's hampered by it's own greatness.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "RSK-Nik",
                                    "body": "Yup it goes perfectly in a sandwich",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Aarondo99",
                            "body": "Well you see back when we were playing under Ferguson there were only two flavours, and that was just how we liked it.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "8u11etpr00f",
                            "body": "Sweet chilli over mature cheddar & red onion is a travesty",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Tyafastics",
                            "body": "Cheese and Onion takes like shit and I’m tired of defending myself here",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "iflylikeaturtle",
                                    "body": "Hands down cheese and onion are shit, and make your breath smell fucking rank afterward",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gullflyinghigh",
                            "body": ">Plain\n\nUrgh.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Cottonshopeburnfoot",
                                    "body": "To be clear they’re the bottom of my list. Relegation beckons. I couldn’t think of all flavours.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Gullflyinghigh",
                                            "body": "'Plain', the Southampton of Kettle Chips.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Nipplecunt",
                            "body": "Stoppit. Mature cheddar is the answer for all five.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fair-Cash-6956",
                    "body": "Context?",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Liverpoolclippers",
                            "body": "Shit pundit",
                            "score": 85,
                            "replies": [
                                {
                                    "author": "Gurbles",
                                    "body": "That's generous. He has to be the worst on British TV. \n\n\nSurely Sky must know this. He is genuinely the reason I don't watch the pre-match and why I mute the TV at half time. ",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "lm3g16",
                                            "body": "I don’t think you can outright say he’s the worst, there’s a couple that give him a run for his money\n\nJoe Cole in particular is horrendous to listen to",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "FrankyFistalot",
                                                    "body": "Put Joe Cole,Anton Ferdinand and Troy Deeney in a room with a typewriter.After a hundred years the typewriter will have become sentient and fashioned basic tools to build and hunt with.The 3 “Pundits” will be almost communicating with hand signals.",
                                                    "score": 18,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Gurbles",
                                                    "body": "Joe Cole on commentary is a struggle. He has a tenuous grasp on the English language. ",
                                                    "score": 30,
                                                    "replies": [
                                                        {
                                                            "author": "Action_Limp",
                                                            "body": "Scholes and Tim Sherwood are impressive with how little they seem to know about football.",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "worotan",
                    "body": "And all the people trotting up in the replies to show why it works and that we get boring and shit content, to give them bland banter.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AccomplishedLocal466",
            "body": "When is the verdict ?",
            "score": 285,
            "replies": [
                {
                    "author": "ArtOfFailure",
                    "body": "Latest reports say \"in the coming days\".",
                    "score": 377,
                    "replies": [
                        {
                            "author": "YouStartTheFireInMe",
                            "body": "Presumably guilty including a tantalising massive punishment then City appeal and we go through it all again.",
                            "score": 424,
                            "replies": [
                                {
                                    "author": "jesuisgeenbelg",
                                    "body": "It'll be guilty but with a weak punishment (transfer ban for one window, suspended points deduction, fine) so City won't appeal and the premier league can act like they were punished.\n\nIn reality though the punishment won't change anything.",
                                    "score": 516,
                                    "replies": [
                                        {
                                            "author": "RockFourStar",
                                            "body": "Something like this is the most likely. I've thought for a while that anyone waiting for some super harsh punishment for city are going to be extremely disappointed.",
                                            "score": 185,
                                            "replies": [
                                                {
                                                    "author": "kpnut93",
                                                    "body": "I've been wanting a super harsh punishment but been expecting a super light one.",
                                                    "score": 127,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Parish87",
                                                    "body": "I mean, this is unprecedented so no one really has any idea of what to expect. But if they've really broken so many rules it has to be a point deduction as a bare minimum, considering what Everton/Forest/etc got.",
                                                    "score": 53,
                                                    "replies": [
                                                        {
                                                            "author": "RockFourStar",
                                                            "body": "My thinking is more based on the world outside of football. \n\nI expect the rich to not be subject to the same rules as everyone else. It happens over and over again. We'll see soon enough I guess.",
                                                            "score": 57,
                                                            "replies": [
                                                                {
                                                                    "author": "Parish87",
                                                                    "body": "Aye I get you, hopefully not but as you say we'll see.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "bleh333333",
                                                    "body": "yeah but not even a significant point deduction? if they wanted for it not to really mean much, now's the time considering city's form",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "RockFourStar",
                                                            "body": "Put it this way, I'll be very surprised if it's enough of a deduction to get them relegated. Maybe out of Europe but not enough to stop their forward momentum in the coming years.\n\nI could be wrong, we'll apparently find out soon enough.",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "internetwanderer2",
                                                                    "body": "Yep this is my thinking. \n\nMaybe even a two window ban (IE Summer 2025 & Jan 26), and a points deduction which puts them down to 15th or so.\n\nThe Prem are fortunate that the bottom 3 are so bad they can give a big deduction without relegation actually coming into play",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "CrossXFir3",
                                                            "body": "Even if they get a point deduction, I suspect it wouldn't go into effect until next season",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "fifty_four",
                                                            "body": "Any points deduction could absolutely put CL qualification at risk, which is worth an enormous sum of money for either Abu Dhabi or whatever club gets it instead.\n\nWhich is why it won't happen.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Skysflies",
                                                    "body": "I don't see how a light punishment works \n\nUs( Liverpool) United, and Arsenal would be justified to sue because we lost titles to this, and that's not accounting for teams relegated, losing Europe etc.\n\nThere's also the financial package each team gets and the reduction because City cheated to a higher position \n\n\nIt's either innocent( which we know isn't the case in reality) or a major punishment",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "RockFourStar",
                                                            "body": "I don't think it will work in any meaningful way and although no one will admit it, that will be the point. The PL will get to say they \"punished\" city and that further breaches will be punished even more(pulling the ladder up). City will take a relative slap on the wrist and go back to what they've been doing.\n\nRemember this is just a random guys opinion, maybe I'm just jaded and things will go the way you think. We'll see soon enough.",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "bloodfromastone",
                                                                    "body": "Nah you’re right, I imagine as with most things like this there are extensive informal negotiations between the two camps essentially trying to come up with outcomes that both camps can accept, and both camps can claim victory with",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "lost-mypasswordagain",
                                                            "body": "You can try; do you have unlimited money to throw at lawyers?\n\nBecause they do.\n\nI suppose you could sue the PL, but I don’t know how you win when you (and the other clubs) signed on to this adjudication scheme in the first place.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Spider_Riviera",
                                                            "body": "I think it'll be on the lighter side of medium. As you said, there's too many teams can cause a fucking stink over a slap on the wrist sentence and too easy for CAS to overturn a harsh sentence on appeal so it'll have to be mid-level, to show the clubs affected, they actually hurt City, but not harsh enough for City to appeal and escape it.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "bloodfromastone",
                                                    "body": "Something like this would definitely be subject to intense negotiation behind the scenes to try to get an outcome that allows everyone to claim victory, basically",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "21otiriK",
                                            "body": "We’re so close to the verdict and people *still* don’t understand the PL have nothing to do with the sentence City will receive.\n\nPL sanction City, City dispute charges, both sides argue the case in front of an independent commission, and then the IC will deliver a verdict and any potential sanctions.",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "Stirlingblue",
                                                    "body": "I don’t think it’s that people don’t understand the process - it’s that people don’t believe the IC will be independent given gulf states propensity for bribes and blackmail",
                                                    "score": 38,
                                                    "replies": [
                                                        {
                                                            "author": "Woider",
                                                            "body": "I think it's more likely the sitting government will put pressure on them, rather than the Chop-Chop brigade itself. They don't want any risk to their economic relationship with a slave state.",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "worotan",
                                                                    "body": "They didn’t say who would be receiving the bribes and blackmail.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "reck0ner_",
                                                            "body": "You understand the judges that comprise the IC are highly respected and experienced, right? They would throw away their entire reputation and career for some money? It's a wildly simplistic and cynical way to view the world.\n\nYou can believe whatever you like but if you can't actually demonstrate any of that once the verdict is out, you have to be satisfied with the fact that your conspiracy theory may not have been based in reality, surely?",
                                                            "score": 18,
                                                            "replies": [
                                                                {
                                                                    "author": "stifle_this",
                                                                    "body": "The government has already gotten involved and muddied the waters. This entire situation is potentially compromised because of the UKs geopolitical interests. This isn't a conspiracy. \n\nhttps://www.bloomberg.com/news/articles/2025-02-06/manchester-city-s-troubles-get-political-with-charges-verdict-looming\n\nConsidering they already capitulated on sanctioning Mansour over Russian ties, they aren't likely going to do anything to City. It's got nothing to do with the reality of the situation outside of how much money he and his family's oil state has and how they choose to weaponize their resources.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "reck0ner_",
                                                                            "body": "Whatever it is that you've linked is behind a paywall for me but I'm going to guess it's regarding the news that came out last year that:\n\n>The UK government has admitted that its embassy in Abu Dhabi and the Foreign Commonwealth and Development Office (FCDO) in London have ‘discussed’ the charges levelled at Manchester City by the Premier League.\n\nAnd basically inferring that this is clear cut proof of UK government involvement in deciding this case.\n\nI understand the logic here perfectly fine. But ultimately when the IC's judgment is released for public reading whatever they decide will have to be thoroughly documented and explained. If the internal reasoning and motivation is sound, and City are found not guilty, I'm asking if you will accept the outcome as just and valid? Likewise will City fans accept the outcome as just and valid if they are found guilty? This conspiracy theory stuff goes both ways.\n\n>You can believe whatever you like but if you can't actually demonstrate any of that once the verdict is out, you have to be satisfied with the fact that your conspiracy theory may not have been based in reality, surely?",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Late_Mixture2448",
                                                                                    "body": "Finally somebody with sense if we’re found guilty fair enough but read through the replies here and everyone assumes we’re guilty and we’ll get away with a light punishment they can’t comprehend the idea we might not be guilty",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "stifle_this",
                                                                                    "body": "I'm saying the entire process is corrupted because of outside forces. You can write an essay about it but the facts are that the UK government has already gotten involved and if it's being printed in the paper, as someone who has worked in government, they definitely had more talks outside of what was reported on. Even if that was the only conversation that creates issues around the appearance of impropriety in a court, which is unacceptable in a supposed functioning democracy. You conveniently ignored my second example of favouritism toward the Emirates. Look, I get it, you want to sound super smart and elevated above all the other plebs here. But you're really just spouting pseudo intellectual ramblings to try to sound \"fair and balanced\". They cheated. They've been caught before. If they get away with this one, well I guess good on them for manipulating the legal system and the loopholes in the leagues rules? Weird dude you are.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "reck0ner_",
                                                                                            "body": "Why did you even reply to me if you were going to dismiss anything I said or asked? If courtesy is out of the window, you can go fuck yourself as well. 👍",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "stifle_this",
                                                                                                    "body": "Because the thing you said was pesudo intellectual ramblings. That's not a personal attack, it's just what you were doing.",
                                                                                                    "score": -2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "reck0ner_",
                                                                                                            "body": "How? I asked you a dead simple question and you can't answer it. Set aside the optics of the situation, the \"appearance of impropriety\", if you read the judgment when it becomes available and you find nothing wrong with the internal motivation and logic, how can you say the outcome isn't fair and just? You can't just say something is pseudo intellectual and think you've won the argument. Are you insecure about your own intelligence or something?",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "stifle_this",
                                                                                                                    "body": "You're just refusing to read what I said. the process is already corrupted. We will never see a truly fair and just outcome either way because outside parties with non-footballing interests have actively entered the conversation. There's a reason juries in the US get cloistered and a million other regulations courts have around the world to not just prevent corruption but quite literally the appearance of impropriety. It is a huge piece of judicial ethics. You dismissing it demonstrates you do not understand that. So why discuss any of this further if you're working from a position you think is correct but is actually rejected by judges all over the world. You know, legal experts. Write as much as you want, cape for city as much as you want. This process is already corrupted. That is a fact.",
                                                                                                                    "score": -1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Stirlingblue",
                                                                    "body": "Have you seen how depressingly easy it is to bribe public officials, it gets done for worryingly small amounts.\n\nAdd to that it’s not even like you’d have to bribe the judge, could just as easily influence the PL to ask for a lighter, financial punishment instead of points deductions",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "reck0ner_",
                                                                            "body": "Why would the PL go through this drawn out infected rigmarole if they were just going to ultimately do essentially nothing in the end? Wouldn't this \"influence\" you speak of have stopped this case dead in its tracks before it ever got this far?\n\nIt's likely true that the PL is being influenced from a number of directions on this. On one side, you have the \"cartel\" clubs, pushing for the PL to punish City. Which is why we have this case in the first place. On the other side, you have City with their state influence trying to make it go away.\n\nThe PL is literally just the 20 clubs that are in it. The owners of those clubs all have massive influence, whether that be enormous wealth or, in the case of City/Newcastle, state backing.\n\nAcknowledging this fact is valid, but that's why the IC is independent of all these influences. I don't think it's fair to assume these judges are corrupt without any substantive evidence. I could equally say the IC judges are being bribed by the likes of Arsenal and United. If you ask me for proof I'll just say the same thing you did. \"The Americans are known for their propensity to bribe and blackmail\". You see how ridiculous that sounds?",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "worotan",
                                                                    "body": "No, the role of citizens in democracies is to question the probity of the authorities so that they don’t abuse their positions.\n\nYou’re thinking of authoritarian and totalitarian states, where the role of the citizen is to show unquestioning awe towards those in power.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "reck0ner_",
                                                                            "body": "You can't begin your comment with \"no\", when nothing you've said is refuting anything I've said. But I've had interactions with you before so I know your entire MO and it's always the same. For everyone else that's reading this exchange, it's clear as day I never said you are not allowed to question things or even that you shouldn't. I said if you can't demonstrate what you're alleging or what you believe, it firmly becomes a conspiracy theory and people are right to label it as such.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "seattt",
                                                                    "body": "> You understand the judges that comprise the IC are highly respected and experienced, right?\n\nThey have respect precisely because they were compliant to the rich and powerful. The system weeds out anyone with an actual spine or morals.\n\n> They would throw away their entire reputation and career for some money?\n\nThey'll be throwing their reputation away only if they rule against the rich, because the rich and powerful decide who to give that reputation in the first place, including even judges. That's how the world works. \n\nI don't see how anyone can look at the state of today's world and think judges are anything but basically glorified HR for the corporate world.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "21otiriK",
                                                            "body": "They absolutely don’t understand the process. The vast majority of people here still think the PL decide the sanction as shown every time this comes up. \n\nThey think they’ve brought the charges, gone through this whole legal process, and then at the end they’re going to say “actually, we don’t want them to be punished, we just wanted to be seen to be doing something.” It’s moronic.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "colleary3",
                                                    "body": "Who makes up the IC? Is it FIFA? CAS? ",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "BWN16",
                                                            "body": "Usually retired British judges",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BQORBUST",
                                            "body": "Add in a thinly veiled admission that they’re unwilling to meaningfully prosecute a SOE because of politics",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "ValleyFloydJam",
                                            "body": "Why do people keep acting like the League decide the punishment?\n\nThe panel will decide it based on the rules.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "jesuisgeenbelg",
                                                    "body": "I know the PL doesn't decide the punishment but it won't stop the PL commenting on the punishment will it?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cancerousman",
                                            "body": "Thing is, if the punishment is weak, then the annoyed other clubs that have been cheated will want to sue.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "WatchFamine",
                                                    "body": "It's worth bearing in mind *who* the PL is: City and 19 other clubs.\n\nThere's nobody else to pass the blame to. If the Premier League want a softball punishment for the (alleged 😉) offences, it's because the majority of the clubs currently in the league want it that way. It disenfranchises the clubs potentially relegated by cheating, but even the big clubs can't band together to protect their interest in spending to win.\n\nEven then, my understanding is that the rivals are not likely to do so.\n\nI don't think there's a need to be defeatist.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Karma_Whoring_Slut",
                                            "body": "Based on City’s initial statements, any punishment beyond non-cooperation fines must be appealed. \n\nThey’ve already talked themselves in to this position.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Gerf93",
                                            "body": "They’ll get a points deduction this season, so they won’t have to play lesser European football next season since they won’t qualify for the UCL this year anyway.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "GormlessGourd55",
                                            "body": "I don't think they're going to found guilty of anything substantial though. It'll be a fine for non-compliance and some other irrelevant rule break, but nothing to do with finances or all that.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "fifty_four",
                                            "body": "My bet is they hint that city is probably guilty but find some way of arguing that back in the annuls of time the investigation didn't follow some rule or other and throw out the charges on a loophole that has since been fixed.\n\nThat way they can avoid saying anything plainly absurd, but also not get sued, claim to have followed due process, and not have to blame anyone still in a position of power.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Bearded_Pip",
                                            "body": "Yup. It’ll be a slap on the wrist sold as a big deal punishment. It will open the door for even more and worse crimes in the future.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Impossible_Wonder_37",
                                            "body": "The question is what is guilty? There is a 0% chance they’re found guilty of 115 charges. Maybe 30-60…",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Impossible_Wonder_37",
                                            "body": "Sigh…. Guilty of what tho? All 115?  Then it won’t be a small punishment. But chances of guilty for more than half is very small.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "stockybloke",
                                            "body": "This is the thing I do really respect Italy for. They did actually dish out punishment to the Calciopoli related entities. Non of this bull shit \"protect the product and our wallets by being as lenient as we low key about it as possible\".",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "AkiAkane1973",
                                                    "body": "Calciopoli was match fixing related. That's an order of degree worse and there's precedent across Europe for severe consequences for that. \n\nThere isn't a similar precedence for financial doping like City have done, so it wouldn't be surprising if their punishment isn't anywhere close to Calciopoli because their infringement isn't as bad.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dino_tu",
                                            "body": "probably harsh punishment and City goes to CAS who give a more lenient sentence",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "MaleficentPressure30",
                                                    "body": "City can't go to CAS.",
                                                    "score": 13,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "lost-mypasswordagain",
                                            "body": "This guy lawfare sportswashes",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sheffieldpud",
                                    "body": "From what I've read the verdict will be given and then it's another long wait again for the punishment which could be another season of waiting. That's without all the appeals etc. This could still be going on for another 2/3 years!",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "airz23s_coffee",
                                    "body": "Max 100k fine and then a bunch of stuff that they technically did but wasn't punishable cos the PL rules are drafted awfully\n\nThe \"stick to the facts\" suggests to me its gonna be a slap on the wrist so they don't want the pundits going \"but what about xyz\"",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "hybridtheorist",
                                            "body": "Yeah, I mean anyone with a brain, even the most biased Man City fan can *surely* see that they can't have the same global reach and income levels of the historical giants like Liverpool or Barcelona. \n\n\nEven when Liverpool hadn't won much in the 90s there was still new fans worldwide supporting them, Man City don't have many worldwide fans over the age of about 18. \n\n\n..... but proving they broke the rules is a separate matter altogether, and it wouldn't surprise me if there isn't much that the FA can show for all this. Though perhaps it'll mean they can't go on like this in future? ",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "The_39th_Step",
                                    "body": "They’ve got the best lawyers in the business. It might not be guilty. I’m gonna wait and see what the outcome is.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "Skysflies",
                                    "body": "I'm reading this the opposite way, they'll be found innocent and Carragher etc are being told don't get angry because of the leaked emails etc stick to the case line",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Scared-Room-9962",
                                    "body": "Can they appeal this one?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "RockFourStar",
                                            "body": "I read something that suggested that they could, but honestly who knows at this point.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "FirmInevitable458",
                                            "body": "They can appeal but not to CAS",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "lost-mypasswordagain",
                                                    "body": "To whom do they appeal?  The UK appellate apparatus?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "my_united_account",
                                    "body": "Guilty with a 1m fine and possibly a transfer ban for a window or 2\n\nI'm not holding my breath",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "G_Morgan",
                                    "body": "As I understand it if City were appealing then it wouldn't be announced yet. Basically the whole process is secret.\n\nIf we're getting an announcement soon it means either a slap on the wrist, a deal or City just outright won.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Fun_Reputation5181",
                                    "body": "One possibility everyone wants to ignore is that the FA are completely full of shit and on a witch-hunt driven by the historic big money clubs to stifle true competition. We all hate the FA in everything they do, except this one thing.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AccomplishedLocal466",
                            "body": "I just realized its int break, so probably wont be nothing , appeal cu next year thing",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "NateShaw92",
                            "body": "So that rules out November.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Tarchey",
                            "body": "'48 hours.'",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ImTalkingGibberish",
                            "body": "It’s been yearssssss",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheGoldenPineapples",
            "body": "\"We urge our pundits to break the habit deeply engrained into them.\"",
            "score": 622,
            "replies": [
                {
                    "author": "RamblinWreckGT",
                    "body": "\"And encouraged by us in every other situation\"",
                    "score": 165,
                    "replies": []
                },
                {
                    "author": "R_Schuhart",
                    "body": "\"because talking bollocks will actually have consequences now, we had some UAE lawyers round threatening to sue us\".",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "Militantxyz",
            "body": "Sky sports knows that if City is found not guilty but someone's says something like \"they still did it\" they can easily get sued for reputation damages and more. ",
            "score": 114,
            "replies": []
        },
        {
            "author": "PeterG92",
            "body": "This being Sky Sports I'm surprised it's not Thogden and KSI doing it",
            "score": 188,
            "replies": [
                {
                    "author": "Turbulent-Eagle88655",
                    "body": "Ishowspeed doing a backflip over the judicial bench as the verdict is read out",
                    "score": 70,
                    "replies": [
                        {
                            "author": "NateShaw92",
                            "body": "The Irish Guy doing a forfeit like having to wear a bacon dress.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JoshMega004",
            "body": "2 point deduction. Transfer ban for the 1st week of any window of City's choosing. And, a stern talking to. Justice",
            "score": 137,
            "replies": [
                {
                    "author": "dntcareboutdownvotes",
                    "body": "In all seriousness, a 30 point deduction looks really harsh but still leaves them above the relegation zone, so I expect that and a January window transfer ban (because of traditionally how little business is done then)",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Downtown_Economy9435",
                            "body": "I think we have different definitions of harsh.\n\nEverton got a 6 point deduction for one charge. \n\nMan City have 115 charges which occurred over a 9 year period.\n\n115 times 6 is 690 so it should be a 690 point deduction, however it should be spread out over their next 9 premier league seasons as the charges occurred throughout 9 seasons.\n\nSo that’s a 77 point deduction each season over their next 9 PL seasons. That would be fair.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "EnglishJesus",
                                    "body": "Fucking subscribe. \n\n77 points off right now, then when they get promoted again they start with -77. Rinse and repeat 9 times.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "Impossible_Wonder_37",
                                    "body": "115 times 6 lol. So pretty. You think they’re gonna be guilty of all 115?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AkiAkane1973",
                                            "body": "I'm not they know what the 115 charges are to even be making the comparison in the first place tbh.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "rebmcr",
                                    "body": "The 115 (or 130) charges all stem from about nine alleged instances of actual wrongdoing, but each instance was covered by multiple rules, and the League chose to make each rule its own charge. About 40% of them are just \"non-cooperation\" repeated over and over for each year's tweaked rulebook multiplied by each original rule.\n\nI'm not familiar enough with other cases to know whether that choice was routine, or an attempt to inflate the number for PR purposes.\n\n**IF** a guilty verdict gets returned (or whatever the equivalent in this jurisdiction is), I think applying the Everton example to each instance would be very consistent, for a 54 point deduction or thereabouts (I think that would be historic in the 1D/PL?). I don't claim to know what the verdict will be, and I am honestly unsure whether to expect it going for or against us.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cdrwolfe",
                            "body": "Explain to me how a 30 point deduction is harsh, and i'll show you 20 teams in the PL right now who would trade that for every trophy etc they have got as a result in a heart beat.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "dntcareboutdownvotes",
                                    "body": "I didn't say it was harsh, I said it looks really harsh, and then went on to explain how it would have zero effect on Man City - my point was that the FA don't want Man City to be punished (I know it isn't the FA who actually give the punishment, but the independent board have already shown they have no interest in handing out punishments that cause any actual real consequences, and suspect they take \"advice\" from the FA)",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Deep_Agent316",
                            "body": "They’ll appeal the first transfer ban and have it lifted during the summer. Then accept it in the winter window. Seen this movie plenty times.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Hill_Reps_For_Jesus",
                            "body": "you're dreaming mate",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hill_Reps_For_Jesus",
                    "body": "one week with no pudding after dinner (suspended)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "G_Morgan",
                    "body": "Transfer ban to start after the window closes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Impossible_Wonder_37",
                    "body": "If you think that’s a punishment they’d get if found guilty of a significant amount of the charges than you’re just a dummy.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Opening-Blueberry529",
                    "body": "And 5 points from Everton.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tame_Iguana1",
            "body": "Can’t upset Man City can we",
            "score": 451,
            "replies": [
                {
                    "author": "3V3RT0N",
                    "body": "The amount of leaks and speculation regarding Everton, Forest, Leicester etc.\n\nBarely a peep with city, makes me want to be a conspiracy theorist.",
                    "score": 285,
                    "replies": [
                        {
                            "author": "YouStartTheFireInMe",
                            "body": "Surely the answer is obvious? City are highly litigious and have a history of going legal. It’s not a deep conspiracy.",
                            "score": 249,
                            "replies": [
                                {
                                    "author": "WeirdF",
                                    "body": "The Scientologists of the football world",
                                    "score": 90,
                                    "replies": [
                                        {
                                            "author": "YouStartTheFireInMe",
                                            "body": "A good description. I was thinking of Lance Armstrong’s vindictive campaign against the likes of David Walsh who accused him of doping.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Robert_Baratheon__",
                                                    "body": "It’s a good analogy since Lance was doping",
                                                    "score": 27,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Qwert23456",
                                    "body": "Where’s the history? City has only ever filed a case in response. To CAS the first time and now after the PL. The case against the League filed last year was also in response to new regulations put in place by the league on AP which has been found to be illegal as well.\n\nCity has been dunked on endlessly in the media and has yet to file any form of cease and desist orders or anything else so where exactly is this “highly litigious” history you speak of?",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "sebdroids",
                                            "body": "mate city filled the case over associated party transaction rules and the case against UEFA after they got punished. They have Lord Pannick on retainer,  have you been living under a rock? ",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "R_Schuhart",
                                    "body": "It is a conspiracy, it just happens to be true. They conspire to sue everyone that opposes them into shutting the fuck up so they can do whatever they like. \n\nI hate weaponized legal systems, it is pure legitimised and socially accepted class justice. As long as you have unlimited resources you can bully anyone and force them to comply or at the very least back down and stand aside. And since you get a reputation the more you do it the more effective it becomes.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "YouStartTheFireInMe",
                                            "body": "But that’s not a conspiracy. There’s no secret theory behind it. It's a relatively factual representation of what City are known to do.",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "Qwert23456",
                                            "body": "There is no basis to this in reality. You honestly think the entirety of english sports media has been muzzled by City for 15+ years? Entire careers have been made highlighting City’s role in football and you think City is secretly playing 4D chess?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "lost-mypasswordagain",
                                                    "body": "They are openly playing checkers but they have 38 more men than the opposition. \n\nIt’s all out in the open.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Qwert23456",
                                                            "body": "Tell us how it's out in the open if you don't mind",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Scared-Room-9962",
                            "body": "You three were acussed of breaking the PSR rules which was pretty shut and dry (Excluding Leicester lol)\n\nCity are accused of fraud and worse on a massive scale.",
                            "score": 81,
                            "replies": [
                                {
                                    "author": "Karma_Whoring_Slut",
                                    "body": "They weren’t accused of it. They all reported to the PL. It was never in question.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Chaar_chavanni",
                            "body": "Comparing known PSR breaches to long ass litigation",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "YouStartTheFireInMe",
                    "body": "Well more accurately Sky don’t want to be sued by a highly litigious club.",
                    "score": 88,
                    "replies": [
                        {
                            "author": "Outside_Break",
                            "body": "Then the system is working as it should. Sky will have to present the actual facts rather than lies. \n\nThe world would be better if more people/companies were litigious about things like this.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "wonky_faint",
                                    "body": "Maybe in a world where everyone has sufficient access to justice, always acted in good faith, and where the court system has infinite resources, sure.",
                                    "score": 104,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Pingupol",
                                                    "body": "That is not the point they're making",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "Pingupol",
                                                                    "body": "You're still not getting it.\n\n\nNot every club has the finances or power of Man City. The issue is that Sky can fling shit at the likes of Everton, knowing Everton can't defend themselves, but wouldn't dare do that to Man City.\n\n\nThat, I think you can agree, is a problem, and not the system working as intended.",
                                                                    "score": 18,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "YouStartTheFireInMe",
                                    "body": "The world would not at all be better if journalists were in fear of litigation over everything they write. What you want is for the wealthy to use their wealth to silence journalists. \n\nIt’s the same way Lance Armstrong ruined lives when people accurately referred to him doping.",
                                    "score": 28,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "milesvtaylor",
                            "body": "They already had to apologise a few weeks ago as Sherwood made some off hand comment that Man City don't follow the rules.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "my_united_account",
                    "body": "Can't upset the Sheikhs can we",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "GamesBurgersButts",
            "body": "Im surprised sky sports are even going to report on the findings, especially if they are found guilty. Sky got the exclusive City documentary,  exclusive Pep interviews, and when everyone reported that both the Premier league and city lost aspects of one of the court cases,  sky reported city had won. \n\nI'm doubting very much they are an impartial entity at this point. City owners have tried more than once to media wash, whose to say they haven't succeeded with sky sports.",
            "score": 162,
            "replies": [
                {
                    "author": "danny_healy_raygun",
                    "body": "I wouldn't be surprised if they add a show where every Monday City's lawyers explain why City are actually the good guys.",
                    "score": 109,
                    "replies": [
                        {
                            "author": "Spglwldn",
                            "body": "Tune in for our exclusive 90 minute documentary - Modern Slavery in the UAE: Actually a Really Good Thing",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "Redditsleftnipple",
                                    "body": "Now I want a documentary on our owners too!\n\n\"Riddling Refugees with bullets: How the same approach can help your club win trophies\"",
                                    "score": 24,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Impossible_Wonder_37",
                    "body": "Well it turned out city did basically win the APT case…",
                    "score": 24,
                    "replies": [
                        {
                            "author": "GamesBurgersButts",
                            "body": "Nope.",
                            "score": -10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Karma_Whoring_Slut",
                    "body": "Well, claiming city won the APT trial was far closer to the truth than claiming the PL did.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "GamesBurgersButts",
                            "body": "Not the way they reported it. Their headline at the time of the first case was Coty had won but they only won one aspect. The rules still stood which is a win for Premier league too. \n\nMy point was most other outlets reported it unbiased, Sky sports didn't.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Karma_Whoring_Slut",
                                    "body": "This isn’t correct. \n\nThe tribunal has since clarified that the rules in their entirety were illegal. \n\nThey have not yet ruled on the new rules.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nick5168",
                    "body": "Murdoch is open to bribes, more at 10...",
                    "score": -4,
                    "replies": [
                        {
                            "author": "kurtanglesmilk",
                            "body": "Murdoch sold Sky years ago",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "UpsetKoalaBear",
                                    "body": "Owned by Comcast now.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DasHotShot",
            "body": "So they’ve massively gotten away with it all as expected and the pundits are being told to accept and swallow it so that the Arabic overlords aren’t slandered and Sky get sued…something they want to avoid because now City of course will have all the ammo to win such cases.\n\nIt’s over.",
            "score": 127,
            "replies": [
                {
                    "author": "WalkingCloud",
                    "body": "Yeah I’m surprised so many comments don’t seem to pick up on this. \n\nSky think the outcome will be not guilty or a slap on the wrist and don’t want Carragher and Neville calling out that it’s bullshit. ",
                    "score": 70,
                    "replies": [
                        {
                            "author": "DasHotShot",
                            "body": "That’s what it feels like. Neville and Carragher alone do multiple shows on Sky and some based on in-depth discussions/debates like the Overlap stuff.\n\nThey’re going to try and gag them all for as long as possible because there will be (social media) outrage for a bit and then people will all lie down and accept it. \n\nI’d be surprised if anyone even bothered with banners or any sort of statements during games. We’re absolutely pathetic about these sorts of things in this country",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Enjoys_A_Good_Shart",
                            "body": "Neville and Carra haven't criticised City for this stuff for years. Never a mention of it as Cuty win 4 titles in a row. Ian Wright had to go on MNF for it to be discussed. \n\nSo this could be interpreted either way. Maybe City are found guilty and Sky are saying don't start mudslinging over the legitimacy of City's titles, less they upset the money flowing into Manchester.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "SargeantPile",
                                    "body": "In fairness on that Overlap Fan Debates, Carragher has said on a few occasions that he thinks Man City are guilty but doubts whether it will/can be proved as such.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "rebmcr",
                                    "body": "Carra called us \"115 FC\" on CBS this season. I think he's used the word \"cheats\" or \"cheating\" relatively recently too.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Qwert23456",
                            "body": "How is it bullshit if the Independent Council come out with a not guilty verdict? Is there another pathway one clears their name or are we just going by vibes and substituting our fantasies for reality? Highly paid experts with decades of experience have been arguing and preparing this case for years. These pundits should be sued to hell and back if they voice opinions that are libellous.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "WalkingCloud",
                                    "body": "It's a fair point, but there's a difference between being found not guilty after arguing that the rules you should've been following shouldn't count and not being found guilty of breaking the rules.\n\nWe'll see the specifics of what the ruling says, but you'll have to forgive me if City's teams of lawyers picking legal technicalities and attacking the legal framework instead of what they've actually been accused of doesn't convince me of their actual innocence.\n\n*Edit: To put it more simply for the downvoters:* **We've literally seen the emails**",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sexmarshines",
                                            "body": "And yet that wasn't the basis for CAS.... But I'm sure in your super unbiased head that verdict was all just a technicality.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "WalkingCloud",
                                                    "body": "We already know City are disputing the rules themselves though:\n\nAgree to follow rules > Secretly break the rules you agreed to > Get caught breaking the rules you agreed to > Argue that the rules you agreed to weren't valid",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "sexmarshines",
                                                            "body": "Ahhh you think the doctored emails were real when they were fully refuted in court. No point talking to morons who want to believe more than want to know",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "WalkingCloud",
                                                                    "body": "Reputable source on the emails being doctored and *'fully refuted'* in court?\n\nCity could've provided all the emails themselves but for some mysterious reason refused to do so.\n\nI also notice you avoided admitting that City are arguing about the rules themselves for this case though:\n\n*Agree to follow rules > Secretly break the rules you agreed to > Get caught breaking the rules you agreed to > Argue that the rules you agreed to weren't valid*",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Lyrical_Forklift",
                                                    "body": "> But I'm sure in your super unbiased head\n\nAnd you're not biased?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Impossible_Wonder_37",
                            "body": "No what they don’t wNt are snapshot statements from biased pundits claiming city are guilty or confirmed cheats when the ruling will be complex and take time to digest. \n\nCity could be found guilty of non cooperation (like 20 charges) but nothing else and if a pundit makes a hold statement it opens sky up to lawsuits.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "snowiestflakes",
                    "body": ">massively gotten away with it all  \n  \nAw bless, it's just not the same when an independent panel objectively examines the evidence is it? Why can't it based on reddit opinion and feelings?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "talionisapotato",
            "body": "That will be hard to do . The \"pundits\" actually using their brains for once",
            "score": 8,
            "replies": []
        },
        {
            "author": "Vingilot1",
            "body": "How could the lads on sky possibly be any more on the fence anyway? Their coverage from drury to the stuff in the studio is absolutely horrendous",
            "score": 8,
            "replies": []
        },
        {
            "author": "ambiguousboner",
            "body": "They barely touch on it as it is \n\nI actually wish they’d offer some commentary on it because it really feels like a small issue, instead of the seismic decision it should be",
            "score": 7,
            "replies": []
        },
        {
            "author": "stereoworld",
            "body": "Ironic coming from the Daily Mail",
            "score": 14,
            "replies": []
        },
        {
            "author": "The-Formula",
            "body": "Sounds like City will get away with it",
            "score": 5,
            "replies": []
        },
        {
            "author": "Mr_Miscellaneous",
            "body": "Their \"Journalists\" have gone so Murdoch that they've had to be told to do their job properly for once.",
            "score": 81,
            "replies": [
                {
                    "author": "JackAndrewThorne",
                    "body": "I mean... They aren't saying this to their journalists. They're saying it to pundits. \n\nNobody is going to Gary Neville for objective fact. They are going to him for opinion. I don't think anybody would ever refer to him as a journalist.",
                    "score": 98,
                    "replies": [
                        {
                            "author": "TLO_Is_Overrated",
                            "body": "He refers to himself as a journalist\n\nSeriously.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lagerjohn",
                    "body": "The Murdochs have no ownership of Sky Sports",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Karffs",
                            "body": "Are you suggesting that u/Mr_Miscellaneous should not make snap judgements and should stick to the facts?",
                            "score": 27,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Winter-Metal-9797",
            "body": "That should be for everything ffs",
            "score": 4,
            "replies": []
        },
        {
            "author": "Dr_Biggusdickus",
            "body": "Sticking to the facts shouldn’t be controversial since most pundits are clueless about this sort of stuff. Especially if it’s not clear cut either way in terms of who won if City are found guilty of some charges but not all.",
            "score": 8,
            "replies": []
        },
        {
            "author": "screamingfeedback",
            "body": "It's their job",
            "score": 3,
            "replies": []
        },
        {
            "author": "ash_ninetyone",
            "body": "I thought the whole point of pundits were to give an opinion",
            "score": 3,
            "replies": []
        },
        {
            "author": "xqqq_me",
            "body": "\"Stay bought if ya know what's good for ya\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "Action_Limp",
            "body": "Good luck getting Keane to shut up. In his opening question to the Qatar World Cup he said that it shouldn't be happening here and none of them should be there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Bearded_Pip",
            "body": "Yeah, the bribes have been paid already.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SarryPeas",
            "body": "Everyone seems to be reading this as City are gonna be found guilty, but I’ve read it as the exact opposite. “Make snap judgements” = don’t say that the league is corrupt and that they have let them get away with it. “Stick to the facts” = don’t talk about anything outside of the actual verdict.",
            "score": 8,
            "replies": [
                {
                    "author": "Electrical-Lab-9593",
                    "body": "\"don't damage the product\" ... i agree .",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlcoholicCumSock",
            "body": "Carragher will give his real opinion on CBS, don't worry",
            "score": 4,
            "replies": []
        },
        {
            "author": "NateShaw92",
            "body": "\"No snap judgements\" makes me think they're materially getting away with it and are trying to avoid a 47 minute rant from someone there.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Willywonka5725",
            "body": "So I guess Sky knows they're about to be found not guilty, and want to stop their pundits from saying what we all think.",
            "score": 9,
            "replies": [
                {
                    "author": "HopefulGuy1",
                    "body": "It could just as easily be the opposite tbh - Sky have been quite pro-City in their coverage so far, if a guilty verdict is returned they may want to avoid their pundits piling on and doing reputational damage to Abu Dhabi.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Impossible_Wonder_37",
                    "body": "Seems more likely the opposite. The pundits love to jump on city without factual information. If the initial decision comes out and it’s vague and the pundits claim city are dirty cheats confirmed, when it’s not at all confirmed…. It opens up sky sports to lawsuits.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dino_tu",
            "body": "so, guilty then?",
            "score": 16,
            "replies": [
                {
                    "author": "jmdwinter",
                    "body": "Innocent more likely. Money talks.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "bralinho",
                            "body": "money money money it's so funny in a rich man's world",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "theglasscase",
            "body": "I don’t know why people are leaping to ‘This means they’re getting away with it!’, as though pundits couldn’t throw out irrational, problematic hot takes if City are found guilty too. It would be just as easy to say something they’d later have to apologise for about City’s owners if they’re found guilty as if they’re cleared.\n\nIt also seems pretty obvious that this isn’t an unusual occurrence for Sky. Why wouldn’t they remind their pundits to stick to the facts for any kind of legal case? They would have received a similar message for the Greenwood case and the ongoing ‘Unnamed footballer who may or may not be Ghanaian and contracted to Arsenal, who could possibly say?’ case. \n\nDeciding that this means Sky knows what the outcome is going to be and it’s going to be pro-City is ridiculous.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fitzgoldy",
            "body": "Wish the pundits would do that more fucking often.\n\nSick of most of the biased fucks who most of the time are looking for a soundbite or just have a dig at a club (Carragher and Neville especially).",
            "score": 7,
            "replies": [
                {
                    "author": "amoult20",
                    "body": "Spurs get dug out alot by every pundit",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Icretz",
                            "body": "I hate Neville or Cara on Liverpool games, they are both very easy when it comes to taking down Liverpool and bigging up the opposition + Neville seems to rejoice in Liverpool fans being miserable live on TV.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cs_irl",
                    "body": "The frustration with them as non-Liverpool or Man United fans is that they clearly each know their own clubs in depth and behind the scenes, so can provide thoughtful analysis and opinion based on that. Then you have them commenting on Arsenal, Spurs, Chelsea etc and they revert to soundbites and lazy analysis. \n\nAs fans of those clubs, we follow them obsessively. We live and breath information relating to our respective clubs. We know all the background, the main characters, the minor characters, we know all the problems in depth, we can see the positives even when everything looks to be falling apart from the outside.\n\nSo when you have people less informed on the minutiae setting the narrative for your club to all the other non-fans, it's incredibly aggravating. Neville can set the narrative for United, Carragher can set the narrative for Liverpool - they are experts in their clubs. It's grating for me to see them do the same for, in my case, Arsenal and I'm sure fans of other clubs feel the same.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Aaronsmiff",
                            "body": "At least yous have got Paul Merson’s insights on ‘Mourinho’ being forced to play upfront while Saka and Havertz are injured!",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "cs_irl",
                                    "body": "Ahah compounding the misery, we have muppets like him in our corner.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dropkoala",
                            "body": "Honestly I don't think Carragher is as clued up about Liverpool as you'd probably imagine. When he first joined Sky he said some interesting things while he was in regular contact with players like Gerrard but I'm not so sure nowadays.\n\n\nLike Steve Mcmannaman he knows or should know loads of people behind the scenes but he'll still say some pretty clueless stuff about Liverpool and Liverpool players that make you question whether he gets his information from Twitter instead of bothering to talk to people he knows given he regularly repeats blatantly incorrect information that goes round on here and on there.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "cs_irl",
                                    "body": "Yeah that's fair too. Same issue, as a non-Liverpool fan, I'm allowing him to set the narrative! I have sympathy though because it's impossible for them to stay up to date with every club in detail and from the broadcaster's pov, they need a consistent lineup so it's not feasible to have experts all the time. Just wish the product we've ended up with wasn't so inflammatory.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Dropkoala",
                                            "body": "Yeah there's way too much to keep on top of, that being said though, it is their job and they shouldn't really get things badly wrong that a lot of fans know when talking about clubs they have a connection to. \n\n\nEven when it comes to academy players, they sometimes get things like the positions those players play totally wrong. I think on Quansah's competetive debut one Liverpool pundit was talking about him being an exciting, attacking left back. Quansah was probably the breakout star of preseason and featured in a lot of games as a centre back, Klopp had talked about him positively, there was a lot of excitement in the fanbase about him so it's not like he was a complete nobody, you'd expect a pundit that has connections at the club to be at least somewhat familiar with him.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SaltOk3057",
            "body": "Telling your pundit to rage bait every single fanbase after every game but no comments on mancity",
            "score": 2,
            "replies": []
        },
        {
            "author": "elburcho",
            "body": "My guess is it will be some level of guilty, but there won't be any punishment from the court beyond the usual paying of costs as that is not for the court to decide. What they would be trying to avoid is the narrative then being that City have avoided punishment, because the FA won't then be able to enact a punishment until after an appeal",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheWeirdDude-247",
            "body": "Just get Patrice Evra back, I can trust him fully to be transparent regarding citeh, I know he'll only use facts.",
            "score": 5,
            "replies": [
                {
                    "author": "BadNewsBearsTCGs",
                    "body": "Putting your trust in a lunatic who licks raw chicken is certainly a choice",
                    "score": 19,
                    "replies": [
                        {
                            "author": "edenedin",
                            "body": "I kinda like a crazy person who spits truth. \nBetter than a jobsworth paid by CFG? ",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BoosterGoldGL",
                    "body": ">Citeh \n\nLove when united fans mock the Manchester accent",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "TankyRo",
            "body": "So they got away with cheating then",
            "score": 4,
            "replies": []
        },
        {
            "author": "GroundbreakingLoss85",
            "body": "Got cleared then",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chaar_chavanni",
            "body": "Carragher and Neville can’t even do football punditry correctly\n\nHaving them speak on Legal issues could invite problems for Sky.\nThem talking nonsense which they do all the time could see sky in court",
            "score": 3,
            "replies": []
        },
        {
            "author": "lost-mypasswordagain",
            "body": "Good luck.  Being uninformed, opinionated assholes is what got them there. \n\nBut also, this is what lawfare does to motherfuckers; the threat (which is far more palpable in the UK) for libel makes journalism less……good. \n\n(Whether we’re calling sports punditry “journalism” is a different matter.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "sensitiveCube",
            "body": "Sky and facts.. it's like saying FOX saying to their panel they should be using facts from now on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fifty_four",
            "body": "Big corporation prefers not to get sued by nation state, or to piss off the epl pro-abu-dhabi voting bloc ahead of negotiating next TV deal. Film at eleven.\n\nWhat else did anyone expect?\n\nGovernment have made very clear they want Abu Dhabi to be able to do whatever the fuck they want and I seriously doubt anyone in authority is willing to die on this hill.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vylain_antagonist",
            "body": "Cool now make them do it for everything else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Practical-Length-230",
            "body": "realistically - it's a fine... nothing more... what can really happen to them?",
            "score": 1,
            "replies": []
        },
        {
            "author": "kazumodabaus",
            "body": "Probably gonna be like a few points off the current season where it won't matter anyway. Complete joke",
            "score": 1,
            "replies": []
        },
        {
            "author": "christraverse",
            "body": "Casemiro 3 match ban is as hard as the sanctions are going to go.  Bought and paid for with blood money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dispelthemyth",
            "body": "All pundits if guilty: off with their (city) head\n\nAll pundits if not guilty: off with their (Premier league) head",
            "score": 1,
            "replies": []
        },
        {
            "author": "YungSnuggie",
            "body": "city must be guilty as hell if they're doing all this beforehand lmao",
            "score": -4,
            "replies": [
                {
                    "author": "No-Bat-7253",
                    "body": "Not guilty*",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Free-Eights",
            "body": "Guess City's lawyers are still on retainer...\n\nAs much as Sky might want to do this to protect themselves in case City is found not guilty, I do think the media generally (not just Sky) kowtow to paint them in as favorable a light as possible. Half the pundits seemed genuinely upset that City lost the FA Cup Final last season and spent most of their time trying to tell ten Hag why he should be sacked.\n\nAnyway, it's laughable that they're asking the pundits to stick to facts for once considering it goes against every incentive they have. They'd have to give Keane, Neville, and Carragher the day off and bring in all ex-City players plus a useful idiot like Jamie Redknapp if the goal is to avoid getting sued.",
            "score": 0,
            "replies": []
        },
        {
            "author": "SwitchHitter17",
            "body": "Probably means nothing is going to happen to them",
            "score": 0,
            "replies": []
        },
        {
            "author": "fridgey22",
            "body": "Sounds like the hammer is really coming down on City doesnt it…",
            "score": -1,
            "replies": []
        },
        {
            "author": "lost-mypasswordagain",
            "body": "I’m going to advance the theory that City did a lot of January business because they already know the “penalty” they’ll pay is a single window ban, just enough points to be out of Europe and a very large number on a fine that they’ll laugh at as they dump 1000 supercars in the ocean for fun.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Sliver_fish",
            "body": "In other words, the brown envelopes have all reached their intended recipients, the cheques have all cleared and Manchester City have bribed everyone they needed to in order to sweep a decade and a half of cheating under the rug.",
            "score": -6,
            "replies": []
        },
        {
            "author": "Teaboy1",
            "body": "So I'm assuming this'll be a slap on the wrist punishment, likely for not engaging with the investigations and nothing else. Which would explain why sky don't want their pundits throwing around whataboutisms, because they don't want city suing them.\n\nAs a city fan I don't really know how I feel. Good? I suppose given that we're not gonna be fucked off to the conference league. Also slightly conflicted if we've got off on technicalities as opposed to actually having done nothing wrong.\n\nFootballs a weird sport nowadays.",
            "score": -3,
            "replies": []
        },
        {
            "author": "TrashDrunkClaude",
            "body": "Looking like City are getting away with it. Be interesting to see Newcastle's response to this. Wonder if the  breakaway clubs will stay loyal to the prem if they're shown to be toothless. ",
            "score": -1,
            "replies": []
        },
        {
            "author": "Quilpo",
            "body": "That's gotta be a bad thing for City, right?\n\nThey wouldn't worry about offending the rest of the league by not going hard enough on City, and might be concerned about the owners.",
            "score": -2,
            "replies": [
                {
                    "author": "WooBadger18",
                    "body": "I think Sky is probably just being proactive and planning for everything, but wouldn’t this more likely mean that City was cleared and Sky doesn’t want their commentators saying that City should have been found guilty?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "lazytraveller_",
                            "body": "I agree on this perspective as well, City being neutral and Sky asking for cautioned approach against decision",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Quilpo",
                            "body": "Could be.\n\nIf the establishment officially says that they're dodgy as fuck, I can see more of the pundits going along with that and putting the boot in, as they don't tend to think for themselves...and the City owners would not like that.\n\nCould just be that regardless of what happens they don't want to get involved in controversy.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thatguyad",
            "body": "\"Don't tell the truth\" \"Give City the benefit of the doubt\"",
            "score": -2,
            "replies": []
        },
        {
            "author": "HEAT_IS_DIE",
            "body": "They can't put the cat back into the bag. Society doesn't care about \"innocent until proven guilty\". Once you are accused, you are guilty. If you are found not guilty, you are guilty.",
            "score": -109,
            "replies": [
                {
                    "author": "butter-muffins",
                    "body": "Innocent until proven guilty is for legal matters. The public is allowed to think whatever they like.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "Militantxyz",
                            "body": "The \"The public is allowed to think whatever they like\" is only allowed because in the end it doesnt matter in a situation like this.\n\nThe club will do its thing and people will forget about it. Juventus was litterly kicked to Seria B because of cheating not so long ago, and it maybe gets mentioned on every 30th post related to Juve.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "DinhoMagic",
                                    "body": "Juve fans like that Luca guy on tiktok are hilarious. He pretends it never happens most of the time & the odd occasion he acknowledged it he pretends it wasn’t a big deal paying off refs. Sadly that’s the same as the majority of Juve’s online fanbase.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "droze22",
                                            "body": "The only hilarious thing here is how badly informed you are, while talking with such authority. First of all, there was no match-fixing or paying of referees in Calciopoli, it was mainly about talking to the referee designators. \n\nMany teams were punished, incl. Juve, Milan, Lazio and Fiorentina. Inter were also involved, but they hid the evidence until the statute of limitations passed, so they weren't punished and were even gifted a league title for coming third. Meanwhile, Inter's ex-president Facchetti was on wiretaps that show him trying to intimidate and bribe referees.\n\nInter and their allies (club shareholders, executives) ran the company that recorded and leaked the wiretaps (Telecom), ran the commission investigating Calciopoli, ran the newspaper that leaked the right wiretaps in their frontpages to create a popular sentiment and climate against Juve (Gazzetta).  \n\nSuch lovely people as Guido Rossi (FIGC comissioner and “real Interista who avoids coffee at the juventus bar\" according to Gazetta), Marco Tronchetti Provera (Telecom Italia president and 2nd biggest Inter shareholder who released the Juve tapes and hid the Inter recordings then resigned the next year from Telecom), Carlo Buora (Inter vice president and Telecom managing director).\n\nFIGC investigator Stefano Palazzi found Facchetti lobbying referees (beyond what Moggi was proven to do) but was too late for the statute of limitations, a bit like City's case against UEFA. Coincidentally, Vieri’s phone was being tapped by Telecom and Inter in 2006…\n\nAll Calciopoli refs were acquitted except De Santis, who had nothing to do with Juve but had received calls by former Inter player and then-executive Facchetti)\n\nThat’s how Inter dominated for the next years up to the treble, by trying to destroy their superiors and in the process destroying the Serie A, the best league at the time.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "DinhoMagic",
                                                    "body": "Another Juve fan defending their actions. Hilarious. Juve is the most corrupt big club in football history. That’ll never change.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "droze22",
                                                            "body": "Another person talking rubbish who is corrected on a very basic mistake, that no paying of refs ever happened, and given a bunch of context that he chooses to ignore and perseveres with his ignorant pre-conceived notion. Sad, but typical.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DrinkingBull",
                    "body": "Well on the other hand, just because the verdict is „not guilty“ that doesn’t mean that you didn’t do it. People get away with shit all the time. Everyone knows that City is not innocent. The question is, can they get away with it.",
                    "score": 56,
                    "replies": []
                },
                {
                    "author": "ambiguousboner",
                    "body": "Greenwood’s never been convicted of anything but we’ve all heard the tapes and you can get in the sea if you’re arguing people should see him as innocent",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "lagerjohn",
                    "body": "> Society doesn't care about \"innocent until proven guilty\"\n\nI think most people still care. You just spend too much time on the internet.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Scared-Room-9962",
                    "body": "It's not a question of they've done what they're accused of, it's a question of if the rules governing that are legally enforcable.\n\nI've a feeling City are about to have the PL remove all financial restraints as they're not legally binding, but who knows.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Maleficent_Resolve44",
                            "body": "If city remove all financial restraints somehow, we might actually get a few rich smaller clubs flying up.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}