{
    "title": "How does an adolescent puppy develop self-motivation to obey? (first time dog owner, Golden age 1yr 8months)",
    "author": "millennium_fae",
    "subreddit": "Dogtraining",
    "rank": 30,
    "score": 5,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1iloaqy/how_does_an_adolescent_puppy_develop/",
    "id": "1iloaqy",
    "selftext": "my Achilles is learning well. he's my service dog prospect, owner trained for psychiatric assistance. as a first-time dog owner, i've dedicated the last 2+ years to creating a solid and productive training regime, along with a safe, fun, and loving home and relationship with him.\n\nas he grows into his teenage phase, his intelligence is really beginning to shine. he always tries to 'think ahead of me', and loves to find ways to push boundaries. it's driving us crazy. i'm so proud of him (,: \n\nso i've begun to wonder what's going through his growing puppy brain. it's my hope that he'll get his Proper Adult Brain soon, but before that point, all his motivation is completely hinged on what reward he gets immediately after performing the command - whether it's food, a toy, or permission to sniff/chase. \n\ni can tell that he's very aware of the situation, and he criticizes the 'reason' why he'd obey. for example, \n\n* he's hesitant to perform the 'back up' command if we're not in a hallway or other kind of tight space. if i try to get him to 'back up' to a spot (like his mat), he turns around and sometimes just goes to the spot normally. \n* he only does benign naughty behaviors if he wants us to pay attention to him - drinking from the toilet, trying to rip up the carpeting, counter-surfing. he won't obey 'quiet time' at his mat or crate 'cause he knows it means we won't be hanging out with him. at the moment, we're trying to super-proof the 'quiet time' concept only when he's clearly sleepy. \n* if he's energetic, pocket-walks are him trying to rush ahead and be foiled by the Gentle Leader harness, stop and look at me, and get a treat. rinse and repeat. he's doing exactly what i've been training him to do, after all! \"no, i don't want to walk calmly by your side. i'm gonna do 'check ins' and get my treat, so let me gallop around!\"\n* i can't seem to graduate his 'drop it' command from low-value-items to medium-value-items. playing keep-away is a much bigger award than obeying 'drop it', after all. \n\nand other little things like that. so folks, i wanted to ask - as a dog matures, do they grow their own motivation to be more obedient? i don't intend to fade his treats and rewards completely, and if his tasks are always gonna be very contingent to treats i'll work with that, but do you think Achilles might ever become more obedient on his own steam?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "millennium_fae",
                    "body": "appeasement behavior and process learning",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PinkStrawberryPup",
            "body": "I like to think of it as patterns and reinforcement. You may be reinforcing things you don't mean to, if your dog is forming undesired habits (like giving him attention when he's drinking from the toilet).\n\nThe more your dog does something, the more it becomes a habit and is reinforced. So, to build better habits, I usually think of it as deterring the undesired habit (like keeping toilet lids closed so that the dog physically can't drink out of the toilet and make a habit of it) or rewarding the desired behavior.\n\nFor pulling on walks, the walk itself is very rewarding for my gal, so when she pulls, we stop in our tracks. We don't continue until she stops pulling, so she forms the habit of not pulling so she can get her reward (of continuing the walk).\n\nFor counter-surfing, we are very careful not to leave anything out thar she can get to, lest she form the habit of counter-surfing. For digging up carpet (and her bed), we've had to watch, deter, and redirect her so it doesn't become a habit.\n\nSometimes, dogs are *too* good at pattern recognition and will pick up details we didn't intend, like \"sit\" means \"put butt on floor with straight front paws *while next to human*\" as opposed to sitting where they're at or, perhaps, in your case, \"back up\" means backpedal *when the walls are close*. Our trainer has recommended reinforcing commands in different environments and different variables to combat this.\n\nAs for developing self-motivation.... I think it'll be more \"be optimistic that a reward is coming because there were previously rewards for this behavior, so continue doing the behavior\". For a Golden, that reward could be praise or petting, though, so it could seem like he's self-motivated, maybe(?).",
            "score": 16,
            "replies": []
        },
        {
            "author": "Maxsmama1029",
            "body": "Make it fun. Make it exciting. Try not to get angry or frustrated. Figure out what they REALLY want. Not all dogs want treats, Max who is trained very well, was trained by kisses and praise. It’s not an overnight thing either. Max’s spot on recall too a few years, and we practiced it consistently and still do. He’s 12. Training isn’t just for puppies, it’s for their whole lives. Last thing, training sessions should only be for 10 mins or so. U don’t want them getting frustrated or bored. Playing fetch, tug or whatever, is a reward!! Not used to tired a pup out either!! GL! Btw, your pup is in his teenage years too, so he’s also prob being a typical teen!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "plasticketchup",
            "body": "You are anthropomorphizing your dog. He is not “criticizing the reason” for the cue. He doesn’t understand the criteria, or the criteria is too high.\n\nIf he doesn’t want to back up, it’s because he has not generalized the back up cue. That’s usually attributed to moving too fast and not splitting up training a cue enough.\n\nHe does “benign naughty behaviors” because he has unmet needs, is a dog which means he is an opportunist, and is potentially bored. Make it impossible for him to practice these behaviors. If you are having a hard time with settle you need to consult a professional.\n\nYou need to expand your loose leash walking toolkit, because what you are doing will not work for an environmentally motivated dog. \n\nYou grow drop it by making it worth while to drop the item. Dropping a high value item gets a high value reward. Even better, you let them pick the item back up.\n\nI think you have a bit of a misunderstanding about how “obedience” evolves. Dogs that respond to cues quickly and sharply got that way through conditioning that only rewards average or better responses. You do that by breaking behaviors down until you start getting above average responses.",
            "score": 7,
            "replies": [
                {
                    "author": "millennium_fae",
                    "body": "thanks for your input, but i just want to confirm that i've been subscribing to everything you've said for his entire training experience. i truly do understand that a dog's training is built on superproofing weighted value rewards. \n\nwhat i was asking is how does a dog go from \"okay, after a year of resting by the cafe table with a high value treat so i was never motivated to jump on the table, now i am capable of doing so for 2 hours with no comprehension of a high value reward when we get home\"? hence me wondering if it comes easier with maturity.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "plasticketchup",
                            "body": "It doesn’t, it comes with SUCCESSFUL repetition and management. A dog who has never in his life jumped on a table doesn’t realize that they can or why they would. That can all be undone with one single successful counter surfing incident.\n\nYou’re still anthropomorphizing and chunking. They don’t go from 1 hour with a high value treat to two hours with no treat. They go 1 hour high value treat > 5 mins med value treat > 20 minutes no treat > 45 minutes high value treat > 1 hour med value treat > 5 mins no treat > 5 mins high value treat > 10 mins no treat etc. you need to create a gambler not a book keeper",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "millennium_fae",
                                    "body": "i mean, of course i wasn't thinking that my puppy was going to jump between the two examples i wrote above. hence my question; what DOES happen in between. like how a human doesn't work for no pay, i will never completely widthold value rewards from my dog. but tasks in themselves are enriching for a working breed, so i'm also aware that its not gonna be all about the treats. plus, i imagine that lying still is easier for a 2+ adult than my teenager, which makes me wonder how maturity plays into it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "plasticketchup",
                                            "body": "The tasks themselves are not rewarding though, that’s a dangerous and misinformed misconception. The reward for recalling on cue is the exact same bit of neurochemistry as the reward for chasing down an interesting scent. It’s the same for a French bulldog as it is for a German shepherd as it is for a bloodhound. \n\nWhat happens over time is that the dog learns how they can access those rewards, and how they cannot. A young dog will seek them through all sources - approaching strangers, grabbing snacks off the counter, responding to cues. But so will an older dog who has no experience. There is literally a common saying about old dogs not being able to learn new tricks; we know it isn’t true but it speaks to the difficulty of modifying behaviors with a long reinforcement history. Through successful repetition of response to cues and applications of rewards, and management and prevention undesirable behaviors, the dog learns which pathways will result in rewards, and which are unavailable to them. What happens between a dog being 8 months old and a dog being two years old is largely time and repetition. While there are some neurodevelopmental milestones that happen, the response to those milestones is literally no different than any other training challenge. When  my 14 month old dog is struggling with a cue, the response is the same as when my 6 month old is struggling as it is when my 8 year old is struggling. Splitting the cue into more manageable slices, and reinforcing successful reduction of the smaller slices.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BayAreaPupMom",
            "body": "I'm training my lab puppy to be a vision service dog. He's 14 months right now so I know what you mean about the teenage mentality. You gotten some very good advice from other posters. Advice I've gotten from the organization is to restrict the area again that the puppy has access to. So where he used to have access to the whole house, for some reason he's starting to display certain behaviors again that he hasn't done for a few months. The recommendation is to go back to basics, as this is a common occurrence. So he's back to his puppy proofed room, whereas others have noted, don't leave anything on the counters, clear the area of any temptations that your puppy would be interested in. Block access to the toilets and/ or waste cans. In our case, we have to keep the floor extra clean, because he is picking up foraging behaviors again. \n\nAs for the backup skill, the way we teach a new skill is to lead him with food. I recently just taught him this. I would force him to scoot back because I would align food just behind his nose. Every time he would scoot back, I would give the mark word and treat. Once he had that down, I introduced the verbal command. I now make him do this at every meal. He has to \"back\" into his spot before I feed him. It really only took 2 days before he figured out the assignment! This actually built upon a prior skill that we have used since he was about 6 mos where he did not get food until he was in a seated position & quiet. If he stands up because he gets too excited, I literally stop preparing his food and stand still, like a statue position. He gets back into position really quick! Labs are so food motivated!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lizdance40",
            "body": "It's not unusual to find yourself at a plateau in training. Best thing to do is get some outside eyes on this.   They should be able to assist you in where your timing is off, where his motivation is not there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BresciaE",
            "body": "If my girl is boundary pushing and hyper I’ll stop what we’re doing have her sit or lay down and we’ll have a quiet moment. I then redirect her to something less stimulating that she does solidly and once she’s been calm for a while we retry the skill that she wasn’t getting. \n\nThe best example I can think of for this was when she was helping me with Christmas shopping in pet friendly stores. I had had surgery and could only lift 5lbs at a time so I had put her harness with saddle bags on her to carry my shopping, and the gentle leader for better communication. She got excited about a group of new people who entered the store, and bounced quite a bit which resulted in the pack knocking several books off of shelves which startled her. I moved her forward a few steps, crouched in front of her, and with one hand holding the gentle leader under her chin (not too tight) and the other hand slowly petting her and had her focus on me while I very quietly talked to her for a solid two or three minutes. She calmed down, I put the books back on the shelf and then we calmly greeted a couple calmer people who wanted to say hi but had more relaxed body language and quieter vocal tones. AKA not the super excited 15 year old who was essentially bouncing in place with a really shrill voice. The mom thankfully headed the teen off at the pass. 😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "noneuclidiansquid",
            "body": "All behaviours happen because of the consequences. He doesn't do something because you say so, he does it because of what happens after. He isn't a robot, he is an adolescent dog with his own thoughts and desires. \n\nThe goal isn't obedience it's a working relationship based on trust. If you want him to do something he's not into, be more generous with the treats, like instead of one small kibble for doing something, give 15 all in a row. Instead of making him go into his crate, put a likimat in there for him. Include games and play as rewards, make the job both easier and more fun.  Tap into his natural retrieving instincts, if something isn't working take a break on it for a few weeks and come back to it.",
            "score": 1,
            "replies": []
        }
    ]
}