{
    "title": "my dog has low motivation",
    "author": "rayne_eee",
    "subreddit": "Dogtraining",
    "rank": 26,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1imcbtn/my_dog_has_low_motivation/",
    "id": "1imcbtn",
    "selftext": "My lovely senior dog is around 10 years old and spends most of her days just sleeping. I've been trying to get her to be more active by playing with her and her toys, and I usually take her outside when I'm doing yard work or shoveling snow. We typically enjoy daily walks, but with about 10 feet of snow recently, it’s tough to get her out. On our walks, she moves very slowly, and I hoped she’d pick up the pace as we walked more often, but she's been maintaining that slow speed for weeks, even months now. \n\nWhen I try to play with her, she often won’t fetch the ball or show interest in her stuffed animals. If she does engage, it lasts only about 20 seconds to 5 minutes before she goes back to her favorite spot to lie down. I'm not sure what to do at this point. She’s never been overly energetic, but this current lack of enthusiasm seems off. The only time I see her perk up is during mealtime. Any advice on how to encourage her to be more active would be greatly appreciated!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "rayne_eee",
                    "body": "suddenly changed behavior / weird behavior",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yogs_Zach",
            "body": "Have you considered your dog might have something age related like arthritis or other joint issues?",
            "score": 1,
            "replies": []
        }
    ]
}