{
    "title": "How do we feel about play nipping?",
    "author": "SirWallaceIIofReddit",
    "subreddit": "Dogtraining",
    "rank": 11,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1in0xj4/how_do_we_feel_about_play_nipping/",
    "id": "1in0xj4",
    "selftext": "I’m about two months into owing my first dog since I was a kid, and he is fantastic. Quickly learning essentials, listens to no, potty trained, I’m so so proud of my little guy. When we play with him, we find he loves to play bite, he is very gentle, has never hurt us, and just likes to gently gnaw on hands  and arms while you move them around like he’s trying to catch them. It’s very cute and I love to play with home like that. \n\nThe problem is, the other day a friends daughter was over and her and the dog loved each other. They were having a great time for almost two hours when our little guy decided he wanted to play as described above. We saw it immediately, but before we could call him off he had gently nipped her arm, which didn’t hurt her, but did scare her, and she understandably wouldn’t play with him anymore. \n\nI love his play nips, but I understand why others wouldn’t, and I really want to avoid a situation where he does hurt someone in the future. Should I discourage the play nipping, or is that a healthy behavior for his age? Is there something I could substitute instead? Thanks in advance\n\n1.5ish year old Corgi/Border Collie if it matters. \n\nTL;DR my dog loves to play with little nips and gnaws and I don’t know if I should let it continue or not. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "SirWallaceIIofReddit",
                    "body": "I can’t find a wiki page that matches this, and I’m more looking for people’s opinions on what behaviors to train, not advice for how to train something like the wiki provides",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}