{
    "title": "Trump illegally removed member of board that protects government employees, judge rules",
    "author": "Evening_Calendar2176",
    "subreddit": "news",
    "rank": 21,
    "score": 19419,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 216,
    "url": "https://abcnews.go.com/Politics/trump-illegally-removed-member-board-protects-government-employees/story?id=119435326",
    "id": "1j3hetr",
    "selftext": "",
    "comments": [
        {
            "author": "GiltCityUSA",
            "body": "To the 77 million MAGA idiots that voted for this criminal, he’s doing criminal shit.  Happy?",
            "score": 2409,
            "replies": [
                {
                    "author": "that1LPdood",
                    "body": "They are.\n\nThey *literally* excuse anything he does. They are beyond reaching or changing their mind through logic or reason.\n\nHe could announce that he’s dissolving Congress and the Supreme Court by force and they’d be like, “well, I don’t agree with every decision he’s made, but Congress and the Supreme Court will handle it through appeals. Everything is fine. He knows what he’s doing.”",
                    "score": 1366,
                    "replies": [
                        {
                            "author": "tofubeanz420",
                            "body": "At this point MAGAs are so far gone I'm through trying to convince them I just want to see them suffer.",
                            "score": 285,
                            "replies": [
                                {
                                    "author": "Jcampuzano2",
                                    "body": "The vast majority of them are already suffering or their true suffering is on the way when it comes to the main thing they claim to have voted for - economy. They're just too stupid to realize it.\n\nThat and many of them literally don't care if they suffer more as long as it \"owns the libs\". This is literally just a team sport to them where as long as the other team suffers more than they do they're completely fine with anything coming out of Trumps mouth. So they're okay with getting fucked economically as long as \"DEI hires\" no longer get special treatment.\n\nIt is literally insane when I go to places with large low income MAGA populations voting for the person who is blatantly fucking them in the ass to give billionaires more and they're basically begging for more.",
                                    "score": 130,
                                    "replies": [
                                        {
                                            "author": "tofubeanz420",
                                            "body": "That's why they need to suffer more than Dems. Give them a taste of their own medicine.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "omgpuppiesarecute",
                                                    "body": "This is built into the design of the Canadian, Mexican, and Chinese tariffs IIRC. They specifically target red states.",
                                                    "score": 23,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Not_Cleaver",
                                                    "body": "They’ll still blame the Democrats, Biden, and Obama for all of that.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "The_Space_Jamke",
                                                            "body": "They can blame the left all the way to their graves, I only care that they reach their destination quickly enough that there's some future left to salvage out of the shithole they made.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "jeneric84",
                                                    "body": "They can easily and willfully ignore any logic. They can simply point to Dems for their suffering. He can murder their entire family and they’d still find someone else to blame it on. Humans can be really fucking stupid. The truth is often inconvenient and the “age of information” and current state of social media offers them no shortage of “information” to rely on.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dovaldo83",
                                            "body": "For them, it's more like seeing their team's mascot dunk on the mascot of their rival team than the selling out of our country.\n\nThey've convinced themselves that all politics is fake wrestling kayfabe. That when their side is proven to have lied, it makes no difference because all sides must lie equally right? They treat the current chaos as not a big deal as the left makes it to be because they have knowingly pretended that immigrants were a bigger problem than they really were when it helped the right.\n\nTo take a step back and think critically about what path they had a hand in setting their country down could only hurt their sense of self worth. Few are willing to even consider it.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "speculatrix",
                                                    "body": "*One of the saddest lessons of history is this: If we’ve been bamboozled long enough, we tend to reject any evidence of the bamboozle. We’re no longer interested in finding out the truth. The bamboozle has captured us. It’s simply too painful to acknowledge, even to ourselves, that we’ve been taken. Once you give a charlatan power over you, you almost never get it back*\n\n-- Carl Sagan",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Fallouttgrrl",
                                            "body": "Honestly I'd go so far as to say, having spent a lot of time driving through (and growing up in) a lot of the rural parts of the country, that many already think they're suffering more than their fair share, that its city dwellers who depend on rural communities, and they think that they wont suffer much more than they already do, but citydwellers will suffer so much more\n\n\nAnd the majority of active government activity in their life is from state and federal agencies telling them what they can't do, because the passive efforts of both have become such a pervasive part of subsidizing their way of life that they don't see it as a government thing anymore, just the way they do business. ",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "FreeFromCommonSense",
                                            "body": "It's the cultist pattern of holding up their suffering as testing/proving their faith/loyalty.  When America is great again, it will all have been worth it /s",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "jfsindel",
                                            "body": "There was a saying that racism will only die when all the racists die. \n\nThis is such a generational issue that I don't even know how to beat it, except be aware that it's a decades long process. I have family members who have generational GOP voters that currently post HUGE copium regarding the Zelensky interview. Saying Trump is playing 10D chess but suddenly having to backtrack when Trump reverses his federal worker order. It doesn't occur to him that not only does Trump lack empathy, but he is really stupid and partnered with someone who is equally dumb as hell (Musk). \n\nIf Trump or Elon were actually competent evil assholes, we would already be so so fucked. But it's actually their dumbass incompetence that prevents them from fully finishing plans and the fact they hire dumbass yes men who also can't finish. If they had a Gavin Newsome running things, we might as well pack our bags. There's a reason people still say Steve Bannon is the most terrifying of them because he ISN'T stupid and was hugely successful, but Trump no longer cares for hus opinion.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "franker",
                                    "body": "And people wonder why we don't want to go on the street and march and protest for their dumb asses (yes, I know actually all of us will suffer).  And then when I take a rubber bullet in the face from the cops and get blinded, they'll just say I'm \"antifa\" and post shitty memes making fun of us.",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "DirkaDirkaMohmedAli",
                                            "body": "> And then when I take a rubber bullet in the face from the cops and get blinded, they'll just say I'm \"antifa\" and post shitty memes making fun of us.\n\nI am positive this happened to the brave Russian protestors when the Ukraine war broke out. Just remember that the free world will see you as a hero. If we actually try to annex someone, I hope we all hit the streets.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Lokinta86",
                                                    "body": "Blindings by US police using less-than-lethal force were rampant during the 2020 protests after George Floyd's murder. Within one week, civilians were subjected to at least 20 traumatic eye injuries, and on May 30th alone, 8 civilians took shots to the face resulting in loss of an eye or partial blindness.\n\nOne such blinding occurred in my nearest major city, where I am/will be continuing to stand up for Ukraine and the USA as we *used to* know it. The man blinded in my city's incident was walking calmly alone, taking photos, when riot police preemptively fired on him. \n\nIn Denver, another man was shot while leaving a friend's apartment. You do not have to go all the way to Russia to find the police state... and you do not even have to be actively participating in the protests to be targeted in America.\n\nTonight's so-called 'offer' to annex Greenland to the US was punctuated with, \"I'm sure we'll get it one way or the other.\"\n\nAnd he has now officially pitched the plan to \"take back\" the Panama Canal. \n\nWere you ready for it to happen the same day you wrote it? \n\nProtesters, please, wear your best available / affordable PPE. Don't assume you're safe at any time just because things aren't at the height of action. ",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "franker",
                                                            "body": "Yup, I remember seeing the aftermath of the injuries on TV.  That's exactly what I'm talking about.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "hedgetank",
                                            "body": "Wear armor, and be creative.  *Just* protesting isn't going to do much. We have to do way more to push back.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Larcya",
                                    "body": "I honestly want the GOP to get rid of Social Security and the VA.\n\nOnly because I know 2 things:\n\n1: I'm never going to see a cent from Social Security and I'm not a veteran.\n\n2: I know a lot of trump supporters who depend on Social Security and the VA and I want to see them suffer.\n\nBecuese the only way this country is going to learn it's lesson is if it is hurt and that means the people. And not everyone voted for this. Shit I worked for Biden's Campaign in both the 2020 primary and the general election. But not everyone voted for the Nazi party in 1933. And we still bombed them to the stone age 12 years later.\n\nThis country needs to be bombed to the stone age so that it learns it's lesson. Probably not actually bombed mind you more of bombed in every other facet of measurement however.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "KindLion100",
                                            "body": "You may get your wish. Might not have the outcome you desire but you may get it.",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "MxDoctorReal",
                                            "body": "My wife doesn’t deserve to lose her VA benefits! She votes blue and she relies on the VA. I want the Trump voters to suffer, but not at the expense of my lefist family.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "KwisatzHaderach94",
                            "body": "as happy as pigs in s--t",
                            "score": 127,
                            "replies": []
                        },
                        {
                            "author": "MrPlaney",
                            "body": "It’s completely baffling how brainwashed they are. I take a peek in conservative subs every so often, just to see if “whatever crazy thing trump is doing”, will finally allow them to realize how stupid he is, but nope. They see every dumb trump decision as winning.",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "johnis12",
                                    "body": "I did see some talk that a number of folks on there were getting banned left and right because even a coupla conservatives were like \"Wait... That's fucked up\", when Trump did some new illegal bullshit.",
                                    "score": 57,
                                    "replies": [
                                        {
                                            "author": "MrPlaney",
                                            "body": "Yep, I saw that too. It’s pretty much an echo chamber for the outright maga conservatives. Dissenting opinions are not allowed, and muted instantly.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "MisterSnippy",
                                            "body": "There's definitely less trump supporters now than there were 2 months ago. Before the election I saw alotta MAGA hats, now far less. They wont say it outright, but I think public perception is very against him. Most people I know who voted for Trump wanted him to do something about illegal immigrants, so they liked that stuff, but everything else he's gone too far.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "jcp42877",
                                                    "body": "I voted red, my wife voted blue. My main purpose in doing so, was that I wanted someone in office, who I thought, would stand against any FAFO shit Russia and China tried to pull. Not to bend over backwards to our enemies and then put that drive towards our ***fuckin' allies***. I have nothing against Canada whatsoever, my brother-in-law lives there. I support Ukraine. I have no desire to do anything to Greenland other than to perhaps visit one day to cross it off my bucket-list. I don't care what's in your pants. I am a proud, gun-owning veteran who is ashamed of what I read and see every day now. My wife and I see a lot more eye-to-eye with our venting recently. The minute this administration wanted to bully others and become Russia's lapdog, they became dead to me.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Krillin113",
                                                            "body": "I’m sorry, but how the fuck did you not see that before the election?",
                                                            "score": 11,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "wam1983",
                                                            "body": "Unfortunately, your transformation is too little, too late. The administration thanks you for your assistance in selling out and destroying the country you once fought for. I genuinely hope you lose your VA benefits and reap the same shit you’ve helped to sew for so many others.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "jcp42877",
                                                                    "body": "Already got my degrees and don't get a disability payment, but thanks for your cordial reply. And people wonder why they never get a serious response on here when asking \"those who voted for Trump, do you regret it and why?\" You just want someone to demean.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "eronth",
                                    "body": "I would not use conservative subs as a barometer on how conservatives feel. Those subs tend to be hyper aggressive in banning folks, to the point that it really won't represent many actual people at this point. Idk if it's all bots there, or if its just a minority of a minority over there, but it's not \"conservatives\" as a whole.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "MrPlaney",
                                            "body": "Oh yeah, I agree. I know many conservative and conservative leaning folks, and most of them agree that most of trumps decisions are downright shitty and poorly thought out. It’s just so weird looking into the mind of brainwashed people, (or bots) who are so blindly following their leader, that they can’t see the hole he’s leading them too.\n\n\nI did see a couple people getting banned for disagreeing with some of trump’s decisions though. It’s pretty much just an echo chamber for the maga conservatives at this point.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Necessary_Chip9934",
                                            "body": "That is likely true, but even the \"conservatives\" who don't like what is happening would vote the same way again.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "felldestroyed",
                                            "body": "Use fox news/conservative radio. Trust me, they justify it in the same way.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RoughChemicals",
                                    "body": "This is entertainment to them. Politics is not supposed to be entertainment.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "MrPlaney",
                                            "body": "Yep. I’ve seen some of the stupidest comments there too, but everyone just pats themselves on the back, and continues to talk about winning.\n\n\nAnyone that disagrees is instantly shadow-banned and muted.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "dustymoon1",
                                            "body": "Well, it is spite driven, pure, and simple.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "acornSTEALER",
                                    "body": "Sometimes people speak out against things he's doing, but they get called liberals, bots, brigaders, etc. even though they're in the most locked down sub on the site that requires you to jump through hoops for a flair to even comment on anything.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "We_Get_It_You_Vape",
                                            "body": "Yup. Wouldn't be surprised if those who speak out swiftly get banned or lose their flair. \n\nI don't think I've ever seen an echo chamber *that* bad, even on Reddit where echo chambers seem pretty common. It's wild that a mod needs to review your comment history before giving you a flair. So, in effect, only the most staunch Trump supporters get to have their comments seen on that subreddit.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "FearlessAttempt",
                                            "body": "If you check in there right after something happens you'll often see a few reasonable takes before they get their talking points hammered into them.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Toby_Forrester",
                            "body": "Someone said MAGA would gladly eat shit if they believe \"liberals\" would have to smell their breath.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "amakai",
                                    "body": "I am willing to make this sacrifice.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheAngriestChair",
                            "body": "Except they're not happy that anyone is pushing back on them.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "BoosterRead78",
                            "body": "There is a guy dying from cancer in a farm house a few miles from town. All of his Trump flags were ripped apart a couple weeks ago from storms. So it was nice not seeing anything up for the lad two weeks. As of today he had 10 new ones bigger and brighter and has his entire front door with “Trump 2024” on it. He no longer cares.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Briantastically",
                            "body": "They want it. They want him to do what they “want”, especially if it breaks the law. It’s about getting even and disrupting the status quo.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "scarletofmagic",
                            "body": "They make it’s very hard for me to keep my empathy. I don’t want people to lose jobs, children to get sick but all they did just make me want them to suffer.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Under_Ach1ever",
                            "body": "Holy shit... This is EXACTLY THE SHIT MY FAMILY SAYS!!!!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DoublePostedBroski",
                            "body": "Nah. It’d be more like, “well, Congress and the Supreme Court weren’t really needed. It was kind of bloated and didn’t work well.”",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "thepianoman456",
                            "body": "I shit you not: on my Facebook, the MAGAs are now literally saying- “paying high prices is patriotic.”\n  \nI fucking KNEW it. I knew they would be saying shit like this. There really is no hope for those dopes. They’re loudly cheering on the rapid demise of our country and global standing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SweetLovingWhispers",
                    "body": "The Russian bots are all cheering each crime he commits.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "NeuroPlastick",
                    "body": "Are liberals happy? No. That's all they care about. Our unhappiness brings them great  joy. Damn the consequences",
                    "score": 98,
                    "replies": [
                        {
                            "author": "centagon",
                            "body": "There's a lot of 'cutting of one's nose to spite their face' going on in America. The US is going to be unrecognizable in a few years.\n\nEveryone else, get ready to see the freakshow.",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "EyeIslet",
                            "body": "\"The liberals made my life miserable for 43 years, and I'm going to make their lives miserable for 43 years.\" - Clarence Thomas",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "NeuroPlastick",
                                    "body": "He should have taken the motor home when it was offered",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "dustymoon1",
                                    "body": "Clarence was a DEI student and was also a poor student. It is his revenge now.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "omgpuppiesarecute",
                            "body": "The whole \"conservatives would eat shit if a liberal would have to smell their breath\" was quite literally codified into law by the supreme Court today.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "GiltCityUSA",
                            "body": "I am not a liberal.  I also did not vote for this clown.  I wasn't a fan of Biden either but honestly at this point anyone would be better than Donald Trump.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "NeuroPlastick",
                                    "body": "I don't care",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Specialist_Brain841",
                            "body": "liberal hate engine",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FiveUpsideDown",
                    "body": "Trump is attacking the United States and the American people.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "MoG_Varos",
                    "body": "I mean, obviously yes Lul.\n\nI live in the south, everyone down here is praising the ground Trump walks on.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "BlackManWorking",
                    "body": "Ohhh they are very happy. If you see any of the related subs….. they are so happy to be “winning.” Whatever the hell that means….",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ayzmo",
                    "body": "Yes they are. They love to see the government failing. They live for it.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "CallRespiratory",
                    "body": "They absolutely are and we gotta stop pretending these are rational people who act in good faith.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Flimsy_Situation_506",
                    "body": "Ya because they still don’t see how this is going to personally going to affect them. Canada already has had the Tennessee Governor begging us not to take their alcohol off the shelves.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "THEdoomslayer94",
                    "body": "If you check the conservative sub they’re constantly glazing him and constantly paranoid that outsiders are infiltrating their echo chamber \n\nSo yeah they’re happy about all this",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "mces97",
                    "body": "As long as their \"enemies\" are hurting, yes. That's what drives them. Not a better future. Just hate. Which is why shit sucks.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "RipErRiley",
                    "body": "Give up on trying to find a bridge of reason to reasonless puppets.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HowCanThisBeMyGenX",
                    "body": "They are happy - because they believe that Trump is breaking the laws to specifically help them and hurt the people that they’ve been told to hate.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GiltCityUSA",
                            "body": "Surprise.  He hates everyone except his elite class.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "adarkuccio",
                    "body": "\"We NeEd A sTrOnG mAn\" 🙃",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Notme20659",
                    "body": "You can whine and complain, but seriously, when have we had a president (or congressman or senator) that hasn’t done criminal shit? Until every dumbass in this nation wakes up regardless of your political view point and says enough is enough, we are not voting for the incumbent in any election, starting with the primaries, we are stuck with this. This isn’t a left issue, this isn’t a right issue, this is a voter issue. Stop voting for the incumbent. Period.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "reddittorbrigade",
            "body": "What illegal? Donald Trump is a king. He has infinite power.\n\n\\-Corrupt SC judges.",
            "score": 550,
            "replies": [
                {
                    "author": "hpark21",
                    "body": "I was going to say, SCOTUS clearly said pretty much anything prez does is legal.",
                    "score": 71,
                    "replies": [
                        {
                            "author": "eronth",
                            "body": "They did not. They said he can't be held criminally for anything he does while president, but it doesn't actually make the EOs he drops legally binding if they're otherwise illegal.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Lord_Nivloc",
                                    "body": "Which is dumb. \n\nIt’s be one thing if they said he can’t be held for small or uncertain criminal things. Although even then, I’d argue that spending a night in the slammer for drunken disorderliness would not prevent him from doing his job, so why does he need to be protected from small things?\n\nBut if he shoots a man in the street, he goes to jail for murder. Despite his tweets to the contrary. ",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Human_Mask",
                    "body": "Did he got a sword from a lady in a lake?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "glitchedgamer",
            "body": "I'm sick of hearing that what he's doing is obviously illegal, what the fuck is going to be done about it?",
            "score": 176,
            "replies": [
                {
                    "author": "B19F00T",
                    "body": "Nothing, scotus gave the president full criminal immunity while In office. The only 2 options we have to see trump out before his term ends, are impeachment with a conviction, or death",
                    "score": 96,
                    "replies": [
                        {
                            "author": "Illestbillis",
                            "body": "Death by peaches!",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "clintCamp",
                                    "body": "Every American gets a peach and they can decide whether they throw the peach at Trump or not?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Illestbillis",
                                            "body": "As long as the \"impeachment\" results in a peachy demise",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "clintCamp",
                                                    "body": "I wonder how many peaches it takes to do that.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Illestbillis",
                                                            "body": "A challenge to the people of America!\n\n🍑",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Booyacaja",
                            "body": "Who initiates the impeachment and why hasn't this already been done is the next question",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "B19F00T",
                                    "body": "a congress member. it hasnt been done because republicans have the majority entirely, any impeachment would obviously fail. the only hope (as I see it) is for the economy to tank hard in the next 2 years, and for voters to fucking wake up and flip the house and senate in the mid term elections. if they fail us like they did in november, we're just straight up fucked for the full 4 years",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "clintCamp",
                                            "body": "Things changed after trumps last term because people still had the bad taste in their mouths. This last time the short memory span failed many and they forgot how bad things actually were last time.  Maybe they will remember again?",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Top-Salamander-2525",
                            "body": "Equally unlikely, but also 25th.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "B19F00T",
                                    "body": "Yeah lol that's literally never going to happen, but you aren't wrong",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Social_Gore",
            "body": "If I do illegal things I get punished",
            "score": 93,
            "replies": [
                {
                    "author": "grptrt",
                    "body": "are you a billionaire?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Social_Gore",
                            "body": "not yet",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "bluemitersaw",
                                    "body": "Once Trump is done doing his thing you'll become a billionaire, I'm sure of it!!!!! Any minute now.... Any minute.....",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "lod254",
                                    "body": "What if you stole a billion dollars?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Social_Gore",
                                            "body": "Depends, if you have a billion and steal a billion, it's fine. If a poor person steals a billion they're in deep shit.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "lod254",
                                                    "body": "Steal a billion and then another!",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "clintCamp",
                                            "body": "All good as long as you kiss the ring and make a donation.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SnooPies5622",
            "body": "o rly\n\n\nbetter pass this one on to a judge with Trump's hand up his butt then",
            "score": 88,
            "replies": []
        },
        {
            "author": "penguished",
            "body": "So wait, that guy that had 34 felonies and wouldn't step down because he doesn't have normal person shame... he did more crimes?\n\nNOOOOOOOOO WAAAAAAAAAY.",
            "score": 35,
            "replies": [
                {
                    "author": "Jeffyhatesthis",
                    "body": "Hes going to try to rule us with an iron fist. his 34 felonies are just going to embolden him more. Search \"trump rule 34\" to see how hes going to do it.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "penguished",
                            "body": "You think redditors don't know what that means? Try facebook for the outdated internet bud.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Smithmw",
            "body": "Judge can rule whatever they want but trump is full blown corrupt and wont listen to it",
            "score": 33,
            "replies": []
        },
        {
            "author": "Badbikerdude",
            "body": "Do something about it, or STFU I'm  so tired of it, and it's only Tuesday.",
            "score": 117,
            "replies": [
                {
                    "author": "AntiDECA",
                    "body": "I mean, there's nothing they can do about it unless congress gets off its ass (they won't) or someone offs him. ",
                    "score": 65,
                    "replies": [
                        {
                            "author": "Evening_Calendar2176",
                            "body": "[ Removed by Reddit ]",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "BigRigButters2",
                                    "body": "Been saying that for over a month now",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "alien_from_Europa",
                                    "body": "We will never be able to organize any meaningful change on this platform.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "namideus",
                                    "body": "Fuck you Reddit!",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "awesomecubed",
                                    "body": "No you don’t.   Martial law will be declared and elections suspended.",
                                    "score": -16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "yatoshii",
                            "body": "Become a worldwide HERO overnight!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "opking",
            "body": "drumpf can do whatever he would like because congress won't hold him accountable. E V E R!!!\n\nHe's a traitor as are his accomplices.",
            "score": 6,
            "replies": []
        },
        {
            "author": "AkaskaBlue",
            "body": "So what will happen to Trump? Nothing as usual Americans talk a big game but lack a spine.",
            "score": 9,
            "replies": []
        },
        {
            "author": "IntelligentStyle402",
            "body": "Surely by know, the entire world knows Donald can do anything he wants? He is definitely above the law and backed by our Supreme Court.",
            "score": 5,
            "replies": []
        },
        {
            "author": "rsmith72976",
            "body": "And? Who’s going to enforce the ruling of the judge? The regime doesn’t care…",
            "score": 4,
            "replies": [
                {
                    "author": "Cool-Economics6261",
                    "body": "The Supremely Catholic High Court has already declared that as president, he is exonerated of any crime he commits. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DwinkBexon",
            "body": "Whenever I read something like this, I keep thinking, \"This is going to have to make enough GOP Representatives realize what a fuck up this is becoming and make it possible for the Democrats to impeach.\"\n\nI still think it'll happen eventually, it's just taking _way_ longer than I thought.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vidar34",
            "body": "If there aren't any consequences for this illegal action, then it isn't illegal.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ZookeepergameDue8501",
            "body": "Man. I've gotten to where I have no hope. Seems like every day I see \"what Trump has done has been ruled illegal by a judge! Action will be taken!\" Then nothing happens. He gets away with it. Every. Single. Fucking. Time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "joecool42069",
            "body": "He's turning us into the baddies.  We're going to be aligned with Russia, North Korea, and China.  He'll alienate our western allies.  We will become the axis of evil.",
            "score": 4,
            "replies": []
        },
        {
            "author": "NSMike",
            "body": "This won't mean much, because the ruling says she was fired \"without cause,\" and it sounds very much like they just have to find a good enough reason to fire her.  Then they'll do so - it'll be a lie, but won't withstand another court challenge because the reason will be subjective.\n\nWhat's truly pathetic is that they couldn't just come up with a lie in the first place.  The incompetence even extends to how bad they are at destroying the thing they want to destroy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sweatytubesock",
            "body": "As usual regarding this scumbag, throw it on the pile.",
            "score": 5,
            "replies": []
        },
        {
            "author": "StepYaGameUp",
            "body": "Any “DO*GE*” gains by criminal activities are going to be **way** offset by the lawsuits that have to be settled from this administration’s actions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cool-Economics6261",
            "body": "“Trump illegally…… “.  you fill in the current crime. \n\nI remember when USA was a rule of law nation. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "metalsnake27",
            "body": "Well that judge won't be around much longer....\n\nHappy to see people fighting against this shit though.,",
            "score": 3,
            "replies": []
        },
        {
            "author": "barnibusvonkreeps",
            "body": "So? Who's going to punish him? What will the consequences be? Lol. Amefcia is a fucking joke.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Nicholas-Steel",
            "body": "So throw him in jail? Toss the book at him? Why is he getting away which such drastic overhauling of government?",
            "score": 1,
            "replies": [
                {
                    "author": "AtTheGates",
                    "body": "Where have you been in the last 4 years? Did you not see everything that was throw at the orange idiot and somehow someway he did not go to prison and was still allowed to be president? It is over. America is done.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Nicholas-Steel",
                            "body": "I'm kinda surprised at all this news coverage of him firing people... like, what did you think would happen when making a \"Reality Star\" known for firing people be president...",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rough-Rhubarb6969",
            "body": "When he flies to Russia just leave him there.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mnguyen75",
            "body": "is there a list of all the dodgy and illegal shit Trump has been doing since his term started?  Preferably one that is updated every day? Cause Im having a hard time keeping track and thats probably by design...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Commander_N7",
            "body": "Say it with me: If Trump illegally does anything; he should be impeached and tried for removal. \n\nIf someone can just do illegal things without any consequence; then it's not illegal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BA5ED",
            "body": "What’s gonna happen is they’re gonna appeal this and ultimately they are going to find out that the executive branch has the authority to end employment without cause.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fsaturnia",
            "body": "The word illegal doesn't mean anything when it comes to these people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jamowl2841",
            "body": "u/Outrageous_Skirt9963",
            "score": 1,
            "replies": []
        },
        {
            "author": "aaust84ct",
            "body": "This person will take legal action and will get a massive payout from loss of earnings, emotional distress etc. But at this point, it's obviously worth the hit to the administration because they can just sack gov employees without restriction. America is being torn apart from the inside out, just as Russia intended; Yuri Bezmenov was right!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScoobiesSnacks",
            "body": "Well she got reinstated and got her job back. That’s really good news in what seems like a storm of terrible news.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinNeighborhood2276",
            "body": "This ruling could have significant implications for the protection of government employees and the integrity of the board.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dchap1",
            "body": "Yet it matters not, and nothing will come of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ITGuy107",
            "body": "Impeach! \nI have a feeling once Trump is gone. The other Republicans will normalize.",
            "score": -15,
            "replies": [
                {
                    "author": "R_V_Z",
                    "body": "Then you have a poor sense of history. This shit has been planned for for decades.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "ITGuy107",
                            "body": "Well, if you look at Vance’s opinion of Trump, not too long ago, he was totally against Trump. In most dictatorships once the leader is gone, the others don’t follow the same footsteps. Even though I think Vance isn’t total D, I think he’ll change once Trump is gone. And many others will change too, they just can’t say what they really wanna say right now.\n\nI understand project 2025 was orchestrated and planned, but I think Trump is the main leader behind it.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "R_V_Z",
                                    "body": "Project 2025 is an extension of Heritage Foundation plans. They've been bitching about a Deep State to distract from the reality that conservatives have been creating external organizations with the aim to take down the US as a liberal democracy since FDR.",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "ITGuy107",
                                            "body": "So then what are returning into?\nRemoving all these government facilities, such as FDIC and consumer protection and cyber security, what is it leading toward?",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "R_V_Z",
                                                    "body": "Christian Nationalistic Oligarchy.",
                                                    "score": 17,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xatoho",
                    "body": "No way, they will not normalize the base is too brainwashed",
                    "score": 13,
                    "replies": [
                        {
                            "author": "ITGuy107",
                            "body": "That’s very poor outlook into our future or my future…. \nThey are implementing a theory into a working government system that is very technical. Their theory could literally collapse the government financially…",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Toph84",
                                    "body": "Countless empires, nations, and kingdoms in history have fallen due to mounting stupidity and bad choices. The USA is not immune. There's no guarantee or fate mandated hand to save the USA.\n\nEither you pull yourselves out or join the list of fallen nations.\n\nBeing in the moment sure it felt like the USA would be around \"forever\", and all the various fictional stories set in the future where it's subconsciously set that USA is the future (how many SciFi Earth militaries basically emulate some idea of a future US military?), but that was never guaranteed.\n\nIf you take a citizen of the Roman Empire at their peak, I'm sure they too would hardly believe their glorious empire would eventually one day completely collapse and fall apart   into nothingness.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "xatoho",
                                    "body": "The outlook on the future is incredibly poor",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pointothedexter",
                    "body": "The fuck they will. They have zero backbone.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "N_Who",
                    "body": "Shame you're getting downvoted for having a feeling people disagree with, when you want to do the right thing.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ITGuy107",
                            "body": "Thank you. \nTrump had six bankruptcy and his working career and this is going to be a seventh.\n\nThe United States was on a good economy and he’s going to crash everything.\n\nSearch Mary Trump on YouTube .",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cyberentomology",
            "body": "Ironic that the people who think “DEI” and “Merit” are antonyms fired the head of the **Merit** Systems Protection Board",
            "score": 0,
            "replies": []
        },
        {
            "author": "FiveUpsideDown",
            "body": "The headline is misleading. The Merit System Protection Board hasn’t protected federal employees in decades. Federal employees lose 97% of the time. https://fedemploymentattorneys.com/legal-blog/how-many-federal-employees-win-their-cases-with-mspb/. As appealing as it is to fire every single MSPB employees, Trump should follow the laws before firing them.",
            "score": -17,
            "replies": [
                {
                    "author": "qwarfujj",
                    "body": "Those stats are going to have a big change if they can deal with all the recently fired employees as a class action.  None of them are legal.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Washyy39",
            "body": "Tomorrow judge contreras and ms Harris will be out of a job… what a shitshow that country has become",
            "score": -22,
            "replies": []
        },
        {
            "author": "Nobodys_Loss",
            "body": "Oh well. Remove him anyway.",
            "score": -26,
            "replies": [
                {
                    "author": "bmoviescreamqueen",
                    "body": "Yall scream \"law and order\" until you're the one ignoring the law",
                    "score": 15,
                    "replies": []
                }
            ]
        }
    ]
}