{
    "title": "The Best Air Purifiers?",
    "author": "Defiant_Fix8658",
    "subreddit": "BuyItForLife",
    "rank": 13,
    "score": 16,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/BuyItForLife/comments/1je38tx/the_best_air_purifiers/",
    "id": "1je38tx",
    "selftext": "With a lot of smoke and bad air from the wildfires, I want to get an update on what is working well. I am looking for help with a good air purifier unit for Smoke, particles, and allergens.\n\nHere is a list I am considering.\n\n* Medify Air\n* Alen BreatheSmart\n* LEVOIT\n* Coway Airmega\n* Honeywell\n* Blueair Blue\n* Winix\n* Austin Air\n\nThanks a lot.",
    "comments": [
        {
            "author": "Lebesgue_Couloir",
            "body": "I vote for Coway Airmega. I have 3 of them and they’re great",
            "score": 17,
            "replies": []
        },
        {
            "author": "c9belayer",
            "body": "Whatever you decide be sure to evaluate the cost of filters. They may vary wildly.",
            "score": 11,
            "replies": []
        },
        {
            "author": "WhereverUGoThereUR",
            "body": "Add IQAir to the list. Lived several years in China and found it the very best of all the others.",
            "score": 6,
            "replies": []
        },
        {
            "author": "finewalecorduroy",
            "body": "Another option is to make a Corsi-Rosenthal box with a box fan and 4 air filters and some duct tape. Big footprint but GREAT at filtering air. You do have to remake the box once a year with new filters, though. But those box fans are cheap and last a long time.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Sosowski",
            "body": "I have Xiaomi and they last me some years already. There's some wireless functions I don't need, but overall the motor, sensor and build is surprisingly solid.\n\nMy Levoit cooked it's own engine, unfixable. I modded PC fans in but I will never buy Levoit again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "filly100",
            "body": "I have terrible allergies and use Blue Air on every level. Works amazing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jack15911",
            "body": "Consumer Reports likes Conway AirMega ProX, Germ Guardian, and BlueAir. They say they evaluate filter costs as part of the ratings, but they don't break them out separately, unfortunately.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Hello /u/Defiant_Fix8658! Thank you for your submission! The AutoMod thought that your post might be a request type post and has changed the flair accordingly, but if this was wrong feel free to change it back!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BuyItForLife) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cool-Role-6399",
            "body": "I own medify air. I cannot complain about performance.\n\nHowever, people online complain that you must change your filters every 6 months or your lifetime warranty will be voided.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhairPharmer",
            "body": "I have 4 Winix 5500(?) running in my house 24/7 that are 3-5 years old. I keep them on fan speed 3 out of 4. No issues, but if power goes out you have to turn them back on. I think these are the best priced BIFL option on your list. Levoit is meh.\n\nI have a blue air, and have done research on hospital-quality others. They're good, but filter costs will bankrupt you if you follow the frequency they suggest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "katkashmir",
            "body": "I have 4 Alen air purifiers, and they are absolutely awesome.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaBomb091",
            "body": "I've heard people say good things about clean air kits from a price/sound perspective! I would recommend giving it a look as I just ordered mine a few days ago :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ResponsiblePen3082",
            "body": "R/airpurifiers. \n\nBudget, room(s) size would help. \n\nThe \"best\" would be one you build yourself, with an AC infinity refillable carbon filter attached to fan and hvac filter box. Second best would be a modified CR box.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vinberdon",
            "body": "I have 2 Winix HEPAs that have been running 24/7 for 6+ years. I clean the screen every week or so, replace the carbon every month, and the HEPA every ~8 months.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConBroMitch2247",
            "body": "Alen is the best of that group by far. And especially since this is r/BIFL - they offer a lifetime warranty as long as you buy your filters from them (or authorized 3rd party)\n\nRemember, get a unit bigger than you think you’ll need so you don’t need to run it on full blast constantly and be overwhelmed by noise - another plus for Alen is that they are insanely quiet. I have a 45i and 75i and they are excellent. The VOC filter has a crazy amount of carbon in it too to help with smoke. I believe they are also one of the few manufacturers that publish their carbon numbers in their filters. A lot of others don’t.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saul_T_Bitch",
            "body": "I have 3 rabbit aire. Love them",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrsredfast",
            "body": "We have multiple Blue Air and a Coway. Happy with all of them.  Frequently available on sale.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soggy-Offer-7241",
            "body": "I bought an Allen 5 years ago and we are very pleased with it. We have an open concept home (2,000 square feet) and the Allen purifier will kick in when I am cooking even though it is across the room on the opposite wall. The customer service is very good!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Muncie4",
            "body": "You are conclusion shopping which is the worst kind of shopping, especially when you list 8 ding dong brands.\n\nThe best air purifier is a PM1 unit.  When you find out pricing on those, you'll be at the hospital tending to your nose bleed.\n\nStep zero of buying an air conditioning system is to buy one suited to the square footage of the room(s) you want to purify.  We don't have this metric, so anyone helping you with recommendations is actually steering you in the wrong direction as you will be an unsuitably sized unit.\n\nStart with stating the sizing.  If its going to be in a room with the door closed, state that sizing.  If every room in the house will be doors open and you want whole house, state the entire square footage.",
            "score": -3,
            "replies": []
        }
    ]
}