{
    "title": "Bra recommendation for a lift, but not any bigger",
    "author": "seakween",
    "subreddit": "BuyItForLife",
    "rank": 9,
    "score": 5,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/BuyItForLife/comments/1jejr05/bra_recommendation_for_a_lift_but_not_any_bigger/",
    "id": "1jejr05",
    "selftext": "As the title reads, I'm just looking for a good bra that can lift my boulders up higher on my chest, not necessarily make them look bigger- they're big enough. I'm willing to spend a pretty penny as long as they're well recommended and will last a good amount of time. Underwire doesn't matter, although would prefer seamless.\n\nI've heard good things about SKIMS if anyone can attest.\n\nThank yewww >.<",
    "comments": [
        {
            "author": "doyoucreditit",
            "body": "Please check in with r/ABraThatFits before making any purchases. They have great measuring instructions, guides to choosing a bra to achieve your goal, and lists of recommended local stores.",
            "score": 1,
            "replies": []
        },
        {
            "author": "torquetorque",
            "body": "I highly doubt anything with the Kardashian name on it is BIFL, they aren't exactly known for substance.\n\nThat said, I have an Anita wireless bra that's been going strong for 15 years and it's still one that I reach for when I just want the basics. [https://www.anita.com/ca/bras/wireless-bras.html](https://www.anita.com/ca/bras/wireless-bras.html)",
            "score": 2,
            "replies": []
        },
        {
            "author": "alliswellintheworld",
            "body": "I wear sports bras. They can be purchased relatively inexpensively in thick material that holds extremely well without any extra padding. They also last a very long time when air dried. In my experience, regular bras just don't have sufficient hold for larger breasts.",
            "score": 0,
            "replies": []
        }
    ]
}