{
    "title": "Daily Roundtable: Community Q&A",
    "author": "AutoModerator",
    "subreddit": "Eldenring",
    "rank": 0,
    "score": 4,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/Eldenring/comments/1jdwjl7/daily_roundtable_community_qa/",
    "id": "1jdwjl7",
    "selftext": "Greetings Tarnished!\n\nThis is the place to ask any questions you may have about Elden Ring. This includes obscure detail questions, \"newbie\" advice questions, build questions, boss advice questions, and what have you.\n\nWell written, constructive criticism is fine but please avoid ranting about aspects of the game you just don’t like. This includes “so and so boss is stupid and too difficult.”\n\nIf you are interested in the game but don’t own it yet, please don’t post “should I buy this game?” or “Is this game worth it?”. If you have played other FromSoftware games and enjoyed them, the answer is yes. If you haven’t, just do a little research! These games are difficult, and sometimes frustrating, and not everyone is going to enjoy them. And that’s okay!\n\nLastly, be friendly! We are all here because we are interested in the same game! Please treat your fellow players with respect.\n\n**PLEASE USE SPOILER TAGS WHEN MENTIONING BOSS NAMES!**\n\nHere are a few helpful links:\n\n[Our Discord](https://discord.com/invite/r-eldenring) which has an awesome [Helper Request System!](https://www.reddit.com/r/Eldenring/comments/uda81o/er_discord_bossdungeon_help_request_for_all/)\n\n[Elden Ring Wiki](https://eldenring.wiki.fextralife.com/Elden+Ring+Wiki)\n\n[Elden Ring Map](https://eldenring.wiki.fextralife.com/Interactive+Map)\n\n[DLC Content Summary](https://eldenring.wiki.fextralife.com/Shadow+of+the+Erdtree)\n\n[DLC Map](https://eldenring.wiki.fextralife.com/Shadow+of+the+Erdtree+Map)\n\n[Most Recent Patch Notes](https://en.bandainamcoent.eu/elden-ring/news/elden-ring-calibration-update-1122) (1.12)\n\n/r/BeyondTheFog for co-op help!\n\n/r/PatchesEmporium for item trading!\n\n/r/EldenRingBuilds for builds and build help!\n\nOur community password is **straydmn**\n\nRise, Tarnished!",
    "comments": [
        {
            "author": "ZorkNemesis",
            "body": "Are there any pitchfork-looking weapons besides Mohg's trident?  I have a sudden desire to do a playthrough as an angry mob with a torch and pitchfork.",
            "score": 2,
            "replies": [
                {
                    "author": "CloakerMonk",
                    "body": "I think the only other option is the Inquisitor's Girandole, a quality faith weapon found in Volcano Manor.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kroganwarlord",
            "body": "Y'all. I put in six hours last night. Do you know how long it's been since I've put in six hours in a game? It was either SDV or ACNH, so at least 2 or 3 years. It is 0610 here and all I wanna do is play this stupid game! \n\nI feel like I'm finally done learning how to move and am now in early game. Boc's got his needle, got PumpkinHead on my third try (with +0 weapons), helped Santa's Wolf friend (barely had to help, TBH), cleared Weeping Peninsula to Castle Morne entrance, got to the Third Church and ran past the dragon to Ball Farm. Haven't got the trick of that one yet, but it was at the end of the session and my hands were literally shaking. (Fighting off a stomach bug ATM.) I'm so much better at killing giants and Kaiden Sellswords and groups of enemies now! Still dying, obvs, mostly because I am so focused on pushing the right buttons I forget to monitor my health bar. (Currently 37 deaths in 15.5 hours.)\n\n* I just keep running into this issue where, even though I haven't changed my layout or armor, my equipment load changes from medium to heavy. The first time I was able to get it back by popping a point into endurance, but the second time I had to unequip my bow AND add another point. What is happening here? Should Strength and Endurance be leveled up at the same time? I only have 23 points in Vigor.\n\n* I LOVE my halberd, this is truly the first game I've played in 30 years where I actually feel like a knight on horseback. I haven't seen many pole weapons in the noob game guides. Is the base model worth upgrading past +2? I know you can't have Torrent for most boss fights, but I spend a lot of time just exploring and fighting littles. Is there a better polearm I should wait for?\n\n* I've got the Bloodhound's Fang and should get the Claymore today. Is it realistic to wield these one-handed, as a fairly shitty player? Or should I stick with sword and shield? (I also plan on trying out double longswords today, so this point may be moot.)\n\n* Since I am such a shit player, we should do Castle Morne before Stormveil, right? \n\n* I feel really naked with the Finger Seal and magic instead of my shield. Can you like, block with the glintstone staff or something? \n\nSorry for all the questions! I think I'm just at that point where things are getting too complicated for newbie guides, and I am not intuitive with this kind of stuff. I think the last time I really understood crafting and upgrades and leveling was KOTOR.",
            "score": 1,
            "replies": [
                {
                    "author": "WhenTheWindIsSlow",
                    "body": "> Is the base model worth upgrading past +2?\n\nAll upgrade materials except for the highest grade can be found in infinite amounts (and eventually can be bought from a vendor), so if you're liking a weapon I would go ahead and upgraded it as much as you want.\n\n> Is there a better polearm I should wait for?\n\nThe general approach to weapons is that none are intended to be strictly \"better\" than any other. They are all different and many have some niche quirks to make them especially suited to certain builds, but the generic versions (for instance, the Halberd as opposed to the non-generic Dragon Halberd) usually have the benefit of versatility on their side as they can have their Ashes of War changed.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "oggy_90",
                    "body": "I'm nowhere near an expert, but there are talismans that raise your max equipment load. Maybe you had one on, but unequipped it by mistake? Also there are other means of temporarily raising your endurance, but those are only further into the game.\n\nand I'm afraid you can't block with any staff or seal. But since they are usually light, one way to go - is to equip a shield and a staff in your offhand and simply swap between them during a battle",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "JDF8",
                    "body": "Mostly in order:\n\n\nYou go from medium to heavy when your total weight is above 70% of your 'maximum' weight. Any weapon or shield in the six weapon slots contributes to your total weight.\n\n\nHalberd is pretty good. You can take it all the way to the final boss and be fine. In general, the 'basic' weapons like halberd, longsword, claymore are good. Certain enemies are weaker to elemental damage than physical (miners, crucible knights), but dex characters can use lightning infusion and str can use fire. Adjusting infusion can be done at any grace, so you can use one weapon to cover all your bases as long as you have the appropriate ash or whetblade.\n\n\nIf you two-hand a weapon, your effective strength stat is increased by 50% for damage calculations. On the other hand, like you noticed some weapons have a very different moveset (greatswords...). It's just a matter of preference whether you want to 2h for extra strength or the altered moveset, 1h and have a shield for blocking, or use two weapons so that you can apply statuses faster or do more dps. \n\n\nIf you mean having one in each hand, BHF and claymore don't go together, as one is a curved greatsword and the other is a normal greatsword. For dual wielding, you want weapons with the exact same class. You can pair claymore with the bastard sword from one of the weeping peninsula merchants, or BHF with a dismounter\n\n\nWhether or not you're good, it's always worth going to the weeping peninsula early. The three churches massively increase your flask healing, and stacking up some early runes will make the early game a lot easier, especially if you put some points in vigor.\n\n\nIf you want to cast a lot, you can put your seal or catalyst in your right hand so that you can retain a shield in your left hand. Later on, it can be worth holding two staves or azur's staff with a seal since many casting tools have passive bonuses to certain schools of magic. There's no magic to block physical attacks, but spells like carian greatsword and adula's moonblade can stagger all but the largest enemies, which will protect you from a lot of attacks",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "oggy_90",
            "body": "Guys, I have 2 questions about specific locations.\n\n1) We are at West Capital rampart ~~bonfire~~ site of grace. One way leads to some >!gargoyle !<mini boss, but I'm interested in the opposite way. There is a golden/ Leyndell knight with a spear(?). Ok, now there are stairs leading down, then there is a ladder going even further down... and then - there is nothing... but like 1-2 gravel stones next to precipice. I mean, it's understandable, the walls and building are destroyed and all, but... does this path really lead to nowhere? Dead end?\n\n2) Where is this area with scripted crumbling floor (once you drop onto), shown in the video:\n\n[https://www.youtube.com/watch?v=Fm-QA4rZPYk&t=1565s](https://www.youtube.com/watch?v=Fm-QA4rZPYk&t=1565s)\n\nthanks in advance!",
            "score": 1,
            "replies": [
                {
                    "author": "monstersleeve",
                    "body": "1. Look for a well and then drop down inside it.\n\n2. That video depicts a part of Stormveil Castle. From the Rampart Tower grace, past the eagles, there’s a spot to the left where you can jump off.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mason_Miami",
            "body": "What does [Nvidia's dropped support for PhysX in their 5000 line](https://www.youtube.com/watch?v=jgU_okT1smY) mean for performance in Elden Ring? Is this question big enough to break it out of Daily Q&A?",
            "score": 1,
            "replies": []
        },
        {
            "author": "goldenmonster99",
            "body": "Why wont you let me play shadow of the erdtree on disc?",
            "score": 0,
            "replies": []
        }
    ]
}