{
    "title": "Strength builds be like;",
    "author": "cahithotasf",
    "subreddit": "Eldenring",
    "rank": 3,
    "score": 4755,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 77,
    "url": "https://i.redd.it/1vcbn8ghfgpe1.jpeg",
    "id": "1je5md8",
    "selftext": "",
    "comments": [
        {
            "author": "NOSjoker21",
            "body": "INT mains be like:\n\nhttps://preview.redd.it/iqvxmtphjgpe1.png?width=1080&format=png&auto=webp&s=e6143756f410501a627f463c3b2a4cae6c6434d8",
            "score": 398,
            "replies": [
                {
                    "author": "KillaklanGaming",
                    "body": "I Unga, therefor I Bunga.\n\n![gif](giphy|nZumtdOQfdVxm)",
                    "score": 185,
                    "replies": []
                },
                {
                    "author": "cahithotasf",
                    "body": "Bonk",
                    "score": 33,
                    "replies": [
                        {
                            "author": "NOSjoker21",
                            "body": "STR Mains *when INT mains bonk back*\n\n![gif](giphy|ev8BNm3f69OxRxSP7R|downsized)",
                            "score": 128,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JesusChristV4",
                    "body": "Seems like str main but with extra steps",
                    "score": 10,
                    "replies": [
                        {
                            "author": "NOSjoker21",
                            "body": "Big magical aqua colored hammer is good yes?\n\n(I prefer Rock Sling, though)",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lenny1802",
                    "body": "That, and my magic Zweihander",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Sprinkle_Puff",
                    "body": "Move over , there’s a new kid in town 😎\n\nhttps://preview.redd.it/j3tll8l06ipe1.jpeg?width=1320&format=pjpg&auto=webp&s=20c6eaa86be0d4c21e6371857fa776bf57875c56",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "kashmira-qeel",
            "body": "STR/INT builds: \"Who you calling a nerd.\"",
            "score": 149,
            "replies": [
                {
                    "author": "Indercarnive",
                    "body": "\"The society that separates its scholars from its warriors will have its thinking done by cowards and its fighting by fools.\"\n\n\\- ~~Thucydides~~ STR/INT players",
                    "score": 121,
                    "replies": [
                        {
                            "author": "kashmira-qeel",
                            "body": "Fr my favourite PVP build is a STR/INT that favors the Royal Greatsword, Waves of Darkness on the Guts Greatsword, Glintstone Pebble on the Claymore, and many other silly things. I don't carry a torch, I use the *Starlight spell* like the classy bitch I am.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MienaiYurei",
            "body": "2 Guard counter with a collosal weapon constantly staggering PCR really changed my perception of STR builds.\n\nSTRENGTH BUILD IS BROKEN AF",
            "score": 81,
            "replies": [
                {
                    "author": "Firm-Scientist-4636",
                    "body": "Yup. It's dying down, but I used to hear strength builds complain about how easy magic users have it. I'm finally doing a strength playthrough of ER and I'm breezing through the game like never before.",
                    "score": 64,
                    "replies": [
                        {
                            "author": "NOSjoker21",
                            "body": "STR Builds with Giant-Crusher Hammer +25, Lion's Claw, Stamina, Jump Attack, and Charge Attack Talismans: \"INT is so easy!\"\n\n[Proceeds to pancake their way through the game]",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "Firm-Scientist-4636",
                                    "body": "Exactly! Lion's Claw is beating ass for me, even just  on Great Stars. (I do love that weapon.)",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Painstripe",
                            "body": "It's funny cause the average idea of a magic build is entirely based on those videos from the game's launch where people stacked Terra Magica + Infinite FP crystal tear + Comet Azur to cheese bosses within moments, and just assume that that's the norm.\n\nI thought having my projectile spells and Unseen Form-invisibility for exploring the game was 'easy mode' on my original playthrough, but then I finally played a pure STR build and jump-attacking everything to constantly stagger them while churning out stupid damage turned out to be the most babyshit way to play this game lmao.\n\nMeanwhile if you dare use spells that aren't Night sorceries, half the enemies and bosses in the game will just input-read and automatically dodge them unless you hit them point-blank.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "NOSjoker21",
                                    "body": "I'm a Gravity Sorcerer but you have to use Glintstone ones at some point. In fact, Rock Sling is preferred because it isn't as easily dodged.\n\nAnd although Const Azur cheese is okay, Meteorite of Astel just scratches an itch I have juuuuust right",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Painstripe",
                                            "body": "I wish there were more Crystalian sorceries, I really love the dark blue hues of Crystal Torrent and Shattering Crystal. Kinda ended up just naturally supplementing their aesthetic with Night sorceries later when I first came across them, and found out about their 'invisible' gimmick that way.\n\nI'd totally rock Lava sorceries more often if they had more spells to choose from as well! Only having 4 spells really limits how interesting a build can be.\n\nI also think one of the sorcery categories should've been a proper green in color, just to differentiate them a little bit. A whole lot of blue going on...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "AFlyingNun",
                                    "body": "> Meanwhile if you dare use spells that aren't Night sorceries\n\n***That's*** the important caveat right here: Night Comet alone makes INT-Caster the easiest playstyle in the (base) game. (DLC on the other hand fucking *hates* casters and is actively trying to murder them)\n\nNight Comet for example gives casters a \"free pass\" vs. Malenia, who can be kited with it. STR and other build types still have to fight her the normal way.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Responsible_Dream282",
                                            "body": "Malenia's 2nd phase is too fast for comet spam. At this point it's easier to engage her. But yeah, NC destroys her 1st phase.\n\nYou can also COmet Azur her stupid during Scarlet Aeonia. Beat her today on NG+5, I got her below 50% HP after the first Aeonia.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AFlyingNun",
                                                    "body": "So don't spam. \n\nCharge cast one, she will react to it when it connects, you dodge the reaction, rinse and repeat.\n\nIn phase 1 she tends to react with either Waterfowl from max range (very easy to dodge), the move where she raises her sword above her head before charging forward and swinging overhead twice, or the lunge attack.\n\nIn phase 2, she tends to react with either:\n\n-Waterfowl from max range (easy to dodge from this range)\n\n-The clone attack (you can blatantly outrun it)\n\n-A side swipe swoop in with a lunge forward follow-up (not hard to dodge)\n\n-Scarlet Aeonia\n\nHey, that last one sounds ***REALLY*** bad to use vs. a caster, doesn't it?! \n\nThat last one is also precisely why it works: you just rinse and repeat with single casts from afar until she does it again and you kill her for free.\n\nDone it on two separate caster characters, both in under 5 attempts. Easiest Malenia kills of my career.\n\nFaith caster can actually do the same with Frenzied Burst (the snipe attack), it's just a lot wonkier and tighter to utilize the windows.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Responsible_Dream282",
                                                            "body": "At this point just fight melee",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AFlyingNun",
                            "body": "To be fair, INT Caster in the base game ***is*** easier than STR. It can drop a lot of bosses before they can even swing, and minimal dodging is necessary.\n\nThe DLC on the other hand nuked casters into the stratosphere, because there's a rapid attack rate on most bosses that makes casting difficult. More importantly, they basically deleted spacing from the game and every boss gets their own \"heh nothing personnell kid *teleports behind u*\" move, which is disproportionately a problem for casters. That's probably why the spotlight is increasingly on STR users, because while INT deserved the critique for the base game, they are absolutely suffering in the DLC.\n\n**The *real* shafted build type is DEX.** It's been a joke since Dark Souls that those filthy Dex users are easymode peasants, but in Elden Ring, the script was flipped. \n\nSTR has the additional benefit of the occasional stagger, and because bosses have become increasingly harder with smaller windows, you prefer a heavy DPH weapon that does as much damage as possible in one hit over a DPS weapon that tries to get multiple attacks off. Any extra damage DEX milks from it's superior DPS is easily outdone by the free damage STR gets from it's staggers, too.\n\nDex isn't bad by any means, it's just not being recognized properly as the 2nd hardest playstyle of the 5 main damage stats. (hardest being pure Faith, an important exception there being the Blasphemous Blade being the single most broken PvE weapon in the game; otherwise, Faith usually functions as a slower-casting INT)",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "R_V_Z",
                                    "body": "The thing about Dex builds is that they are also secretly also Bleed builds most of the time. Sure, some bosses can't bleed, but the ones that do can get chunked down quickly.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Responsible_Dream282",
                                    "body": "The \"objective\" ranking is probably:\n\n1. Pure STR\n2. Pure INT\n3. Pure FTH\n4. Pure DEX\n5. Pure ARC.\n\nWhere dex shines are the hybrids. Dex/arc gets bleed, Dex/int has the speed boost, cold and some somber weapons, DEX/FTH also gets bonus speed and some nice weapons. Quality is shit tho aside from very high levels",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "AFlyingNun",
                                            "body": "I said it elsewhere but in no universe is Pure INT below pure STR in the base game. (DLC is another story)\n\nNight Comet can dish out 2.2k and cast faster than any colossal weapon can swing...and all that from a safe distance, while most bosses don't react to the spell whatsoever.\n\nThat STR is one of the easiest playstyles is truth. That INT-casters trying to rewrite history and say it's eas***ier*** than INT is copium.\n\nPure Arcane also has no business being at the bottom since there's actually quite a few weapons where Occult produces better damage returns, not to mention a Bandit for example can fully neglect DEX, max Arcane at 80 and still deal ridiculous DPS with Reduvia.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Responsible_Dream282",
                                                    "body": "And forgot to mention that STR gets a 50% boost if you 2 hand. Because of that lower levels are simply unfair. With 54 str you can reach the hardcap of 80, meaning you need 26 less levels to max out your damage.\n\n\n\n\nStr also gets the Clawmark seal cause fuck you",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Responsible_Dream282",
                                                    "body": "Reduvia alone can't carry a whole stat. Arc just works better with dex.\n\n\nOccult infusions on weapon with Innate bleed outperforme bleed infusions, so you get more base damage against enemies immune to bleed. Bleed by itself is probably 3 or 2, but Arc and bleed are not the same thing.\n\n\n\n\nAnd what setup fo you need for this 2.2 k damage? \n\n\nAlso, this is build overall, not 1 specific min maxed YouTube build. Night Comet and Carian Slicer are the only 2 spammable sorceries in the game.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Firm-Scientist-4636",
                                    "body": "I agree with you on DEX and the DLC. I still disagree about the base game. I was on the struggle bus on my first INT playthrough. I had to research how to get more powerful spells since getting them isn't an apparent thing. Want to get Cannon and Gavel of Haima? Talk to a dude in a church about a key, find the key in the rafters of the academy after taking a path that isn't immediately obvious, go back to the dude to get a gesture, find the tower where you can use the gesture to get access to the spells. It's convoluted. I understand being convoluted is part of the often frustrating charm of this game, but I can find Great Stars in a chest on a road. (I was going to mention Bloodhound's Fang, but in retrospect getting it is also somewhat convoluted).\n\nFor me, every Soulslike I've played has been easier with a STR build instead of INT with the exception of Demon's Souls (my love!). Magic is a fucking cheat code in that game, at least in the PS3 version. It spurred my love of casters.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AFlyingNun",
                                            "body": "If we're measuring for the ***potential*** of each build though, there's just no denying you can juice Night Comet up to hit for 2.2k at a much faster rate than what STR bonking sticks dish out, and at a much safer range too. Can also pick up Night Comet right at the start of the game. (though yes, you'll need meta knowledge to both snag it and know how to get the 38 INT for it ASAP)\n\nMy INT caster playthrough was *base Vigor* and still one of my easiest playthroughs. There were bosses where depending on their RNG, I might die at the start, but I lazily said \"whatever, he'll do something stupid eventually\" because I recognized I could down him in 5 hits before he could touch me. \n\nLeonine Misbegotten in the Consecrated Snowfields comes to mind; his lunge attack countered me and prevented spell spam, but if he just *didn't* open with that attack, he was dead. Eventually that wasn't his first attack and GG he died without even getting close to me.\n\nOr Fire Giant for example, I didn't learn *shit* about fighting his Phase 2 on my INT Caster. I estimated my spacing, got it right, and Comet Azur'ed him doing his attack he always does at the start of phase 2 and killed him as explosions happened around me, before he even started using non-scripted attacks.\n\nMohg? Free pass.\n\nMalenia? Free pass.\n\nEven Radagon with his \"fuck casters in particular\" parry move, I forget which spell I used but I found one he didn't react to with a parry. Might've been Rock Sling.\n\nIt's just busted. \n\n...*So* busted in fact, that I'm convinced part of Miyazaki designed the DLC saying \"fuck INT Casters in particular,\" because it's absolutely *night and day* to compare how they perform in the base game vs. in the DLC. Painful experience in the DLC, but a walk in the park for the base game where I could skip learning a lot of the movesets.\n\nThe DLC is definitely - IMO - a balancing oddity, because it feels like the base game was jerking off STR and bleed builds, and Miyazaki just said \"say, what if we do ***more*** of that?!\" while completely neglecting Quality builds (who desperately needed help) and giving INT-casters the middle finger.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Firm-Scientist-4636",
                                                    "body": "Idk. My experience playing these games has been radically different. STR usually feels easier, especially against non-boss enemies. Bosses I'll grant you can be a bit easier with INT sometimes. I breezed through Rellana and couldn't figure out why until my partner pointed out that my INT is high and therefore my INT defense was also high and her spells didn't affect me as much as other builds.\n\nWith meta knowledge most classes are busted. Following a thorough walkthrough like FightinCowboy's that is as comprehensive as it is can also make things much easier. I guess I bring that up to point out meta, idk.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Responsible_Dream282",
                                                    "body": "DLC doesn't only bully int with the boss design, it also added barely anything new for int. All the new sorceries are shit aside from Blades of Stone and we got 0 good int weapons. There are also 0 int talimans(technically the talisman of the dread is one, but who tf uses magma sorceries?)\n\nAt least we got the backhand blades, these melt with frost. Killed Malenia with them yesterday, I could proc frost in a single combo",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "InfernoDairy",
                    "body": "Str builds are the easiest builds to run in Souls games and don't let anyone tell you otherwise.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "whitegoatsupreme",
                            "body": "It been like that since DS.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Responsible_Dream282",
                            "body": "Bloodborne is different because skill improves crit damage there, but yeah. Stagger is just op",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bfruth628",
                    "body": "Lol my DS1 playthrough was a STR build with a Zweihander. Was funny pancaking mobs",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rushes_End",
            "body": "![gif](giphy|NSa4nyXMSHgvUtUbws|downsized)\n\nGood argument, but Kamehameha",
            "score": 48,
            "replies": [
                {
                    "author": "MrWr4th",
                    "body": "Bro cast Rellana's Twin Moons on us with a gif",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ryethehow",
            "body": "*Rolls away. “YoU’rE aBuSiNg LiGhT RoLl”",
            "score": 30,
            "replies": [
                {
                    "author": "cahithotasf",
                    "body": "Lmaoo",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silent-Carob-8937",
            "body": "Mandatory unga bunga copypasta\n\nStr: unga bunga\n\nInt: I unga, therefore I bunga\n\nFth: I unga in the name of bunga\n\n\n\nArc: U̷̯̪̝̪͔̹̇̀͑̽̑̒̑̾n̵̜̙͉͍̪̈̒̾̃̅͂́̋͠ğ̴̢͕̙̙͂͆̊͌͝a̵͈̾͛̊͋̈́̀́̍̈́͆̒̎ ̵̼͈̮̬̳̟̼̳͛̓͒̒͘b̸̧̨͚̞͉̘̲̺̉͂̾͝ų̷̛̲̫̌̏̈̉̀͜ͅņ̶͔̟̬̗̂̾͊̓̌̿͝g̶̯̩͓͙͈̮̮̟̘̹͇̰̱̯̓̄̐̅̾̒̊͊ͅa̶̡̻̼͈̭͇̥̾͋̀̎̿̐̕\n\n\n\nDex: uwu nga bunga",
            "score": 59,
            "replies": [
                {
                    "author": "Rude_Original_4322",
                    "body": "Dex: I can't bunga very well so I unga unga",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "XLittleSkateyX",
                    "body": "Fth: Our Unga, who art in Bunga",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Onni_J",
                    "body": "Nah, dex: I slashed you ankles into 50 pieces, would you like me to mail them to your family?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Silent-Carob-8937",
                            "body": "dex: I slashed youngabunga ankles into 50 pieces, woungabungald youngabunga like me to mail them to youngabungar family?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Onni_J",
                                    "body": "Dex int: Would you like to see the moon? *moonveil to the face*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sparkster227",
            "body": "![gif](giphy|Cz6TlrRVVyv9S)",
            "score": 21,
            "replies": []
        },
        {
            "author": "dx_lemons",
            "body": "Faith builds throwing a boulder",
            "score": 17,
            "replies": [
                {
                    "author": "GoinXwell1",
                    "body": "Woe, rock be upon ye - Faith builds",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "themiddleguy09",
            "body": "And boom hes dead.\nDouble moon - Komet combo and finish with the cosmic Finger Explosion",
            "score": 17,
            "replies": [
                {
                    "author": "cahithotasf",
                    "body": "Hold my fp flask",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Faeddurfrost",
            "body": "“Pretty”\n\n*earthshaker followed by hammertime*",
            "score": 6,
            "replies": []
        },
        {
            "author": "someguythatlikesdogs",
            "body": "https://preview.redd.it/sry9o5cdsgpe1.jpeg?width=1170&format=pjpg&auto=webp&s=43fabc1fbb999fd8febf736da9fe6b44c40e373c",
            "score": 12,
            "replies": [
                {
                    "author": "Dramatic_Leopard679",
                    "body": "Hahahah exactly.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brain_lessV2",
            "body": "Strength builds upon being confronted by Gavel of Haima:\n\nhttps://i.redd.it/gtdcs5v6wgpe1.gif\n\nAlso nice repost",
            "score": 8,
            "replies": []
        },
        {
            "author": "Solyanka23",
            "body": "Pancake slamming since Anor Londo",
            "score": 4,
            "replies": []
        },
        {
            "author": "S4sh4d0g",
            "body": "INT has a bell curve\n\nLow end (STR build): BONK\n\nMid INT: *spams spell cheese, chugs 10 blue flasks, dies in 1 hit*\n\nHigh Int: BONK (Blue)",
            "score": 3,
            "replies": []
        },
        {
            "author": "GirlMoan",
            "body": "![gif](giphy|jnbePlxQIwFTAENERT)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pixiwish",
            "body": "Having beaten the game with several builds (to be transparent I haven’t beaten SotE multiple times only once) I think all styles can eventually be built OP as hell and have an easier time with different things. You can also make every style really hard if you don’t use OP things. \n\nWhat I will say is have found is that in my experience caster builds are much harder starting out. You have to distribute flasks because you run out of MP quickly and your regular attacks are trash and you don’t really stagger anything. \n\nI find that it is after Rennala is when casters really start to catch up and start having an advantage for a while but towards the end of the game everything can be really powerful. \n\nAlso disclaimer I’m a loser who won’t play any build with 0 range options. Great bow on strength build for pulling and get little ranged jerks who want to snipe me. I just feel having 0 range options on any character is not the type of self imposed disadvantage I want to deal with.",
            "score": 3,
            "replies": [
                {
                    "author": "AFlyingNun",
                    "body": "Having done the same, my ranking goes like this, from best to worst:\n\n**Base Game:**\n\n1) INT Caster\n\n2) STR\n\n3) Bleed\n\n4) Faith weapons (could also just call this Blasphemous Blade)\n\n5) Dex\n\n6) INT but with a focus on INT *weapons* rather than casting\n\n7) Quality\n\n8) Faith Caster\n\n**DLC:**\n\n1) STR\n\n2) Bleed\n\n3) Faith Weapons\n\n4) Dex\n\n5) Quality\n\n6) INT weapons\n\n7) INT Caster\n\n8) Faith Caster\n\nMight seem wild to see INT caster go from being the best in the base game to one of the worst in the DLC, but the lack of spacing and the brief attack windows in the DLC disproportionately hurt casters.\n\nFaith caster was the hardest for me because while it might be more *fun* to have a diversity of spells, it's simply harder to have to consider all the approaches to make something work instead of simply going \"hurrdurr bonk\" or \"hurrdurr night comet.\" Faith incantations also tend to be significantly longer than INT spells and rarely chain the way spells do, meaning either you struggle more or you forego 99% of the incantations and decide Catch Flame is your lord and savior. (which is *still* harder than Night Comet just because you gotta stay in close to the enemy)\n\nFaith weapons is probably the best example of what you're talking about: Blasphemous Blade itself is perhaps the single best PvE weapon in the game, but I found all the other Faith weapons to be good (Golden Halberd) or situational (Black Flame Tornado) at best, and otherwise generally pretty \"meh,\" because they often suffer from the same slow casting issues as the incantations.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Pixiwish",
                            "body": "Faith caster is def really rough. It isn’t just the cast time but the range often sucks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Responsible_Dream282",
                    "body": "I never used much arc, but my ranking would be:\n\nBase game\n\n* STR\n* Bleed\n* Spellblade INT or fth\n* Pure Caster INT or FTH\n* DEX\n* ARC\n\nSTR is op because of the 50% dual wield boost. STR builds can reach their hardcap 26 levels earlier than other builds by simply 2 handing. Also stagger is op and Lion's Claw is braindead.\n\nBleed is bleed. Even Malenia is weak to bleed\n\nFTh and Int are carried by their weapon selection. Blashoemous Blade, DMGS, Moonveil, etc\n\n  \nDex is more of a hybrid stat\n\nArc is a supplementary stat.\n\n\n\nDLC:\n\n* STR\n* Bleed\n* spellblade FTH \n* Spellblade INT\n* DEX\n* Pure Caster Faith\n* Pure caster INT\n* ARC\n\nCarian Slicer counts as spellblade because it's just a op straight sword with a negligable mana cost.\n\nFTH got several amazing talismans and spells, 2 armour sets which boost it, 2 transformations, The Blashpemous Blade got a freaking buff with the Talisman of the Dread. It also has % damage, with the insane health pools it's op\n\nBleed is just priviliged. Once again,% damage is op, and they made Radahn's weakness bleed. I repeat, they buffed BLEED.\n\nSB Faith got more weapons and older weapons were buffed\n\nSB int stays the same\n\nDex got some nice weapons\n\nPure casters get bullied by the insane speed of the bosses. You get 0 breathing space.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "enchiladasundae",
            "body": "*whiffs*\n\nShit\n\n*whiffs*\n\nCome back here\n\n*runs out of stamina*\n\nStand still!",
            "score": 3,
            "replies": []
        },
        {
            "author": "grimlock2183",
            "body": "https://preview.redd.it/zh3wm1w62hpe1.jpeg?width=159&format=pjpg&auto=webp&s=3f23b25134faa520caf59e0c0934811667e3d74d\n\nMe, an STR/INT build, about to deck a MF with my Moonlight Greatsword",
            "score": 3,
            "replies": []
        },
        {
            "author": "Trick-Scientist-9163",
            "body": "STR/INT/FTH/DEX/ARC Build be like:\n\n\"....I no decide so I do all thing 🤷‍♂️\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lago_10",
            "body": "Bonk!",
            "score": 2,
            "replies": []
        },
        {
            "author": "boodledot5",
            "body": "Or if you have enough arcane, you can corkscrew MEC inside the doggo's face",
            "score": 2,
            "replies": []
        },
        {
            "author": "QuestionBeneficial25",
            "body": "I'm a str/dex/int main I use the dark moon greatsword I would say something showing how you all are below me but ranni said it's snu snu time so you're lucky.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dramatic_Leopard679",
            "body": "STR is good and all but it gets old really quickly. You fight the same way against literally every enemy, with the same “slow but hard hitting” weapon.\n\n Little bit of faith or intelligence and suddenly you have much more variety. It’s your choice if you want to spam jump attack + poise break for 80 hours though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "That_boi_Jerry",
            "body": "Dodge",
            "score": 2,
            "replies": []
        },
        {
            "author": "Log_Out_Of_Life",
            "body": "*dodgerolls attack*",
            "score": 2,
            "replies": []
        },
        {
            "author": "darkouto",
            "body": "*BONK*",
            "score": 2,
            "replies": []
        },
        {
            "author": "GKTT666",
            "body": "I cast greatslash",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dveralazo",
            "body": "I cast Mace.\n\n\nGavel of haima",
            "score": 1,
            "replies": []
        },
        {
            "author": "SerTristan",
            "body": "https://tenor.com/view/now-watch-this-drive-gif-25121927",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmilingManTheGuy",
            "body": "\\*Carian Retaliation\\*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Complex-Garlic-2231",
            "body": "☠️🤡🪦",
            "score": -2,
            "replies": []
        }
    ]
}