{
    "title": "New player…",
    "author": "Basel-Sami",
    "subreddit": "Eldenring",
    "rank": 8,
    "score": 137,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 76,
    "url": "https://i.redd.it/4xfblyepxhpe1.jpeg",
    "id": "1jecwyj",
    "selftext": "So i just purchased elden ring after a recommendation from a friend. Any tips for starters? My buddy recommended some stuff like the bloodhound’s weapon and other stuff but I’m not so sure about that. He also told me (over 100 times i would say) that I’ll die REPEATEDLY, so that sounds fun 👍.",
    "comments": [
        {
            "author": "Green_Left_Knee",
            "body": "Word of advice: If something is far too powerful for you, go around it. If you can't, turn around. If you can't, acquire skill.",
            "score": 71,
            "replies": [
                {
                    "author": "Ivelostmyselfagain",
                    "body": "Acquire a git gud /j",
                    "score": 11,
                    "replies": [
                        {
                            "author": "GraceOnIce",
                            "body": "Where can I find that?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "fellas_decrow",
                                    "body": "Depends, I found it when I reached some weird thingy saying *50 hours in-game*",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "BeYeCursed100Fold",
                                    "body": "Near Try fingers, but hole.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Leg_McGuffin",
                    "body": "See I’m in the camp that you should grind your face into tree bro 100 times and then go play the game",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PixelJock17",
                    "body": "Been playing for a couple weeks now, about a 10 hrs in game. And this is probably the best most concise advice you can get.\n\nDon't get too pressed by hard enemies, you'll get there and sometimes you'll get lucky.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CoffeeAddict1011",
            "body": "Ignore the golden mofo with the horse",
            "score": 30,
            "replies": [
                {
                    "author": "Active_Appearance_75",
                    "body": "Can’t stress this enough OP",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fixthe_fernback",
                            "body": "What level is reasonable to face this asshole?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Outside_Ad1020",
                                    "body": "When you are so late in the game that you randomly remember his existence while sleeping",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Active_Appearance_75",
                                    "body": "Id say come back when you’re around 30-40 to feel more confident, he will still slap you around tho but you’ll be more experienced and confident",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "antoin5000",
            "body": "Just expect a lot of deaths from every area like your friend said bloodhound fang is an excellent beginner weapon.For general tips explore the areas a lot and until you beat a certain boss you can't change your stats so don't spread them too thin.Finally i say this every time have 60 vigor by the endgame and have fun!",
            "score": 12,
            "replies": []
        },
        {
            "author": "M3tro1dhunt3r",
            "body": "Level up vigor. Top stat to level up on any playstyle. The world is bigger than you think so exploration is key",
            "score": 12,
            "replies": [
                {
                    "author": "fellas_decrow",
                    "body": "Yes! I’ve heard always have your vigor half your level until Vigor lvl 60! :)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kyrieiverson",
                            "body": "Never looked at it this way, but it’s not a bad rule to follow.\n\nI personally think it’s better to meet minimum stat requirements for weapons you plan to use regularly, then level vigor (and endurance for heavy weapon/armor builds).\n\nYou get way more out of leveling your weapons than you do attack stats, ESPECIALLY at low levels and for strength weapons.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NovaBlade2893",
            "body": "The best advice i can give is to level Vigor, you can deal as much damage as you want, but if you die in a single hit. It wont matter unless you can 1 shot the boss youre against",
            "score": 7,
            "replies": []
        },
        {
            "author": "FatRollingPotato",
            "body": "Is this your first souls game? If so, then I would look up a mechanics-only guide. (like this one: [https://www.youtube.com/watch?v=NLdZ8Zex1cw](https://www.youtube.com/watch?v=NLdZ8Zex1cw) )\n\nA lot in this game is about \"figuring it\" out and overcoming the associated challenges. Combat is part of that, boss of course, but also navigating around the world, setting your next goal and keeping track of NPC storylines of the NPCs you meet along the way. So be ready to learn and use your brain, because getting better at the game is as much about leveling your character as it is leveling your IRL skills to learn.\n\nThe game is also very open and does very little to actively guide you (no quest log, no indication for which level you should be etc.). Which means usually everyone's journey will be different, you will make different mistakes, gain different experiences, and learn from different things. You can follow a guide or walkthrough, just be aware that you can always do that on a second run as well, but you can never do a blind run again. So don't waste that chance.\n\nAlso, don't try to be completionist with this game. You technically need to play through the game three times for all ending trophies anyway, so you don't have to get everything right first time. Otherwise you will also put a lot of pressure on yourself, which is not needed. As stated earlier, there is always the chance to do NG+ or a second fresh run.",
            "score": 5,
            "replies": [
                {
                    "author": "FatRollingPotato",
                    "body": "Oh, and level vigor, upgrade your weapon, be friendly to any NPC or thing that does not immediately attack you. don't kill NPCs, even if they ask for it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CardboardPolaroid",
            "body": "Level Vigor more than anything (during the early game). Put some points into your main stat sure, but you won't make it far if you can't take a few hits \n\nRoll *into* attacks, not away. It can be a bit hard to get into that habit but it helps big time with bosses\n\nDon't be afraid to experiment with different weapons, or even start a new run if you hate the playstyle your starting class pushes you towards. I had to do that a couple times, especially since I messed up my stats very early. \n\nI hate to be that guy, but sometimes \"Get Gud\" is the best advice you can receive. Sometimes there really isn't a strategy to follow. You just have to learn more, and by doing so become a better player\n\nDon't go hollow on us kid, you've got this.",
            "score": 4,
            "replies": []
        },
        {
            "author": "EGH6",
            "body": "1. it's open world. if something is kicking your ass, go somewhere else.\n\n2. i recommend going south from the start at first, you will find useful stuff that will prepare you for where the game initially tells you to go.\n\n3. level vigor. If there is a weapon you want to use you can level to the stat requirement but until you are satisfied with your HP, get some vigor.\n\n4. Dont fat roll, keep equipment burden under 70%",
            "score": 3,
            "replies": []
        },
        {
            "author": "SloboRM",
            "body": "Game flourishes mid game and late game is super good. Farm and level up before moving forward",
            "score": 2,
            "replies": []
        },
        {
            "author": "D4Junkie",
            "body": "I just started playing last week! I’m legit obsessed at this point! Ha!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ark-458",
            "body": "This is one of the best games ever made - ever. Take your time and approach everything inquisitively, and opened minded. \n\nTake it slow, explore everything you possibly can. \nKeep your head up, failure is part of progression in this game - death is valuable. \n\nElden ring wiki is an awesome tool to assist you, but it can ruin elements of exploration too. Use it as a last resort or in moderation.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mistakes-were-mad-e",
            "body": "Explore. \n\n\nTry things. \n\n\nThere are always more runes. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kitjing",
            "body": "I'm just gonna say try figuring things out as much as you can before guides. No shame in using guides when you're absolutely stuck. But i'm seeing a lot of people here for a first time player, writing pages of notes about build guides and whatnot, it might rob you a bit of your own personal discovery. The game does keep certain things vague on purpose. Read item descriptions \n\nThe best direct tip I can give is. Don't be afraid to go somewhere else. And if you're really lost just follow a line from a grace.",
            "score": 2,
            "replies": [
                {
                    "author": "fixthe_fernback",
                    "body": "I grew up with guides in game informer and what not. I have much more fun with guides in games like this I've decided. Brings out the kid in me",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Kitjing",
                            "body": "I did as well I still have the issue I used to complete ff7. I'm not trying to shame it at all. It's just with a game like this, For me Sometimes just scraping on your own is more fun than somebody Literally giving you a bullet point guide of what to do. To be fair I think the only thing that irked me was people just throwing out build guides. I feel it's better to give some tips about general exploration and things You wish you knew before hand.\n\nI guess whenever I give tips to people. I always air under the idea that maybe they would like to still play The Game themselves. So I give tips for them to chew on and suggest guides as a last resort. I just generally prefer to do things myself as much as I can. And I guess that kinda just bleeds into the way that I give tips and suggestions.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tanrob5",
            "body": "Hey just like, take it all in man. You only get to experience this game once. Enjoy it even though it’s REALLY gonna piss you off",
            "score": 2,
            "replies": []
        },
        {
            "author": "mhnonsaprei",
            "body": "Level vigor and bloodhound fang.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Apokolypse09",
            "body": "Don't get to hung up on losing runes. Also you can just go around the gold dude at the start.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MasterWrongdoer719",
            "body": "Don’t attack non hostile NPCs unless you really hate them. It can screw you over later in the game.",
            "score": 2,
            "replies": [
                {
                    "author": "vitamin_r",
                    "body": "And don't you dare lay a finger on turtle pope!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Threshybuckle",
            "body": "I am so jealous. \nWish I could discover it all again",
            "score": 2,
            "replies": []
        },
        {
            "author": "HotShame9",
            "body": "This game doesnt have difficulty sliders, the difficulty slider is ur decision on how to approach dangers.\n\nIf a place oneshots u, its clearly not the time to be there. Follow the easy path, its okay to ignore threats, keep on leveling what makes u powerful",
            "score": 2,
            "replies": []
        },
        {
            "author": "HulkBusterG-Man",
            "body": "Try finger but hole",
            "score": 4,
            "replies": []
        },
        {
            "author": "EliAssassin9639",
            "body": "Starting out vigor will help a lot, so don't stress too much on secondary stats except to meet stat requirements for weapons/spells. Also get an idea of what kind of combat you prefer & upgrade those weapons. Armor can help a bit but it'll mostly be for fashion. Stay strong tarnished!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConfidentYear3638",
            "body": "The bigger the enemy, the closer you should be. Unless you are playing as a mage. Either way, medium range is often a death sentence. Don’t be scared because a boss is huge, get up close and personal \n\nAlso as someone else said, don’t be scared to run through an area if you call kill something",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crazy_Manufacturer_2",
            "body": "Willpower and patience",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ahthenegotiatior",
            "body": "Don't forget about Boc! I left him lying in a cave for 150 levels before I remembered",
            "score": 1,
            "replies": [
                {
                    "author": "Te545688",
                    "body": "I sadly killed him in that cave thinking he was an enemy",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "402playboi",
            "body": "Rest at a site of grace near the gatefront ruins to get your horsie",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarkDeath225",
            "body": "Explore! Explore everything you possibly can before moving on to another area",
            "score": 1,
            "replies": []
        },
        {
            "author": "OBeast617",
            "body": "Have fun but most importantly be yourself",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brassboar",
            "body": "Level vigor and your main attack stat enough to equip weapons you want to try. Use weapon upgrades once you find one you like to increase damage. Don't focus too much on your attack / damage stat until vigor is up to 30-40.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brassboar",
            "body": "Level vigor and your main attack stat enough to equip weapons you want to try. Use weapon upgrades once you find one you like to increase damage. Don't focus too much on your attack / damage stat until vigor is up to 30-40.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unclebiscuits79",
            "body": "Try fingers, but hole.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Any_Sense7672",
            "body": "Really important advice: do not open the chest in dragon-burnt ruins, Stay clear of the lake until you hit RL20+",
            "score": 1,
            "replies": []
        },
        {
            "author": "CreepyTeddyBear",
            "body": "You're in for a treat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "somenerdyguy420",
            "body": "Don't seem happy about it",
            "score": 1,
            "replies": []
        },
        {
            "author": "TactiShovel",
            "body": "You should rarely have to grind for levels since there is side content everywhere. And I do mean *everywhere.* Just hug any walls you see on the map, and you'll eventually find a cave/catacomb to explore.\n\nAlso, keep in mind that there is tons of content both above and below you, so if you see a ledge in the distance that isn't surrounded by a bottomless pit, you can probably get there somehow.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RosieDa",
            "body": "Follow the grace until you get torrent and the ability to level up. Then go explore. You don't have to fight anything in any order, if something is too hard you can go somewhere else. Have fun!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shirokush",
            "body": "Good luck",
            "score": 1,
            "replies": []
        },
        {
            "author": "vertical_limbo",
            "body": "It's easy to get overwhelmed, but taking your time and luring enemies out to fight individually can make your life a million times easier. Try out things you're curious about. Ignore the meta and try not to look up OP stuff on your first play through, unless you're really stuck. It's a massive game and, assuming it clicks, there will plenty more play throughs to min max once you find what you like!",
            "score": 1,
            "replies": []
        },
        {
            "author": "paradox-eater",
            "body": "Make sure to kill the golden horse at the beginning. He drops a key item you need to progress",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScoobiSnacc",
            "body": "BE PATIENT\n\nThat’s the secret to souls games; Patience. All the skill and op gear won’t help you if you try to unga bunga the game by charging in like Leeroy Jenkins. If an enemy is giving you trouble, watch their attack patterns and learn how long their windup is. If there’s a boss you’re clearly not ready for, grind runes to level up and come back later. If there’s a group of enemies ahead, don’t charge into them and get mobbed. If you’re in a dungeon, check your corners, walls, and ceilings for traps and ambushes. \n\nAlso, dump your runes before going into a boss fight. Either level up or buy something so you have as few runes as possible. That way if the boss steamrolls you and you have to come back, it’s no big deal cause you didn’t lose any significant amount of runes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frogchamp10",
            "body": "You don’t have to fight him. Don’t do it. Come back later.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BasementDwellerDave",
            "body": "Go around the settings and turn on prioritize framerate/performance mode. You'd want to play this with smooth gameplay",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldCrustyE76",
            "body": "VLDL does a great skit for new players. \n\nhttps://youtu.be/EI0n42t4_0g?si=B4j5-gE_POMAlEcj",
            "score": 1,
            "replies": []
        },
        {
            "author": "boodledot5",
            "body": "I'd recommend going everywhere except Caelid before doing Stormveil Castle. Make sure you meet Melina, collect the map from the big statue things, and fast travel back to the church with the merchant near the beginning. Don't hold back on upgrading your starting weapon/s",
            "score": 1,
            "replies": []
        },
        {
            "author": "vitamin_r",
            "body": "Just don't give up.  You might hit a stumbling block or two...maybe even one that makes you put the game down for a while.  \n\nBe sure to pick it back up, and make sure you finish the game.  It's truly one of a kind.  You discover way more than you think you're going to.  \n\nThe last bosses will probably take a long time.\n\nStart by going south on the map after poking around limgrave for a bit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shwa12",
            "body": "Don’t listen to people that tell you to avoid the golden knight on the horse.  He just wants to talk!",
            "score": 1,
            "replies": []
        },
        {
            "author": "EvilSoulDark",
            "body": "You don't have the right, oh, you don't have the right! that's why you don't have the right, oh, you don't have the right!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crafty-Hope6885",
            "body": "this makes me happy to see. i’m so excited for you",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pawgpatrol420",
            "body": "Do the weeping peninsula -> limgrave -> first boss",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outside_Ad1020",
            "body": "Explore around before heading to fight Margit, I mean it",
            "score": 1,
            "replies": []
        },
        {
            "author": "FnB8kd",
            "body": "Just a random tip: Summons can help, but many times, I find summons can make it harder. As a new player, if you get invaded, you are probably dead, but also for boss fights, bringing in summons increases their health and makes their movements less predictable. \n\nIf you take some time learning to fight properly the game (all the souls games too) will be infinity more fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WarlockReverie",
            "body": "Do not trust Melina, I’m still waiting for my Honda Accord.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dizzy_Celery_2797",
            "body": "Go up to the golden dude on the horse, he gives you a free legendary weapon 🫡",
            "score": 1,
            "replies": []
        },
        {
            "author": "NesterQuester",
            "body": "Welcome to a difficult yet fun game i hope you like it",
            "score": 1,
            "replies": []
        },
        {
            "author": "IronCreeper1",
            "body": "It’s an open world game. Chances are, if you can see it, you can go to it\n\nJust wander around a load. When you find something you can’t do, go wandering again",
            "score": 1,
            "replies": []
        },
        {
            "author": "mlemu",
            "body": "Keep grinding, get good, don't be afraid to switch up your playstyle, and explore every single corner of every area haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "AceOfSpades532",
            "body": "Don’t try really hard to fight something over and over again. There’s no time you’ll ever be forced to fight a boss immediately (apart from literally the first one). If you’re getting worn out just go and find something else in a different part of the map.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DMTipper",
            "body": "See you in 6 months if you're still wanting to get gud",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mikko2822",
            "body": "https://preview.redd.it/jur2aar0aipe1.jpeg?width=1179&format=pjpg&auto=webp&s=6f054eb1e0c7a184d2c8d6da33800103eee2561b",
            "score": 0,
            "replies": []
        }
    ]
}