{
    "title": "5090 Verified Priority Access Invites Sent (to a non-4090 owner)!",
    "author": "Cunningcory",
    "subreddit": "nvidia",
    "rank": 9,
    "score": 39,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 102,
    "url": "https://www.reddit.com/r/nvidia/comments/1je9bj9/5090_verified_priority_access_invites_sent_to_a/",
    "id": "1je9bj9",
    "selftext": "Hey everyone! Another round of invites just went out (Tuesday, 12:30 est). The exciting thing about this wave is that they seem to also be going out to non-4090 owners! I received an invite and I own a 3080. I registered within the first hour the sign-ups went live. Other than that, I can't think of anything special.\n\nDid other non-4090 owners receive invites? I'm very excited, as I thought it would be months before I would be eligible for a 5090FE!\n\nEdit: Also my Nvidia account is nine years old, and I've used GeForce Experience (now Nvidia App) and GeForce Broadcast. I also signed up for GTC (virtually) using my Nvidia account, so maybe that gave me an edge?",
    "comments": [
        {
            "author": "vballboy55",
            "body": "Dang. I have a 3090 and signed up instantly and did not receive anything",
            "score": 34,
            "replies": [
                {
                    "author": "DripKing2k",
                    "body": "It’s not about when you signed up, it’s basically a lottery system",
                    "score": 15,
                    "replies": [
                        {
                            "author": "samthenewb",
                            "body": "Maybe it is a tiered priority system? The signup asked your permission for access to Nvidia app account telemetry as a part of the verification. Wouldn’t be surprised if verification put you into a priority tier, then Nvidia lotteries for each tier as available. We don’t know the full extent of telemetry data used, so there could be many factors in verification including current card ownership and maybe even what you play and for how long.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "DripKing2k",
                                    "body": "Well it’s lottery for the most part lol, or at least that’s how they marketed it,for the 5090s it’s definitely weighted towards ppl who owned 4090s, and I can speak from personal experience for that.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "samthenewb",
                                            "body": "Yes a lottery may be involved, but there also is verification. So if you don’t meet the verification requirements you probably don’t get put into the pool to win. As time goes on they will lower the verification requirements to keep the pool filled.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "2FKNBAD",
                                    "body": "I've never purchased a card from Nvidia and I was selected for a 5080.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "samthenewb",
                                            "body": "Interesting. “From Nvidia” you also mean no card from an AIB selling a card using Nvidia processor right? Out of curiosity what have you been using  your Nvidia account for?\n\nAnecdotally 5080 VPA has been more generously spread around.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "hotitoti",
                                    "body": "Do you mean account verification?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "samthenewb",
                                            "body": "I mean verification for priority access. The name of the program is “Verified priority access.” In plain english it means they aren’t allowing everyone to get priority. Verification is the process of choosing who is eligible for priority. We don’t know what Nvidia’s requirements are but there is speculation.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "hotitoti",
                                                    "body": "I saw that thing saying, we commend you do extra verification for your accounts like 2FA, but I said no. That’s what I’m wondering about.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "samthenewb",
                                                            "body": "No that is unrelated to VPA and is for account security. I don’t know if your two factor data is considered by the VPA. It is an opaque system.\n\nAll we know is Nvidia checks some account data to decide if you are “Verified” for priority access. A lot of speculation is that they are checking your hardware from the Nvidia app.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cbthomas927",
                                    "body": "You’re assuming so much here but you’re certain in your assumptions as if they’re facts.\n\nIt’s ok to believe this is why you haven’t been selected, but the truth is, it’s just likely there’s thousands, if not hundreds of thousands of people that signed up and only maybe hundreds that are given out.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "samthenewb",
                                            "body": "It is just guessing on how Nvidia is using telemetry. That is why it is full of “hedging” words like “maybe” etc. I am assuming Nvidia is using telemetry because that was explicitly covered in the signup process. I assume that Nvidia is using the data they asked for in the manner they stated. I trust that their explanation for asking for access to your data is truthful, that is all.\n\nIt is also possible that there is only two tiers, eligible and ineligible. I don’t think anyone has been explicitly told they are ineligible based on account data, besides the account age check.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mewz_x",
                    "body": "Same dude I wonder if we not eligible",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Vittadini",
                    "body": "I signed up withing 20mins and did not receive one either. I had 2080 Ti, 3090, 4090 and I am GFN ultimate subscriber.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "LAHurricane",
                            "body": "Lol, I have had a GTX 460, GTX 970, GTX 1070, and RTX 3080 Ti, not to mention I'm a GeForce Now Founder since nearly day 1...\n\nOh, I also bought an ASUS TUF 5080... But all I want is a 5080 FE...",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RobotSir",
                    "body": "Same boat",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gradius88",
                    "body": "I had (still own) a 3080 12GB and got the invite. I signed up for the latest version of Nvidia priority access back in Feb. So I think it is definitely random AF.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Plane-Inspector-3160",
                    "body": "Me too but I lucked out and homie in our discord let me buy his at msrp, I did toss him a little something for being a legendary gpu hero!",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheOGPink",
            "body": "I received the invite for a 5080, couldn’t be happier about it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "P1xelEnthusiast",
            "body": "I have a 4090 FE. I signed up right away. I have had every flagship GPU for years. I have nothing.",
            "score": 10,
            "replies": [
                {
                    "author": "anticommon",
                    "body": "Welcome to the club. But hey, at least Nvidia shipped 2x 5070s than they did 4090s in the same period.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrHaddad1213",
            "body": "3080 owner, sprinting to my email, having my heart broken once again.\n\nSoon(tm)",
            "score": 7,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Sorry, I know that feeling all to well",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MrHaddad1213",
                            "body": "Oh, it’s okay!\n\nAt the end of the day, a 3080 is still fantastic for the time being.\n\nSure, Monster Hunter looks slightly worse, but there are many worse situations to be in.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LAHurricane",
                                    "body": "Slightly? Lol? It's more like unplayable...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mewz_x",
                    "body": "Same bro same did you select both 5080 and 5090",
                    "score": -1,
                    "replies": [
                        {
                            "author": "MrHaddad1213",
                            "body": "Just the 5090 for me.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Orion6284",
            "body": "Me too i just got mine.  Upgrading from 3080 EVGA",
            "score": 5,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Yeah, Zotac 3080 here. Either Nvidia decided to diversify their priority requirements or it was a big drop. I do have a pretty old Nvidia account and have been using GeForce Experience a long time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnotherFPSPlayer",
            "body": "Given that VPA has now reached 3000 series, I'll have to wait for a few more weeks, even months to get one. Running 2070 Super Founders Edition, which I bought from Nvidia earlier.\n\nDon't think the loyalty counts but who knows.. Congrats to all who received the Email & good luck to the rest who are still waiting.. 🕘",
            "score": 2,
            "replies": [
                {
                    "author": "vatiwah",
                    "body": "i have a 4080, no invite for 5090 yet :|",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cl733",
            "body": "My last card was a 2nd hand RTX 970. I’ve been waiting for this release to build my new PC with a 5090, so I doubt I’m getting a VPA email anytime soon if those with other high-end previous generation cards get them first. I signed up on day one and I’ve had an account for eight years, though, I haven’t bought anything through it. I guess I will have to stick with my B580 I was able to pick up for MSRP until then.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Likely_Unlikable",
            "body": "2080 owner and I got the 5080 invite today as well!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Berniechn",
            "body": "Lucky you, I mean very lucky. I have 3090FE and last gen got selected for 4090FE, I didn’t use it myself however. Signed up about 30 mins after it went live, I just not feel like I will get lucky this time. Still no email.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ShortYellowBus",
            "body": "I checked my email, saw an email from NVIDIA GeForce and got super excited. \"You've been selected...\" They asked me to take their survey. RIP me.",
            "score": 4,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Top level trolling from Nvidia lol",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ShortYellowBus",
                            "body": "https://preview.redd.it/7so9lte2mhpe1.png?width=1440&format=png&auto=webp&s=f6acd2f837f6a8392dee5427f31ca2b0acfd197f\n\nThey're definitely trolling lmao",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SJSquishmeister",
                    "body": "I didn't even get that, lol",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kryllius",
            "body": "I just got the VPA for 5080 5min ago.\n\n3080 10GB owner here who signed up last week.",
            "score": 4,
            "replies": [
                {
                    "author": "Nornina",
                    "body": "I signed up on the 7th ao this gives me some hope. No email :(",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChristopherFromNEPA",
            "body": "4070 Ti, No invite yet ='(",
            "score": 2,
            "replies": [
                {
                    "author": "SRVisGod24",
                    "body": "4070 owner, also no invite yet",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "KiSamehada",
            "body": "3070 owners cooked. Signed up February 25.",
            "score": 2,
            "replies": []
        },
        {
            "author": "davekurze",
            "body": "Lol, still waiting as a 4090 FE owner",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chosen_Zombie",
            "body": "I just got one too! I have a gigabyte 4090 btw.",
            "score": 2,
            "replies": []
        },
        {
            "author": "prophecy0",
            "body": "Still waiting (in)patiently. I have a 4080FE currently.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sarhoshamiral",
            "body": "I have a 3080 FE. Still nothing....",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "This is the first wave that went out to someone other than 4090 owners. It's definitely not random, though they may do a lottery style amongst the pool that qualify. My Nvidia account is nine years old and I signed up for GTC, so who knows what other factors they've added to decide if you qualify...",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhoWantsTheClap",
            "body": "Previous 670 and current 2070 owner still waiting",
            "score": 1,
            "replies": []
        },
        {
            "author": "J3NO",
            "body": "I signed up for both 5090 + 80\nI thought I would have double the luck but i guess not",
            "score": 1,
            "replies": []
        },
        {
            "author": "franklin969",
            "body": "How frequently do they send these invites out? Is it just completely random?",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Seems to be once a week on Tuesdays around noon.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Weird. I only signed up for the 5090. I didn't want to get anything mixed up!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kramjam",
            "body": "As a 2080 Super owner, I look forward to an email in 20 years",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "That's how I felt as a 3080 owner. I'm honestly floored I got an invite. I usually have really bad luck with these kind of things (and have had bad luck until now).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MikeKlump",
            "body": "Got a 5080 email no 5090 unfortunately. Signed up for both. Does purchasing a 5080 make it less likely to get a 5090 email later?",
            "score": 1,
            "replies": []
        },
        {
            "author": "newfissy",
            "body": "3080 FE owner, purchased through Best Buy. Received a 5090 email invite. I signed up very soon after the waitlist launched.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saminoski",
            "body": "I have a 3080, signed a week into VPA with no hopes and received an email two week later, then a 5080 in less than a week 🤷‍♂️",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Yeah, the 5080 has been easier to get. Nvidia was limiting the 5090FE to 4090 owners until this week. I was third in queue when I got my email, so maybe I'll get mine in less than a week as well!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Cunningcory",
                    "body": "Yeah, the 5080 has been easier to get. Nvidia was limiting the 5090FE to 4090 owners until this week. I was third in queue when I got my email, so maybe I'll get mine in less than a week as well!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OutlandishnessOk11",
            "body": "For you winners do you all have Nvidia app installed? I wonder if that is a requirement...",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Yes, I do, and I use it for driver updates. I've used it a few times for the overlay, but I've usually had the overlay off.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gun_In_Mud",
            "body": "Nothing in my mailbox. I have 4090 & 1080 ti - NOTHING.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CorgsMcElhenney",
            "body": "I have a 3080 and got the 5090 invite this morning too. I thought I only signed up for the 5080 card (only one I was interested in).",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "Oh weird",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpartanDune",
            "body": "I just wished Canada was part of the priority access :/",
            "score": 1,
            "replies": []
        },
        {
            "author": "OriginalLight1",
            "body": "4090 owner here, I signed up for VPA the week it went live. Nvidia account since 2016, no invite yet.",
            "score": 0,
            "replies": [
                {
                    "author": "-goob",
                    "body": "4090 here as well, and I signed up within *seconds* of it going live, and still nothing.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "safetyguy14",
            "body": "got mine, 3080 FE + RTX 5080 owner",
            "score": 1,
            "replies": []
        },
        {
            "author": "wwang",
            "body": "Have 4090 and got nothing 🥹",
            "score": 1,
            "replies": [
                {
                    "author": "P1xelEnthusiast",
                    "body": "Yeah - 4090 FE.\n\nI have owned every flagship card for years. \n\nI signed up instantly. I only selected 5090.\n\nNothing",
                    "score": 2,
                    "replies": [
                        {
                            "author": "-goob",
                            "body": "Same here. Feelsbad",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lyndonguitar",
            "body": "Do the only send invites for previous purchasers in the nvidia website?",
            "score": 1,
            "replies": [
                {
                    "author": "UglyMeows",
                    "body": "ive never bought from them (asus 3080 here) and just got an invite for a 4090, so theres hope lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "lyndonguitar",
                            "body": "4090 or you mean 5090?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "UglyMeows",
                                    "body": "OOPS 5090 lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ryanthetemp43",
                    "body": "No I bought my 3080 from EVGA directly, so just owning a 3080 should be ok for you.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hyrumwhite",
                    "body": "The criteria is unclear, though when you sign up they say they’ll look at your usage via nvidia software ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cunningcory",
                    "body": "I got my 3080 from Zotac. I can't remember where I got my 980Ti from back in the day lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blitzkriegstorm",
            "body": "I got mine for the 5090 (and purchased it) as well. I don't know why I was selected as I am just a humble 3080 owner with no previous NVIDIA shop purchase, but not going to complain.",
            "score": 1,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "How old is your Nvidia account? Did you sign up for GTC online this year?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "blitzkriegstorm",
                            "body": "i didn't sign up for GTC, but I guess my account is pretty old at about 8 years.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cunningcory",
                    "body": "How old is your Nvidia account? Did you sign up for GTC online this year?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LoTeezah",
            "body": "Dang man, still haven’t gotten mine 🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "HYDPixel",
            "body": "For data purposes, I signed up on Feb 19th and have a 4090, but no invite yet unfortunately (need the card to access the full refresh rate of my monitor or else wouldn't need the upgrade, but alas).",
            "score": -1,
            "replies": []
        },
        {
            "author": "Aromatic_Wallaby_433",
            "body": "I have to wonder how many of these have gone out, like if it's only 500 or so over the last month?",
            "score": 0,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "[https://strawpoll.com/6QnMQ6J6kne/results](https://strawpoll.com/6QnMQ6J6kne/results)\n\nThis poll, done last week, had 344 people verify they received an invite. Granted that's just the people who saw the poll, so you can at least triple that number.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "stonewallace17",
            "body": "I signed up almost immediately, got my 5090 priority access email today. Do have a 4090.",
            "score": 0,
            "replies": []
        },
        {
            "author": "zentrani",
            "body": "I've got a 3080FE but no idea how nvidia knows who has a 4090.",
            "score": 0,
            "replies": [
                {
                    "author": "damien09",
                    "body": "Nvidia app and previously GeForce experience.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "zentrani",
                            "body": "Guess I gotta install that then lol thanks",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "damien09",
                                    "body": "Yep might be what is slightly screwing me as before Nvidia app just last year I never used GeForce experience",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LilJashy",
            "body": "I have a theory that your current card doesn't actually matter. It's probably more that the 3090 and 4090 owners were willing to pony up the big bucks for the 5090, so they signed up for that one, and the 3080 and 4080 owners were wanting to stay in the xx80 range, so they signed up for that one, etc. I think it's just a numbers game and the people we're seeing signing up for these cards, by and large (meaning not all the time, but usually) are the ones who have been in the same tier of GPU in the past",
            "score": 0,
            "replies": [
                {
                    "author": "Cunningcory",
                    "body": "[https://strawpoll.com/6QnMQ6J6kne/results](https://strawpoll.com/6QnMQ6J6kne/results)\n\nThis poll shows that a majority of people who signed up for a 5090 do NOT own a 4090, so I think that kind of ruins your theory.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LilJashy",
                            "body": "Even better - it disproves what seems to be the common theory that 4090 owners get selected first for 5090s, etc",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Madeiran",
                                    "body": "How did you arrive at that conclusion?\n\n61% of 4090 owners have been selected.\n\n2% of non-4090 owners have been selected.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "LilJashy",
                                            "body": "Well TBH I didn't actually look at the poll, I was just going off of what Cory said",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Cunningcory",
                                    "body": "They WERE selected first. This is the first wave that has included non-4090 owners.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Cunningcory",
                                    "body": "They WERE selected first. This is the first wave that has included non-4090 owners.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tht1guy63",
            "body": "What conspiracy is everyone on. I doubt it ever mattered if you had a 4090 already or not. Its a lottery system. Honestly most those who could afford a 4090 could also afford a 5090 and want the bleeding edge so probly a large chunk trying for 5090 are those 4090 folks anyway.",
            "score": 0,
            "replies": []
        },
        {
            "author": "johnnyphotog",
            "body": "I have a 5090 and received nothing.",
            "score": -1,
            "replies": []
        }
    ]
}