{
    "title": "Another alpha male in shambles :(",
    "author": "uDoucheChill",
    "subreddit": "clevercomebacks",
    "rank": 10,
    "score": 3768,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 103,
    "url": "https://i.redd.it/izw4zao5fgpe1.png",
    "id": "1je5l0p",
    "selftext": "",
    "comments": [
        {
            "author": "Tonkdog",
            "body": "Lol it's a problem. Just makes him sound like an asshole out of the gate.",
            "score": 297,
            "replies": [
                {
                    "author": "GKBilian",
                    "body": "I’m 50/50 on sympathy and ire with young men these days. On one hand, they were taken advantage of by grifters like Andrew Tate in their youth who fed them pure poison under the guise of a healing potion. On the other hand, they’ve had enough time to see that the alpha male bullshit is total nonsense at this point. We’re gonna end up with a lot of single angry older men if they don’t wise up.",
                    "score": 95,
                    "replies": [
                        {
                            "author": "AdvancedTower401",
                            "body": "I'm 24 and never once for a second sunk into any of that bullshit, so it's really hard for me to have any degree of sympathy for those dorks",
                            "score": 80,
                            "replies": [
                                {
                                    "author": "Trevorblackwell420",
                                    "body": "yeah you had to be at least a bit of an idiot to fall for his grift. Unfortunately, this election proved the majority of americans are idiots.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "AdvancedTower401",
                                            "body": "There's so many personalities on YouTube or others that I'll like for a little bit until I hear one of their unfiltered opinions and realise they are completely incompetent. I remember I watched Joe Rogan because his guests were interesting, and then he started talking for a second and I'm wondering why anyone agrees with such an uneducated opinion",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Trevorblackwell420",
                                                    "body": "Because they are also uneducated. They are the majority remember.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MileHiSalute",
                                    "body": "That’s kinda how those guys think too. If they didn’t struggle with something then they can’t see why anyone else would. There’s a difference between sympathy and empathy",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "AdvancedTower401",
                                            "body": "This is true, I'm empathetic to their situation, just not sympathetic for them as they drove themselves there through taking the easy route emotionally and possibly through life as well. (Something I've struggled with in a different way)\n\n All it takes is the attempt every day to be a little better, and I will support you with everything I've got.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ZeeDyke",
                            "body": "The people who fell for the \"Alpha Male\" grift most likely were not the ones that would have been very successful otherwise.\n\nI remember in my young years you had the \"Pickup Guru\" grift that attracted these same kind of people that believed women where objects that could be manipulated and even \"programmed\" into falling for them. Obviously the Guru's where very charismatic confident people who were quite successful, and they bated the opposite kind of men into thinking they could be like them.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "TelenorTheGNP",
                            "body": "I lean in the direction that we should all be done with forgiving people their ignorance.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rosemearydirty",
                    "body": "First impressions really matter!",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "sanslumiere",
            "body": "I cannot think of a more glaring red flag than announcing yourself as an \"alpha\" in the get to know you phase.",
            "score": 146,
            "replies": []
        },
        {
            "author": "GoochAFK",
            "body": "\"Any man who must say I am the king is no true king\".\n\nPerfectly encapsulates this. Also tywin is such a boss",
            "score": 159,
            "replies": [
                {
                    "author": "TrickyNexus",
                    "body": "I saw that scene on youtube and then after I started watching GoT.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "sunofnothing_",
            "body": "called him out.   she's 100% correct.",
            "score": 58,
            "replies": []
        },
        {
            "author": "Sudden-Raise-9286",
            "body": "A leader is a servant. If you need to see yourself as a superior, then you’re no leader.\n\nAlso, ALPHA WOLVES ARE NOT FUCKING REAL!!!!!!",
            "score": 59,
            "replies": [
                {
                    "author": "baconeggsandwich25",
                    "body": "It is real, but it's an aberration that occurs when wolves are kept in captivity. Which makes it funnier and sadder when dipshits identify themselves that way.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Sudden-Raise-9286",
                            "body": "*not real naturally",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SaltManagement42",
            "body": "Alpha? Like the early version of a male, before testing, bug-fixes, and necessary updates. Unstable, unreliable, erratic, and certainly not suitable for release to the general public.",
            "score": 37,
            "replies": [
                {
                    "author": "Lyrolepis",
                    "body": "More like alpha particles: cancerous, but not very penetrating.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "j0a3k",
                            "body": "This is an incredible line and I'm going to start using it so I wanted to say thanks.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZeeDyke",
                    "body": "Kinda like they call them self Neanderthals. Makes a lot more sense now.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "pueblodude",
            "body": "Conservative alpha males are like the lowest wolf/child in the pack,at the bottom,at the end.",
            "score": 76,
            "replies": [
                {
                    "author": "BlerghTheBlergh",
                    "body": "The way most „alpha males“ in my proximity behave reminds me of ostriches. They puff up their chest, parade their feather bouquets around but when they get attacked they deflate and fight like bitches.\n\nFrom younger to older „alpha males“ it’s always the same pattern of behavior: humble brag, make a statement that sounds vaguely philosophical but is most likely made up and deflate when people don’t fall for the fakeness. No „I’m a leader“ mantra left after they’re called out on their shit with an influx of petty behavior not worthy of any leading position.\n\nUnfortunately it seems that tons of folks are falling for that persona, hence the Musks in this world",
                    "score": 28,
                    "replies": [
                        {
                            "author": "pueblodude",
                            "body": "Excellent comparison.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "shkeptikal",
                    "body": "That's the funniest part imo. The \"alpha wolf\" concept is just the perfect idea of a right wing strongman. Largely because the concept as a whole has since been disproven multiple times going so far as to prove that *wolves are actually largely matriarchal*. There are no alpha wolves or \"pack leaders\" and if they are, they typically have vaginas.\n\nBut hey, it can't be said that a conservative ever let a little thing like evidence or objective reality get in the way of their nonsense.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wakemeup3000",
            "body": "Always nice when the garbage takes itself out. Golf clap to the person who saw this exactly how it was presented.",
            "score": 14,
            "replies": []
        },
        {
            "author": "sarbofr",
            "body": "so called alpha males when  their mom comes in the picture",
            "score": 25,
            "replies": []
        },
        {
            "author": "Sikkus",
            "body": "Any real self-confident, strong, and reliable guy will never boast about being an alpha male. They dont need to. Their actions speak for themselves.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Dwashelle",
            "body": "I just can't fucking believe that some men earnestly call themselves alpha males. It's another level of lame and you have to be completely devoid of self-awareness to think it's badass.",
            "score": 8,
            "replies": []
        },
        {
            "author": "subbychub",
            "body": "why am I so annoyed by the use of ab instead of about? Is it because they spelled everything else out? I dunno, but I don't like it",
            "score": 45,
            "replies": [
                {
                    "author": "StellarJayZ",
                    "body": "It's very lazy.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "subbychub",
                            "body": "I think this is it. I'm a pretty lazy person truthfully so I think it bugs me that someone is THAT lazy",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Thamnophis660",
                    "body": "She's not sure how to spell \"about\" so she just abbreviates.\n\n\nIt is annoying btw, and distracts from the otherwise decent burn.",
                    "score": -20,
                    "replies": [
                        {
                            "author": "Double-Scratch5858",
                            "body": "You genuinely think someone cant spell \"about\" but had no issue with \"accountability\"?\n\nSure, if you say so.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "Thamnophis660",
                                    "body": "Strongly suspect is more like it. \n\n\nPeople's command of the English language is atrocious sometimes. Nothing would surprise me at this point.",
                                    "score": -25,
                                    "replies": [
                                        {
                                            "author": "Double-Scratch5858",
                                            "body": "Youve got literally nothing to go off of to come to that conclusion unless you just think everyone that abbreviates a word can't spell. Which would be like totes sus bro dyt?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Thamnophis660",
                                                    "body": "Fair enough, but what other reason would someone have to abbreviate that word and only that word? Because it looks cool? Because \"about\" is such a labor to fully spell out two times?\n\n\nNo \"/s\" here, I'm genuinely curious.",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "Double-Scratch5858",
                                                            "body": "Because like every other abbreviation that exists it saves time? Nah cant be that. Way more likely they just cant spell.\n\nIs it your first day on the internet? Or texting in general? Why do people type g2g or gtg? Its only saving a few characters. I guess those people must really struggle with all those 2 letter words.\n\nI normally wouldn't even care enough to explain all this but its just the audacity of being so sure that someone can't spell because they abbreviated a word you think doesn't need abbreviation.",
                                                            "score": 10,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Akulatraxus",
                                                            "body": "Autocorrect is also a possibility. Trying to type “about” and ending up with “abiyr” I can totally see my phone going “fuck it the closest thing I can see here is “ab” that'll do.”\n\nIn fact, yep! If I type in “abiyr” in my phone I get the suggestions “Abby” “ab” and “a bite”.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Thamnophis660",
                                                                    "body": "Precisely why i shut that off",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "subbychub",
                            "body": "Glad it wasn't just me",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "StigitUK",
                            "body": "Subtle. Love it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BootsOfProwess",
            "body": "From alpha male to single male",
            "score": 5,
            "replies": []
        },
        {
            "author": "StatisticianLoud2141",
            "body": "Alpha mean not out of the testing phase yet, so it's not quite suitable for public.",
            "score": 4,
            "replies": []
        },
        {
            "author": "westens",
            "body": "The irony of the language he uses to ask for permission to be who he says he is.\n\n\n\"Hopefully\" that's not a problem but a preference \"?\"\n\n\nAlpha AF. This is it ladies. Peak male specimen.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Haskap_2010",
            "body": "\"No thanks, I'll wait for the beta version to be launched.\"",
            "score": 4,
            "replies": []
        },
        {
            "author": "_Mr_Relic",
            "body": "Dang..",
            "score": 4,
            "replies": []
        },
        {
            "author": "tommyleeruiz",
            "body": "I agree, alphas don’t need to be alphas, nor boast, and especially don’t seek others approval as they earn their rank and don’t question it!",
            "score": 5,
            "replies": []
        },
        {
            "author": "strywever",
            "body": "Natural leaders don’t have to announce what they are. People just want to be around them and take cues from them. If you feel you have to announce it, you’re just an insecure attention-seeker.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Then-Raspberry6815",
            "body": "Our \"alpha\" at work is known as \"Bigot bob,\" just what would expect, racist, bigoted, misogynistic, Q-Cumber cultist, that everyone openly laughs at and tells to fuck off. Then he scurries away to whine to management who just ignores him. ",
            "score": 4,
            "replies": []
        },
        {
            "author": "TpyoOhNo",
            "body": "\"iM aN aLpHa! ^...is ^that ^ok?\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "Stickboyhowell",
            "body": "This seems to be universally true. Anyone who has to state 'I'm an alpha' obviously isn't one. It's like the little kid on the playground shouting and whining 'I'm in charge! I'm the leader!\"\n\nDude, if that were true people would just follow, you wouldn't need to state it. The fact that you feel the need to state it indicates nobody wants to follow you. Ergo, you are not the leader/alpha.",
            "score": 3,
            "replies": []
        },
        {
            "author": "queuedUp",
            "body": "What confuses me the most about the alpha male bullshit is these boys think this persona somehow makes them appear more attractive to women",
            "score": 3,
            "replies": []
        },
        {
            "author": "Obvious_Market_9485",
            "body": "For real, anyone labeling themself alpha is a confirmed beta\n\nNah Ima go with gamma or delta",
            "score": 3,
            "replies": []
        },
        {
            "author": "beliefinphilosophy",
            "body": "\"Alpha Male? You sound more like a lone wolf... AKA an Animal that got kicked out of their pack because they couldn't stop being a c*nt\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "seenthewolf",
            "body": "Alpha and Beta males quake in fear when they meet Final release males.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Odoyle-Rulez",
            "body": "click, click, boom.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PositiveStress8888",
            "body": "this is the only response to someone saying they are an alpha",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bulky-Internal8579",
            "body": "What a loser - whereas I am an Alpha Alpha thereby deserving of your obedience! /s",
            "score": 2,
            "replies": []
        },
        {
            "author": "TelenorTheGNP",
            "body": "That would explain that bang I heard around 530 yesterday - it was a man's balls exploding under the force of that stomp.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Carry385",
            "body": "Seems to me that alpha is more of an earned term rather than something you just claim to be. I think it's a stupid term in general to use, but it's even more ridiculous how many self proclaimed alphas there are out there who are likely toxic to their circles and masculinity in general.\n\nWhatever happened to those gentleman up series of videos? I think we could use more of that for our impressionable youth/lost adults.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DJ_Fuckknuckle",
            "body": "Like...what happened here? Seriously, what?",
            "score": 2,
            "replies": []
        },
        {
            "author": "scarletOwilde",
            "body": "Did mommy wean him too early?",
            "score": 2,
            "replies": []
        },
        {
            "author": "capitali",
            "body": "never met an self declared alpha male that was anything other than a festering polyp on the ass of humanity.",
            "score": 2,
            "replies": []
        },
        {
            "author": "youhavetherighttoo",
            "body": "The accuracy",
            "score": 2,
            "replies": []
        },
        {
            "author": "tercron",
            "body": "This alpha male WILL NOT like this amount of truth",
            "score": 2,
            "replies": []
        },
        {
            "author": "HuTyphoon",
            "body": "\"strong and dominant alpha male\" is just shorthand for \"whiny manchild with huge gaping insecurities\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "stinkypirate69",
            "body": "Waiting for the cleverness…I see two annoying people",
            "score": 2,
            "replies": []
        },
        {
            "author": "newleaseonlife22",
            "body": "ab is short for about? Is this the Gen Z slang?",
            "score": 5,
            "replies": []
        },
        {
            "author": "abgry_krakow87",
            "body": "What's hilarious is that he is asking her if it's okay that he be the alpha. That's not how alpha or establishing dominance works, yo! Lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "Thatoneafkguy",
            "body": "“Any man who must say ‘I am the king’ is no true king”",
            "score": 2,
            "replies": []
        },
        {
            "author": "SexyGirlOhYeah",
            "body": "I agree.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaleficentAd1732",
            "body": "He really meant \"sexually\" he hopes you like his personality disordered Fifty Shades of Grey weinering.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuckethed",
            "body": "In the immortal words of the Geto Boyz “real gangsta ass 🥷 don’t flex nuts, cuz real gangsta ass 🥷 know they got em”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Distinct_Distance437",
            "body": "Alpha Bitch slapped -hehe",
            "score": 1,
            "replies": []
        },
        {
            "author": "VelvetySiren",
            "body": "In its severe from takes the life out of you so no",
            "score": 1,
            "replies": []
        },
        {
            "author": "Angerina_",
            "body": "Go fully unhinged and talk Omegaverse with that selfproclaimed Alpha.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whiplashMYQ",
            "body": "If you have dom energy it'll show through your attitude and actions. And saying you're an alpha is not dom behaviour.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thebarbedlord",
            "body": "Alpha Male in males and Feminists in females - for your own sanity steer clear of either species",
            "score": 1,
            "replies": []
        },
        {
            "author": "Evening_Exam_3614",
            "body": "He said from his mother's basement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OCE_Mythical",
            "body": "Couldn't imagine anything worse than a self proclaimed alpha male",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glittering-Ship1910",
            "body": "Fake \n\nAs\n\nFuck",
            "score": -1,
            "replies": []
        },
        {
            "author": "Critical_Price_6291",
            "body": "I understand why what this guy said was cringe, but why do responses like this deserve applause?\n\nIf you don't want to talk to him you don't have to, but it's not like this is going to change this guy's mind, and it's fun to point and laugh now, but there's a reason there's such a backlash against feminism, post like these are why. \n\nThis EXTREMELY misguided young man obviously wants to get to know this woman, got some TERRIBLE advice because there is next to no good advice out there for guys, and was privately and now publicly made into a laughing stock. Again, his approach was cringe at best, but this is not the way.",
            "score": -2,
            "replies": [
                {
                    "author": "Critical_Price_6291",
                    "body": "Downvote all you want, I'm actually trying to help. Hope you enjoy getting fitted for your red robes, it's no skin off my nose.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Key-Benefit6211",
            "body": "And a bitch that talks bad about alpha males is the first person to cry for one when they have ran their mouth to the wrong person.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Golem_of_the_Oak",
            "body": "I mean it’s true but it’s the sort of thing people say with the intention of screenshotting it and posting it somewhere. It isn’t the sort of thing that would actually affect the person that it’s directed toward.",
            "score": -21,
            "replies": [
                {
                    "author": "scotcetera",
                    "body": "I'm not sure you understand just how fragile and insecure the \"alphas\" are. Or incels, red pillers, whatever they're calling themselves these days",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Golem_of_the_Oak",
                            "body": "No I do, but this is more of a statement of opinion than an actual comeback. A comeback would have been something more like “oh I’m actually more into real men.”",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "scotcetera",
                                    "body": "I still think their comeback is better than yours, tbh",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Golem_of_the_Oak",
                                            "body": "That’s cool!",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Plane_Sweet8795",
            "body": "So…he tells you his general disposition and y’all say…no, you don’t have the right to tell us about yourself, we just get the right to verbally abuse you. Got it…wow. Nonetheless, I’m an alpha female. 🖕",
            "score": -14,
            "replies": [
                {
                    "author": "Accomplished-Glass78",
                    "body": "Well the funny thing is that the “alpha male” stuff came from a debunked scientific study on wolves and isn’t really true in nature but many men took the alpha male saying and ran with it. Essentially, they call themselves that because they thought it happened in nature, but it doesn’t happen (not in the way they think) so anyone who tries to use that phrase ends up looking kinda dumb.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Plane_Sweet8795",
                            "body": "Well…what’s funnier is the number of studies in human psych that support it. Like the A, B, S study. Studies for ages on the subject. Dont get me wrong-there are toxic people that over and miss use it. If you wanna talk wolf…go for it. Makes people relating it to wolves as a means to justify all that verbal abuse in the original post look kind of dumb.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jorycle",
                    "body": "Sounds like some real beta energy.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "RobespierreLaTerreur",
                    "body": "When they use the vocabulary of rapists and sex traffickers, they can't really expect respect in return.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hoppie1064",
            "body": "The lion doesn't care what the sheep think.",
            "score": -10,
            "replies": [
                {
                    "author": "RobespierreLaTerreur",
                    "body": "The rape culture motto.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Hoppie1064",
                            "body": "Rape isn't a thing among lions.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "BetterUsername69420",
                                    "body": "The rape culture byline",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}