{
    "title": "No lies detected.",
    "author": "_crazyboyhere_",
    "subreddit": "clevercomebacks",
    "rank": 5,
    "score": 10160,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 41,
    "url": "https://i.redd.it/cwxmxyqtigpe1.jpeg",
    "id": "1je61dw",
    "selftext": "",
    "comments": [
        {
            "author": "Kencleanairsystem2",
            "body": "I honestly don't get it.  My father-in-law is a very smart guy. Very intelligent, master's degree in engineering, worked at GE building jet engines for his entire career, Reads constantly, retains facts, data and information  which he shares to the point that we call him \"Professor\" because he lectures on and on and on about things that he is interested in (whether YOU are interested or not!).  He's an immigrant, has three daughters, three granddaughters, and LOVES Trump. We live in a very blue state, and he says he watches and reads a balanced amount of news (MSNBC, BBC, AP, CNN, FOX....) and he thinks nothing Trump has done so far  this term is wrong.  AND he filled in my dying mother-in-law's absentee ballot by voting for Trump, which she would have never done. (based on that one fraudulent vote alone, Trump's victory was CLEARLY bullshit).  He tries to talk politics with me (like won't wait for me to enter his house with all my family's gear on my shoulders and in my hands when we arrive at his house....he has to talk about it right away on the front lawn..) and I keep saying \"We are completely opposed in our political views, I'd rather not just argue because we'll never see eye-to-eye.\" I just don't understand it.",
            "score": 70,
            "replies": [
                {
                    "author": "capitali",
                    "body": "He is just an asshole.  He's working to be an asshole, and he sees this as his support, his enablement, I can be an asshole and there are a lot of other assholes on my side.   The willingness to allow yourself to be misinformed, hateful, and without empathy is a willful decision being made here.  He has decided to be an asshole and he is aware of his decision.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "Kencleanairsystem2",
                            "body": "He’s a great guy, but we don’t agree on this and it baffles me. Love him to the moon and back, but….",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zbr4h",
                    "body": "He may be sharp and competent, but it sounds like he lacks emotional intelligence, namely the ability for empathy. \n\nAnd, as the other commenter noted, he’s an asshole.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OMG_A_CUPCAKE",
            "body": "Still having a Xitter account, and paying for a blue checkmark on top of that is directly supporting the fascist Trump regime. Everyone in this picture is a moron.",
            "score": 20,
            "replies": []
        },
        {
            "author": "palm0",
            "body": "Look, yeah they're universally stupid, malicious bigots, or both. But just quoting a king of the hill meme isn't clever. It's just a meme.",
            "score": 47,
            "replies": [
                {
                    "author": "Upset_Dragonfruit575",
                    "body": "To be fair, being a bigot and being stupid are the same thing, no need to be redundant about it... ",
                    "score": 16,
                    "replies": [
                        {
                            "author": "palm0",
                            "body": "No they aren't. You can be stupid and not a bigot. And you can be a bigot and intelligent about other things. \n\nBeing a bigot ***is*** stupid, but they aren't the same thing.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upset_Dragonfruit575",
                                    "body": "\"Stupid is as stupid does\" 🤷",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "EventualOutcome",
                                            "body": "Duh-is*",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "palm0",
                                            "body": "There are also people that sorry Trump that are neither stupid or bigoted, they are simply malicious and greedy.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Upset_Dragonfruit575",
                                                    "body": "Again, \"Stupid is as stupid does\". \n\n\nEven Forrest Gump with his 70 I.Q. understands what that means, why is it such a hard concept for you to grasp? ",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "palm0",
                                                            "body": "Bro. Being evil isn't mutually exclusive with intelligence. I don't understand why you think that's true and I don't know why you continually insist on referring to a movie that is not remotely realistic. \n\nForrest Gump was by modern standards autistic. He's shown to actually be a savant in the book and he even is shown to ***not*** be a bigot (though in the book, bubbah is white and racist). If you're trying to say that stupid and racist are synonymous, which you explicitly did in your first comment, then you can't use Gump as an example of being stupid with his below average intelligence because he is not a racist! \n\nPeople are rarely just one thing. And intelligence, like so many things, is a spectrum and not a straight line. You can be extremely intelligent in some areas and very stupid in others. Like being a talented brain surgeon that thinks Egyptian pyramids were grain silos.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "clermouth",
                                                                    "body": "a common trait is that, no matter how smart they are, they all overestimate their own intelligence.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "edfitz83",
            "body": "Better take all federal standards away from those red state schools.",
            "score": 6,
            "replies": []
        },
        {
            "author": "GibsonBluesGuy",
            "body": "They probably can read they just don’t….",
            "score": 4,
            "replies": []
        },
        {
            "author": "Daisy_Mellow",
            "body": "No lie detectors needed",
            "score": 4,
            "replies": []
        },
        {
            "author": "Bleezy79",
            "body": "Most of them are in complete denial about whats going on in this country.  They live in a bubble of misinformation and selected news propaganda and honestly have no idea Trump just made removed the insulin cap or that he's going to gut medicare/medicaid.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Financial_North_7788",
            "body": "Dean withers and his buddy Parker are both gems. Highly recommend if you’ve never watched them. Particularly if you have Trumpers in your life and want coherent arguments to refute them.\n\n10/10 recommend",
            "score": 1,
            "replies": []
        },
        {
            "author": "Humans_Suck-",
            "body": "This isn't clever or a comeback",
            "score": 0,
            "replies": []
        },
        {
            "author": "ShaneDawsonsPetCat",
            "body": "I hate magats, but nothing about this is clever",
            "score": -7,
            "replies": []
        },
        {
            "author": "fatattack699",
            "body": "Enjoy the next four years Reddit 😂",
            "score": -6,
            "replies": []
        },
        {
            "author": "Plane_Sweet8795",
            "body": "An actual sign of low intelligence is making fun of people.",
            "score": -31,
            "replies": [
                {
                    "author": "Mysteria_Cosmica",
                    "body": "Go cry yourself to sleep. Conservatives are sacks of shit.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Plane_Sweet8795",
                            "body": "Wow…trashy",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ask_bout_PaterNoster",
                    "body": "Yeah, shame the maga crowd for their ideology and their hate, don’t just say “they stupid hur hur”. The goal is not to bully the bullies, the goal is to stand up to them, remove their power, and show them why what they’re doing is wrong.  No one should be amused by what they’re doing.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "RazorRamonio",
                    "body": "an aCTual SigN of Low INTeLLigEnce IS MakINg FuN oF pEoPle.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "Estate_Valuable",
            "body": "I can read, and you left wing idiots are ridiculous. Look at that... I can spell, too.",
            "score": -36,
            "replies": [
                {
                    "author": "RazorRamonio",
                    "body": "You must be so proud of yourself.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "feltsandwich",
                    "body": "Your device tells you when a word is spelled wrong, genius.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Mysteria_Cosmica",
                    "body": "Good job, you’re still an evil, garbage person.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "_dark_beaver",
                    "body": "Awww, a special unique snowflake.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Def_Surrounds_Us",
                            "body": "I have really come to enjoy calling conservatives sensitive and/or snowflakes. \n\nThey're usually way too angry to meet what the situation calls for, they say the same bullshit lines about censorship or whatever, and they melt at criticism. It's why we never get an actual argument, or an actual response from these people most of the time. Conservatives are snowflakes, through and through.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "_dark_beaver",
                                    "body": "They’re weird!",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mystiax",
                    "body": "Yeah, but at what cost? How hard do you need to take a nap right now?",
                    "score": 8,
                    "replies": []
                }
            ]
        }
    ]
}