{
    "title": "MAGA don’t know that Tesla isn’t the only manufacturer of EVs",
    "author": "RoyalChris",
    "subreddit": "clevercomebacks",
    "rank": 3,
    "score": 7155,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 183,
    "url": "https://i.redd.it/w83jd6vy0hpe1.png",
    "id": "1je8es4",
    "selftext": "",
    "comments": [
        {
            "author": "aaron_adams",
            "body": "\"Elon Musk does a Nazi salute, and suddenly EVs aren't so bad anymore.\"\n\nThis kind of thinking goes both ways.  Up until about a year ago, MAGA hated EVs, and Trump was telling people that if Biden got a second term, everyone would be forced to buy one.",
            "score": 701,
            "replies": [
                {
                    "author": "MosquitoValentine_",
                    "body": "Now according to Trump it's illegal to not buy Teslas.",
                    "score": 316,
                    "replies": [
                        {
                            "author": "Teriyaki456",
                            "body": "Not that trump actually knows or cares about what is actually illegal.  He’s been committing so many illegal acts his life he no longer knows or cares",
                            "score": 111,
                            "replies": [
                                {
                                    "author": "MosquitoValentine_",
                                    "body": "He's never faced any consequences for his actions. His entire life he has done whatever he wants because he knows he can get away with it.",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "Teriyaki456",
                                            "body": "Yep, 100% agree",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "OrvilleTheCavalier",
                                            "body": "This is why the mic smack to his face will happily live in my head forever.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ScipioAtTheGate",
                                    "body": "[Just like all the legal residents they will be illegally sending to the camps](https://youtu.be/cn0AL8K7W6I?t=564)",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Telemere125",
                                    "body": "If I knew I’d never face the consequences of my actions, I’d probably have trouble following the law too - especially malum prohibitum offenses.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NotCoolFool",
                            "body": "“Everything’s computer!”",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "fauxregard",
                            "body": "I don't own a Tesla. Bake me away, toys.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Extension_Property_5",
                                    "body": "STOP RESISTING",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Shmitty594",
                            "body": "But Pam Bimbo said it's an act of terrorism to touch one, so now I'm conflicted",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Public_Joke3459",
                                    "body": "When they care more about a car and less about what took place at the capital it should raise flags that they really don’t give a shit about the country and the only capital they care about is the greenbacks they can stuff in their pockets",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MosquitoValentine_",
                                            "body": "They are more outraged that people are boycotting a car, than the actual reason behind the boycott. The CEO did a fucking NAZI SALUTE at the presidential inauguration. \n\nBut I guess Trump has done worse things with his hands, so why would they care...",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "quillmartin88",
                            "body": "It's almost as if everything Trump accuses Democrats of doing is something he's planning. \n\n\nMark my words: when he orders forced transgender surgeries next year, his cultists will praise it. ",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "dsmithcc",
                            "body": "Pure irony, people don’t know shit even if it hits them in the face, sadly.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "No-Cat-4682",
                            "body": "Need those clips put together and published",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RoyalChris",
                    "body": "They even claim that eating clean healthy food is conservative.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "pretty1i1p3t",
                            "body": "Still not taking eating advice from someone to whom McDonalds is the pinnacle of deliciousness. \n\nDisgusting.",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "Mr_Epimetheus",
                            "body": "And then take away all the protections that mean you can get clean, healthy food in the US.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "DJ_Fuckknuckle",
                                    "body": "I hope none of them ever eats food free of human effluvia ever again. \n\n\nWait, strike that. They probably don't NOW. If it was free of spit or mucus or worse, it probably doesn't taste right to them.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pixel8443",
                            "body": "Like healthy eating and habits are new. :D",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Tarledsa",
                                    "body": "Michelle Obama was raked over the coals for this opinion, for kids at that!",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "pixel8443",
                                            "body": "Yep, and guess who ended her program.  Starts with a T and ends with a rump.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "pixel8443",
                                            "body": "And guess who ended her program... starts with a T.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BoppinTortoise",
                    "body": "Further proves MAGA is a cult. No critical thinking just following their orders",
                    "score": 20,
                    "replies": [
                        {
                            "author": "SlumberingSnorelax",
                            "body": "Not knowing things and following orders without thinking about why, or strictly as a reaction to hurt or offend others “just because”, are apparently the dominant characteristics of a majority of Americans today. It’s a sad and pathetic timeline to live in.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Slight-Ad-6553",
                    "body": "Trump claimed that Harris would force Americians to buy EV a few mounths ago",
                    "score": 15,
                    "replies": [
                        {
                            "author": "aaron_adams",
                            "body": "Yep.  And he claimed that the Biden administration would mandate it, too.  Now he has a Tesla himself, and he's claiming all his supporters should buy them as well.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "babygrenade",
                    "body": "I've said this before but if conservatives start driving EVs out of spite instead of rolling coal, that's kind of of a win.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "aaron_adams",
                            "body": "Eh, that's actually a fair point.  But I know a lot of redneck Trump supporters that won't give up their jacked up trucks that get 3 miles to the gallon that still sport the \"my truck identifies as an EV\" bumper stickers.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "machyume",
                    "body": "Very soon, they will be pro-environment an anti-gun simply because Musk sells EVs and Democrats are buying guns in larger numbers.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Anomuumi",
                    "body": "With the minor difference that your statement is true.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "suplexdolphin",
                    "body": "Then he basically produces an ad for them on his front lawn",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SpideyUdaman",
                    "body": "There was a lot of grim warning from environmentalists about global warming and we needed to act soon. The mag-aholes deny that and would rather focus on stupid crap like complaining about woke and lgbt as if they'll be doomed by these concepts of freedom. We'll be doomed by an uptick in global temperature, and promotion implementation of evs, hybrid, and alternative fuel, however the size, can have a good positive impact collectively as time is expiring.\n\nHYPOCRISY at its best. Now they happen to want evs as long as bing bong is the salesman and the heil car is the ev. Treating politics like being a delusional sports team fanatic.\n\nUSA is one country but a giant contributor to global warming. Not to mention, before this lousy administration right now, countries looked up to USA, and we would've been serving as a role model of climate change advocacy and action for the good of the world, as we've always had even if slowly because of republican opposition, had we chose the better leaders to govern us.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "aaron_adams",
                            "body": "Who said I had a problem with them buying EVs?  All I said is they're acting like a cult, hating EVs until Musk outs himself as a Nazi and Trump suddenly says it's patriotic to buy them.  I don't have a problem with them buying EVs, I have a problem with their logic.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SpideyUdaman",
                                    "body": "Sorry I talk too much, I was just saying they're hypocrites, why I had it capitalized. I don't have a problem with them buying evs, just that when EV and environment related stuff happened to be connected to the democratic party, they were oppositional and denial... and now they embrace it. They'll still deny climate change and buy evs because their leader said so.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DarkArcher__",
                    "body": "Oh they do still hate EVs unless they have a big T stamped on the front",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RobespierreLaTerreur",
            "body": "Elon Musk doesn't give a single fuck about the environment anymore anyway. If he did, he wouldn't torpedo public transit and trains. He just cares about power and being the center of attention.",
            "score": 135,
            "replies": [
                {
                    "author": "RoyalChris",
                    "body": "He never gave a single fuck. He just played into whatever made him the most profit.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "AliviaCronin",
                            "body": "His focus shifted the moment he saw dollar signs. Eco-friendly was never the goal.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Infinite_Ground1395",
                    "body": "After the 5th or 6th time that TBC failed and had to cancel a project he decided he couldn't profit off public transit so he decided to make sure everyone else failed as well.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Popular-Jackfruit432",
            "body": "Not only is the ioniq a ev. It's a better rated ev than that shitty tesla made by a more reputable and actual car company.\n\nHonestly idk why people didn't buy it first.",
            "score": 61,
            "replies": [
                {
                    "author": "zephillou",
                    "body": "hyundai had a terible reputation up to id say 2010... they turned a new leaf but for some the stigma is still there",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Popular-Jackfruit432",
                            "body": "Not sure how tesla has a better \"stigma\"  to people. Hyundai needs better marketing if that's the case \n\nCar of the year, world car of the year. Ev of the year. Performance car of the year.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "zephillou",
                                    "body": "Yeah I'm just talking as a millennial growing up with Hyundais...they were shat on by a lot of people as they used to have reliability issues in the 80-90s so that stuck for a bit. My dad had one, my friends had them... So i know they weren't bad. \n\nI'm not saying that in 2025 tesla doesn't have a stigma attached to it. But I'm just saying it was not as much of a contender until the 2010s",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "boo_jum",
                                            "body": "Yeah as a fellow millennial, I was kinda fascinated how Hyundai went from basically a Geo Metro reputation to a decent-car-on-a-budget reputation.  (My parents always went with Honda because there was a local dealer who had a good service dept and they've been consistently reliable.  My dad's midlife crisis car was an S-2000. 😂)",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "zephillou",
                                                    "body": "Your dad is cool... Even by today's standards. 😎",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "boo_jum",
                                                            "body": "He loved that car so much; my mother named her Lola because, as she put it, 'what a showgirl.' It was also funny to me because my parents bought a house in 1988 in a neighbourhood that was socio-economically WAY out of their price range, but in 1988, they had the means to finance the purchase.  So I grew up in an area where all of our neighbours were MUCH better off than we were, so we had lots of fancy european cars (and a lot of big american trucks all tricked out and never once taken offroad).  Dad's car wasn't the fanciest, but I think he probably knew how to drive it better than the folks with the Lambos and whatnot.  (And dad's driving lessons are why I a) know how to drive manual and 2) can out-accellerate souped up rice rockets off the line with a stock engine 😂)",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "zephillou",
                                                                    "body": "Driving a manual is a skill on its way out in North america and it makes me sad. \n\nI also ride a motorbike so i can't imagine NOT having a manual transmission, and i lucked out with a wife who prefers driving manuals as well.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "boo_jum",
                                                                            "body": "I grew up in a fire zone (SoCal), and my mother is one of the most emergency-preparedness-oriented humans I have ever met without going fully over the cliff into Prepper territory.  So she insisted that I and my siblings learn to drive manual in case we ever needed to evacuate and that was the only option available to us.\n\nBut tbh, I prefer it because it keeps me focused and engaged AND it's just plain more fun. :P",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Popular-Jackfruit432",
                                            "body": "I agree, I'm just confused about how tesla got such a good rep in general relatively. They had just as many issues and still do.\n\nKia and Hyundai got a bad rep when they had a shaky start. They had a \"buy a van get a car for a $1 deal\" at one point. Still can't fully shake that stigma, I guess.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Smooth-Reason-6616",
                                                    "body": "When they first started appearing in the UK, they seemed to be a few years behind other manufacturers...  similar to how Skoda were just after the wall came down... cheap, basic cars with suspect reliability...\n\nOr when cheap, small capacity Chinese motorcycles started appearing a few years ago... 1980s engines and styling, with shoddy build quality...\n\nBut nowadays, Hyundai, (and Skoda!), are probably as good, if not better quality, as most of their immediate competitors... But you just can't forget about their older models that you grew up with...\n\nAnd I still won't buy a Chinese motorcycle...",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Reddsoldier",
                            "body": "No, the Leaf is a Nissan EV!  ;)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zephillou",
                                    "body": "As a dad, i accept this brilliant attempt at humour.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Reddsoldier",
                            "body": "No, the Leaf is a Nissan EV!  ;)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CranberryPossible659",
                            "body": "They improved the look and feel. I remember the Accent circa 2000 felt like a tin can and by 2010 was more like a normal car. But the theta ii GDI engines (2012-2019) had such a high failure rate that Hyundai/Kia had a class action settlement over it. I don't think they're on par with Toyota or Honda yet. Not defending Tesla, bc they have next to no quality control and poor factory conditions.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zephillou",
                                    "body": "Hyundai /KIA is all about value for money.\nWhen I was shopping for a new car a whole ago... I realized that I could get a car with all options included (leather, sunroof, nav, heated steering, etc etc etc) through south Koreans or I could get for the same price the most basic features only (electric windows, maybe Bluetooth) through the Japanese car makers.\n\nThe interest rates for financing were also way better on the south korean brands.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "courage_2_change",
                    "body": "I thought about buying that ioniq 5. I really like how it looks and of course electric. Battery could be bigger tho!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Smooth-Reason-6616",
                            "body": "Has a range of up to 354 miles with the larger 84 kWh battery and rear-wheel drive, while the smaller 63 kWh battery provides up to 273 miles..\n\nThe Society of Motor Manufacturers and Traders (SMMT) reports the average range for all available electric cars is 236 miles... so even the smaller battery size jas above average range...",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "courage_2_change",
                                    "body": "Damn I only thought it was 236 only.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "actuallychrisgillen",
                    "body": "I have a Genesis GV60 (same platform) that car rocks hard.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HPenguinB",
            "body": "I'm excited about magats buying EVs to own the libs.",
            "score": 58,
            "replies": [
                {
                    "author": "Slight-Ad-6553",
                    "body": "no no no you are deeply orfended adn are in your safespace right ?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Fiveofthem",
                            "body": "Why doesn’t MAGA have spell check? Do you turn it off because it always tries to correct Covfefe?",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "I_W_M_Y",
                    "body": "Watch them buy teslas and then do a ICE conversion on them.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "spavolka",
            "body": "People who don’t like EVs have no understanding that Tesla isn’t the only maker of them. It’s mind blowing how narrow people are.",
            "score": 27,
            "replies": [
                {
                    "author": "headlyone68",
                    "body": "China EVs kick Tesla’s ass in terms of price and quality. BYD announced 5 minute charging. Waymo is ahead of Tesla in terms of full self driving. \n\nBacking Trump may have been desperation in quashing lawsuits and regulatory action against Tesla, killing federal backed EV charging stations, gaining federal contracts, etc. Tesla is still trading at 100x P/E. I wouldn’t be surprised if it falls to trigger a margin call on loans backed with Elon’s Tesla stock.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Howunbecomingofme",
                            "body": "Those BYDs popped up one day and they’re just everywhere here in Australia. It won’t be long before they eclipse Tesla sales which have dropped by over 60% since Trump took office.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MasterRanger7494",
            "body": "They think Elon invented everything. Online payments? Elon. Electric cars? Elon? Rockets? Elon? They probably think he discovered space.",
            "score": 19,
            "replies": [
                {
                    "author": "IdeliverNCIs",
                    "body": "Musk wanting to go to space just follows the original pioneers, who happen to have been former Nazi scientists",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tiny_Brilliant7347",
            "body": "MAGA is literally the most ignorant collective in the history of the US.",
            "score": 20,
            "replies": [
                {
                    "author": "Bulky-Internal8579",
                    "body": "Counterpoint - the Confederacy was similarly dumb and evil.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "SadPandaFromHell",
            "body": "Also, the environment is still a priority. But a lot of environmentalists now recognize pollution as a problem with capitalism- and not individual lifestyles. Most pollution is done by the 1%, if they could start \"end-of-life\" planning for their products, quit the practice of planned obsolescence, and quit weaponizing advanced psychological manipulation to ensure even higher rates of consumerism- things would be dramatically better. Paper staws arent like, the worst idea. But policys like that optically put the blame onto the consumer. It makes *us* make consessions, when there are sooooo many bigger things that could be done by corporations.",
            "score": 29,
            "replies": [
                {
                    "author": "Irethius",
                    "body": "Environmentalist have also been saying for years that the battery waste produced by electric cars is terrible too.\n\n\nThe real answer to transportation is a less car centric city design.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pops_Daddy",
            "body": "Theyre not known for their intelligence",
            "score": 11,
            "replies": []
        },
        {
            "author": "luca_07",
            "body": "does anybody sane really think a MAGA knows what an EV is?",
            "score": 11,
            "replies": []
        },
        {
            "author": "BeefOneOut",
            "body": "MAGA morons….",
            "score": 7,
            "replies": []
        },
        {
            "author": "Tudorboy76",
            "body": "Eat shit Elon indeed",
            "score": 7,
            "replies": []
        },
        {
            "author": "ImpossibleHorror8460",
            "body": "Imagine expecting MAGA to know anything except what their betters have told them",
            "score": 4,
            "replies": [
                {
                    "author": "Nekowulf",
                    "body": "Maga is enthusiastically, intentionally uninformed. They pride themselves on how little they know and how much they depend on being told what to think.  \nThey call it being an independent thinker, unswayed by propaganda, and not a hive mind like the liberal groupthink.  \nIt's absolutely maddening knowing these people vote.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dcarsonturner",
            "body": "They never cared about the environment",
            "score": 6,
            "replies": []
        },
        {
            "author": "Weekly_Mycologist883",
            "body": "MAGATs never, ever, get anything right",
            "score": 3,
            "replies": []
        },
        {
            "author": "deezsandwitches",
            "body": "These morons are constantly wrong. They think tesla is the only ev company out there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "iamthedayman21",
            "body": "MAGAts didn’t know a thing about EVs until Elmo and Trump told them to. So of course their world view is limited to Tesla. Their world view on most things is limited.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ninjaoftheworld",
            "body": "Honestly? If this drives those numbskulls to all buying teslas to “own the libs” and they accidentally save the environment while still driving trash, that’s an acceptable compromise to me. Let THEM make that shithead richer.",
            "score": 3,
            "replies": []
        },
        {
            "author": "letsbereal1013",
            "body": "Dumb af. It takes a few seconds to look up the car if they don't recognize it. They don't stand for anything. Now suddenly these people care about the environment? Please!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Apprehensive_Map64",
            "body": "Are they really that stupid or are they just pretending because that's the only way their stance makes any sense?",
            "score": 2,
            "replies": []
        },
        {
            "author": "whodis707",
            "body": "They know nothing they are so ignorant.",
            "score": 2,
            "replies": []
        },
        {
            "author": "usernamesogeneric1",
            "body": "They are so dumb, it's insane.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Relative-Rub1634",
            "body": "They also don't know how far their heads are up their asses...",
            "score": 2,
            "replies": []
        },
        {
            "author": "volanger",
            "body": "Ioniq 5 is a really cool looking car too imo. Only EV in the US that actually made me want the car.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LightDarkBeing",
            "body": "Kelly Perry, moron.",
            "score": 2,
            "replies": []
        },
        {
            "author": "capitali",
            "body": "you cannot be both maga and intelligent or well informed -- these circles do not cross on a Venn diagram.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bottle_Only",
            "body": "Hyundai also owns Boston Dynamic which is lightyears ahead of tesla in robotics. They are literally everything that Tesla wishes they were.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fluffy-Opinion871",
            "body": "You probably have a better vehicle now too!",
            "score": 3,
            "replies": []
        },
        {
            "author": "SheepherderFun4795",
            "body": "r/shitamericanssay",
            "score": 1,
            "replies": []
        },
        {
            "author": "marathonbdogg",
            "body": "Anyone know what kind of EV Mark Kelly traded his Tesla in for?",
            "score": 1,
            "replies": [
                {
                    "author": "Slight-Ad-6553",
                    "body": "Hyundai Ioniq 5 ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Fiveofthem",
                            "body": "I wish, he traded it in for a Chevy Tahoe.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "boo_jum",
                                    "body": "unrelated, but I have a cousin named Tahoe, and when my aunt announced that was what she was naming her kid, my whole family had a collective WTF moment.  And I told her I was going to call the kid Suburban.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Smooth-Reason-6616",
                                            "body": "Had a kid at my school whose family name was Mustaine... his name was Ford...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "marathonbdogg",
                            "body": "Oh? Then whose gas guzzling SUV was that he was showing off in?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Voodoo_Dummie",
                    "body": "This one name appears on every single EV related post. Is he really all that you've got? One senator who seems to be a doof?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AngryScientist",
                            "body": "The sad thing is, he's not a doof.  He's a combat pilot and an astronaut; objectively he's not an idiot.  So he should have known how bad the optics were getting an SUV after making such a big show of getting rid of his swasticar.  And now they're trying to lump everyone else on \"the left\" in with him as not really caring about the environment.  It's so disappointing and predictable.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Voodoo_Dummie",
                                    "body": "You're making a classic mistake. Very highly educated people are still quite capable of being doofs, especially in the case of experts who tread outside of their expertise where they are the same mouth-drooling idiot like the rest of us average joes.\n\nSee for example that the list of skills required of being a combat pilot or astronaut, nor the years and decades of study and training, includes a \"public relations\" class. And while it is a required skill of politicians, that isn't exactly a career with solid training beforehand. See orange doof for reference.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoNet204",
            "body": "Wow, kelly perry is a dope who thinks she’s clever",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Needleworker5837",
            "body": "\"MAGA don't know.\" FTFY.",
            "score": 1,
            "replies": []
        },
        {
            "author": "anelectricmind",
            "body": "r/confidentlyincorrect",
            "score": 1,
            "replies": []
        },
        {
            "author": "DurableLeaf",
            "body": "Other EVs are better anyways. Tesla was artificially propped up by temporary \"cool\" status and the lies about FSD.",
            "score": 1,
            "replies": []
        },
        {
            "author": "draconicmoniker",
            "body": "For years I've been wondering which EV brand would get truck nuts first, I guess now we know",
            "score": 1,
            "replies": []
        },
        {
            "author": "Waldo305",
            "body": "Ionic 5 is a nice looking EV imo. Although the EV subreddit shits on it non stop and dick ride Chinese EVs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Then-Raspberry6815",
            "body": "Um... I was told that there would be no fact checking. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "ras_1974",
            "body": "According to their leader, coal is clean.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Known_Diamond5636",
            "body": "MAGAts don’t know shit, doesn’t stop them voting, sadly",
            "score": 1,
            "replies": []
        },
        {
            "author": "bronzegorilla253",
            "body": "To all of you Tesla owners contemplating the same, you better hurry.  If there's a run to trade in Teslas, while purchasing continues to slow, their value will plummet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Competitive-Ad572",
            "body": "...willful ignorance, intentional misrepresentation, and an absolute lack of empathy...\nWhat a lovely recipe for a fascist state. Post-modern Republicans are mendacity at its finest. I like mine with a dash of abject fear of a brown woman. Mumm-wah, it tastes just like 1956, as imagined.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TexasBootyEater",
            "body": "ITT: People don't understand sarcasm 🙄",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuckyLover76",
            "body": "Their ignorance still fascinates from time to time. Like how detached from reality are MAGAs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "JailFogBinSmile",
            "body": "EVs don't save the environment, they save the car companies at the expense of the environment. This is dumbass virtue signalling either way",
            "score": 1,
            "replies": []
        },
        {
            "author": "RackCitySanta",
            "body": "think make brain hurt, big",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot-Equivalent9189",
            "body": "I mean the comment makes sense.  It is better to keep something for longer , rather than buying new. If you care about the environment you would kept the tesla and add stickers to it . Because the waste to build the car is already there .",
            "score": 1,
            "replies": []
        },
        {
            "author": "mazza77",
            "body": "MAGA doesn’t know much either way",
            "score": 1,
            "replies": []
        },
        {
            "author": "OverlyExpressiveLime",
            "body": "As we all know, the MAGAts aren't exactly great at critical thought",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chinerpeton",
            "body": "Damn, the cop out about Teslas being the only EVs in the world got rolled out in a matter of days like out of some factory...",
            "score": 1,
            "replies": []
        },
        {
            "author": "patrinoo",
            "body": "Do Americans think only Teslas are EVs? This shit turned out to be the equivalent of the market share in iphones vs androids for gen z.",
            "score": 1,
            "replies": []
        },
        {
            "author": "anonlgf",
            "body": "Is this “the environment is no longer a priority” crap a new talking point for the morons who think climate change isn’t real?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ornery_Pepper_1126",
            "body": "I know it’s not the point of this post but we have an  (older) electric Hyundai Ioniq, they are really good cars, OOP made a good choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eatpie888",
            "body": "Yes, help bring the price down so i can buy one",
            "score": 1,
            "replies": []
        },
        {
            "author": "Humans_Suck-",
            "body": "Is there a comeback somewhere that I'm not seeing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "External-Example-292",
            "body": "MAGAS pretending they care about climate change? Didn't Trump say he doesn't believe in it and drill baby drill...   And they supported him on those points ... So which is it",
            "score": 1,
            "replies": []
        },
        {
            "author": "JRiceCurious",
            "body": "...even if it weren't, Hyundais typically get really good gas mileage, soooo...",
            "score": 1,
            "replies": []
        },
        {
            "author": "AtherealLaexen",
            "body": "Their reading comprehension is equivalent to that of a six-year-old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DctrSnaps",
            "body": "How do we know they are maga?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Constant-Anteater-58",
            "body": "Lmao. He ain’t wrong. Fuck Elon so I’m gunna buy a whole new fucking car that takes up resources.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CitizenKing1001",
            "body": "MAGA aslo thinks Tesla is the number one EV company by sales",
            "score": 1,
            "replies": []
        },
        {
            "author": "degrix",
            "body": "Isn’t the environmental issue that it’s buying another _new_ car when one is still fairly new by the looks of it? EVs carbon footprints are generally front loaded so the longer you hold onto them the better overall for the environment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TriggerHappy_NZ",
            "body": "Yeah but you're still throwing away a perfectly good car, which has environmental impacts\n\nthis is just conspicuous consumption (the worst kind of consumption!)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded_Wind574",
            "body": "Great deal for one side. The person who got Tesla got ripped off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "honorablenarwhal",
            "body": "How about Rivians? Are they manufactured by non-Nazis/decent humans? \n\nWe could make it a point to make sure we mention other EV brands as much as possible.\n\nIf this is already being done, I apologize!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Karelkolchak2020",
            "body": "First things first…",
            "score": 1,
            "replies": []
        },
        {
            "author": "512115",
            "body": "And just like that, stupid people continue to be stupid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_One46",
            "body": "Remember, MAGA bots and trolls do not care what is true or factual.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gymtrovert1988",
            "body": "If you listed all the things MAGA knows, it would be a blank page.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Annanymuss",
            "body": "Im confuse, do they care for the enviroment now after all lol?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odoyle-Rulez",
            "body": "If you have the means to purchase a tesla, you have the means to sell it. \n\n  \ntesla owners are **complicit.**",
            "score": 1,
            "replies": []
        },
        {
            "author": "Toutanus",
            "body": "To be fair : an electric car is environment friendly if you use it long enough. Changing car this early is bad for carbon footprint.",
            "score": 0,
            "replies": [
                {
                    "author": "Hillbillyblues",
                    "body": "I partly agree, but now second hand Tesla's will be a lot cheaper meaning more ICE cars are taken off the road. Unless all these Tesla's get destroyed because nobody wants to be seen in them.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "M4K077",
            "body": "Lol Americans buying EVs being charged by all these new coal powerstations Donald dump is gonna build.",
            "score": 0,
            "replies": [
                {
                    "author": "NoThanksImCis",
                    "body": "I see this talking point brought up a lot but the alternative is a gas engine that uses gas and pollutes every second that it's running and needs an oil change every 3k-10k miles.\n\nIdeally we would rely on more renewable sources but this is measurably better.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BobSaget_Returns",
            "body": "I'm so grateful that all the left does is cry on the internet instead of actually doing anything of substance.\n\nYou know what they say, the left cries while America thrives.",
            "score": 0,
            "replies": [
                {
                    "author": "Xhojn",
                    "body": "Lmao, you call what's going on right now thriving?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BobSaget_Returns",
                            "body": "Absolutely I do. I voted for all of this and I'm super proud to be an American rn honestly.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Azdak66",
            "body": "The only problem with trading in a tesla for a Hyundai is: you are now stuck with a Hyundai. \n\nPyrrhic victory, to be sure.",
            "score": -1,
            "replies": [
                {
                    "author": "Smooth-Reason-6616",
                    "body": "Should have a look at the list of awards the Ioniq has won before you knock them...",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Azdak66",
                            "body": "For me, my experience actually owning a Hyundai is more relevant. But everyone is entitled to their own opinion.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Honorablemention69",
            "body": "Liberal terrorists don’t know burning Teslas is polluting the environment!",
            "score": -4,
            "replies": []
        },
        {
            "author": "Once-Upon-A-Hill",
            "body": "More money for middle class factory workers in Korea and China.",
            "score": -24,
            "replies": [
                {
                    "author": "Bulky-Internal8579",
                    "body": "Less money for fascist billionaires.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "MosquitoValentine_",
                    "body": "Hyundai EV's are built in Georgia.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Once-Upon-A-Hill",
                            "body": "Only as of May 2024, and even with that, they get to strip profits out of the USA and back to Korea, a real win for the USA.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "SBCwarrior",
                                    "body": "Tell that to all the maga cult who swear they're so \"American\" and yet drive Toyotas, Nissan and Hondas",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "MosquitoValentine_",
                                            "body": "Their MAGA hats and FJB underwear is all made in China.\n\nSuper big Americans they are.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Once-Upon-A-Hill",
                                            "body": "The top 3 most popular vehicles are all US companies, and of the top 10, 6 are US companies.\n\n[https://www.edmunds.com/most-popular-cars/](https://www.edmunds.com/most-popular-cars/)",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "ippa99",
                                                    "body": "With most major parts and subassemblies made in Mexico, India, Canada, etc.\n\nIronically, quite a few Hondas, Toyotas, and Hyundais etc. are more \"American made\" than American brands.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Joelle9879",
                                    "body": "So let me get this straight, if you buy an EV by another manufacturer then you're anti American because the cars are manufactured elsewhere. If you buy an American car that isn't an EV, then you obviously don't care about the environment. So basically your argument is that you must by from the Nazi fascist or you're an un-American AH who likes to pollute? Yeah that's not remotely unhinged thinking or anything 🙄",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "derbyt",
                    "body": "Hyundai has shifted production of Ioniq 5 to a $7.6 billion plant in Georgia, USA.\n\nhttps://apnews.com/article/hyundai-ev-georgia-production-begins-ioniq-424cf322822f707e7070260a789ffb59",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Once-Upon-A-Hill",
                            "body": "Only as of May 2024, and even with that, they get to strip profits out of the USA and back to Korea, a real win for the USA.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Free_Management2894",
                                    "body": "Yeah, imagine how the world would look like, if us companies did that. Oh wait. It would just like today.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Smooth-Reason-6616",
                                    "body": "You mean, like Ford strips all its profits back from Mexico and Europe...?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RobespierreLaTerreur",
                    "body": "Nice try. [https://www.hyundainews.com/en-us/releases/4174](https://www.hyundainews.com/en-us/releases/4174)",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Once-Upon-A-Hill",
                            "body": "Only as of May 2024, and even with that, they get to strip profits out of the USA and back to Korea, a real win for the USA.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Spinxy88",
                    "body": "Less money for working class factory workers in America.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Bulky-Internal8579",
                            "body": "Not according to the workers at the Ioniq factory in Georgia.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Spinxy88",
                                    "body": "Could you be specific, what is their take on my flippant remark?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "untonplusbad",
            "body": "A car is a car. Electric or not, it's bad for the environment. Electric cars are bad in other ways, and every Tesla sold helps building stupid rockets to go to mars.",
            "score": -8,
            "replies": []
        }
    ]
}