{
    "title": "Military vs USPS!!!!",
    "author": "Brian_Ghoshery",
    "subreddit": "clevercomebacks",
    "rank": 12,
    "score": 1656,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 65,
    "url": "https://i.redd.it/7otr8ii04hpe1.jpeg",
    "id": "1je8szj",
    "selftext": "",
    "comments": [
        {
            "author": "Daveplaysgtr",
            "body": "It doesn't lose money, it costs money.  Like the defense department.",
            "score": 61,
            "replies": [
                {
                    "author": "ThingSwimming8993",
                    "body": "Nah, the defense department definitely loses money.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Relicc5",
                            "body": "They lose all sorts of things…",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "ThingSwimming8993",
                                    "body": "Yes",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Spear_Ritual",
                                            "body": "Imma need an email for every $80,000 Hellfire you use, justifying its use and why you couldn’t have used a cheaper munition.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Delicious_Taste_39",
                            "body": "Yeah, I'm thinking about that Jon Stewart interview where they couldn't tell him where the money went \"they just lost it\".",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "outdoorschillguy",
            "body": "The usps is a service. It’s not a business.  We pay taxes to facilitate mail services for everyone equally.",
            "score": 70,
            "replies": [
                {
                    "author": "JetstreamGW",
                    "body": "The usps is not funded by tax dollars. They became responsible for their own funding in 1971.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "outdoorschillguy",
                            "body": "Thank you. I learned something new today.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "the_cardfather",
                                    "body": "Something apparently Congress and the DOGE don't understand either. \n\nWhile the post office is supposed to be in charge of its own revenue rate increases are handled by the postal regulatory committee, and spending mandates have been in place since 2007. \n\nThe post office has been required to completely fund its retiree healthcare benefits. They've had to borrow hundreds of billions of dollars to do it. So now they have one of the most overfunded pension systems in the entire United States. \n\nAnd both sides of Congress want that money and both sides of Congress have agendas against the post office and that's why it is being run into the ground. \n\nIn most years if you took away that funding mandate the post office would be one to two billion in the black and they would have money to invest in things like new machines and new vehicles.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "loricomments",
                                            "body": "Democrats repealed that a few years ago. Don't both sides this.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "the_cardfather",
                                                    "body": "In what bill? Not to my knowledge.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "loricomments",
                                                            "body": "Postal Service Reform Act of 2022.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Particular_Row_8037",
                                            "body": "Never mind Louis deJoy has been doing a good job of running into the ground.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "justintheunsunggod",
                            "body": "When you Google it, the phrase used is \"generally self-sufficient\". We've propped up the USPS more than once. Which I'm not opposed to. It's a necessary service.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kilertree",
            "body": "The post office isn't funded by tax dollars. It is intentionally kneecapped by Congress to make sure it doesn't interfere with the free market.",
            "score": 23,
            "replies": [
                {
                    "author": "mike_pants",
                    "body": "Almost entirely true, but it has been occasionally given windfalls to shore itself up during shortfalls. But so has Tesla.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kilertree",
                            "body": "When was the last windfall that they got?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mike_pants",
                                    "body": "Last time, I _THINK_, was in 2021 to the tune of 8 billion. But since Congress repealed the need for it to fully fund every pension, it's been entirely self-sustaining.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kilertree",
                                            "body": "They didn't give them 8 Billion.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "mike_pants",
                                                    "body": "They did, during the pandemic.\n\nWe were _brutalized_ during the pandemic. I was working 14-hour days every day for months. The parcel service alone was horrendous, and half the carriers straight up refused to come to work.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "kilertree",
                                                            "body": "I'm going to need you to send me article where they gave the post office 8 billion dollars",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "mike_pants",
                                                                    "body": "K.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TruckGray",
            "body": "This is a perfect example of why the push to manage government like a business is the stupidest moronic thing since flat earth knuckle draggers.  Especially when you dont include the metrics of what these government services are providing for american citizens but only think of them as being profitable or not profitable.",
            "score": 7,
            "replies": [
                {
                    "author": "justintheunsunggod",
                    "body": "We seriously need to stop putting MBAs in charge of everything.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "TruckGray",
                            "body": "Agree.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Guillotine-Wit",
            "body": "Corporatists are pushing to turn public service into private profit.\n\nThey're the real parasites.",
            "score": 6,
            "replies": [
                {
                    "author": "NewConstructionism",
                    "body": "So you're saying we should privatize the military?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Guillotine-Wit",
                            "body": "We've already got private militias.\n\nIt helps them get around that pesky oath to the constitution.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Current-Square-4557",
                            "body": "It’s polite to add /s to sarcastic comments.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "chillumbaby",
            "body": "Congress is just a big money drain supporting millionaires.",
            "score": 6,
            "replies": [
                {
                    "author": "PrismaticDetector",
                    "body": "They *are* the millionaires. They're supporting the *billionaires*.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "try-catch-finally",
            "body": "So pissed that my kids lost me so much money. \nThe ROI has been minimal to non existent",
            "score": 5,
            "replies": []
        },
        {
            "author": "Joelle9879",
            "body": "The USPS is a service not a business to make money. It is also entirely self funded. The whole \"The USPS loses money\" argument doesn't hold water because it doesn't use tax money anyway",
            "score": 4,
            "replies": []
        },
        {
            "author": "Fine-Bed-9439",
            "body": "USAF vet here… AF1 costs $200k+ PER HOUR to fly. Need a fighter escort? A 2-ship of Raptors will add another $160k+ per hour. Oh, and they’ll need gas, so a KC-135 ads another $25k an hour. This is all approximate of course, but it’s over $100 per SECOND just to move a president somewhere.",
            "score": 5,
            "replies": []
        },
        {
            "author": "supernovadebris",
            "body": "defense contractors run the world.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Jathaniel_Aim",
            "body": "USPS is a service. Like a library or fire department. Viewing everything as a commodity is the reason why Americans have $500 premiums AND $100 copays.",
            "score": 2,
            "replies": [
                {
                    "author": "the_cardfather",
                    "body": "I wish I had only $500 premiums & $100 copays. (Ok for primary care it's $50). Premiums for 2 adults on Obamacare is $1100.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarkBladeMadriker",
            "body": "The big difference being that the post office isn't profitable, we're as the military \"loses\" vast amounts of money each year.",
            "score": 3,
            "replies": []
        },
        {
            "author": "StrikingWedding6499",
            "body": "It’s unimaginable that so many numbskulls still not getting the concept that *postal service* has never meant to be a for-profit organization, but to provide *every citizen and resident* a reliable channel to deliver mail and goods, hence connects cities and rural areas with faraway lands, whilst providing jobs across the nation. Pre Reagan, a postal worker could afford to buy a house, raise a family, and retire. Now one of the most essential service is about to stripped apart. When that happens, just wait and weep how much Amazon, DHL, and FedEx will suddenly jack up their charges.",
            "score": 3,
            "replies": [
                {
                    "author": "StandardNecessary715",
                    "body": "Isn't that what DeJoy wanted anyway? Doesn't he have something to do with Fed Ex or something?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Odd_School_8833",
            "body": "Pretty quiet about the Pentagon [failing 7th consecutive audit in 40 years, $824 billion unaccounted for](https://americanmilitarynews.com/2024/11/pentagon-fails-7th-audit-cant-fully-account-for-824-billion/) but it’s not likely made-up accountability program led by an unelected billionaire official with military contracts will clamor about it, gee whiz.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Current-Square-4557",
            "body": "It’s called the postal service, not the postal corporation.\n\nWhen all you have is a business degree every problem looks like an overpriced nail.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RaineFilms",
            "body": "True",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fischmafia",
            "body": "Don't plant the idea of for profit military in Agent orange.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Southpolarman",
            "body": "The USPS does NOT lose money. They have been harnessed with this bizarre requirement...by REPUBLICUNTS, to pre fund retirement for employees for a period of 75 YEARS. What other segment of civilian life or government sector has this requirement?  NONE. REPUBLICUNTS are trying to blow up the post office and privatize it. Which will drive up prices, drop service and make 12 people rich. Fuck them. Eat The Rich.",
            "score": 2,
            "replies": []
        },
        {
            "author": "loricomments",
            "body": "The only reason the post office doesn't pay for itself is because Republicans put an absurd funding requirement on it in an effort to privatize it by saying it loses money. That was repealed by Democrats a few years ago but it will take time to recover.",
            "score": 2,
            "replies": []
        },
        {
            "author": "991839",
            "body": "the usps can at least pass a budget check. the military asks the government where the money went",
            "score": 2,
            "replies": []
        },
        {
            "author": "Particular_Row_8037",
            "body": "But wait you can't throw facts at cult followers. You're expected too much from the poorly educated.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jordu5",
            "body": "USPS never loses my mail or packages but the military loses billions all the time. Never passed an audit",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThrustTrust",
            "body": "Don’t they lose money because the government steals their budget for other things?",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-City4673",
            "body": "usps hasn't taken federal money since the 70s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LameDuckDonald",
            "body": "There are no \"tax dollars\" being spent on the USPS.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Curleysound",
            "body": "“Post office spendin my money sendin me bills! Military buys bullets and that’s cool!” /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "EntrepreneurBusy3156",
            "body": "The economist. 🤣🤣🤣🤣. A foreign publication with a political left axe to grind.   Nice try.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peaurxnanski",
            "body": "It's not a for-profit venture. It's something we pay money to have because it's worth having. \n\nWhen did our entire culture get overtaken by the idea that if you can't make money off of something, that it's worthless?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrostyGuarantee4666",
            "body": "I fucking love the USPS! That’s how I get my drugs lol. They’re always so consistent and predictable. Every other company is absolute garbage. It does help that I literally live next door to my post office but still. Like clockwork, every time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Living_Machine_2573",
            "body": "Note: the usps WAS profitable until a bunch of bipartisan under ~~Obama~~ Bush required them to pre fund their retirement for 40 years.\n\nThis was a poison pill that led to its decay.",
            "score": 1,
            "replies": [
                {
                    "author": "Gnd_flpd",
                    "body": "Actually it wasn't Obama that required that, it was George W. Bush that required it; it was passed by a Republican-led Congress and signed into law by President **George W.** **Bush**,",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Living_Machine_2573",
                            "body": "You’re correct!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gnd_flpd",
                                    "body": "Well I'm not trying to be a know it all, but I did also see that Obama was trying to do something with the USPS as well.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}