{
    "title": "R slash FDRWasAMistake invites you (I created it) to add arguments demonstrating that FDR was a mistake for America.",
    "author": "Derpballz",
    "subreddit": "Anarcho_Capitalism",
    "rank": 341,
    "score": 467,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 55,
    "url": "https://i.redd.it/x1e8gm21roie1.png",
    "id": "1ino0v4",
    "selftext": "",
    "comments": [
        {
            "author": "agent_venom_2099",
            "body": "Yeah if they think Trump was a threat to the courts, wait until they find out all the things FDR did.",
            "score": 44,
            "replies": [
                {
                    "author": "Derpballz",
                    "body": "FAX",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "EGarrett",
            "body": "The gold seizure executive order was the beginning of the end of citizen's sovereignty and the US dollar. It's hurting people even today.",
            "score": 27,
            "replies": [
                {
                    "author": "drewshaver",
                    "body": "So many people complain about the cost of living crisis, yet so few understand that excessive money printing is the root cause of it",
                    "score": 22,
                    "replies": [
                        {
                            "author": "EGarrett",
                            "body": "Yup, when you go to the store and realize that bacon or eggs is twice what you remember it being, thank FDR.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Quantum_Pineapple",
                                    "body": "I was told by Reddit for four years the president has absolutely no control over the economy/inflation or food and gas prices.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Quantum_Pineapple",
                            "body": "So many people not only complain about the cost of living, they've also been brainwashed by the state to scoff at the idea of the gold standard to begin with, like it was caveman-level econ, etc.\n\nOf *course it was*, because it restricts centralized fractional reserve banking and forced accountability lmao.\n\nAnything that goes against centralization and fractional reserve banking will be taught as backwards econ thinking with zero irony.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Electronic_Rub9385",
            "body": "The NJ governor said he didn’t care about the Bill of Rights during COVID.  AOC argued that Biden should ignore judicial rulings during his presidency.  Obama executed American citizens without due process with drone strikes.  And none of that was a constitutional crisis? Leftists can GTFOH with their pearl clutching.",
            "score": 23,
            "replies": []
        },
        {
            "author": "ToxicRedditMod",
            "body": "Stalin to FDR is like Bert to Ernie.",
            "score": 33,
            "replies": []
        },
        {
            "author": "Ya_Boi_Konzon",
            "body": "\"I love FDR.\" -Mussolini",
            "score": 14,
            "replies": [
                {
                    "author": "TheFortnutter",
                    "body": "thats basically what he said.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Ya_Boi_Konzon",
                            "body": "https://preview.redd.it/4ly6tdkzprie1.jpeg?width=1180&format=pjpg&auto=webp&s=9e140234997a5334d7102be34fb10bb0b8bd641c",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Ya_Boi_Konzon",
                            "body": "https://preview.redd.it/m6rmno8yprie1.jpeg?width=800&format=pjpg&auto=webp&s=db89aa9a8fe2f5fd43b0f62579e7d217fb646e85",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "YardChair456",
            "body": "If you wanted to list all of the things he did it would look like a democrat meme meme.",
            "score": 8,
            "replies": [
                {
                    "author": "Derpballz",
                    "body": "Fax",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "agent_venom_2099",
            "body": "Yeah if they think Trump was a threat to the courts, wait until the find out all the things FDR did.",
            "score": 13,
            "replies": []
        },
        {
            "author": "denzien",
            "body": "People are so far up FDR's ass, it's insane. You mention anything negative about his policies, however well intentioned, and they jump all over you because he cared or something.",
            "score": 7,
            "replies": [
                {
                    "author": "ForFreedomLovers",
                    "body": "Stalin, Mao, Pol Pot, and Castro cared.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "donatj",
            "body": "The missing link /r/FDRWasAMistake",
            "score": 6,
            "replies": [
                {
                    "author": "Derpballz",
                    "body": "Fax",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Quantum_Pineapple",
                    "body": "BASED and subbed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "livinlizard",
            "body": "Growing up, FDR was the pinnacle of how you manage your time on this planet, but since then I've seen a man who was in the least a dictator, but if the truth was to be known, more like a maniacal villain. I now believe he knew of the impending Pearl Harbor attacks but wanted us in the war. Not to mention the government assistance programs he created, that have strapped future generations with life-depleting debt.",
            "score": 5,
            "replies": []
        },
        {
            "author": "121bphg1yup",
            "body": "FDR was the worst president in US history.",
            "score": 4,
            "replies": [
                {
                    "author": "ForFreedomLovers",
                    "body": "Wilson and Lincoln were probably worse, but not by much.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "121bphg1yup",
                            "body": "Wilson at least regretted his actions and meant well. FDR on the other hand was pure evil.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ForFreedomLovers",
                                    "body": "He regretted sending tens of thousands of young american men to be slaughtered unnecessarily in WW1?  I have heard he regretted signing the bill to form the Fed, but that's easy to say to attempt to save face after the fact.  He never campaigned to repeal it; nor did he explain the evils of fiat currency, legal tender laws, nor inflationary taxation.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "res0jyyt1",
            "body": "Welcome back, fellow liberal democrats",
            "score": 2,
            "replies": [
                {
                    "author": "Derpballz",
                    "body": "Fax",
                    "score": 2,
                    "replies": [
                        {
                            "author": "res0jyyt1",
                            "body": "Turns out we are the most inclusive sub on reddit",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AdventureMoth",
            "body": "It is possible for both to be evil",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quantum_Pineapple",
            "body": "FDR put Asian Americans in camps because \"reasons\", and gets a skatepark in Philly lmao.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Net8312",
            "body": "Look at the Supreme Court cases under FDR's first and second terms. The Court initially told him that his economic schemes to regulate markets were entirely incompatible with the concept of economic liberty (Lochner), then, after he threatened to pack the Court with his crony judges, they all lost their spines in the face of irrelevance. Look up Wickard v. Fillmore and its associated contemporary cases. It's disgusting when you follow the Court's reasonings from upholding God-given rights to their cowardly kowtowing into approving Keynesian horseshit. Takes a real failure of human decency to pull shit like that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "palaceofcesi",
            "body": "You know you’re the good guy when Stalin and Mussolini compliment your policies multiple times",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomGuy92x",
            "body": "You magats realize that Trump wants to invoke the same law that FDR used to set up Japanese internment camps, right? \n\nTrump has made it clear that he will invoke the Alien Enemies Act of 1798. Once invoked he would have the power to imprison not just illegal immigrants, but also totally LEGAL immigrants with NO connection to crime, all WITHOUT a trial. \n\nAlso, Trump has threatened to imprison Mark Zuckerberg for life, he threatened to shut down TV broadcasters that are critical of him, and he threatened to criminally persecute many of his political opponents, such as Liz Cheney and the J6 committee. \n\nTrummp is most definitely one of the most authoritarian U.S. Presidents in modern history.",
            "score": -33,
            "replies": [
                {
                    "author": "MoonSnake8",
                    "body": "/r/lostredditors",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Savant_Guarde",
                    "body": "No he's not.\n\nThere is a HUGE difference between expressing some thoughts and having people like you devine what you like from them and actually doing the actions.\n\nFor example, when people say \"we want to make America great again\", some people believe that means a return to slavery, no child labor laws, removal of voting rights for women etc, none of which is true.\n\nSo sure, if you want to pretend that taking statements, usually out of context and turning them into the most exaggerated cartoons of what they could mean, then pretend that those preconceived notions equal reality, then your last sentence is true.\n\nIn reality, it's not even close.\n\nWhat I find even more funny, is how people are upset more with DOGE, than what DOGE is uncovering.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Mojeaux18",
                            "body": "Well said.  Imma steal this.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Savant_Guarde",
                                    "body": "Feel free.😁",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No-One9890",
                            "body": "I have seen no substantive evidence of any doge findings",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "Mojeaux18",
                                    "body": "Turn off Rachel madcow. Also take off the blindfold.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "seenthevagrant",
                                            "body": "Oh no the government paid for employees subscription to a niche political app that has boring political news pertinent to their job. And golly gee they spent less than a million a year on it. Totally worth handing over the gov to the richest man on earth",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "Mojeaux18",
                                                    "body": "So you’re ok with the govt handing over $8m to Fox News? You good with that? This is how we rationalize subsidies across the board. He got some why can’t I? Which would be fine if it’s someone else’s money.  But it’s taxpayer money.  \n  \nI can’t believe there are people who hate corporations but ignore the biggest corporation that steals from the poor and gives to smaller corporations.  And argue that it’s some sort of coup by unelected people?  What do you think the bureaucracy is? They aren’t elected.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "seenthevagrant",
                                                            "body": "They weren’t paying politico as a quid pro quo. They had employees turn in expenses and politico was part of it. I don’t like it but I’m not going to kiss elons ass thanking him for uncovering “corruption” while he takes tens of billions of dollars for his own companies. \n\nIdk how anyone takes him seriously while he is still one of the largest receivers of federal funding",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "Rieux_n_Tarrou",
                                                                    "body": "DOGE hasn't gotten around to DoD yet. Theyve only done USAID in the past weeks and have already found $20+ billion in waste fraud and abuse. And they're already being hemmed up by activist judges to slow down their progress \n\nSo yeah I do take them seriously. Elon answered reporter questions about SpaceX funding yesterday at length and with full transparency.\n\nYou know what I don't take seriously? People who don't do due diligence and exercise critical thinking before posting stupid comments with emotional arguments and no basis in reality.\n\nYou're gonna wanna step your game up if you hope to make it in the real world",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "seenthevagrant",
                                                                            "body": "I would love to see this break down where he has found 20 plus billion in waste. Him saying trust me bro is not transparency. \n\nI would trust him a lot more if he started with himself and the biggest fucking issue of the dod. Instead he is going after agencies that have investigated him. Once he takes his own medicine I will be convinced. Until then I will be highly critical and skeptical. Sucking him off for going after one of the most benign agencies with some of the lowest budgets is asinine.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tandoori7",
                            "body": "https://www.independent.co.uk/news/world/americas/us-politics/darren-beattie-trump-state-department-b2696297.html?utm_source=reddit.com&utm_source=reddit.com",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "RandomGuy92x",
                            "body": ">There is a HUGE difference between expressing some thoughts and having people like you devine what you like from them and actually doing the actions.\n\nTrump wasn't just expressing some thoughts, he literally made it clear in one of his recent executive orders that he plans on invoking the Alien Enemies Act of 1798. That will give Trump the power to imprison totally legal immigrants without granting them a trial. And the fact that you magats are totally ok with that really shows that you don't mind big government oppressing people as long as it's the people you don't like who are being oppressed. \n\nTrump threatened to imprison Mark Zuckerberg for life. That isn't just empty words. As the one overseeing the executive branch Trump has the power to follow through with such threats. And Zuckerberg has since bent the knee to Trump. So Trump threatening Zuckerberg with life imprisonment is really the equivalent of someone putting a gun to your head and go \"do as I say or else...\". \n\nAnd threatening to shut down TV broadcasters, when such a threat comes from the president of the United States isn't just mere words or thoughts. It's a real threat that can have chilling effects on free speech. \n\nThreats like these absolutely make Trump an authoritarian leader. But again, most of you magats don't seem to have a problem with big government oppressing people and using coercion to get their ways, as long as it's not conservatives who suffer as a result. \n\nSo at least be honest enough to admit that you absolutely love big government as long as they're oppressing the right kind of people.....",
                            "score": -10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thermionicvalve2020",
                    "body": "Lololol. Your reeeeee's only make them stronger.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "MFrancisWrites",
            "body": "Find me a leftist that thinks the camps were good.\n\nY'all argue in absolutes because once you're forced to confront nuance, it all falls apart.",
            "score": -28,
            "replies": [
                {
                    "author": "GunkSlinger",
                    "body": "\"People who refuse to accept vaccines, I think the right response for them is not to force them to but rather to insist that they be isolated,\"\n\nhttps://preview.redd.it/7shlses03qie1.png?width=640&format=png&auto=webp&s=c32337614ed0bf3c05baddcdbefb600098851444",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Junai7",
                    "body": "Everyone forgot about COVID?  There were many people demanding camps for the unvaccinated.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "Derpballz",
                    "body": "Find me a Republican who thinks that Trump doing the unanimously agreed to be bad things are good.\n\nY'all argue in absolutes because once you're forced to confront nuance, it all falls apart.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Rieux_n_Tarrou",
                    "body": "TIL Anarchi-Syndicalist is just acosplay for edgy communists. You're in the wrooooong sub buddy lol",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Celtictussle",
                    "body": "Find a leftist who doesn’t love a guy who put Japs in camps.",
                    "score": 8,
                    "replies": []
                }
            ]
        }
    ]
}