{
    "title": "Statist - Narco Statist….",
    "author": "ProtectedHologram",
    "subreddit": "Anarcho_Capitalism",
    "rank": 302,
    "score": 523,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 106,
    "url": "https://i.imgur.com/SJShGPI.jpeg",
    "id": "1ipox6y",
    "selftext": "",
    "comments": [
        {
            "author": "pythonNewbie__",
            "body": "poor cartels, imagine getting called a terrorist instead of a cartel member, so degrading",
            "score": 319,
            "replies": [
                {
                    "author": "MaineHippo83",
                    "body": "The reason she objects to this is because there have been people in the maga movement who want the designation so that the US military can be used in Mexico.",
                    "score": -39,
                    "replies": [
                        {
                            "author": "HippityHoppe556",
                            "body": "![gif](giphy|VSoRPmlMaKR8xCmq7F|downsized)",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kyledreamboat",
                    "body": "Cartels provide services terrorists do not.",
                    "score": -141,
                    "replies": [
                        {
                            "author": "SopwithStrutter",
                            "body": "Terrorists provide services",
                            "score": 111,
                            "replies": [
                                {
                                    "author": "kyledreamboat",
                                    "body": "Cartels provide better and more robust services than terrorist",
                                    "score": -107,
                                    "replies": [
                                        {
                                            "author": "trahloc",
                                            "body": "Terrorists provide lifelong employment with an extensive retirement package.",
                                            "score": 96,
                                            "replies": [
                                                {
                                                    "author": "whoisdizzle",
                                                    "body": "Retirement packages that even go with you to the afterlife",
                                                    "score": 50,
                                                    "replies": [
                                                        {
                                                            "author": "EndSmugnorance",
                                                            "body": "*Are these my virgins?*",
                                                            "score": 30,
                                                            "replies": [
                                                                {
                                                                    "author": "mattboy",
                                                                    "body": "Those are parts of your virgins brother.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "trahloc",
                                                                            "body": "*ah, I thought they looked familiar.*",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Thebeardinato462",
                                            "body": "Terrorists provide oil, cartels provide avocados. I know which one I need more.",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "vbullinger",
                                                    "body": "Wait a minute, Buddy. I drive a Leaf and love guacamole",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "Fox_Mortus",
                                                            "body": "Choosing to drive a Nissan is a form of self harm.",
                                                            "score": 15,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Thebeardinato462",
                                                            "body": "What assumption are you making? Tex-mex is life, I drive a Prius and I have a bicycle.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dinglebutterball",
                            "body": "No no, he’s got a point. They do have wares to sell.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "AdeptStranger1947",
                            "body": "If terrorists didn’t provide services why would the public put up with them? Think of Hamas for example very clear Islamic extremist terrorist group also voted into power in Palestine. Why? Because they provide better services than the PA does",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "beating_offers",
                                    "body": "I thought those groups existed because people were afraid of them.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Double_Education_690",
                            "body": "What.. lol bruh",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Total-Efficiency-538",
            "body": "Since Mexico is not within the jurisdiction of the US legal system, and the US must consent to the lawsuit of another country for a lawsuit to be filed... Good luck with that.",
            "score": 189,
            "replies": [
                {
                    "author": "pepe_silvia67",
                    "body": "I’m looking forward to the US rebutting by sending all of the uninsured motorist accident claims back to mexico.",
                    "score": 104,
                    "replies": []
                },
                {
                    "author": "HKatzOnline",
                    "body": "Problem is, there are MANY anti-gun leftists here in the US that would LOVE that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "G1nSl1nger",
                    "body": "That's not how lawsuits work. Their assets within Mexico are fair game and don't require your boss' permission to be sued for",
                    "score": -61,
                    "replies": [
                        {
                            "author": "CommiRhick",
                            "body": "That's the name of the game of tariff war... \n\nHe's bringing manufacturing back whether they want it or not because the system will fail regardless... \n\nBetter to have the manufacturing process set up and expensive in the states, rather than cheap and in China... It will hurt at first, for a good long while, and things will never be the way the \"once\" were. \n\nWe live in a fake system, that system is coming to an end...",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "G1nSl1nger",
                                    "body": "What are you even about? Tariffs have nothing to do with lawsuits.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "CommiRhick",
                                            "body": "Grains of sand add to make a heap... \n\nNor does a snowflake blame themselves for the avalanche... \n\nDo you think mexico will seize the assets and just do nothing? No, they will resume operations and compete against the US. \n\nGeopolitics and macroeconomics in a Nutshell",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Clamper5978",
                                                    "body": "They will never compete with the US. They have plenty of resources to do so, but the corruption, and inability to set up a true functioning government that can manage their assets properly, will never exist. Sheinbaum is a Marxist at heart. She’s the wrong person to want to try it with.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "G1nSl1nger",
                    "body": "Can I ask where you got your law degree?",
                    "score": -34,
                    "replies": [
                        {
                            "author": "hazael10",
                            "body": "reddit",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChaoticDad21",
            "body": "lol, because that’s comparable",
            "score": 135,
            "replies": [
                {
                    "author": "LoneHelldiver",
                    "body": "She has no choice but to do as her bosses tell her to do.",
                    "score": 117,
                    "replies": [
                        {
                            "author": "ChaoticDad21",
                            "body": "![gif](giphy|ARW8yiJ2oiExXIZhXd|downsized)",
                            "score": 34,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Blaize69",
                    "body": "Maybe she should sue Obama for giving them the guns.",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "seenthevagrant",
                    "body": "It’s comparable in that cartels produce drugs that get smuggled into the us. Us gun manufactures produce the guns that get smuggled into Mexico for the cartels to use. \n\nhttps://everytownresearch.org/report/damming-the-iron-river/#:~:text=An%20estimated%20200%2C000%20firearms%20are,the%20%E2%80%9Ciron%20river.%E2%80%9D%209",
                    "score": -34,
                    "replies": [
                        {
                            "author": "trahloc",
                            "body": "The right to self defense is a legitimate right from birth which we made sacrosanct in our founding document. Drugs are illegal even in their own country, not comparable... Unless you consider the cartels/drugs to be a legitimate arm/duty of the Mexican government?",
                            "score": 40,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "red_tapez",
            "body": "The SC will rule Mexico has no standing to sue and call it a day.",
            "score": 37,
            "replies": []
        },
        {
            "author": "NOIRQUANTUM",
            "body": "Cartels traffic drugs and people, they extort the hardworking citizens and terrorize anyone who they deem to go against them.\n\nGee I wonder what was the term?",
            "score": 31,
            "replies": [
                {
                    "author": "DreamLizard47",
                    "body": "NAP sinners",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tiny_ChingChong",
            "body": "Legalize drugs, and guns then you wouldn’t have issues to begin with",
            "score": 72,
            "replies": [
                {
                    "author": "FaithlessnessSpare15",
                    "body": "Exactly, the war on drugs is a waste of time. We can't even keep drugs out of prison... how the hell do they expect to keep them out of general society? Lol, but they know this. The government profits on it.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "frisbm3",
                            "body": "You're right up to the point where you say the government profits. The government is a nonprofit and struggles with this daily.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "angry_snek",
                                    "body": "> The government is a nonprofit\n\nMaybe, but some politicians sure aren't. Have you heard about lobbying?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "frisbm3",
                                            "body": "The money goes to their campaigns. They aren't allowed to accept bribes or gifts. Maybe in India that's how it works.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "30sAreTheTruTest",
                    "body": "Agreed! The only problem is that the US doesn't recognize that the guns coming from their country, and the US people consuming that many drugs, are the only reason Mexican cartels continue to exist. We shouldn't police what adult people do and consume. Drug addiction is the result of other societal problems that wouldn't happen in a truly Ancap society. These are the problems of big-government interests and manipulations. Even Nixon's aide admitted the drug war was meant to target black people, and that they knew they were lying and exaggerating about drug recreational use effects.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "YazaoN7",
                            "body": "Drug addiction would absolutely happen in an ancap society. The only difference is that my money wouldn't be used in BS programs that don't really solve the issue. The chemical structure of addictive drugs like opiates is what makes them addictive: in other words whatever arrangement of governance a society adopts has little to no bearing on the chemical structure of a compound like an opiate. Now if someone wanted to drug themselves to a stupor I have no problem with that as long as it's outside my property and doesn't violate any of my rights (which it hypothetically shouldn't).",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "DreamLizard47",
                                    "body": "Addiction is a social problem. It's not a chemical problem. Even studies on rats show that. When rsts have freedom they don't indulge in the dopamine seeking behaviour. In a more free society people would be more mentally healthy and would also be able to be more productive. Like they would be sble ro build their own housing when the state won't prohibit it. ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "critsalot",
            "body": "why would she care if they are called terrorists? thats so weird. if it was the mexican government that would be different. :-p",
            "score": 45,
            "replies": [
                {
                    "author": "Crafty_Jacket668",
                    "body": "This would give the US the green light and justification to invade Mexico",
                    "score": 19,
                    "replies": [
                        {
                            "author": "dangered",
                            "body": "Or because Mexico is run by the cartels, ~60 Mexican politicians were assassinated leading up to and during the 2024 election cycle.\n\nSource: https://en.m.wikipedia.org/wiki/List_of_politicians_killed_during_the_2024_Mexican_elections\n\nThe cartels selected her and they’ll likely remove her from office using the same methods if she doesn’t properly defend them.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Red_Igor",
                                    "body": "It probably both",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mrpenguin_86",
                    "body": "Then your country becomes one harboring terrorists. That opens up a can of worms.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Finzzilla",
                    "body": "Because the cartels have people everywhere in every company, a lot of the time the companies don't even know. If they get labelled terrorist these companies become under threat of sanctions, and so do the people just working in them unaware of any cartel influence. Due to this foreiners will probably stop investing in mexican companies because there's too much risk.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "New-Arrival1764",
            "body": "Oh no. Gun makers won’t be able to sell guns… exactly where they’re already not able to sell guns… I wonder where the Mexican government get their arms?",
            "score": 32,
            "replies": [
                {
                    "author": "RichardInaTreeFort",
                    "body": "Obama and Holder?",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "busterexists",
            "body": "Guns are already functionally illegal for the common Mexican citizen to own, so what is this going to accomplish other than making it extremely difficult/expensive to procure arms for their military/police force? No North American weapons manufacturer is going to do business with the Mexican government after this. So they'll be stuck with 2 options, pay through the nose to import European stuff or settle for dogsh*t South American junk and have the cartels outgun them even more than they are now.",
            "score": 10,
            "replies": []
        },
        {
            "author": "BP-arker",
            "body": "Big woop",
            "score": 6,
            "replies": []
        },
        {
            "author": "Darmin",
            "body": "I hope we don't label them a terrorist group. They've got enough guns as it is. We don't need to send them more!",
            "score": 19,
            "replies": []
        },
        {
            "author": "BostonInformer",
            "body": "The only understandable reason for her to not like the label is it sounds like Trump trying to justify an invasion. Her trying to point the fingers at gun companies is a dumb clap back though, is her argument that the SEMI automatic weapons that come from this country are the problem? Because the cartels are primarily using weapons that require a ton of red tape to get here.",
            "score": 5,
            "replies": []
        },
        {
            "author": "IDrinkMyBreakfast",
            "body": "Aww, the Mexican government is angry that they won’t be allowed to sell American guns to cartels. So sad for them. /s",
            "score": 4,
            "replies": []
        },
        {
            "author": "Zestysteak_vandal",
            "body": "Do we have gun companies manufacturing firearms in Mexico? Cause that seems silly. Maybe make em here. And Mexico doesn’t have to sell em.  Cause that won’t increase the amount of guns smuggled across that border.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LaTron_Flames",
            "body": "I wanna see Juan try...",
            "score": 3,
            "replies": []
        },
        {
            "author": "kanaka_maalea",
            "body": "We've heard her bluff before.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FaithlessnessSpare15",
            "body": "Cartels run the Mexican government",
            "score": 3,
            "replies": []
        },
        {
            "author": "pickles_are_delish_",
            "body": "Does anyone really give a shit what Mexico does?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lord_Hugh_Mungus",
            "body": "hmmm....Cartels....Ak 47's....made in China, Russia, North Korea, etc.  Good lucks with that.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beneficial_Slide_424",
            "body": "Legalize all drugs, problem solved. Someone selling drugs are not terrorists",
            "score": 5,
            "replies": []
        },
        {
            "author": "kyledreamboat",
            "body": "Trump is too much of a pussy to do the easy  thing. Legalized cocaine.",
            "score": 19,
            "replies": [
                {
                    "author": "goodguy847",
                    "body": "I think Fent is a bigger issue now. It’s laboratory grade being imported from china through mexico.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Barbados_slim12",
                            "body": "Do people even want to do fentanyl? Of course some do, but isn't it mostly being laced into other drugs?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "goodguy847",
                                    "body": "Yeah, that’s kinda the point. A few hardcore nut jobs do, but most users just want to blow down a line on Saturday night.  Keep the fent out and legalize coke.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SmellyScrotes",
                                    "body": "I live in a low income building where I help people get off the streets, they absolutely smoke fent, I’ve had 4 deaths in the last 6 months",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kyledreamboat",
                            "body": "I find fent to be overblown it maybe issues in the landlocked states but being near a coast has its perks",
                            "score": -15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "InTheLurkingGlass",
                    "body": "It’s not just drug that cartels deal in, it’s humans as well.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "_divi_filius",
                    "body": "legalized what now?",
                    "score": -7,
                    "replies": [
                        {
                            "author": "asdf_qwerty27",
                            "body": "Everything",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "kyledreamboat",
                            "body": "Cocaine",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "SmellyScrotes",
                                    "body": "Simple yet effective, bottom the market out in a month",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "kyledreamboat",
                                            "body": "Fun fact cocaine has pretty much remained stable all these years while upping quality.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "whoisdizzle",
                                                    "body": "Cocaine quality in terms of purity is dogshit now. I think the average for east coast areas is sub 30 percent. 100 percent should fully legalize and actually get decent shit",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aricbarbaric",
                    "body": "Go move to Oregon if you wanna be a druggie",
                    "score": -14,
                    "replies": [
                        {
                            "author": "kyledreamboat",
                            "body": "Hmm I don't think you understand what sub you're in republican",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "Go move to China if you wanna be an authoritarian.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "aricbarbaric",
                                    "body": "I don’t want cocaine or any hard drugs legalized so I’m authoritarian? You need to lay off the “democrat” propaganda. You wanna ruin your body that’s your choice, but don’t make it more readily available to people.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Foreign_Ad_7504",
                                            "body": "\"I don’t want cocaine or any hard drugs legalized so I’m authoritarian?\"\n\n🙄 yes, that's exactly what that means. Where do you people come from?\n\n\"I'm not authoritarian! I just want to tell people what they can and can't put in their body.\"\n\n🤦‍♂️",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "aricbarbaric",
                                                    "body": "I just want you to continue to smoke your crack illegally? Whatever man, enjoy. Luckily most hard drugs are a self inflicted, manifestations of Darwinism.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EasyCZ75",
            "body": "![gif](giphy|GzeASHCqjvLbOgD0bC)",
            "score": 5,
            "replies": []
        },
        {
            "author": "keeleon",
            "body": "Lawsuits for what?",
            "score": 2,
            "replies": []
        },
        {
            "author": "lethalweapon100",
            "body": "Sheinbaum - a good Hispanic name",
            "score": 2,
            "replies": []
        },
        {
            "author": "Proper-Ride6722",
            "body": "What an odd thing to say..",
            "score": 2,
            "replies": []
        },
        {
            "author": "HKatzOnline",
            "body": "So, she is a typical leftist - going after the tools the criminals use instead of the criminals themselves. Maybe she should go after the vehicle manufacturers as well as the criminals drive those to kill people.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jsar16",
            "body": "You stop your drugs and we’ll stop our guns.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hazael10",
            "body": "ah yes the old i do this, but run to my mommy’s lawyer anytime it backfires good ol’ shitRICA!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darth_Meider",
            "body": "This is either  the best or the worst timeline we are in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded_Chart10",
            "body": "Just take over Mexico bruh",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikenanamoose",
            "body": "https://preview.redd.it/c496azwq7bje1.jpeg?width=1290&format=pjpg&auto=webp&s=fcbf56a9dce16e008b1360272401abcbef50ac3b\n\nSo here are a couple of sources I found on the matter. The confusing part is that the way these are written the timeline of events goes as such: (1) Mexican president claims US guns are coming down across the border and points to US gun stores as accomplices. (2) Mexican president will pursue legal action against gun stores in specific states/manufacturers if cartels are  labeled foreign terrorist organizations. (3) US president threatens Mexican President with labeling cartels are terrorist organizations if she pursues legal actions against gunmakers.\n\nIt’s the use of the phrase “Meanwhile Trump threatens to…” that sounds like the above order of events is happening. Something sounds off about it all and I feel like we are missing an event before the first one listed above.\n\nAlso, I have noticed this sub is getting a lot of pictures of sections of news articles or headlines with no sources. I get that everyone wants to bitch and moan about current events, but can we all agree to site sources in one form or fashion?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Newbie_SciFi_Fan",
            "body": "Mexico trying to sue US gun manufacturers would be almost as ridiculous as Russia trying to collect that $20 decillion fine from Google \n\nLet the sabre rattling about war with the cartels not distract from the fact that these soon to be \"terrorist\" organisations only exist because of government regulation \n\nTrump at the moment is like a chicken with his head cut off, one moment suggesting an admittedly good move of cutting defense spending by 50%, only then to turn around and suggest a combination of everyones least favourite wars ever: the war on drugs and the war on terror",
            "score": 1,
            "replies": []
        },
        {
            "author": "cordoba172",
            "body": "Where do you think all their American made weapons come? I agree with her",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pondorous_",
            "body": "Sheinbaum is such a beautiful hispanic last name",
            "score": 1,
            "replies": []
        },
        {
            "author": "CollectedHappy3",
            "body": "If they did anything about the cartels and stop getting paid off by them, maybe we wouldn't have to label them. Terror organizations for terrorizing American citizens. How many border patrol agents need to have guns pointed at him before we just take them out? So tired of this political b******* someone do wrong punish them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "popcultminer",
            "body": "Mexico is not a serious place.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Klik23",
            "body": "Better start taking away American made guns from the cartel and using it as evidence against the American gun manufacturers.",
            "score": 0,
            "replies": []
        },
        {
            "author": "mechanab",
            "body": "Coming to the defense of drug cartels. So typical of the Mexican government.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Tandoori7",
            "body": "Imagine using fentanyl one day and next day you are accused of financing a terrorist organization.\n\nThat would be fun tbh",
            "score": -6,
            "replies": []
        }
    ]
}