{
    "title": "Fitting description of most college professors in the humanities",
    "author": "delugepro",
    "subreddit": "Anarcho_Capitalism",
    "rank": 275,
    "score": 300,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 30,
    "url": "https://i.redd.it/vtx4hy8c9lje1.png",
    "id": "1ir69p5",
    "selftext": "",
    "comments": [
        {
            "author": "Crabapple321",
            "body": "So basically Reddit",
            "score": 22,
            "replies": [
                {
                    "author": "Ifyouwant67",
                    "body": "I'm starting to think reddit was receiving money from USAID.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "AgainstSlavers",
                            "body": "I have no doubt.  May have been USAID-paid hitman who murdered Aaron Swartz.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Ifyouwant67",
                                    "body": "👍",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Alternative-Dream-61",
                            "body": "I don't agree with everything USAID was spending money on, but it did provide the important benefit of projecting soft power and US hegemony.  It's like the Marshall Plan.  It's difficult to say exactly how it benefitted us financially, but it was a massive benefit against the Soviets and opening up new markets for US products.\n\nThe Belt and Road initiative will replace it (and likely be better in the long run for a number of countries).",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ToxicRedditMod",
            "body": "Having worked in academia, the Humanities and the soft sciences had the nuttiest, politically outspoken (even in the classroom) professors.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Rieux_n_Tarrou",
            "body": "THose whose whole careers have been spent in ivy-covered buildings are known as \"experts\" by mainstream media",
            "score": 9,
            "replies": []
        },
        {
            "author": "sanguinerebel",
            "body": "I was sheltered from this having gone to a private college where every single professor had to have also had real career experience in a field relative to the subject they teach. I've definitely seen that present in other areas of life though where you have these people who everything they know is either out of a book or from theoretic discussion without any of it being put to the test in real applications. These types should not be looked to with respect or to learn from. I think they have a place in society, often coming up with innovative ideas, being thinkers, but their ideas need run through the filter of practical use before they are given any weight or trusted. Some ideas that sound great end up being a dumpster fire when put to the test.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Darmin",
            "body": "Military members and fed employees that haven't ever held a real job, or it's been 15+ years so they don't know shit anymore trying to tell dudes \"you can't get out, the job security here is amazing\"\n\n\nDUDE I DONT NEED JOB SECURITY, IM ACTUALLY JUST GOOD AT MY JOB",
            "score": 3,
            "replies": []
        },
        {
            "author": "Space-Knife",
            "body": "Education is simply newspeak for indoctrination",
            "score": 3,
            "replies": []
        },
        {
            "author": "KingRexxi",
            "body": "This also brings to mind a similar situation with career politicians. Those living in government buildings in DC and have been for the past 20 years are completely out of touch with what the average American life looks like.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bluefootedpig",
            "body": "Didn’t he only work in academia? What real world experience does he have?",
            "score": 1,
            "replies": [
                {
                    "author": "denzien",
                    "body": "He grew up in poverty in Harlem and worked manual and service jobs, supported himself through college. Served in the Marine Corps during the Korean War. Worked in the Department of Labor (where he saw how inefficient government was). Worked as an Economic Analyst at AT&T\n\n[https://www.tsowell.com/cv.html](https://www.tsowell.com/cv.html)\n\nOtherwise, yes. Mostly Academia. Where he can see and interact with other Academics and critique them.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "denzien",
            "body": "Must be nice",
            "score": 1,
            "replies": []
        },
        {
            "author": "MindOverManner69",
            "body": "Anti-intellectualism, one of the many great features of fascism!!!",
            "score": -1,
            "replies": [
                {
                    "author": "Ayjayz",
                    "body": "Breathing air is also a feature of fascism. If you keep breathing you're fascist!\n\nOr maybe correlation is not causation.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MindOverManner69",
                            "body": "The education is indoctrination crowd are anti-freedom and fascist wannabes.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Thomas Sowell is an academic. The point he makes fairly frequently isn't that intellectualism is bad per se, but that intellectuals with no experience in the real world are stunted people who come to incorrect conclusions due to their own arrested development.\n\nHe's also speaking from personal experience, I believe he worked outside of academia for about a decade between his master's and doctorate. Not everyone who's being critical of academics is anti-intellectual, in the same way that not everyone being critical of specific kinds of police officer is against law enforcement as a whole.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MindOverManner69",
                            "body": "I know who Uncle Ruckus is, don't kid yourself. And there is only 1 side that constantly pushes for anti-intellectualism in the US and that's conservatives.\n\n\"Colleges are liberal indoctrination centers\" - 1000 times a day.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "How could you conceivably think that being racist about someone I clearly like and respect enough to know his background would make me want to listen to you?\n\nI would suggest deleting all your social media for a few weeks/months. Not forever, just take long enough to regain control over your emotions. Outbursts like this don't help you, they don't help bring people into your way of thinking, and they make your life actively worse by bringing unnecessary, unproductive negativity in.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "MindOverManner69",
                                            "body": "I feel like he's a faux intellectual who has accomplished fuck all that will be remembered .\n\nI find it hilarious that he's criticizing people for doing nothing when he himself has had little to no impact on anything. He left academia years ago to become a token conservative pundit claiming racism will go away if we stop talking about it.\n\nSo what real life work experience does this guy have to make him so above the other people in academics? Hey? Explain to me that one.\n\nGuy is a fucking phony and a sellout.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "You're getting pretty worked up about someone who you claim won't be remembered, my dude. I usually just don't remember people who I think won't be remembered instead of fighting randoms about them online.\n\nDo you really think that I'd put together an elaborate defense for you that we both know would mean nothing to you? You're radicalized and emotional enough that you're trolling subreddits of people you dislike just to get in internet fights, it's not like I'm gonna write you a 300 word political post that will abruptly change your perspective. We both know that you closed the door to a productive political dialog immediately with your hostility and racism, it was a deliberate choice you made.\n\nThe best thing I can do for you is, again, to encourage you to disconnect from it all for a while. This clearly isn't good for your wellbeing. You might find when you come back that you're actually an effective communicator when your mind isn't clouded by real-life frustrations you aren't dealing with, and you've achieved the distance necessary from a silly forum to not become immediately emotional.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Official_Gameoholics",
                    "body": "Socialism*",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MindOverManner69",
                            "body": "I dont hear socialists claiming school and education are bad, sorry.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Official_Gameoholics",
                                    "body": "Clearly you haven't seen Mao's China, Stalin's USSR, Hitler's Germany, Pol Pot's Cambodia, and Kim Jong Un's North Korea.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MindOverManner69",
                                            "body": "Your point proves that fascist dictators are bad, not that socialism is anti-intellectual.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Official_Gameoholics",
                                                    "body": "Last I checked, none of those listed are Fascists. They held philosophies separate from Actual Idealism.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Will-Forget-Password",
            "body": "You do not even go to college.",
            "score": 0,
            "replies": []
        },
        {
            "author": "pean-",
            "body": "Thomas Sowell isn't worth the kilobites it takes to store this asinine quote. I'd sooner accuse ivy league professors of being bourgeois than call them sheltered. I think having that much money and prestige allows for a much more in depth understanding of how the current liberal world order actually functions.",
            "score": -3,
            "replies": []
        }
    ]
}