{
    "title": "Your soul is in your sperms",
    "author": "CauliflowerBig3133",
    "subreddit": "Anarcho_Capitalism",
    "rank": 273,
    "score": 0,
    "upvote_ratio": 0.07,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1isw2x6/your_soul_is_in_your_sperms/",
    "id": "1isw2x6",
    "selftext": "Your soul is in your sperms. \n\nIf you get rich bang hot bitches you won't go extinct but can live again through your children. \n\nMore soul can be transferred by teaching your sons programming, businessees, and how to get rich bang hot bitches and your daughters to have rich baby daddy.\n\nSelf is illusion. So is selfishness. What's selfish is not you but your genes. They alone have utility function. Not you. \n\nThe purpose of life is not to just live forever but to live so many times you never escape samsara. \n\nhttps://en.m.wikipedia.org/wiki/The_Selfish_Gene\n\nSo how does this affect libertarianism? \n\nWell. We concentrate too much with how hard work and good choices to a guy's best interests. But a person best interests is often not well defined.\n\nInstead we should think. How can more economically productive people have more children instead of mere more money. Should they choose too of course. Easily and simply. ",
    "comments": [
        {
            "author": "NeilDiamondHandz",
            "body": "Sir, this is a Marxist bread line.",
            "score": 6,
            "replies": [
                {
                    "author": "DreamLizard47",
                    "body": "there is no bread",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Vinylware",
                            "body": "The bread was a lie",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheseusTheFearless",
            "body": "I've read the selfish gene and it's an incredible book that can really change how you view biology. However I don't think it should have any relevance to how you determine your purpose in life.",
            "score": 2,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "Why not?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Knorssman",
            "body": "Mysticism around the soul in your sperm cells ain't it",
            "score": 2,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "Works for me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Will-Forget-Password",
            "body": "Did you really just say women have no soul?",
            "score": 1,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "They have eggs that works differently. \n\nThe purpose of all living beings is to reproduce. \n\nThose who fail don't live.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Will-Forget-Password",
                            "body": ">The purpose of all living beings is to reproduce.\n\nSays who? \n\n>Those who fail don't live.\n\nThey die. They did live though. \n\nHow does this theory even begin? One soul in a man would mean we are all the same soul.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CauliflowerBig3133",
                                    "body": "Saya evolution theory. \n\nIf humans have a trait, like selfishness, then chance is those traits are genetically hardwired. \n\nGenes that makes you selfish reproduce and become Commons. Genes that makes you unselfish go extinct and uncommon. \n\nThe soul thing is a joke. I make it sounds like religion. \n\nWe have no souls. We have genes and thoughts. Those reproduce differently",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Will-Forget-Password",
                                            "body": "Sorry I messed up your joke. \n\nI do not really disagree with the selfish gene theory. My concern is that the selfishness is aggression. Before incentivizing more of something, we should justify any of something. From my perspective, selfish gene theory is \"might makes right\".",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GoogleFiDelio",
            "body": "Does that mean my soul covers your mom's tonsils?",
            "score": 0,
            "replies": []
        }
    ]
}