{
    "title": "This was posted on the official White House X account. You can't support Trump and call yourself an AnCap.",
    "author": "Schowzy",
    "subreddit": "Anarcho_Capitalism",
    "rank": 255,
    "score": 0,
    "upvote_ratio": 0.47,
    "num_comments (reported by reddit)": 76,
    "url": "https://i.redd.it/tz5gei8mt6ke1.jpeg",
    "id": "1itl5o0",
    "selftext": "AnCap is when we vote for an emperor to bend us over right? It's fine though because he said he's gonna cut government spending! Right?",
    "comments": [
        {
            "author": "AToastyDolphin",
            "body": "His ego is unfathomably massive, nothing new. He can call himself whatever makes him feel better if he shrinks government in the process. I think actions speak louder than words, but I will eat my words if the government is larger when he leaves office. I just wish he would shut up for once. ",
            "score": 37,
            "replies": [
                {
                    "author": "Fun_Assignment_5637",
                    "body": "this is exactly my take. He is an asshat same as Musk. But I am an adult and judge people based on their actions rather than their pure speech. Thanks to Trump we have TikTok back. If it was Kamala there, the zionist congress would have completely removed TikTok from the App Store. So I'm happy with Trump and it's all relative. I'm happy because Trump is better than the democrats. I don't agree with the Republicans on pushing their Christian morals but the Demoncrats are in a whole different level of stupid. Some people are idealistic and can't understand that everything is relative.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "AToastyDolphin",
                            "body": "Yup, Trump and Musk are both miserable people who will do anything to “own the libs”, but it’s hard to be mad when you think about what Kamala would be doing as president right now. ",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ya_Boi_Konzon",
                    "body": "💯",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "tvrin",
                    "body": "My prediction - he will grow the government, replacing existing institutions with ones loyal to him. He will not reduce spending, while nominally cutting taxes he'll finance the state through inflation. He will target the some institutions particualrly, especially those that people are (often rightly so) fed up with to gain popular support, but soon new will appear, pushing his agenda. He might sometimes make a \"good will gesture\" that costs him nothing, like pardoning Ulbrich. I will eat my words if none of those things will happen.\n\nHe is as authentic as \"free speech absolutist\" Musk banning people for criticising certain politicians. Being different flavor of authoritarian does not make you libertarian.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AToastyDolphin",
                            "body": "To my knowledge, neither of them have ever called themselves Libertarian. The closest they got was Trump saying he will free Ross if he wins, which he did.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JollyDwarf",
            "body": "What are your views on Burger King? Can an AnCap eat there?",
            "score": 30,
            "replies": [
                {
                    "author": "Banned_in_CA",
                    "body": "Burger King has no standing army.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kurokamifr",
                            "body": "only officially",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nolobrown",
                    "body": "As long as he’s not a clown",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "casinocooler",
            "body": "His narcissism is what is driving this whole operation. He wants to be known as the president who saved America and future generations. Even narcissists can do good for society. I support his actions so far. This is the closest thing to ancap I have witnessed in my lifetime. Significantly better than any other president in the last 50 years and better than Kamalama ding dong.",
            "score": 4,
            "replies": [
                {
                    "author": "GoogleFiDelio",
                    "body": "If he manages to pull us out of the spending crisis he could actually take credit for saving the country. We've been on the Cloward–Piven path for too long.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Schowzy",
                    "body": "If you support a tyranical statist when he's doing things you like, you aren't an ancap.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "casinocooler",
                            "body": "Who am I supposed to support? These are the greatest revelations in my lifetime. If they can cut 50% of the waste I will be ecstatic. I would like perfection and a more noble champion but until now I thought I would never see even modest cut backs. The bureaucracy was so thick this is the only way any of this would be remotely feasible. I don’t think any of us here like him as a person we like that he is slashing waste and government left and right. Even a war or revolution would have less effect on the bureaucratic institutions than we are seeing. This is amazing and you can call us whatever you like. Maybe you can be the last remaining “true” ancap. I don’t care this is amazing.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "upchuk13",
                                    "body": "The idea that he can cut 50% of spending is utterly fanciful.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "casinocooler",
                                            "body": "I said 50% of the waste. To cut 50% of the spending would require changes to Medicare/medicaid and social security and I don’t think that will happen.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "upchuk13",
                                                    "body": "How would you know what is or isn't waste?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "casinocooler",
                                                            "body": "Waste is anything that doesn’t add value to a process or customer. Customer being the majority of tax payers/voters knowing they are not mutually exclusive.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "deefop",
            "body": "I don't support Trump, but I support any and all damage that he does the the hegemony and the cathedral while he's there.",
            "score": 5,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "I mean how much of an utilitarian can we be, he might do good stuff, but he is also supporting a dictator in russia who currently is behind about 2 million wounded and killed. I surely couldnt stand behind trump, even if he trimmed the federal government.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "deefop",
                            "body": "The US is more to blame for Ukraine than Russia is, frankly. We pushed for that to happen for years, and then American politicians went to Ukraine and encouraged them to line up and die fighting Russia.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "really, if thats the case i would ask you, should ukraine be able to choose to be in a trade association with eu without getting invaded by russia?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fraide",
            "body": "Ok.",
            "score": 10,
            "replies": [
                {
                    "author": "T_Noctambulist",
                    "body": "Anyways...",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "TexFarmer",
            "body": "No, but I can wholeheartedly support what he is doing to the federal government workforce!",
            "score": 3,
            "replies": []
        },
        {
            "author": "muffinman210",
            "body": "Get your head out of your ass. A magazine cover? Really? Ignore that for just a moment. What is he ACTUALLY doing? \n\n>You can't support Trump and call yourself an AnCap.\n\nWhat, because he's in a government position? Have you not noticed all the gov employees fired? How about certain tax funded organizations getting dismantled to cut costs?",
            "score": 3,
            "replies": [
                {
                    "author": "IC_1101_IC",
                    "body": "They are either one of two things, a naive idiot who thinks that any progress with government to its destruction is bad because government bad, ergo, hoppe style (Wha why can't the government go away tomorrow morning) type stuff, or an leftist-leaning 'ancap' who desperately wants to fit in with the leftist mob around them. Either way, they are to be ignored.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HesperianDragon",
            "body": "Next you are going to tell me I can't enjoy the music of Biggie Smalls because he wore a plastic crown one time.\n\nhttps://preview.redd.it/oy1n6iyou6ke1.jpeg?width=864&format=pjpg&auto=webp&s=d889ae682af0d772b025d4946b544d7aa84cf60e",
            "score": 21,
            "replies": [
                {
                    "author": "timeforchorin",
                    "body": "Hahaha totally the same thing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Classh0le",
                    "body": "holy non sequitur fallacy batman!",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "not_slaw_kid",
                    "body": "Which positions of political power did Biggie Smalls hold when this image was created? I'm curious, because it must be a pretty big one or, y'know , you would be comparing a musician doing a publicity stunt with a politian who has well-documented authoritarian beliefs stating his intentions to be authoritarian, and that would be pretty fucking dumb. And yet... I don't seem to remember hearing anything about president Biggie 🤔",
                    "score": -4,
                    "replies": [
                        {
                            "author": "GoogleFiDelio",
                            "body": "He was the King of New York, moron.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JonZ82",
                    "body": "Completely out of context, nice strawman ya got there. \n\n\"Long live the king\" should be a warning as well. This subreddit is shit with fascists running around.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "jimmietwotanks26",
                            "body": "https://preview.redd.it/vgpevh72w6ke1.png?width=517&format=png&auto=webp&s=bfb006d62cd9877ae17fec256b11427b18698a56",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Classh0le",
                            "body": "calling people you disagree with fascists is also shit. Man this sub has really taken a nosedive compared to 10, 12 years ago",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_up_and_atom",
            "body": "Were you a federal worker that got fired? How is he bending you over?",
            "score": 5,
            "replies": [
                {
                    "author": "Schowzy",
                    "body": "Nope, I can just see that this guy thinks he owns us. If you're only an AnCap when the state does things you don't like, you aren't an AnCap. You don't get to support a statist and still call yourself an ancap just because he's doing things you agree with.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "_up_and_atom",
                            "body": "Got it.\n\nDo you agree in principle with some of the stuff he and / or the DOGE team are doing?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Red_Igor",
            "body": "There are reason to criticize some Ancaps and libertarians love of Trump, but a magazine cover, not one of them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ellisschumann",
            "body": "No, but I can point and laugh. I can also acknowledge when he scores a point for the freedom movement.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GoogleFiDelio",
            "body": "You guys spent the first four years of Trump taking his jokes seriously and treating his serious opinions as jokes.\n\nAre you going to continue making that mistake for the next four years?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "Methinks he's trolling and now you're seething. Works every time it seems. Just ignore next time.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Vinylware",
            "body": "It's amazing how many people will support on this sub without realizing that he caused the inflation to sky rocket back in 2020 during his final months in office.\n\nHe will continue to bend the economy over and run it into ruin, he is no savior.",
            "score": 6,
            "replies": [
                {
                    "author": "PaulTheMartian",
                    "body": "He started it and Biden continued it. Now he’s going to be at the helm while the general public continues to deal with the resulting inflation",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Vinylware",
                            "body": "Precisely.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GoogleFiDelio",
                    "body": "Did Trump cause the inflation or the the idiotic response to the scamdemic cause it?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Vinylware",
                            "body": "He was responsible for the pandemic response.\n\nYou can go back and view him giving the order to lockdown; ordering the fed to print more money into circulation via the unemployment checks. As much as I hate Biden, he didn’t start it —Trump did.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "Wrong, the far left was the faction hyping COVID and lockdowns\n\nTrump couldn't lock anyone down, that's a state level thing. That's why GOP governors pulled their states out of them early as Dems attacked them for killing grandmas. \n\nDem states stayed locked down for years.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Vinylware",
                                            "body": "Yet, many largely populated GOP states like Texas, Florida, and Tennessee still locked down, despite these claims. It wasn’t just the far-left calling for it, neo-cons and conservatives were also calling for it in congress and supported the motion.\n\nFrom my experience living in a state run by a dem gov., we had opened up at the same time as the rest of the country, it was rocky and slow, but it did get passed. Trump has been avoiding taking responsibility for playing a role in the poorly managed response. He could’ve veto the motion, but his actions speak for what happened during that time.\n\nI’ll give him credit for going against the vaccines developed by big pharma, but that’s about it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "GoogleFiDelio",
                                                    "body": ">Yet, many largely populated GOP states like Texas, Florida, and Tennessee still locked down, despite these claims.\n\nYep, the propaganda and lies were think. We locked down for a few months. California and New York for years. That's the difference. \n\n>From my experience living in a state run by a dem gov., we had opened up at the same time as the rest of the country, it was rocky and slow, but it did get passed.\n\nWhich state?\n\n>Trump has been avoiding taking responsibility for playing a role in the poorly managed response. He could’ve veto the motion, but his actions speak for what happened during that time.\n\nNo, he literally didn't have a \"veto\" power over the actions of governors.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Vinylware",
                                                            "body": "To answer the state question, Michigan. The state opened back up around the end of 2020 to early 2021; wasn’t \"years\" here. It was rocky because of the propaganda being pumped out from our Capitol Hill and damaged state economy.\n\nWhat I was referring to in veto is congress and senate, they were also part of issuing the restrictions laid onto the public, wasn’t just the governors. I will admit to being wrong on that account. However, doesn’t change the fact that many GOP governors still enacted and followed through with the lockdowns and restrictions.\n\nHere what I do want some clarification on is your statement \"…the propaganda and lies were think.\" Did you mean \"…were working?\" I assumed that’s what you meant. But keep in mind, republicans in those states were also responsible for the propaganda and lies spreading around, although it was in a different vain (and no I’m not talking about big-pharma here).",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "GoogleFiDelio",
                                                                    "body": "LOL Whitler. You still had schools closed and mask mandates in 2022.\n\n>What I was referring to in veto is congress and senate, they were also part of issuing the restrictions laid onto the public, wasn’t just the governors\n\nWrong, it was mostly state level. And the House was controlled by the Democrats at the time, who were trying to destroy Trump by any means necessary and impeaching him. Do you think they would have cooperated in scaling back the economic terrorism?\n\n>I will admit to being wrong on that account. However, doesn’t change the fact that many GOP governors still enacted and followed through with the lockdowns and restrictions.\n\nYep, and when they became the first to back off they were called \"DeathSantis\" and grandma killers who put profit above lives. There's no way to spin this into a DNC win.\n\n>Here what I do want some clarification on is your statement \"…the propaganda and lies were think.\" Did you mean \"…were working?\" I assumed that’s what you meant.\n\nOther views were illegally censored. Only the official big lie was allowed.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Vinylware",
                                                                            "body": "Actually no, our mask mandates were mostly optional-to-nonexistent by the summer of 2021, went on a trip across the state during that time and saw first hand that most people weren’t wearing masks.\n\nI’m not making a pro-dnc case here, I’m pointing out the errors the gop had done.\n\nI do not support Whitmer, she’s a vile politician who has caused mass death with her policies during the lockdowns and has poorly managed the new bipartisan rebuilding of the roads. Not much progress has been made.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GoogleFiDelio",
                                                                                    "body": ">Actually no, our mask mandates were mostly optional-to-nonexistent by the summer of 2021, went on a trip across the state during that time and saw first hand that most people weren’t wearing masks.\n\nYet the schools were closed and a bunch of idiotic tyranny was in place.\n\n>I’m not making a pro-dnc case here, I’m pointing out the errors the gop had done.\n\nPretty much all of them were forced by the DNC propaganda the pervaded everything.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Vinylware",
                                                                                            "body": "Schools in Michigan were closed until the fall of 2021. Once again I can attest to this because I attended in-person lectures at my college at that time. In conclusion, we were shut down for one and a half years, not two or three. It sure felt like that, of course but the reality was that it was relatively short.\n\nEdit: changed \"end of summer of 2021\" to \"the fall of 2021.\"",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "GoogleFiDelio",
                                                                                                    "body": ">Schools in Michigan were closed until the fall of 2021. \n\nThe internet says otherwise. K-12 was still closed or remote and you had kids wearing rags on their faces.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Vinylware",
                                                                                                            "body": "Again, I can attest to the schools being opened-up during the fall of 2021.\n\nIn addition, it depended on the businesses/institutions you were going to that dictates whether or not a customer (or student) had to wear a face mask. Even then, there were more people going maskless by the summer of 2021.\n\nWhat may be happening is that the sources you’re using are going over a brief generalization of what was being speculated by those outside the state or in our major cities, I cannot say for sure if that is the case or no considering you have not shared these sources.\n\nHere is what I can confirm for you:\n\n1.) Cities such as Lansing, Detroit, and Ann Arbor were still pushing for mask mandates, while rural areas and smaller cities (I.e., Traverse City, Mason, and Okemos) were not pushing the mandates.\n\n2.) Schools had opened up in the fall of 2021 for both colleges and K-12, with the caveat being that it was mandatory for students to wear a mask (this was taken out of effect by early 2022).\n\n3.) People in Michigan were already in the process of de-masking in the summer of 2021, and wherever you went it was more likely to see someone without a mask than with a mask in numerous areas across the state.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                    "body": ">Again, I can attest to the schools being opened-up during the fall of 2021.\n\nK-12 wasn't.\n\nAs to the rest of it your state was still farm more stupid about COVID than mine, Texas, and I'm correct that the GOP>DNC on this issue.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Vinylware",
                                                                                                                            "body": "Don’t know what else to tell you other than the personal experience of actually living in my state during 2020-2022.\n\nK-12 & colleges were open in the state of Michigan during the fall of 2021, family members of mine were attending high school at that time and I was attending college.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                    "body": "Anecdotes mean nothing.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Vinylware",
                                                                                                                                            "body": "As I've stated, I do not know where you're getting that information from, leading me to believe it was a GOP-centered article(s).\n\nHere is [ballotpedia](https://ballotpedia.org/School_responses_in_Michigan_to_the_coronavirus_(COVID-19)_pandemic) with a timeline of Michigan's coronavirus response/schools opening back up, because the information you are providing is heavily incorrect to what actually occurred in Michigan.\n\nSchool attendance had drop significantly as a result of the lockdowns, but as previously stated schools were mostly in-person by the fall of 2021.\n\nHere is an article from the [MLive](https://www.mlive.com/news/2021/06/from-masks-to-learning-loss-these-are-5-big-questions-facing-michigan-schools-this-fall.html) from June 27, 2021 discussing the re-opening of schools in Michigan.\n\nAn article from [ChalkBeat](https://www.chalkbeat.org/detroit/2021/1/26/22249109/michigan-classrooms-reopening-pandemic-continues/) from January 26, 2021 discussing schools reopening and making comments on the attendance decline and uncertainty of the times prior to the 2021 fall school year.\n\nEdit: added more articles to help support this position.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "afieldonearth",
            "body": "No government >>> Monarchy >>>>>>>>>>>>>>>> Democracy",
            "score": 4,
            "replies": []
        },
        {
            "author": "chub0ka",
            "body": "But you can support Zelensky the dictator?",
            "score": 3,
            "replies": [
                {
                    "author": "Schowzy",
                    "body": "When did I say I did?",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cryptolingo",
            "body": "It’s a bad look, no doubt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Practical_End4935",
            "body": "Biden never called himself a King. He worked his whole life to increase the size of the government. I’ll take my chances with Trump",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ya_Boi_Konzon",
            "body": "Monarchy is more libertarian than democracy.",
            "score": -1,
            "replies": [
                {
                    "author": "Vinylware",
                    "body": "No, that's not true at all. Neither monarchism or democracy are libertarian in nature.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "GaussAF",
                            "body": "There's a book on this called \"Democracy, the God that Failed\" by Hans Herman-Hoppe\n\nBasically, the way he explained it was that the incentive structure that exists in a monarchy usually leads to a more (obviously not perfect) libertarian outcome than a Democracy because the monarch is incentivized to grow the overall value of their Kingdom over a long time horizon (it's like a business they own that pays them a dividend that's hard to sell) whereas the bureaucrat in a democracy is only there briefly so they operate on a very short term scale to transfer value to themselves or to those who can help them later without as much consideration of the long term consequences.\n\nThe former is optimized by minimal regulation and welfare and, in general, minimal zero sum pvp games. The latter is optimized by the opposite of this. \n\nThe overall tax rates when Europe was dominated by hereditary monarchies was 5-8%. The Arab gulf states are monarchies today and have very low tax burdens. So the reality seems to match the model.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Vinylware",
                                    "body": "I don't necessarily agree with Hoppe on this.\n\nI know of the book, and it's on my list of books to purchase. Yet coming from a historical background, monarchism is nothing short of being more related to totalitarianism (see France, England prior to its parliamentary rule, Holy Roman Empire, and aristocratic Russia).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "GaussAF",
                                            "body": "It is totalitarian in that a single person sets the rules, but the rules that are set tend to be minimal and you have less corruption because the king takes x% of the total GDP for himself so minimizing corruption and zero sum games actually has the effect of improving the king's profit whereas the opposite is true in a Democracy.\n\nLook at first world countries today that are monarchies like the Gulf Arab States and you'll see that the % of the people's income that goes to the government is actually much smaller than in most Democracies. The regulations if you start a business in those countries is much lighter as well.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Vinylware",
                                                    "body": "Monarchies were (and still are) riddled with corruption, by no means would a king take a specific amount of the national GDP for himself result in  minimizing corruption.\n\nThat percentage is the heavy taxation imposed upon the serf class and minor nobility when collectors showed up.\n\nMiddle eastern monarchies have a guarantee with the United States and other western powers because of their massive oil reserves and strategic importance to the U.S. military.\n\nHow can Hoppe be certain that corruption would completely diminish? What stops the king from violating the NAP if he is the sole central power dictating and enforcing the laws?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "GaussAF",
                                                            "body": "Corruption exists in both systems, it's never zero\n\nHowever, the hereditary monarchies of Europe prior to their disappearance after the world wars only taxed 5-8% of GDP on average.\n\nThe UK now sits at ~40%, Germany ~38, France ~43%, \n\nThe UAE sits at ~17%, Qatar ~6%, Saudi Arabia ~3%\n\nSo even with the massive amount of money the monarchs pay themselves, it still costs less to live under one than a democracy historically\n\nYes, the Gulf states don't need as strong a military because they have the US to protect them. However, that's not any different for Europe, they lean on the US in the same way so that doesn't explain the difference.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Schowzy",
                    "body": "I don't think you know what any of those words mean.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "IC_1101_IC",
            "body": "Monarchy better then Democracy every day of the week.",
            "score": -1,
            "replies": []
        }
    ]
}