{
    "title": "\"The U.S. healthcare system is free market healthcare gone amuck\" Meanwhile, the U.S. healthcare system: (also, plz sub to r/USHealthcareMyths. Debunking such myths is arguably the most conducive to promoting libertarian ideas - it strikes at the core of Statist confusion)",
    "author": "Derpballz",
    "subreddit": "Anarcho_Capitalism",
    "rank": 193,
    "score": 50,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 6,
    "url": "https://i.redd.it/8op3qnjm1oke1.jpeg",
    "id": "1ivfqbh",
    "selftext": "",
    "comments": [
        {
            "author": "s3r3ng",
            "body": "Only a complete idiot would say we have free market healthcare in the US.  Government has been all over it for many decades now.",
            "score": 12,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "never had free market healthcare anywhere in the world.  \"Healthcare\", \"provider\", \"doctors\",\"hospital\" etc  are all defined by legal definitions.  Free market healthcare is just items and services undefined.  \n It's a linguistic nightmare to try to parse the differences due to usurpation of words. \"eastern medicine\" or \"native medicine\" are essentially the best ways to try",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zealousideal-Skin655",
                    "body": "Why do you think free market is always perfect? Where has free market healthcare worked?",
                    "score": -4,
                    "replies": [
                        {
                            "author": "mspgs2",
                            "body": "In my life time? Probably no true free market system exists.  Government always has some level of control.\n\nNow on a small scale \"concierge healthcare\" is the closest thing with minimal government.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rumblemcskurmish",
            "body": "A free market is i go to one of 15 diff burger joints all competing on the basis of price and quality.  Not the state limits supply and fixes prices so that I have very few options",
            "score": 4,
            "replies": []
        },
        {
            "author": "Cosmic_Spud",
            "body": "It'll never be so until people finally get over the fact that it is a business like any other.  If you cant afford care, nobody has an obligation to help you.  Doctors aren't slaves and neither are your neighbors.  \n\nThe prices would be far lower if the doctors didn't get auto-payments from insurance companies though.  They'd have to compete like every other industry.  \n\nI do like that there are emergency services, but I'm not sure how best to pay other than credit default services. You don't pay it off, your credit is dinged.  It'd be easier if the prices were real and not inflated.",
            "score": 2,
            "replies": []
        }
    ]
}