{
    "title": "Unpopular opinion: If you don’t pay your rent, the owner of the property has every right to kick you out",
    "author": "Ill_Reputation1924",
    "subreddit": "Anarcho_Capitalism",
    "rank": 144,
    "score": 616,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 218,
    "url": "https://i.redd.it/riqlbcgkp1le1.jpeg",
    "id": "1iwx4d6",
    "selftext": "found this garbage while doomscrolling ",
    "comments": [
        {
            "author": "TheKanonFoder",
            "body": "If you stop evictions then you're stealing from the person who owns the house. And everybody will stop paying the rent. This blind hatred towards anybody who's better off than you will never propel society forward it'll just drag it back into the dark ages",
            "score": 183,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "> And everybody will stop paying the rent.\n\nAnd then no one will rent anything out anymore, and the housing shortage will worsen by orders of magnitude.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "URNONEXISTANTPP2",
                            "body": "because there wont be anything TO rent out",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IanMoone007",
                    "body": "And they are stealing from the government who is the ultimate landlord since basically almost nobody truly owns real estate.   I was thinking about that yesterday. Let’s say they get their wish. No more evictions. Fine. You still have to pay the property taxes. Oh and the maintenance when it happens. Failure to do that will be enforced by the code enforcement, and since the penalty can’t be eviction, the only solution is… jail.   The logic won’t be followed by those who believe landlords shouldn’t exist.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Emergency_Accident36",
                            "body": "no one goes to jail for owing taxes,  they go to jail for gross misrepresentation.  Let's atleast get that straight",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "IanMoone007",
                                    "body": "I know that now but if no one could be evicted from a residence then why would they pay property taxes and who would buy it?  You’re stuck with whomever is living there. I’m saying the local governments would have to change the law to be able to collect those taxes and also do code enforcement because why would someone voluntarily make fixes to a property if there is basically no other way to enforce the law. Right now a property owner can lose their property if they don’t follow code enforcement.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "International_Lie485",
                                    "body": "Tell that to Wesley Snipes.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Emergency_Accident36",
                                            "body": "yeah he clearly intentionally evaded taxes. He would have gotten fined if he stuck to a story with plausible deniabilty.  Instead of using the defense \"IRS was an illegitimate government agency.\"\n\n\"Snipes was convicted of three misdemeanor counts of failing to file tax returns. \nHe was fined $5 million. \nProsecutors argued that Snipes earned over $38 million between 1999 and 2006 but didn't file returns or pay taxes. \nSnipes' defense \nSnipes claimed he was a nonresident alien.\nHe claimed he received bad information from his associates.\nHe blamed his advisers for bad information.\nHe claimed the IRS was an illegitimate government agency.\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "International_Lie485",
                                                    "body": "Now admit you were wrong.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Emergency_Accident36",
                                                            "body": "I wasn't, is reading that hard?  \"no one goes to jail for owing taxes,  they go to jail for gross misrepresentation.  Let's atleast get that straight\"",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Tertinian",
                    "body": "Listen dude, if Musoulinni couldn't bring back the medieval age, no one can",
                    "score": -23,
                    "replies": [
                        {
                            "author": "Fluffy-Feeling4828",
                            "body": "This is just such a deep misunderstanding of so many things ...",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Tertinian",
                                    "body": "> Listen dude, we just need to make the state a gigantic monster, destroy everyone else's factories, then we'll revert industrialization and we can all go back to kings, lords and peasants as we are meant to be.\n\n> All wealthy donors and supportes are nobles of course.\n\n Bruh, he literally wanted this. That's his whole spiel",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "Fluffy-Feeling4828",
                                            "body": "And if you're saying *Mussolini* said that, you're still wrong. He had no interest in deindustrialization, just curtailing the free market. His method for doing so was putting state puppets at the head of Italian corporations. *His* whole spiel was about nationalism and controlling markets.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Fluffy-Feeling4828",
                                            "body": "... What? He said if we start ignoring the property rights of those who are doing better than us we'll be worse off, what does this have to do with deindustrialization and a powerful state?\n\nThe \"spiel\" was a one-paragraph comment that largely is in line with AnCap belief. We certainly don't want kings and deindustrialization, so the hell are you on about.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rumblemcskurmish",
            "body": "If you don't have the right to evict someone based on terms of a contract where they WILLINGLY agreed to the terms, then you don't own your property.  Without property rights there can be no liberty and no capitalism",
            "score": 106,
            "replies": [
                {
                    "author": "Tertinian",
                    "body": "Oh boy, do I have a coconut island to tell you about",
                    "score": -56,
                    "replies": [
                        {
                            "author": "eagledrummer2",
                            "body": "Neither the landlord nor the renter \"woke up first\", since the entire island was already claimed when they woke up.  So, even besides the completely unnapplicable analogy, the premise doesn't even make sense.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "WishCapable3131",
                                    "body": "The landlord totally woke up first in this hypothetical. Of course many investment property owners inherited wealth.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tertinian",
                                    "body": "Liberland, also known as the Free Republic of Liberland, is a micronation promoted by Czech right-libertarian politician and activist Vít Jedlička,[1][2] who began claiming in 2015 an uninhabited stretch of floodplain on the Croatian bank of the Danube (known as Gornja Siga), to be the territory of a new independent country.\n\nThe official website of Liberland states that the nation was created in the wake of the ongoing Croatia–Serbia border dispute.[4][5][6] According to Jedlička, this dispute resulted in a plot of land west of the Danube being unclaimed by either side.[5][7] The parcel of land in question is 7 km2 (2.7 sq mi) in area, roughly the same size as Gibraltar. It has been administered by Croatia since the Croatian War of Independence.[8] Liberland has no diplomatic recognition from any recognized nation.[9] The land lacks infrastructure and lies on the floodplain of the Danube.\n\nhttps://en.m.wikipedia.org/wiki/Liberland",
                                    "score": -5,
                                    "replies": []
                                },
                                {
                                    "author": "Tertinian",
                                    "body": "Also, one guy woke up first, way before the main character. He even put gathered the coconuts. So you know...",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Itsjustmealex",
                            "body": "That's such a flawed analogy, rental properties are not just unclaimed waiting for someone to get there first, the are properties that are bought or passed down and require investment and upkeep most renters are using the rent they receive to pay off the mortgage pay into repairs or replacements and act as a sort of income they can live off of. Someone just squatting in a rental property is stealing from the other renters on that property the owner and eventually any future tenants when the property ceases to be available for rent.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Tertinian",
                                    "body": "If you really want to take this literally, instead of the commentary to the use of \"WILLINGLY\", take for example Manifest Destiny and the Western Trail.\n\nThe USA took control over the land, but no one lived there ( natives aren't people ofc ), so they said if you can grt there, build a house and farm, it's yours. That's staking.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "Itsjustmealex",
                                            "body": "Land Lords are not immortal you may have a point during this then but how does that factor now most rental properties are not 200 years plus the land Lords are not the same people that's staked out the land during manifest destiny. These people have bought existing property or the built them out right for the purpose of renting them out when you have people not paying rent because of some dumb notion of collective guilt of all landlords you will cease to have property available to rent",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "Ease there straw man, I'm looking to line up all landlords against the wall and shoot them. I'm asking that we consider more factors that go into what makes Something \"Willingly\" agreed upon",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Itsjustmealex",
                                                            "body": "How is a renters agreement not a willingly agreed upon contract",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Tertinian",
                                                                    "body": "Easy, it's a basic necessity required to live. Like healthcare, like food, like water. Lack of basic access to these things is a clear threat to one's life and the exercise of self-defense is expected.\n\nNow I'm not saying you just go ahead and shoot the first landlord you see. I am merely arguing for the state to provide the basic starter kit for life for those without means. This would generate strong competition on the free market, while also ensuring product and service standards, all without the heavily bureaucratic regulations that we have now.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Itsjustmealex",
                                                                            "body": "How does the state do this without undermining property rights or some means of wealth distribution, all of which would be under the threat of violence from the state",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "rumblemcskurmish",
                            "body": "I don't get the reference.  Haiti?  Jamaica?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Tertinian",
                                    "body": "It goes like this, you were in a plane crash, you and another guy are the only survivors on a remote island surrounded by shark infested waters.\n\nBy the time you woke up, the other guy already staked the island and gathered all the coconuts.\n\nIf you want some coconuts and to remain on the island, he demands you agree to a contract where you must perform sexual and physical work in exchange for remaining on the island.\n\nIs the contract consensual? Can both parties enter into this Willingly?",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "CaliRefugeeinTN",
                                            "body": "That is a weird fantasy to have bro. Stranded and forced into gay sex? You need your browser history checked.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "Is this kink shaming?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rumblemcskurmish",
                                            "body": "Ummm you've jumped right over private property.  Are you arguing that if you crash land somewhere and wake up on a beach you have ownership of the property?  \n\nThis is precisely why I'm a minarchist and not an anarchist.  You have to determine property rights or, yes, you just have lord of the flies where you have to kill the other guy on the island to make your claim for the property.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "Oh, alright. Well it's meant to highlight that the term \"willingly\" has to take into account more than if a person signs a paper themselves.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "rumblemcskurmish",
                                                            "body": "You can't engage in a contract with someone over property that you don't own.  You don't have sole and exclusive rights so you can't possibly rent it.  \n\nA landlord has sole and exclusive rights to his property.  He rents it - the renter signs a contract saying under which terms they can be vacated (non-payment, etc).  If the renter violates the agreement, he can be vacated - he agreed to those terms.\n\nThere's nothing particularly complicated about it.  No force was applied.  If you don't like my terms, rent somewhere else \n\nUnder no circumstances is the renter anything other than a willing party of a contract signed consensually.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "PersonaHumana75",
                                                                    "body": "> Under no circumstances is the renter anything other than a willing party of a contract signed consensually\n\nExcept in the coconut island example, if the other guy already made the work to move all the coconuts to their autoproclaimed property",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "rumblemcskurmish",
                                                                            "body": "Yes except in your island example where no one owns anything.  \n\nThis is why communism/socialism/anarchism end up with mass graves.  It's not a coincidence \n\nThe original question was about rent and you keep exerting an example where the basic requirement for \"rent\", private property ownership.\n\nYou can't have rent without private property.  Your example doesn't fit at all",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Tertinian",
                                                                                    "body": "Dude, the first guy to wake up staked and claimed the island. He literally owns it now, it's his. He found unclaimed land and made it his.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "rumblemcskurmish",
                                                                                            "body": "I'll play along.  You wake up first, and claim ownership.  I wake up next crack your skull with a coconut and claim I own it.\n\nWhat happened to your ownership?  Where did it go?\n\nBTW, on a side topic, literally 99% of political debates are a misunderstanding about how private property works and I'm being 100% serious. \"I have a right to say whatever I want cause of first Amendment!\".  Sure.  On YOUR PROPERTY.  Not on my property or your employer's property.  . .  etc.  Almost every argument can be reduced to a private property dispute",
                                                                                            "score": 8,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Tertinian",
                                                                                                    "body": "You would bash my skull in? What's wrong with you? Why is that your first thought? I literally did nothing. I just minded my own business, I claimed land and I worked land and I own land. I did this myself. \n\nI didn't leave you to die either, I offered you a contract which you were free to refuse. I did not coerce you in any way.\n\nWhat happened to the NAP?",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "rumblemcskurmish",
                                                                                                            "body": "Literally done nothing? You've violated the NAP and claimed property that's rightfully mine!  I saw it first and already claimed it you thief!  My use of force is morally justified.  \n\nWhat proof do you have you own it other than \"I want it more\"?\n\nYour turn.",
                                                                                                            "score": 8,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Tertinian",
                                                                                                                    "body": "For my turn I use the \"I woke up first\" and therefore I saw it first part of the scenario.\n\nI'll let you roll for 69d4 damage",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "rumblemcskurmish",
                                                                                                                            "body": "I disagree.  You're a thief and liar.  It's my property.\n\nYour turn.",
                                                                                                                            "score": 6,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Tertinian",
                                                                                                                                    "body": "I already made a throne of coconuts till you woke up. A house and a pool. I've been living here for a while now.\n\nYou are violating the NAP.",
                                                                                                                                    "score": -2,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "SopwithStrutter",
                                                                                            "body": "That’s not how ownership works",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Lil_Ja_",
                                                                                                    "body": "How do you claim ownership of something which is unowned then?",
                                                                                                    "score": 4,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SopwithStrutter",
                                                                                                            "body": "I don’t know how you would do that today, because EVERYTHING is owned so that never happens. \n\nLand claims are typically ran by a government that claims the land first. \n\nEven in the situation the man claims, the person sleeping has just as much right to claim the land and coconuts for himself. \n\nNow the two can work out an agreement, and they may use force, they may compromise. \n\nTheir ownership of the land will be determined by the competition they engage in.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Lil_Ja_",
                                                                                                                    "body": "So you’re not an ancap\n\nGot it",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "SopwithStrutter",
                                                                                                                            "body": "You can just say TLDR if that was too much.\n\nTry this\n\nMan fight. Winner get land.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Lil_Ja_",
                                                                                                                                    "body": "Which is not ancap\n\nThat’s law of the jungle, the polar opposite of the NAP",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "SopwithStrutter",
                                                                                                                                            "body": "Hey you made it through that sentence! \n\nNow try part two:\n\nSome men trade. \n\nSee if that makes sense to you. \n\nNow try to put the two ideas into ONE idea. \n\nTwo choice. Trade or fight. \n\nYou did it! Good job!",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Lil_Ja_",
                                                                                                                                                    "body": "Good god man\n\nRead some theory why don’t ya\n\nHere’s a video assuming you don’t read\n\nhttps://youtu.be/8HhWhqTCKUI?si=RQrR7S0Xx3V0Z8px",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "SopwithStrutter",
                                                                                                                                                            "body": "I’m trying to make it digestible after you demonstrated a predisposition to obstinance.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "rumblemcskurmish",
                                                                                                    "body": "Thank you.  For the life of me I don't understand why private property ownership is a hard concept to grasp.",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SopwithStrutter",
                                                                                                            "body": "It isn’t. Dishonest people twist words to their favor, and that’s the only reason anyone ever “doesn’t understand” private property",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Tertinian",
                                                                                                    "body": "Okay... Umm, there is no indication that anyone or any nation owns or claims the land. So that guy staked it, gathered the coconuts, etc, he settle the land. Isn't it his place now?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SopwithStrutter",
                                                                                                            "body": "No.",
                                                                                                            "score": 5,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Tertinian",
                                                                                                                    "body": "Why?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "SopwithStrutter",
                                                                                                                            "body": "Why does he not own the land merely for saying “this is mine”? Is that the question you’re asking?",
                                                                                                                            "score": 3,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "kurtu5",
                                                                            "body": ">  if the other guy already made the work\n\nroobbing a bannk  is  ''worrk'.   youu sounnd liike aa marxist",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Lil_Ja_",
                                                                                    "body": "Mixing your labor with something unowned is homesteading\n\nRobbing a bank is stealing that which is owned\n\nWhat sub am I on?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "kurtu5",
                                                                                            "body": "> something unowned\n\nYou are on a sub where you don't magically loose ownership becuse some commie decided its now unowned.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Tertinian",
                                                                                                    "body": "Dude it's an empty island in the middle of nowhere. As far as we are concerned, there is no owner, no markings, nothing to identify that this is owned or claimed by any entity.\n\nIt's unclaimed land, terra incognita.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "kurtu5",
                                                                                                            "body": "> Dude it's an empty \n\nDude its commie labor theory of value when you claim your 'work' magicaly makes you an owner.\n\n\"if the other guy already made the **work** to move all\"",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Tertinian",
                                                                                                                    "body": "If you take unclaimed land and mix it with your work, it's yours. You own it. What kind of ancap are you? You know fascists are not ancaps right?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "kurtu5",
                                                                                                                            "body": "> work\n\n\"My ass made a mark in the sand.  I worked and its mine.\"\n\n\nI am the type of ancap that thinks the labor theory of value is bullshit.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Lil_Ja_",
                                                                                                    "body": "Read rothbard\n\nI beg of you",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "kurtu5",
                                                                                                            "body": "nonseqitoor",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Lil_Ja_",
                                                                                                                    "body": "It’s not, you’re in an ancap sub but know absolutely no ancap theory\n\nSo go read ancap theory\n\nHomesteading is how you turn something unowned into property",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "kurtu5",
                                                                                                                            "body": "Piling up some coconuts  and thus owning the island is some commie bullshit labor theory of value.  If we can play that game, then I was thinking about doing stuff before he piled up coconuts.  I worked first, so its mine.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Lil_Ja_",
                                                                                                                                    "body": "So how do you claim ownership?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "kurtu5",
                                                                                                                                            "body": "Anything but claiming your subjective labor of  value meets  homesteading as recognized by a stateless polycentric legal system.  All else is  larping.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Lil_Ja_",
                                                                                                                                                    "body": "So then walk me through it\n\nHow do you become the owner of something that no one owns?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "kurtu5",
                                                                                                                                                            "body": "> Anything but claiming your subjective labor of value meets homesteading as recognized by a stateless polycentric legal system.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "Ah, desert island scenarios, where we try to extrapolate general-case rules out of contrived worst-case outlier situations.  This is fun!\n\nHow about this one: you find yourself on a desert island with one other survivor, and you both agree to split all of the coconuts 50-50, but at that precise moment, an asteroid smashes into the earth, unleashing a cloud of dust into the atmosphere that lasts for 1000 years, and conconut palms become extinct.  What do you do?",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "That's easy, you try and most likely fail to survive.\n\nNow answer my hypothetical coward",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "Your hypothetical coward?  Your scenario had two characters in it -- which one is the coward?",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Tertinian",
                                                                    "body": "It's a critique on the willingly part of entering a contract. If the answer to my scenario is \"no it's not consensual\" then we need to consider more factors to consider something \"willingly entering a contract\"",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ILikeBumblebees",
                                                                            "body": "Still not sure who in your scenario is a \"coward\", but I'll reiterate the point that even if we agreed that forcefully monopolizing all of the coconut trees and excluding the other party from any alternative would constitute duress in that instance, I don't see how any principles applicable to the general case -- where people are usually contracting with other parties to *expand* the set of options available to them, not regain options that have been forcefully removed from them -- could be meaningfully extracted from it.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ok_Nefariousness9019",
                                            "body": "Okay, now let’s make it more realistic. You wake up on the island, same situation. But there’s 100s of thousands of islands just a couple feet apart, there’s even a boat you can use. If you choose to stay on that island are you not entering into that contract willingly?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "In this situation, sure, I'm willing to call that willingly entering into a contract.\n\nThe purpose of both mine and your scenario was ( I hope ) to highlight that willingly entering into a contract has to take into account more than signing a paper with your own hand.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Ok_Nefariousness9019",
                                                            "body": "Correct. And I think you’ll find that many people here are more minarchist than anarchist. I just don’t like when people act like just because someone already figured something out to their advantage that they are the oppressed victim of something. \n\nYour example seemingly equates the fact that there are landlords that already own property so anyone that is in the place of renting is being unwillingly oppressed by the landlord.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Tertinian",
                                                                    "body": "I have a friend named Crassus and he owns this private fire fighting company in Rome.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bongobutt",
                                            "body": "This is why the saying goes, \"possession is 9/10ths of the law.\" If the guy already gathered the coconuts, then yeah, by standard homesteading/property philosophy, he owns them. That guy is free to trade them with you, and you are free to reject the trade or go do your own thing. You can fish, forage, or plant whatever you want. Your analogy is contrived to assume that the first man could gather or \"claim\" the *entire island's property* in a single morning, which is neither practical, possible, or particularly enlightening or analogous to the principle. If the island's resources were truly so limited that he could gather 100% the resources to himself in a single morning, then the two guys are both gonna die anyway. But if they could sustain themselves by fishing, then the first guy has not perpetrated any violence or harm - the other guy can go fish and provide for himself.  \n  \nThe analogy is *trying* to make a point about monopoly as a concept, and specifically as a criticism of free markets. But in a system of voluntary competition/cooperation, a monopoly has no teeth. People are free to reject it and do their own thing.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "It's not a criticism to free market buddy. It's a criticism to what constitutes \"entering a contract willingly and of free accord\".\n\nBut if you wanna go further, every single game, from Monopoly to Catan gets you started at a base resource point with which you can work.\n\nThe State has no business regulating the market past enforcing contracts and ensuring property rights. But it's imperative that the state becomes a player in the economy acting like a consume-cooperative you opt into for property rights and offers free-market alternatives to the basic stuff for life, like healthcare, education and housing. This would already give strong competition and standards in the market without forcing birocracy heavy regulations.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "bongobutt",
                                                            "body": "Perhaps other people have framed that thought experiment different form how you did, but it doesn't indicate what you say it does. It is correct to say that the scenario you gave doesn't imply agreement to a terrible contract. But it also doesn't indicate that the *only option* that person B has is to agree to person A's terrible offer.  \n  \nIf person A lived on the island for 20 years, and homesteaded much of it, then person B coming to the island later doesn't have a right to what person A built and grew. Period. If stealing is \"the only\" option to survive, that doesn't make it justified. You could also just agree to perform labor for person A or provide a product of your own making in exchange for coconuts.  \n  \nAgain, the saying is, \"possession is 9/10ths of the law.\" It is about who already has it. Homesteading is a whole area of discussion.  \n  \nI fail to see how this analogy of yours points to the need for a state.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Tertinian",
                                                                    "body": "Well, at it's core, it's simply displaying the same issue as \" I'm 26 and in debt, I should've started investing in real estate 20 years ago. \". \n\nIn my opinion, the crux of the scenario is that the late comer cannot pull himself up by his bootstraps out of this situation without entering into slavery. It's that or death. That's the whole and singular point of this extreme scenario. And yet it hits close to home for too many ( of course not in a literal kind of way ).\n\nAnd the state part is my solution basically. Free-Market with a state switching from regulatory powers to straight up participating in essential goods and services. Redistribution with a positive impact on the free-market basically.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Lil_Ja_",
                                            "body": ">Is the contract consensual? Can both parties enter into this willingly? \n\nYes.\n\nDisappointed in other “ancaps” who refuse to remain consistent",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "How do you feel about the sentence\n\n\"Slaves are willingly slaves because I provide everything for them to live in return for work, if this wasn't the case, could always refuse and kill themselves, I'm not forcing them to stay alive.\"",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Lil_Ja_",
                                                            "body": "Does the slave have the option to leave at any point?\n\nIs the slave being violently punished?\n\nDoes the slave voluntarily agree to work for the necessities he is being provided?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ed_Radley",
                            "body": "And it proves what, that a reductio ad absurdum edge case thought experiment will lead to poor outcomes if taken literally? Maybe you should get back under the bridge you're supposed to be guarding, otherwise those people will be crossing it without paying the correct toll.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GuessAccomplished959",
                            "body": "Can you rent me this island for free?\nPlease and thanks.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Tertinian",
                                    "body": "Yes, but you may not sit on the coconut throne. Everything else is free to develop for a 99 year lease.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sekt0rrr",
                            "body": "[I beg you watch this video](https://youtu.be/KSc3_lP24oQ?si=4brmt076fUp4gHk4) and realise you can alter the scenario to literally fit ANY narrative.\n\nPoor argument, even poorer fallacy.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mnatheist",
            "body": "Almost 100% of people who are against rent won't let me live with them for free.  Most are pro taxation. And several of them make pro cannibal statements.",
            "score": 53,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "but they sure wouldn't dispute your adverse possession claim.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Tertinian",
                    "body": "Actually based",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alternative-Dream-61",
            "body": "LLs get all the heat but they aren't the main issue.  The issue is a lack of affordable housing people can purchase and it's the result of government intervention and policies.",
            "score": 24,
            "replies": []
        },
        {
            "author": "_BlueJayWalker_",
            "body": "Pretty sure that a popular opinion here",
            "score": 58,
            "replies": [
                {
                    "author": "Ill_Reputation1924",
                    "body": "yep, i was being sarcastic",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "ptofl",
            "body": "POV theres no landlords and you need to pay a £30k downpayment to have a roof over your head straight out of uni.",
            "score": 18,
            "replies": []
        },
        {
            "author": "not_slaw_kid",
            "body": "Fun fact: When polled, 100% of \"fuck landlord\" people were unwilling to let me live in their house for free",
            "score": 18,
            "replies": []
        },
        {
            "author": "insanityisinherit",
            "body": "They always leave out the inconvenient part where the renter made an agreement to trade money for shelter.",
            "score": 12,
            "replies": []
        },
        {
            "author": "pavelshum",
            "body": "They still had to pay rent in Communist Russia and if you failed to pay rent they busted your ass and evicted you. These losers don't even know the basics of their own fantasy world.",
            "score": 11,
            "replies": []
        },
        {
            "author": "watain218",
            "body": "nothing wrong with evictions, pay your rent and dont violate the contract you willingly signed",
            "score": 8,
            "replies": [
                {
                    "author": "Ill_Reputation1924",
                    "body": "this",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "eagledrummer2",
            "body": "It's always \"stop evictions\" to stop capitalism, but never \"stop renting\"",
            "score": 11,
            "replies": [
                {
                    "author": "Tertinian",
                    "body": "It's always \"stop evictions\" to stop capitalism, but never \"just be homeless\".\n\nFixed it for you",
                    "score": -4,
                    "replies": [
                        {
                            "author": "PM_ME_DNA",
                            "body": "People who oppose evictions never had a shitty tenant",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "eagledrummer2",
                            "body": "Not allowing people to steal food does not imply a mandate to starve. \n\nHow much longer are you going to hang around here with your bad faith excuses for arguments?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Ecstatic_Doughnut880",
                            "body": "If you can't pay the rent  move to a smaller flat, find a cheaper offer, move back to your parents, share the rent with someone...\nIt is not like your gonna be homeless and there are also deadlines so you have time to find a new appartment",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "soonPE",
            "body": "r/lostredditors \n\n  \nyou meant to post this in r/antiwork ?? because i doubt anybody around this place see that as unpopular, and I pay rent, not a home owner.....",
            "score": 6,
            "replies": [
                {
                    "author": "Ill_Reputation1924",
                    "body": "I was being sarcastic",
                    "score": 5,
                    "replies": [
                        {
                            "author": "soonPE",
                            "body": "My bad, apologies!!!\n\n  \nlately you find such posts around here, that you get to a point were you dont know anymore",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "brightpixels",
            "body": "economics > feelings",
            "score": 7,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "=taxation is never theft. (just finishing the equation, my opinion is irrelevent)",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mean--machine",
            "body": "As a landlord, I approve this message",
            "score": 4,
            "replies": []
        },
        {
            "author": "DMBFFF",
            "body": "Throw out the riff-raff!\n\nThere are many others who will pay the rent, rent increases, and be less problematic.",
            "score": 8,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "that equals \"throw out the non taxer payers, tthere are many others who happily pay high taxation\"",
                    "score": -6,
                    "replies": [
                        {
                            "author": "DMBFFF",
                            "body": "Landlords have a right to their private property: governments don't.\n\nIf a tenant doesn't like the high rent, thon can go live somewhere else.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Emergency_Accident36",
                                    "body": "government actually claimed it to begin with.  \n\n>If a tenant doesn't like the high rent, thon can go live somewhere else.\n\nif the property title of use holder (you're not an owner, read the fine print) doesn't like high taxes then they can go live elsewhere...  Your logic is not principled",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "DMBFFF",
                                            "body": "Governments claims are illegitimate as governments are illegitimate.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Lil_Ja_",
                                            "body": "Property cannot be claimed simply by declaring “everything is mine” and then shooting or imprisoning anyone who disagrees with you",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Emergency_Accident36",
                                                    "body": "that isn't how it went.  But more importantly that is the source of your claim to the property within the territory of the United States.  Renters could challenge the landlords claim to the property and it would be sourced to the allodial title which the US government holds, whom granted title of use to the property owner",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tacocarteleventeen",
            "body": "I’ve been through evicting a tenant before.  It sucks but I was facing financial ruin if I didn’t.  Including the damage to the property is cost me over $13,000.  \n\nI know people fall on hard times, but I’m just a small contractor that rented my first house I owned out after the 2008 recession when it was underwater to try and save my credit.  I finally sold it right after COVID when it finally went positive in value.",
            "score": 5,
            "replies": []
        },
        {
            "author": "GuessAccomplished959",
            "body": "The most annoying thing is that a lot of LL are willing to work with renters who are having difficulties paying.\n\nIt's usually better to have someone in there rather than it sit vacant.\n\nBut all these \"children\" make their LLs out to be slum lords which somehow means they don't need to pay.",
            "score": 5,
            "replies": [
                {
                    "author": "Ill_Reputation1924",
                    "body": "commies are out here thinking we still live in the 1880s",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "querque505",
            "body": "I lived in an apartment complex for 28 years and even serviced it as a janitorial contractor and later dvd libraries. I was always on time with rent and I sponsored 3 people as tenants over the years. I got CKD and lost my job and one day after rent was due an eviction notice was on my door. I tried to negotiate and get some time to receive unemployment but they weren't willing. I'm convinced it was because I hadn't had a rent increase in years due to my great relationship with management and the owners. Then, some investment group in Plano, Texas bought it out and replaced the management company. They wanted me out so they could raise the rent on my unit. They couldn't give a crap about my years as a great tenant and service contractor.",
            "score": 11,
            "replies": [
                {
                    "author": "PacoBedejo",
                    "body": "This highlights the difference between voluntary association capitalism and government-chartered corporatism.\n\nAnCap principles apply to sole proprietorships, partnerships, and cooperatives. They apply less when government involvement is forcibly socializing liabilities and losses.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Celticpenguin85",
                            "body": "Could you expand on this please? What prevents this from happening under Ancap?\n\n\nEdit: Fuck me for asking a question ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PacoBedejo",
                                    "body": "Who is offering the liability shields and tax + inflation avoidance (401k, anyone) that allow the formation and funding of massive corporations?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Celticpenguin85",
                                            "body": "A private landlord can just as easily refuse to cut someone slack for missing rent.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lil_Ja_",
                                                    "body": "Correct, but they would also have more incentive to cut you slack than they do now, because there would be significantly more competition\n\nAnd even if they don’t, that competition gives you more options",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "PacoBedejo",
                                                    "body": "Of course they can. They're significantly less likely to do so, though. Dealings are heavily and unnaturally depersonalized by government's involvement through regulations, tort, and government-chartered corporatism.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DumpyDoggy",
                    "body": "Doesn’t make much sense. \n\nGetting someone out to raise rent is something that is done in rent control areas, not Plano Tx. Unless, they wanted to rehab the unit to target a higher income bracket.\n\nThey are also required to give a 2 day grace period on rent payments in Texas.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "querque505",
                            "body": "The apt was in NM, the owners were in TX",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PolishAnticommunist",
            "body": "Why is this an \"unpopular opinion\"? To me, it's obvious that you have the right to evict people who are illegally occupying your property, and I don't see anything controversial about that.",
            "score": 2,
            "replies": [
                {
                    "author": "Ill_Reputation1924",
                    "body": "the “unpopular opinion” was sarcastic",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TexFarmer",
            "body": "What do you think will happen if the owner does not pay on the note, should the bank be forced to absorb the loss? Should we all stop paying our mortgages, or should the bank write it off and all mortgages be forgiven too?\n\nWe all have to pay someone!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ronpaulclone",
            "body": "I bet they aren’t opposed to sheriff sales for not paying property taxes for their beloved government indoctrination centers.",
            "score": 2,
            "replies": [
                {
                    "author": "Ill_Reputation1924",
                    "body": "yep, they will literally call people “boot lickers” while also advocating for a totalitarian government",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "time2vape",
            "body": "You voluntarily signed a contract 🤷🏻‍♂️",
            "score": 1,
            "replies": [
                {
                    "author": "Ill_Reputation1924",
                    "body": "yep",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sunstoned1",
            "body": "We CAN say the current housing system is oppressive and manipulated by governments to benefit the wealthy. Central banking, money printing, tax policy, zoning, lending laws, and more... All conspire to move property further and further up the food chain.\n\nIf (and this is a conditional) we are forced to have a government, then something like Georgism can address the housing problem.\n\nOr, we have a true free market and let individuals work it out amongst themselves.\n\nBut whatever nonsense we have right now is doomed to fail.",
            "score": 1,
            "replies": [
                {
                    "author": "CollectedHappy3",
                    "body": "The problem with letting the people solve it amongst themselves (without an arbiter) will sometimes end with violence. Some people just can't be reasoned with.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bongobutt",
            "body": "Most people have either had a bad experience with a landlord, or have heard about someone else's bad experience. By contrast, very few people have heard about a landlord's bad experience with a tenant. A bad experience with a landlord sucks - don't get me wrong. But there is no shortage of landlords that can give horror stories of bad tenants that cost thousands or tens or thousands of dollars in damage to the property and the business. Landlords can absolutely do better. But eviction as an option is still absolutely necessary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "time2vape",
            "body": "Agreed, but I feel like you can definitely defend homeless people squatting in abandoned buildings",
            "score": 1,
            "replies": []
        },
        {
            "author": "03263",
            "body": "How do you feel about property taxes then?\n\nIs it just paying rent to the government?",
            "score": -6,
            "replies": [
                {
                    "author": "Ok_Caterpillar6789",
                    "body": "Property taxes shouldn't exist. They're the worst kind of extortion, right up there with income tax.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Xombie2000",
                            "body": "There are few things I hate paying more than property tax every year for something I own.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Emergency_Accident36",
                            "body": "you missed the point.  It is in fact your rent to the government",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Ok_Caterpillar6789",
                                    "body": "I diddnt miss the point. It's absolutely renting from the government. \nI pay about 12,000$ a month in property taxes, \nI'm very aware of the point being made.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Tertinian",
                            "body": "Hear me out, how about georgism?",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "finetune137",
                                    "body": "Who becomes the master George?",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "International_Lie485",
                                    "body": "So a government...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "finetune137",
                    "body": "Consent. Do you read me. Over",
                    "score": 5,
                    "replies": [
                        {
                            "author": "03263",
                            "body": "It's a bit more tricky when we are talking about housing, shelter is a basic human need and everybody must exist somewhere. I am not a big fan of or jumping to the defense of landlords, I'd rather see more co-op and other forms of occupant-owned housing arrangements in multi-family dwellings.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "finetune137",
                                    "body": "> shelter is a basic human need \n\nBut not a right.\nSex is basic human need too. I don't see leftists advocating for women having sex with incels",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EGarrett",
            "body": "Yes, with the understanding that the owner of the property has to actually be maintaining it in order to claim ownership. You only own yourself, the product of your labor, and things that are given or traded to you by their owner. So you can't just plant a flag in some dirt, claim you own the whole field and charge rent for someone to farm or live there. You have to create a building or buy or develop or perform maintenance on the building the whole time. \n\nIf the landlord leaves and the building falls into disrepair to the point that others have to perform the labor to keep it livable, it's derelict and the owner has abandoned the property and can't come back later once others have fixed it up and say it's there's.\n\nJust pointing this out because flag-planting and the issues of ownership and rent-seeking are common points of confusion when it comes to An-Cap.",
            "score": -9,
            "replies": [
                {
                    "author": "DifficultEmployer906",
                    "body": "Yea the confusion is on your end. Breach of contract between a renter and a landlord does not equate to property ownership changing hands. That's absolutely absurd.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "EGarrett",
                            "body": "> Breach of contract between a renter and a landlord does not equate to property ownership changing hands.\n\nYeah, you have no idea what I said and at no point did I suggest that you take property from someone by breaching contract. I said if the property is abandoned to a certain point then the owner forfeits ownership as a matter of ethical standards.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "DifficultEmployer906",
                                    "body": "Ethical standards according to who?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "EGarrett",
                                            "body": "According to what's logically necessary to have a civilized world. Meaning that things will work best if other people use that concept to decide who is in the right when there are disputes and thus who to protect or stop. Just like the Non-Aggression Principle.",
                                            "score": -13,
                                            "replies": [
                                                {
                                                    "author": "DifficultEmployer906",
                                                    "body": "So you want your arbitrary and nebulous values to dictate property rights for other people? Are you sure you're in the right sub?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "EGarrett",
                                                            "body": "Is the Non-Aggression Principle \"arbitrary and nebulous?\" No, it's a consistent logical concept that reasonably intelligent adults can understand and apply to situations. Likewise for this.\n\nIf you don't understand how to apply general ethical principles in absence of government, I suggest *you're* in the wrong sub.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "DifficultEmployer906",
                                                                    "body": "No it's not. What constitutes harm to someone else is fairly objective and universally agreed upon.  \n\n\nWhat you view as ethical is not. For example, your ridiculous assertion that if a landlord stops maintaining a piece of property and someone else decides to do it, ownership then transfers to that other person. This is a completely subjective standard that you personally agree with. Which is fine, but when you try to force that standard onto other people it becomes antithetical to anarchism, let alone anarcho-capitalism",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "EGarrett",
                                                                            "body": "> What you view as ethical is not. For example, your ridiculous assertion\n\nBut you failed to even read it properly so you have no idea.\n\n>if a landlord stops maintaining a piece of property and someone else decides to do it, ownership then transfers to that other person.\n\nYeah that's not what I said at all.\n\n\"If the landlord *leaves* and the building *falls into disrepair to the point that others have to perform the labor to keep it livable.*\"\n\nMeaning if you disappear and the building becomes completely decrepit to the point that it can't even be lived in without others having to do all the work, then the building is derelict and you no longer own it. Not just if someone fails to do some maintenance and someone else DECIDES to do some work on it, if they literally abandon it until it's not even livable on a basic level and someone else HAS to.\n\nYour replies are terrible so your \"assessment\" is of zero value.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Secretsfrombeyond79",
                                                                                    "body": ">\"If the landlord leaves and the building falls into disrepair to the point that others have to perform the labor to keep it livable.\"\n\nSo if my TV brokes and I don't fix it, and someone else fixes it for me, does that mean my TV is now theirs ?\n\n>Not just if someone fails to do some maintenance and someone else DECIDES to do some work on it, if they literally abandon it until it's not even livable on a basic level and someone else HAS to.\n\n\nAnd what is the time frame I should have to do that, is it exactly after a year I don't fix it ? And who decides on this time frame ? Could we even call it a law ?",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "EGarrett",
                                                                                            "body": "> So if my TV brokes and I don't fix it, and someone else fixes it for me, does that mean my TV is now theirs ?\n\nPerfectly fair question. If the TV is in your property (that you own, rent, maintain etc rightfully) then no one is in their right to take it. Since your property is your own private space that other people can't trespass on or use without your permission. (This doesn't mean that someone else forfeits ownership of something that is reasonably theirs and usable if they bring their phone into your house or anything, they just can't claim ownership of something that's in yours).\n\nIf you leave the TV outside of your property and it's broken down and doesn't work, then it's fair to consider it derelict and someone else can take it.\n\n>And what is the time frame I should have to do that, is it exactly after a year I don't fix it ?\n\nThe time frame in which the property is livable while you perform no maintenance on it. Since property usually needs windows, doors, temperature control, electricity plumbing etc, it will be until enough of those things have failed that it can't be reasonably used for living. I think in a few months, nature will take the area back with plant growth and animal invasions to the point that it's clearly derelict and unlivable unless someone else comes in and fixes all that.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Secretsfrombeyond79",
                                                                                                    "body": ">If you leave the TV outside of your property and it's broken down and doesn't work, then it's fair to consider it derelict and someone else can take it.\n\nOk so people can take other's property if it's broke and they fix it before them. I'll ignore the \"inside of your property\" part because that's not the point of what I asked.\n\n>The time frame in which the property is livable while you perform no maintenance on it. Since property usually needs windows, doors, temperature control, electricity plumbing etc, it will be until enough of those things have failed that it can't be reasonably used for living.\n\nSo, if I go on vacations, a natural disaster happens and destroys my house, and someone fixes it before I come back, or puts a trailer on it, it is suddenly their property now ?\n\nYour idea of ownership based on maintenance is full of holes that enable people to steal the property from others, and also have literally no point of fairness and would never be accepted.\n\n--------------------------------------------------------------------------\n\nEdit- Have to edit cuz the other guy blocked me.\n\n>Nope I didn't say you could just take someone else's property. You won't ignore it, and you won't mischaracterize what I said.\n\nFirst of all pretty scummy of you to block me so I can't answer back. I did not mischaracterize what you said, I think you yourself don't understand the implications of the subjective idea of property you just propossed. because it can totally happen. And you being offended and refused to adress the point won't change that.\n\n\n>Nope, because you can work to fix the house. If you abandon it and aren't trying to fix it in a reasonable period of time, you don't.\n\nBut that's my intent, others can't know my intentions. It is intent then, what decides if something is property ? how do I prove intent ? What is a reasonable period of time ? A few months ? What if I was saving and took vacations for months ?\nAgain, you are just adjusting your idea of property to whatever relative situation to not admit it's full of holes and completely invalid once put to test.\n\n\n>You're really struggling here.\n\nAm I ? That's why you blocked me ? How generous of you.\n\n\n>Nope, your understanding is though, and you deliberately lied about what I said and said you'd ignore my correction, so now you're ignored.\n\nI haven't lied, and I didn't ignore your \"correction\". You still refuse to deal in dialectics and have an intelligent conversation. Way to prove your point. \n\n\n--------------------------------------------------------------------------\n\n\n>I think you aren't getting the underlying point. What it means is that *after some (long) period of time,* the property is considered abandoned by the previous owner.\n\nI got the point, however the problem with this is that said *long period of time* it's completely subjective and prone to personal interpretation. It cannot be thus, a nonspoken rule, not even a law.\n\n>Just like throwing some broken TV in the woods.\n\nWhat about people who brings a portable TV to a campsite and stop using it? What about cars, those are usually parked public and not inside your property. I know a guy who's got the same car brocken parked outside his house for two years now, if I go and fix is can I steal it from him ? Etc.\n\n>There has to be at least some constant interaction and causal connection with the thing.\n\nWhy ? How is this NOT a subjective interpretation of what property is ? Why should I accept it that you are now the owner of my car I was saving to finally fix one day, instead of  just shoot you for stealing what's mine ?\n\n>Or you could just pay someone to maintain it, protect it, and such. That's what a private protection would do.\n\nOh cool idea, we could even call that a government of sorts ! we could pay them protection for our stuff ( taxes ), so they ensure they are still ours even if we don't use them ! /s\n\nSo basically you want to pay taxes to make a government ensure my property rights. In other words I'm not owner of my propriety, the government is, and once I stop or can't pay they will steal it from me.\n\n>Moreover, an Anarcho-Capitalist society has governance. Private tribunals and protection agencies. These organizations will surely stipulate at least a range of time and destruction a piece of property can go by until it becomes forfeit. That is, the owner pays a notary to even prove/recognize he owns said property, and a tribunal to solve judicial disputes. Those organizations will have voluntary agreements to solve that sort of scenario.\n\nAnd why would I voluntarily ever form part of a society so damn stupid, I have to pay extra just to be owner of my own stuff ?\n\n>If you still disagree, how do you propose we solve this issue?\n\nIf I pay for something or built something in my terrain then it's mine. Try to take it, I'll use force to defend it.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "EGarrett",
                                                                                                            "body": "> I'll ignore the \"inside of your property\" part because that's not the point of what I asked.\n\nNope I didn't say you could just take someone else's property. You won't ignore it, and you won't mischaracterize what I said.\n\n>a natural disaster happens and destroys my house,\n\nNope, because you can work to fix the house. If you abandon it and aren't trying to fix it in a reasonable period of time, you don't.\n\nYou're really struggling here.\n\n>Your idea of ownership based on maintenance is full of holes\n\nNope, your understanding is though, and you deliberately lied about what I said and said you'd ignore my correction, so now you're ignored.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "Chigi_Rishin",
                                                                                                            "body": "I think you aren't getting the underlying point. What it means is that *after some (long) period of time,* the property is considered abandoned by the previous owner. As in, they fail to go there, make any sort of repair, for several years/decades. Just like throwing some broken TV in the woods. A house is just a more complicated object. In other words, we can't simply own any and everything we ever touch/use for the rest if time. There has to be at least some constant interaction and causal connection with the thing. So, indeed, if your house gets destroyed and you never go back there or even make a point of restoring it, it will be considered abandoned eventually. Or you could just pay someone to maintain it, protect it, and such. That's what a private protection would do.\n\nMoreover, an Anarcho-Capitalist society has governance. Private tribunals and protection agencies. These organizations will surely stipulate at least a range of time and destruction a piece of property can go by until it becomes forfeit. That is, the owner pays a notary to even prove/recognize he owns said property, and a tribunal to solve judicial disputes. Those organizations will have voluntary agreements to solve that sort of scenario.\n\nOtherwise, it would be Pure Anarchy. In Pure Anarchy, the only technical property one can own is their bodies and what they are carrying. Because things such as land, buildings, and objects would have no way of having a proven owner. It would be \"I own this place because I am usually here, protecting it.\" \n\nAnd no, I don't think Pure Anarchy can work. It actually makes conflicts worse. It's just an extreme example to explain why anarchy is not the lack of all rules, but instead non-aggression supported by agreements and contracts that can be valid for every single person.\n\nIf you still disagree, how do you propose we solve this issue?",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "DifficultEmployer906",
                                                                                    "body": "Dude, you know I can just look at your original post, yea? \n\n\nDid you forget the very beginning of it? \n\n\n>So you can't just plant a flag in some dirt, claim you own the whole field and charge rent for someone to farm or live there. You have to create a building or buy or develop or perform maintenance on the building the whole time.\n\n\nYou even go further than what I said; and that you're now suddenly trying to distance yourself from. You're also claiming that someone can't own property unless they're actively involved in it in some way at all times",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "EGarrett",
                                                                                            "body": "Right, you can't plant a flag on land and do nothing but claim it and collect rent. Just like you can't abandon a building until it becomes completely decrepit and claim you still own it later.\n\n>You're also claiming that someone can't own property unless they're actively involved in it in some way at all times\n\nNo, you can own it as long as it is *the product of your labor.* As house is used for living. The livability of a house is the product of your labor. You own it as long as it is reasonably livable. When it's no longer livable it's not the product of your labor anymore.\n\nYour default way of thinking seems to be insufficient for these concepts.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DifficultEmployer906",
                                                                                                    "body": "Lol your concepts aren't complicated dude. They're just antithetical to anarcho capitalism. The confusion stems from why you're here more than anything. You can have any absurd view on property rights you want, but under anarcho capitalism, you have no authority, moral or otherwise, to force those views onto anyone but yourself. If I choose to buy a piece of land because I just wanna take a walk in the woods, I'll do it. What you view as sufficient development or maintenence is completely inconsequential and subjective. Seizing it based off your subjective views and who tf knows what authority would violate the NAP; and a whole lot can stem from that",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "EGarrett",
                                                                                                            "body": "> Lol your concepts aren't complicated dude.\n\nBut you failed to understand them, \"dude.\" So you don't really know.\n\n>under anarcho capitalism, you have no authority, moral or otherwise, to force those views onto anyone but yourself.\n\nYou have no other way to determine why someone else can't just declare they own the ocean. You need a consistent principle, you being too lazy to understand it is irrelevant to its value.\n\n>If I choose to buy a piece of land because I just wanna take a walk in the woods, I'll do it.\n\nBuy it from *who,* doofus? If it's undeveloped land no one owns i and you can take a walk in the woods as much as you want.\n\n>What you view\n\nYou have no idea what my \"view\" is.\n\n>would violate the NAP\n\nYou already declared that consistent logical principles were nebulous, so don't try to apply one here.\n\nAnd I don't think you have anything else to add, \"dude.\"",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kurtu5",
                                    "body": ">  ethical standards.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Emergency_Accident36",
                    "body": "they can't handle this level of cognitive processing. It gives them cognitive dissonance",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EGarrett",
                            "body": "It sounds confusing to some people because they don't realize that a house is still the product of your labor even if you walk away from it to go to work. It stops being that when you are no longer doing anything (i.e. not even opening and closing the doors) and it is no longer livable. Which is very similar to laws we have now about abandoned homes. Likewise you can own an object that you didn't make yourself if the person who made it (or other rightful owner) gave it to you or traded it to you. Someone else said \"what if I want to buy a patch of land just to have a walk,\" you can't buy the patch of land in the first place if it's undeveloped, no one owns it, and as a result, you're welcome to walk in it as long as you don't stop anybody else from doing so too (or otherwise mess it up).",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bessierexiv",
            "body": "This seems like a misguided poster, eg it doesn’t explain more. Maybe it’s the common understanding that oh landlords can have rent which is too high and people consider that to be unfair in an era where we have a housing crisis and a cost living crisis. But how would you approach that issue people in this sub?",
            "score": -1,
            "replies": [
                {
                    "author": "seniordumpo",
                    "body": "Start by having people look at who regulates every step of housing planning, construction, purchase, and material production.   Then once they have looked at that ask again why housing is limited or expensive.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eranaut",
            "body": "All the political dichotomy just feels like you burning your neighbor's house down, but you both live in the same duplex",
            "score": 0,
            "replies": []
        },
        {
            "author": "Notable-Anarchy",
            "body": "The practice of land ownership in this way is unethical and exactly why other schools of thought hate Anarcho-capitalism. If all you’re going to contribute to a stateless society is making it rental world. You’re not an anarchist. You’re a feudal lord. And the tithes you’re retaining contribute nothing. \n\nLandlords are like a parasite stateless society.",
            "score": -1,
            "replies": []
        },
        {
            "author": "mt_2",
            "body": "You are being a bit misleading here though right? No one is saying \"stop evicting people who don't pay rent\", they are clearly saying \"If I've signed a 1 year tenancy contract with a Landlord, why does the government allow him to evict me before this agreement has come to an end?\".\n\nSurely you can see this? A contract is a contract and you shouldn't be able to get evicted within the time that you have agreed to pay money for a service, over a contract no-less. Without a government contracts essentially \\*are\\* the law, but the government gives people exceptions to get out of these contracts. \n\nThe same goes for the tenant leaving early, he has agreed to pay for a year and should have to pay for entire year.\n\nNo-fault evictions are something else and I believe if the contract is up and you haven't followed up with a new 1 year lease, or however long, the Landlord is of course within his rights, but again, no one is talking about \"not paying rent\", at most it's about early evictions, and potentially no-fault evictions, which in lots of cases are fair so you can criticise them for this.",
            "score": -23,
            "replies": [
                {
                    "author": "kendoka-x",
                    "body": "where are you getting this context from?  I just see something saying stop evictions.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "mt_2",
                            "body": "This is without adding any context, to think this is \"pro-not paying rent\" you have to be the one adding context.",
                            "score": -19,
                            "replies": [
                                {
                                    "author": "kendoka-x",
                                    "body": "i never said it was \"pro not paying rent\", if i had to guess at a context i'd say the default stance is don't be a hardass about evicting people as soon as its legal, but on its face it just says stop evictions.  not stop evictions on the needy old, or the struggling poor.  Just stop them, end of story.  Right, wrong, indifferent.  is the guy loaded but just doesn't want to pay, stop those too.  And given that broad stop, i'd default to \"no, don't stop.  People who don't pay should be evicted\"",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ill_Reputation1924",
                    "body": "generally, what the fellas who would make something like think that it’s okay to occupy a building if it is currently vacant, even if they haven’t received permission from its owner",
                    "score": 7,
                    "replies": [
                        {
                            "author": "mt_2",
                            "body": "considering the amount of people who \"occupy buildings\" is tiny, and the amount of people who have been evicted before a tenancy agreement has come to an end is surprisingly high in the USA, I really think you are wrong here.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DarkUnable4375",
                    "body": "Usually the problem is Tenant sign a 1-year contract, 3 months in, tenant stops paying rent. Tenant breaks contract first.  Whether it's loss of job, sudden health problem, sudden events like 9/11, death of a partner, etc.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Secretsfrombeyond79",
                    "body": "\\>No one is saying \"stop evicting people who don't pay rent\",\n\nYou don't read much about the opinions of your own side don't you?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "mt_2",
                            "body": "\"my own side\"? I fully believe in anarcho-capitalism as you could see through the vast majority of my posts on this subreddit being heavily upvoted, I just refuse to fight ghosts and bogeymen, there are bigger issues.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Secretsfrombeyond79",
                                    "body": "your side \"of the debate\". Go to anti work and ask them under what conditions should landlords be able to evict people.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "kurtu5",
                                    "body": "> I fully believe in anarcho-capitalism as you could see\n\nI see  otherwise",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tablefourtoo",
            "body": "you have every right to throw someone out of your property if they are in breach of their rental contract. \n\nhowever, if you leave your lot vacant or undeveloped or let a property decay and then other people move in as squatters and develop it and you leave them be for too long, you lose your right to that property",
            "score": -19,
            "replies": [
                {
                    "author": "Fox_Mortus",
                    "body": "Rights are not on a use it or lose it basis. Your view on property only encourages the destruction of natural beauty. If I have a creek running through my property and choose to keep it natural instead of developing it, by your logic some homeless guy can come build a shack there and I can't do anything about it.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Emergency_Accident36",
                            "body": "except all through american and even global history adverse possession is law and how the country was developed. You remove it now, that deligitimizes any and all susbequent claims",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "danneskjold85",
                            "body": "You would have to prove your use of the natural creek, otherwise it's not your property because neither you nor anyone else created it.\n\n>Rights are not on a use it or lose it basis. Your view on property only encourages the destruction of natural beauty.\n\nLand use rights are. Ironically, you're the one defending decay.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Fox_Mortus",
                                    "body": "Decay is not inherently bad. We don't need to develop every square inch of the planet. Leaving certain land to nature is beneficial to society as a whole.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "danneskjold85",
                                            "body": "- That didn't address what I wrote\n- You don't speak for society \n- Society doesn't have property rights\n- There is no such thing as a collective good\n- There is no \"we\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "> You don't speak for society\n> \n\nYou do?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "danneskjold85",
                                                            "body": "No, only for myself. You should, too.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "kurtu5",
                                                                    "body": "Just making sure.  A lot of statists and I thought you were one.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "danneskjold85",
                                                                            "body": "What gave you the impression I was a statist?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Fox_Mortus",
                                                    "body": "There is absolutely such thing as collective good, in the same way that there is collective bad. A nuclear blast is pretty much peak collective bad. A clean river is collective good. There are plenty of things you benefit from simply by being near them even if you don't own them or control them in any way.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "danneskjold85",
                                                            "body": "Asserting it doesn't make it so. \"Good\" is a value judgment and society isn't a person so society doesn't make value judgments. There is probably a clean river somewhere in Siberia that isn't good or bad to me because I don't know it exists and likely never will. A nuclear explosion that obliterates my enemies is good to me and bad to my enemies. \n\nThere can be no property rights if any are subject to some undefinable collective good. That's communistic \"personal property\" territory. \n\n>There are plenty of things you benefit from simply by being near them even if you don't own them or control them in any way.\n\nYes, the point being that *you* don't own the creek, either.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "helpmesleuths",
                            "body": "Nah it requires that you as the owner don't kick the homeless guy out within 10 years which is plenty of time to exert your ownership. That's the law in the UK and other common law countries",
                            "score": -10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AgainstSlavers",
            "body": "Landlords are getting laid enough.  No need to fuck them more.",
            "score": -5,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "Downvotes are by the few landlords not getting laid.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ncdad1",
            "body": "The question is whether we favor humans or capital in the struggle.",
            "score": -7,
            "replies": [
                {
                    "author": "old_guy_AnCap",
                    "body": "Very often landlords are humans. After my divorce I got possession of a duplex with one side being 450sf and the other 950sf. I rented the larger side and lived in the smaller. During COVID the renters quit paying rent and made no effort to get any of the assistance that was available. The government made it very difficult to do an eviction due to rules to \"protect tenants\". After 8 months I was finally able to get them evicted, doing the legal work all on my own. By that point I was so far behind financially and they had so badly trashed the place I had to sell it \"as is\" costing me as much as $100,000 of my equity. Fortunately I don't have major mental or emotional issues and my girlfriend was happy to have me move in with her.\n\nI am a human.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ncdad1",
                            "body": "I am thinking of the hedge funds using their capital to buy up all the homes and rentals so that there is no affordable place to live now",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "old_guy_AnCap",
                                    "body": "But the laws proposed impact all property owners, whether they are individuals or corporations. Under the law they are the same.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "ncdad1",
                                            "body": "But hedge funds with billions way out gun homeowners with a salary.  They fulfill the saying that \"you will own nothing and will love it\" since they will own the entire housing stock one day.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tertinian",
            "body": "For starters, maybe we use the least bad way to tax, Georgism.",
            "score": -2,
            "replies": [
                {
                    "author": "Foreign_Ad_7504",
                    "body": "No. That's just your own terrible opinion. No ancap is going to think \"georgism\" makes any sense at all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emergency_Accident36",
            "body": "is this an argument for taxation or something?  Oh not those landlords. Do you have an allodial title?  No. Why?  Because when the government conquered the land and took ownership they never sold you one.. and you agreed to those terms.\n\nThis is the exact same argument like it or not.  Land owners are tenants of government owned property. You don't want to pay the tax rent, then you have no standing to claim moral highground in the defense of landlords",
            "score": -4,
            "replies": []
        }
    ]
}