{
    "title": "USAID took half a billion dollars in taxes from Americans, and sent it to an NGO called Internews Network. They work with 4,000+ outlets to “train journalists” and “tackle disinformation”. It’s led by Jeanne Bourgault, who USAID paid $500k a year.",
    "author": "ProtectedHologram",
    "subreddit": "Anarcho_Capitalism",
    "rank": 142,
    "score": 391,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 56,
    "url": "https://imgur.com/a/uU4VKoQ",
    "id": "1ix0xm0",
    "selftext": "",
    "comments": [
        {
            "author": "MisterMurica1776",
            "body": "Source for the brigaders who can't do a fucking Google search: https://www.usaspending.gov/search/?hash=c0452661d2ae71b2fc6ee56304505ccb\n\n2 contracts and 136 grants, meaning the overwhelming majority was just given to them with no obligation.",
            "score": 55,
            "replies": [
                {
                    "author": "wophi",
                    "body": "The nice thing about a grant is you don't have to do any follow up work or track KPIs.  \n\nYou just write the check and you're done.  I'm surprised that the govt ever does contracts.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "rhos1974",
                            "body": "I have worked under grants in healthcare that required me to provide monthly reports on progress. I’m sure there are some grants that don’t require documentation but there are many that do.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "CryptoRocky",
                                    "body": "I’m on the board for a billion dollar grant program, and we require KPIs, milestones etc. Many grant programs do not though.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RSherma",
                            "body": "I’m not defending these grants, but I do want to say that they do have to do a decent amount of reporting. I’ve had the miserable experience of having to read through 2 CRF Part 200 (the Federal grants and financing support rules) plenty of times. https://www.ecfr.gov/current/title-2/subtitle-A/chapter-II/part-200?toc=1\nThey’re their own form of burden. And pass the money through a state allocation process, and you’re spending money complying with two layers of messy rules.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "trinalgalaxy",
            "body": "Don't forget that that whole was blocked from forming her propaganda organization in the US so she ran over to the UK to do it yet our illustrious dictators made sure they still got paid...",
            "score": 6,
            "replies": []
        },
        {
            "author": "DMBFFF",
            "body": "The sooner Musk fires ALL federal workers and cuts funds to all federal agencies, the better!",
            "score": 65,
            "replies": [
                {
                    "author": "jakedasnake1",
                    "body": "The only actual ancap comment on here so far, super weird how this post is getting brigaded",
                    "score": 30,
                    "replies": [
                        {
                            "author": "divinecomedian3",
                            "body": "The statists are starting to feel the heat",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CakeOnSight",
                    "body": "does DOGE have the ability to do any of that? I dont know or care how any of this works lol",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "StanfordWrestler",
                    "body": "This should be the top comment.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "divinecomedian3",
            "body": "\"Don't you know? COBOL defaults empty addresses to this exact address. Those grants just didn't have an address, which is totally normal when allocating hundreds of millions of dollars.\"",
            "score": 10,
            "replies": []
        },
        {
            "author": "slackjaw79",
            "body": "Bad news for the pro-disinformation crowd.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Grouchy_Competition5",
            "body": "Well, yeah. Someone has to tell journalists what to say.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CakeOnSight",
            "body": "So glad this stuff ive been saying for YEARS is coming to light",
            "score": 2,
            "replies": []
        },
        {
            "author": "RacinRandy83x",
            "body": "Imagine if doge actually had auditors working for them",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zacppelin",
            "body": "All these money is to destabilize foreign government, install our people, so that our business can easily go in and sweep up all their resources. Just like how we will soon have ownership on the remaining resources in Ukraine (whatever is left of it).\n\nYou cannot just think of cost in a business, you have to think of return of investment. For the amount of money that the corporate America had made over the years, most of these money are \"well-spent\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "bewenched",
            "body": "Are they really the Free Press if they’re being paid off aka “bribed”?",
            "score": 1,
            "replies": []
        },
        {
            "author": "taimoor2",
            "body": "It’s the propaganda arm of US government. Half a billion is well worth it…\n\nI am all for tackling government waste but government propaganda is essential in the modern world, especially with rise of China.",
            "score": 1,
            "replies": [
                {
                    "author": "CryptoRocky",
                    "body": "Can you expand on this? I generally disagree, but am open to hear your opinion",
                    "score": 3,
                    "replies": [
                        {
                            "author": "taimoor2",
                            "body": "Just to clarify, you want me to explain how government propaganda is useful for sovereign countries in the modern world?\n\nI want to confirm before I write up a long-ass reply after misunderstanding your comment.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "greyduk",
            "body": "And how much did we waste sending Trump to 5 minutes of the Super Bowl and Daytona 500?\n\n\nI'm all about cutting government spending, but this administration (100% predictably) is not interested in the least.\n\n\nThey're setting up the system so we'll still be robbed, it will just be somehow even less transparent.",
            "score": -52,
            "replies": [
                {
                    "author": "hkusp45css",
                    "body": "I'm not sure it's entirely appropriate to compare the cost of moving the President between public appearances to sending $500M to a fake agency at an abandoned building over the course of years for a sham mission that they aren't even capable of fulfilling and which holds no value for any taxpayer EXCEPT the recipient.",
                    "score": 51,
                    "replies": [
                        {
                            "author": "Lovesmuggler",
                            "body": "Yes this is just one example, the 20 billion hidden at the EPA to pay in kickbacks to democrat politicians is a bigger scandal.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "hkusp45css",
                                    "body": "It's all scandalous. The faster we find it and cut it out, the happier Americans should be.\n\nOddly, we seem to have a lot of progressives doing their dead level best to defend this kind of shit.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rogue-Telvanni",
                    "body": "Are you capable of forming a single thought that isn't a whataboutism?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "greyduk",
                            "body": "It's not whataboutism it's that he's lying about saving money, and getting supposed libertarians and anarcho-capitalists to drool over him. He's taking that money, and putting it in his pocket. \n\n\nI'm not talking about Biden, I'm not talking about democrats, I'm not talking about anyone other than Trump. He's not saving American taxpayers a dime.  Well, a couple of his friends, he will. ",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "moon_apes_unite",
                    "body": "Are you really comparing fuel costs of a couple short flights... to 500 million dollars? 🤣",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "JonZ82",
            "body": "Proof is an imjur photo. Yall dumb as a bag of rocks",
            "score": -48,
            "replies": [
                {
                    "author": "MisterMurica1776",
                    "body": "Learn how to do a Google search please",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "RandomGuy92x",
                    "body": "I'm not an ancap, I'm actually left-leaning. But this is absolutely accurate information, and it wasn't discovered by DOGE but by WikiLeaks, who are a much more reliable source of information than DOGE. You can look up the Internews contracts and grants on the official government website: [https://www.usaspending.gov/search/?hash=dd63a590994dea53dcbbff15a1d1d509](https://www.usaspending.gov/search/?hash=dd63a590994dea53dcbbff15a1d1d509)\n\nThe USA Spending website has the same address listed for Internews. And if you use Google Maps to search for that address you'll find the same picture of that building.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "multipleerrors404",
                            "body": "94k and 16k is definitely not half a billion",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "RandomGuy92x",
                                    "body": "Those are just direct contracts. But there are also 136 grants that are listed, the largest one being for over $81 million. Combined those grants are definitely worth several hundred millions of dollars.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "multipleerrors404",
                                            "body": "Oh OK.  I only glanced.  Was wondering if maybe it was the wrong link?",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "NotBillNyeScienceGuy",
                                                    "body": "Tabs at the top you can see “Grants”, which have no contractual obligation",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "multipleerrors404",
                                                            "body": "Appreciate it. Holy crap.  That's insane.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "NotBillNyeScienceGuy",
                                                                    "body": "I don’t see how they have a nonprofit status and the CEO makes $500k a year. Although here where I live the homeless shelter’s board members all make $250k a year and the auditors say it’s “industry standard”",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "multipleerrors404",
                                                                            "body": "I used to give to united way out of my paycheck at an old job until I found that it was mostly spent on marketing.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hyperlinux",
            "body": "How is it wasteful to spend money training journalist on how to deal with and eliminate misinformation. The “people” that see this is wasteful usually have things to hide.",
            "score": -47,
            "replies": [
                {
                    "author": "Lovesmuggler",
                    "body": "The government calls anything it doesn’t like misinformation to censor it.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "ToxicRedditMod",
                    "body": "The modern version of \"misinformation\" is truth not approved by the gov't. I think it's ok if our billions are not spent on that. If it's important to you, you are free to donate to that cause.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Gemini_Of_Wallstreet",
                            "body": "What used to be considered misinformation: THERE'S A MAGNITUTDE 9 EARTHQUAKE IN CALIFORNIA EVERYONE PANIC\n\nWhat is now considered misinformation: a woman is a female of the species homo sapiens.",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TWlSTED_TEA",
                    "body": "Misinformation is an authoritarian dog whistle for censorship",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Rogue-Telvanni",
                    "body": "If you genuinely think that's what's going on here, you need to listen to what Mike Benz has to say about all of it.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "denimdan1776",
            "body": "And that cost you the tax payer .0014cents last year.",
            "score": -37,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "Cool, if it's so little, then it's fine to cut it.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "RandomGuy92x",
                    "body": "I'm not an ancap, and I'm left-leaning in fact. However, I'd say the problem is not just the financial cost to the tax payer here. I think the bigger problem is that the government is actively infilitrating the media in the name of \"combatting misinformation\". That's the opposite of freedom of speech and freedom of the press.\n\nWhen the government gets involved in the media in order to push or suppress certain narratives I'd say that is a major problem. I certainly don't trust the Republican Party. But equally I also don't trust the Democrats. So when politicians, who are paid for by Wall Street, mega corps and lobbyists try to stir the media into a certain direction I view that as deeply concerning.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Anxious-Educator617",
                            "body": "Left leaning and defending this crap. You are in fact left , don’t add the leaning crap.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "RandomGuy92x",
                                    "body": "I'm generally left-wing, yes. But that doesn't mean that I trust the government. Just like the Republican Party the Democrats are also controlled by the mega corps, the ultra-wealthy and lobbyists. I'm not sure what you think I'm trying to defend. I'm saying the exact opposite, that it's concerning if the government gets involved with the media.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "denimdan1776",
                            "body": "True, but there is a lot of misinformation and disinformation out there. People need to be trained on how to decipher what is and isn’t. That includes misinformation from places like China and Russia and Saudi Arabia and a wide breadth of others that we KNOW is putting out this misinformation on our social media and astroturfing their views. For .0014 cents a year per citizen the US gov trying to combat that. \nI’ll take that bill over all of the subsidies and bombing runs we’ve paid for over the years. I am sure it has a pro democracy slant to the training but anything coming out of America I trust more than Putins propaganda",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "HelpRespawnedAsDee",
                                    "body": "> For .0014 cents a year per citizen the US gov trying to combat that.\n\nBro, right here you have prove that those .0014 cents (lol) are in fact, not being used for what you think are being used. \n\nBtw, lmao at claiming some sort of moral high ground while accepting that USAID is used as a form of colonialism but, since it's not THEIR colonialism then it must be good. \n\nGood job lmao.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "seniordumpo",
                                    "body": "Nothing says fighting disinformation like journalists taking government approved disinformation classes.  What could possibly go wrong.  And also here’s an idea, why do we need to fund either this or the bombing runs, why not neither.  As of right now we fund both so neither sounds much better.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "denimdan1776",
                                            "body": "Yup and I’m 100% sure Trump is going to cut military funds /s\n$500,000 vs 650,000,000,000",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "seniordumpo",
                                                    "body": "Probably not, a few months ago I would have been highly doubtful he would cut anything from USAID.  I enjoy a government cut wherever I see one.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}