{
    "title": "Trump is an authoritarian because doesnt respect individual liberty",
    "author": "Historical_Donut6758",
    "subreddit": "Anarcho_Capitalism",
    "rank": 171,
    "score": 0,
    "upvote_ratio": 0.44,
    "num_comments (reported by reddit)": 39,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1ix7pgz/trump_is_an_authoritarian_because_doesnt_respect/",
    "id": "1ix7pgz",
    "selftext": "Thats the post.",
    "comments": [
        {
            "author": "myadsound",
            "body": "Ancaps already know",
            "score": 21,
            "replies": []
        },
        {
            "author": "unintegegratedshadow",
            "body": "Well he’s a president so…",
            "score": 14,
            "replies": []
        },
        {
            "author": "AToastyDolphin",
            "body": "https://preview.redd.it/q6zqr3lfo4le1.jpeg?width=757&format=pjpg&auto=webp&s=e566e93e94b8413a7f93737814e579e261cc6f6d",
            "score": 12,
            "replies": [
                {
                    "author": "Ya_Boi_Konzon",
                    "body": "Lmao",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Historical_Donut6758",
                    "body": "https://preview.redd.it/i5ta7uk3r4le1.jpeg?width=1080&format=pjpg&auto=webp&s=3672be24975d24b045973738695fcf6b1b8ca0b4\n\nfixed it for you",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TradBeef",
            "body": "Yes and?",
            "score": 6,
            "replies": []
        },
        {
            "author": "XDingoX83",
            "body": "Ok ",
            "score": 18,
            "replies": [
                {
                    "author": "crinkneck",
                    "body": "Agreed. And pretty much applies to all but like 4 politicians in the last century.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "RonaldoLibertad",
            "body": "Can't disagree. \n\nBut is there an argument you're trying to make or defend?",
            "score": 17,
            "replies": [
                {
                    "author": "NOIRQUANTUM",
                    "body": "checked the profile, he's an anti work commie. Just another reddit leftist being mad.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "ToxicRedditMod",
                            "body": "Posting on Reddit for 12 hours a day isn't a job?",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "NOIRQUANTUM",
                                    "body": "unfortunately no. Unless if you like getting paid in social validation. Then again, it doesn't pay the bills.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RonaldoLibertad",
                            "body": "Not surprised.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RickSanchez86",
            "body": "And water is wet.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DumpyDoggy",
            "body": "False, an authoritarian does not respect individual freedom to any degree whatsoever. \n\nDon’t downplay authoritarianism and don’t trivialize it’s victims.",
            "score": 9,
            "replies": [
                {
                    "author": "Historical_Donut6758",
                    "body": "so by that logic then pinochet wasnt an authoritarian since he respected private property rights for the most part",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ya_Boi_Konzon",
                            "body": "Correct.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tichy",
            "body": "What do you mean, what individual liberty?",
            "score": 5,
            "replies": [
                {
                    "author": "RandomGuy92x",
                    "body": "Well, for example Trump supports the death penalty for drug dealers and has praised communist China for their harsh anti-drug laws.\n\nHe also threatened to imprison Mark Zuckerberg for life. And he threatened to revoke the licence of TV broadcasters that are critical of him. He also threaten to imprison Liz Cheney and the J6 committee. And Trump's FBI Director, Kash Patel, has said that he would go after people in the media and persecute members of the media who have spread misinformation and who have lied to the American people.\n\nAnd in one of Trump's recent executive orders he said that the Attorney General would charge teachers with sex crimes for using their students prefered pronouns. Which regardless of what you think of trans stuff is obviously massive government overreach.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Tichy",
                            "body": "Drugs, OK, I can understand the \"individual liberty\" argument, although in reality it is not quite as simple.\n\nI don't see what the other stuff has to do with individual liberty. Presumably he wants to go after some people for breaking the law, especially with regard to election interference?\n\nTeachers, some have clearly been grooming the kids, in which case \"sex crime\" seems an appropriate charge. I doubt they will be charged for using preferred pronounds, though. I couldn't get a clear answer googling yet, but it seems in many places NOT using preferred pronouns would get teachers fired or punished, which is also a massive government overreach.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RandomGuy92x",
                                    "body": "So with regards to Mark Zuckerberg Trump apparently thought that Zuckerberg was illegally interfering in the election or something, or tweaking the Meta algorithm in favor of the Demcoratic Party. Which is also a question of individual liberty. In a country without government regulation Zuckerberg would be free to do with Meta whatever he wants. So that's certainly about individual liberty as well.\n\nAnd Trump threatened to imprison Zuckberg for life for election interference, which even according to current US laws would be ridiculous.\n\nAnd with regards to trans stuff, in one of his executive orders he definitely used language that implied that simply using a student's prefered pronouns could be considered a crime if the student is a minor. And I understand you may have critical views of trans stuff, but if a 16 year old asked a teacher to be referred to by a name and pronoun different from their biological sex, criminally charging a teacher for complying with that would be a massive violation of free speech.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Tichy",
                                            "body": "Well there seem to be laws around election interference. Pesonally I agree that private companies should be allowed to say what they want (within the limits of free speech). In the end Zuckerberg donated to the inauguration party, so it seems the threat was not that serious.\n\nAs for criminally charging teachers for using prefered pronounds, I would wait to get enraged about that until it actually happens. There is too much fearmongering going on.\n\nIt's also a difficult subject. How DO you effectively protect children from grooming? I don't really like banning certain topics from school completely, but what if it is the only effective solution? Otherwise you can only get into a hellscape of ever more complicated and detailed laws about what can be said in what way under what circumstances, which may simply not be practical. And the fact is a lot of teachers are pushing the ideologie, how do you distinguish them from the ones who merely heed the wishes of 16 year old trans kids?\n\nSchool in itself is a questionable thing if kids are forced to go and government has almost a monopoly on it.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kurtu5",
                            "body": "> Trump supports the death penalty for drug dealers\n\nBut he freed Ross?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RandomGuy92x",
                                    "body": "Well, yeah, that was probably a tactical concession to the crypto community in order to get their vote. But Trump has also said on numerous occasions that he wants to impose the death penalty for drug dealers and has praised China for their harsh anti-drug laws.\n\n[https://www.youtube.com/watch?v=NUClE1P8ApI](https://www.youtube.com/watch?v=NUClE1P8ApI)\n\n[https://thehill.com/homenews/campaign/4305566-trump-doubles-down-death-penalty-for-drug-dealers/](https://thehill.com/homenews/campaign/4305566-trump-doubles-down-death-penalty-for-drug-dealers/)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Every leader is authoritarian in one way or another, it all depends how much they choose to push the boundaries of their authority, it's especially authoritarian against those wouls be said adversaries.\n\nThat being said. Trump is the greatest mix bag of shit we have so far leading",
            "score": 2,
            "replies": []
        },
        {
            "author": "SoylentJeremy",
            "body": "You are correct.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NOIRQUANTUM",
            "body": "Ok what's your point? \n\nMaybe get a hobby, touch grass? I heard photography or tennis is fun. Try that.",
            "score": 2,
            "replies": [
                {
                    "author": "Historical_Donut6758",
                    "body": "that such a fact needs to be periodically reminded given the high number of trump apologists in this group",
                    "score": 0,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "well the top comments of this post beg to differ. There are pro trumpers and anti trumpers here. Nuanced as a political discussion sub should be. I mean, we even have a \"socialist\" user flair here. Just because we don't censor anybody we disagree with doesn't mean it is wrong.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Historical_Donut6758",
                                    "body": "there is no reason at all when an anarcho capitalist should vote for trump. none whatsoever. otherwise they are cosplayers",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "kurtu5",
                                            "body": "> There are pro trumpers and anti trumpers here. \n\nWere you not able to understand that statement?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Historical_Donut6758",
                                                    "body": "you cant be an anarchist and a supporter of trump. plan and simple",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "kurtu5",
                                                            "body": " Are you stupid?  Thre are both pro and anti here.   Do you know what that means?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "NOIRQUANTUM",
                                            "body": "like I said, this is an anarcho capitalist subreddit but we have a people with a wide range of different political beliefs here that isn't anarcho capitalism. Plenty of posts here that have criticized Trump here have received numerous upvotes. \n\nSeriously, get a hobby",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Even-Reindeer-3624",
            "body": "Just for giggles, is there anyone on the other side that would represent this issue a little better than Trump?",
            "score": 2,
            "replies": []
        },
        {
            "author": "manupan",
            "body": "Yes, but the democrats are even more authoritarian imo, so who you prefer? You only have 2 options so choose the least bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gemini_Of_Wallstreet",
            "body": "Choosing the lesser of two evil is still choosing evil...",
            "score": 0,
            "replies": []
        },
        {
            "author": "DMBFFF",
            "body": "Agreed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "frud",
            "body": "Thank you, word_word#### for another amazingly insightful post.",
            "score": 1,
            "replies": []
        }
    ]
}