{
    "title": "Why jump over the new state of the art subway turnstile spikes and metal shields in New York City when you can just walk through the door?",
    "author": "carlanpsg",
    "subreddit": "Anarcho_Capitalism",
    "rank": 139,
    "score": 179,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 20,
    "url": "https://v.redd.it/pj8y627gk5le1",
    "id": "1ixd5x8",
    "selftext": "",
    "comments": [
        {
            "author": "Schowzy",
            "body": "It's state run, it should be no surprise it's riddled with holes and inefficiencies.",
            "score": 73,
            "replies": [
                {
                    "author": "EccentricPayload",
                    "body": "Exactly. If it was privatized there's no way a company would allow these potential profits to get by for free.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Schowzy",
                            "body": "They would be called racist for doing it though. /s",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Revolutionary-Cup954",
            "body": "But we have to charge cars to drive on streets their taxes pay for for this",
            "score": 25,
            "replies": []
        },
        {
            "author": "DifficultEmployer906",
            "body": "Does NYC not know about automatic secure exists? We have them in nearly every airport in the country",
            "score": 8,
            "replies": []
        },
        {
            "author": "MrBobBuilder",
            "body": "It blew my mind how many people were okay just stealing like that when I visited",
            "score": 39,
            "replies": [
                {
                    "author": "GodFromMachine",
                    "body": "Stealing from the state is alwasy the correct choice. My insane taxes should be enough to maintain public transportation with no additional charge, if they weren't devoured by government bureocrats in every step of the way. If anything, not paying for the subway is a small form of reimbursement.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Zacppelin",
                    "body": "Cutting costs, that's the nature of businesses.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Lil_Ja_",
                    "body": "That’s not stealing, the train is unowned",
                    "score": 2,
                    "replies": [
                        {
                            "author": "critsalot",
                            "body": "the state manages it. you need to pay for it to get maintance. the japanese pay before they get on a train. its a cultural issue we have fallen to the point where people are ok with not paying for it (also for it to be allowed not to be maintained to japanese standards)",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Lil_Ja_",
                                    "body": "I do pay for it to get maintenance \n\nWhether I use it or not",
                                    "score": 28,
                                    "replies": []
                                },
                                {
                                    "author": "Angus_Fraser",
                                    "body": "Then what are the taxes for?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "ElderberryPi",
                                            "body": "To deflate the currency, and to let you know who's boss?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "critsalot",
                                            "body": "i wasnt aware new yorkers paid taxes for it. figured it was solely based on fees for the train. if its already been paid for then yea charging does seem like double dipping.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "upchuk13",
                            "body": "I'd go short of saying it's theft, but it's antisocial and shouldn't be done.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ExcitementBetter5485",
            "body": "Silly bot, you already posted this last month.",
            "score": 12,
            "replies": []
        },
        {
            "author": "rasputin777",
            "body": "DC is like this too.  \n\nHalf the people entering the metro walk through the little bypass door.  \n\nI tried it once after like 20 other people did. I was stopped by the station manager. Actual racism in the wild.",
            "score": 5,
            "replies": []
        },
        {
            "author": "CakeOnSight",
            "body": "beauty in the heart of darkness",
            "score": 1,
            "replies": []
        },
        {
            "author": "NinSeq",
            "body": "Maginot line vibes",
            "score": 1,
            "replies": []
        },
        {
            "author": "stKKd",
            "body": "Is this woke spikes? They're rounded",
            "score": 1,
            "replies": []
        }
    ]
}