{
    "title": "The Ukrainian ambassador to the US realising that the billion dollar money laundering racket is finally coming to an end",
    "author": "Kyle_Rittenhouse_69",
    "subreddit": "Anarcho_Capitalism",
    "rank": 69,
    "score": 413,
    "upvote_ratio": 0.65,
    "num_comments (reported by reddit)": 377,
    "url": "https://i.redd.it/cyvba7zgp1me1.png",
    "id": "1j0vlg4",
    "selftext": "",
    "comments": [
        {
            "author": "None",
            "body": "[deleted]",
            "score": 209,
            "replies": [
                {
                    "author": "CarmeloManning",
                    "body": "Lockheed Martin this, Lockheed Martin that.  Has anyone checked on Northrop Grumman?",
                    "score": 70,
                    "replies": [
                        {
                            "author": "PacoBedejo",
                            "body": "Raytheon quarterlies matter.",
                            "score": 45,
                            "replies": []
                        },
                        {
                            "author": "Wregdam",
                            "body": "What about Sikorsky",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Helicopter0",
                                    "body": "Lockheed bought Sikorsky.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SgtCheeseNOLS",
                    "body": "I don't even think they asked Boeing or Raytheon if they were ok with this",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "One_Mathematician159",
                    "body": "Did anyone ask a Ukrainian what they wanted? This is all about extorting Ukraine for minerals because they are weaker than us.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "scpecialInk",
            "body": "\"Kyle\\_Rittenhouse\\_69\"",
            "score": 147,
            "replies": [
                {
                    "author": "kvakerok_v2",
                    "body": "4 doors - more whores.",
                    "score": 51,
                    "replies": []
                }
            ]
        },
        {
            "author": "jmmgo",
            "body": "There probably is a less sinister and more likely explanation on why she responds like that instead of \"a laundering racket is finally coming to an end\".\n\nWar is terrible. Even Trump understands that. OP clearly doesn't.",
            "score": 174,
            "replies": [
                {
                    "author": "Kyle_Rittenhouse_69",
                    "body": ">War is terrible. Even Trump understands that. OP clearly doesn't.\n\nZelensky clearly doesn't.",
                    "score": -154,
                    "replies": [
                        {
                            "author": "NtsParadize",
                            "body": "Was he supposed to let Russia take over Ukraine?",
                            "score": 111,
                            "replies": [
                                {
                                    "author": "flyingchimp12",
                                    "body": "Been going on for 3 years with no peace talks. How fucking naive do you have to be to think it’s still about not letting Russia take over at this point.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Kyle_Rittenhouse_69",
                                    "body": "That's not why they invaded. Do some research. You have the entire internet at your disposal. No excuses 👍",
                                    "score": -100,
                                    "replies": [
                                        {
                                            "author": "Secretsfrombeyond79",
                                            "body": "> That's not why they invaded.\n\nLmfao, demonstrating that good old two parties two braincells. \"If the other party opposes it, then I'm gonna be completely partisan to the opposite!!!\"",
                                            "score": 48,
                                            "replies": []
                                        },
                                        {
                                            "author": "ripyurballsoff",
                                            "body": "Russia invaded because they want the natural resources. That’s it.",
                                            "score": 66,
                                            "replies": [
                                                {
                                                    "author": "daennie",
                                                    "body": "Well, no. You're literally mapping behavior of USA during Iraq war onto other countries.\n\nWhy do fuck we need resources from Ukraine? We in Russia already have more unexploited resources than Ukraine have at all.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "ripyurballsoff",
                                                            "body": "Your economy is based on natural resources and not much else. Putin knows he can feed the war machine while trying to secure more. Why wouldn’t rich people want more resources to get richer ?",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ur_a_jerk",
                                                    "body": "that's not the reason. they already have a lot of it.",
                                                    "score": -38,
                                                    "replies": [
                                                        {
                                                            "author": "Jumanian",
                                                            "body": "What they can’t want more?",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "author": "ur_a_jerk",
                                                                    "body": "Russia seized Donbas in 2014. can you find and information of them exploiting or expanding the mines, or clocking in big revenues? nope.\n\nThat is not the reason for the war. Other factors were much more important",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ripyurballsoff",
                                                                            "body": "Yea because we’ll be getting accurate info from an authoritative state. Russia’s economy is trash because of decades of authoritarian communist rule and they’re heavily invested in energy and natural resource exports. They don’t make money on anything else. They have to try and monopolize fossil fuel energy or they’ll collapse. They’re going the feast or famine route which means war and leveraging resources.",
                                                                            "score": 15,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "tim310rd",
                                                                                    "body": "But there really isn't significant mining left in those areas of Ukraine, and we have satellite capabilities, we can see if people are mining, but they haven't been. This is mainly just farmland, and a few old salt mines like the giant one in soledar, which isn't exactly a rare earth mineral.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "angrypassionfruit",
                                            "body": "Tell us why please.",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "author": "Boxatr0n",
                                                    "body": "NATO expansion was a big part of it. Not the only part but it did play a major role in the decision. Probably gonna get downvoted for saying this cause for some reason everyone believes Putin is just an idiotic war hungry monster who doesn’t think before he acts. Crazy cause he was KGB and was briefly the head of Russias intelligence.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "OldAge6093",
                                                    "body": "They invaded for regime change",
                                                    "score": -15,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "And...?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "jmmgo",
                                            "body": "They invaded because Russians are imperialist people who long for authoritarianism. It's very sad.",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "daennie",
                                                    "body": "> Russians are imperialist people who long for authoritarianism. It's very sad.\n\nAnd it's racism.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "BendOverGrandpa",
                                                            "body": "I saw above you claim to actually be Russian.\n\nDo you agree with your dictator Putin's actions in regards to Ukraine?\n\nAlso have you been drafted yet or are you already employed by the state?",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "daennie",
                                                                    "body": "> Do you agree with your dictator Putin's actions in regards to Ukraine?\n\nNo, but I really think Trump's peace deal is the best what Ukraine can get in this situation. If Zelensky continues the war, Ukraine will face to even worse deal in one or two years.\n\nAnd do not forget that as long as the war continues, there will be more dead people on both sides among combatants and civilians. And nothing in return as result.\n\n> Also have you been drafted yet or are you already employed by the state?\n\nBoth, of course.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BendOverGrandpa",
                                                                            "body": "There was no peace deal offered though, that's the problem. And it never included both the parties that should be involved. And there were no security guarantees.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "daennie",
                                                                                    "body": "> There was no peace deal offered though, that's the problem.\n\nYes, but we have framework of the deal from rumours. And even that very unpleasant for Ukraine deal will be difficult to sell to Putin.\n\n> And there were no security guarantees.\n\nAnd for Ukraine without a significant improvement on the ground there'll no guarantees in future too.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "jmmgo",
                                                            "body": "I would call it realism.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ClimbRockSand",
                                                    "body": "Americans have been much more imperialist than Russia since the current Russian government arose in 1989.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "NtsParadize",
                                            "body": "Your arguing skills are on par with J.D. Vance.",
                                            "score": 37,
                                            "replies": []
                                        },
                                        {
                                            "author": "Time_4_Guillotines",
                                            "body": "I dId My OwN rEsEaRcH…\nFuck off bot",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Time_4_Guillotines",
                                            "body": "https://preview.redd.it/qtaoca6yg3me1.jpeg?width=1164&format=pjpg&auto=webp&s=2f5fe42ab239004f3fd02f36e6b89d3be28da8ec",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "MerryMortician",
                                                    "body": "It’s fitting Zelensky has the Reddit logo on his chest there.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "OldAge6093",
                                    "body": "Russia invaded to change the regime there",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "author": "Jumanian",
                                            "body": "Even if that’s true that’s not a good reason. That like saying I don’t like my new neighbor better go takeover his home to get the old owner back.",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "angrypassionfruit",
                            "body": "What part of your house and land are you willing to give away for “peace”?",
                            "score": 72,
                            "replies": [
                                {
                                    "author": "JizzGuzzler42069",
                                    "body": "This type of thinking is what gets more bodies thrown into the grinder. The war must end.\n\nIf Ukraine seriously believe they’re going to retake their post territory from Russia by force, they’re delusional. They haven’t made any meaningful gains over the past year and Russia has massively ramped up military production. Russia has more troops, more arms, and has heavily fortified their taken positions.\n\nUkraine *cannot* maintain the war and gain ground. Russia simply has far more bodies and weapons to throw at the problem. \n\nTo be clear, Russia is in the wrong to have invaded. They’re a terrible country led by a terrible person, but whoever is the “right” doesn’t matter here. The only way Ukraine gets to continue to exist long term is by cutting a deal. That or NATO gets involved directly with boots on the ground and that’s simply not going to happen. If it does, we’re looking at world war with strong potential for nuclear force, nobody wants that. And frankly, I’m not willing to risk nuclear war so that Ukraine gets to continue to be a country.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Ok-Section-7172",
                                            "body": "At this point, I kind of do want that. Give Ukraine their nukes back, let us leave them alone and be done. If it's nuclear, great, let's do this in the name of \"NONE OF OUR DAM BUSINESS\".",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "JizzGuzzler42069",
                                                    "body": "Nuclear is everyone’s damn business.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "_whatidontknow_",
                                                            "body": "Well said, JizzGuzzler42069.",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ok-Section-7172",
                                                            "body": "It either is, or it isn't. This is a piss or get off the pot moment. If we won't participate in our agreement, then we need to rollback that agreement. Let's take the anarcho capitalist approach. Is it our business, or is it not our business? Can't be both. We aren't authoritarian, or at least shouldn't be. Isn't our motto, it's not in our area, it's not our business? We can't have it both ways.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "JizzGuzzler42069",
                                                                    "body": "It’s everyone’s business in the sense that if someone starts slinging nukes, nuclear fallout becomes everyone’s problem. \n\nLike, in a scenario where Russia decides to chuck 100-200 nukes at Europe, and Europe chucks their nukes back, that level of nuclear damage will have world wide consequences on people’s health and production of food and good.\n\nIt is quite literally impossible to say, while living in a country with one of the biggest nuclear weapon stock piles in the world, that nuclear war doesn’t affect you lol. When your children and grandchildren are coughing up blood from the radiation poisoning seeping into all of the water and food we drink, will it be your problem then?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sbd104",
                                                                            "body": "We tested way more than 200 nukes during the Cold War. It would not cause nuclear winter.\n\nHumans also don’t automatically have an increased health risk from that level of increase to back ground radiation as it’s honestly negligible on a world wide scale.",
                                                                            "score": -2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ignatzioisntme",
                                            "body": "“Give me Freedom or give me death” used to mean something to Americans",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "webdevverman",
                                    "body": "Ukraine is unable to defend their land, though. They are already giving away mineral rights for the US's help.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "OSHAstandard",
                                            "body": "Trump wants them to accept giving up there minerals. In exchange they get zero security guarantees and Russia gets to keep all that land they took and then they just invade Ukraine again in 4 years. So why wouldn’t they just keep fighting now.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "Competitive_Board909",
                                                    "body": "American workers in Ukraine is the security guarantee. Are you too daft to realize that? If American workers are attacked, Trump would open the floodgates of terror on Russia. How do you not understand that?",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "OSHAstandard",
                                                            "body": "Then why couldn’t trump say that when asked? All he could muster was oh Putin wouldn’t do that. He couldn’t say if they invaded again they would defend them. Is it because it’s not a security guarantee? Us had intelligence assets in Ukraine in 2014 and 2022 did that stop Russia?",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "Competitive_Board909",
                                                                    "body": "Bc Zelensky tried to leverage that as American troops on the ground at all times and America continually providing weapons systems. That’s not what the deal is. The deal is a ceasefire. Zelensky was ungrateful, called the VP by his first name on international television, and called him a bitch under his breath “suka”",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OSHAstandard",
                                                                            "body": "If it’s a security guarantee then trump would say that. It’s not stop being stupid. The only thing trump has said is Putin wouldn’t do that. Vance was being a dick and if he called him a bitch he was just telling the truth. Vance started the whole butsbit of thanking him. For what? He has thanked America, Biden trump countless times.  He was lying and trying to stir the pot.  Why should he thank Vance he has done fuck all for Ukraine beside try to push a deal where on America and Russia win and Ukraine gets invaded again in a few years.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Competitive_Board909",
                                                                                    "body": "Trump has one of the best records regarding foreign wars of any modern day President: NO NEW FOREIGN WARS. He told Putin in his first term that if Putin invaded Ukraine that he would blow up Moscow. And guess what? Putin didn’t invade Ukraine during his first term. A ceasefire is not a deal that is supposed to include security guarantees. What you’re asking for is an alliance. An alliance is when you enforce one side over the other. Trump doesn’t want to benefit either side moving forward. Nor do American taxpayers want to have to keep paying for defenses of Ukraine. A ceasefire is when both sides declare a truce. Just be honest and say you want an alliance. You don’t want a ceasefire. You don’t care if the war ends. You only care if Ukraine is protected. If both sides stop fighting then Ukraine is safe. You want an alliance. Not a ceasefire. Not the same thing. A ceasefire shouldn’t include security guarantees, otherwise it looks like an alliance. Do you understand now? Do you understand how easily you have been tricked bc people conflate words to mean the same thing when you didn’t understand the difference between them to begin with?",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Time_4_Guillotines",
                                                                                            "body": "Look at you. Stroking the shaft, cupping the balls, and swallowing the gravy.\n\n![gif](giphy|hs7Pvg2O3dFqliXKAl)",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Competitive_Board909",
                                                                                                    "body": "When all you can muster is an ad hominem attack, I know I’ve won the debate.",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "OSHAstandard",
                                                                                            "body": "So trump threatened to blow up Moscow if they invaded? But now his plan is to roll over and give them everything they want? I don’t want a ceasefire and neither does Ukraine because without a security guarantee it’s just going to be Russia invading them for a third time. What is so hard to understand about this. Do you understand now? Trump dosent want peace he wants a headline that he “saved Ukraine”. Just like he “saved Afghanistan” by negotiating strictly with the Taliban and leaving Afghanistan out of the negotiations.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Competitive_Board909",
                                                                                                    "body": "Oh jfc. Trump did inform the Afghanistan military of what was going to happen. It was supposed to happen in stages. Biden did it all at once in the middle of the night. Where tf do you get your news from? Joy Reid? Keith Olbermann? \n\nWhere is the whole Trump rolling over thing coming from? What there makes you think Trump is rolling over? The US is not supposed to be defending Ukraine. It’s not supposed to be wasting its tax dollars to protect a country with an ungrateful leader who doesn’t care about a ceasefire. And yes, Trump’s threat worked and it will work again. But you don’t want a ceasefire. You just want more war powers",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "OSHAstandard",
                                                                                                            "body": "They don’t want a ceasefire with our security guarantees. That’s just pushing off the next invasion so why would they want that? It what way shape or form in your head is that something they should be happy with?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Competitive_Board909",
                                                                                                                    "body": "If the US consistently elects strong Presidents that keep other countries like Russia in their place then this ceasefire would last. But if the US decides to elect corrupt establishment war mongers like Obama and Biden again who allowed and encouraged Russia to invade Ukraine then yeah the ceasefire may not last. But moving forward, Americans now knowing much more about their government, should be looking at presidents who are the complete opposite of Obama and Biden.",
                                                                                                                    "score": 5,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "OSHAstandard",
                                                                                                                            "body": "How is trump a strong leader if he’s giving Putin everything he wants? This is literally encouraging further invasions.",
                                                                                                                            "score": -1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Competitive_Board909",
                                                                                                                                    "body": "What is he giving Putin? What is he encouraging? Come on Joy Reid. Tell me.",
                                                                                                                                    "score": 3,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "OSHAstandard",
                                                                                                                                            "body": "Let’s see Russia keeps all the land and Ukraine gets no nato and no security guarantees. That’s exactly what Russia wants and that encourages a future invasion because this one was successful. Let’s see what ya got putins puppet.",
                                                                                                                                            "score": -1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Competitive_Board909",
                                                                                                                                                    "body": "When Russia invaded Crimea under Obama, Obama gave them Crimea. Are you gonna complain about that too?\n\nThe Biden admin and NATO dangled Ukraine’s bid for admission in front of Putin’s nose like a carrot for years both on back channels and in the media. If NATO and the Biden admin actually wanted Ukraine as a NATO member, then they should have just done it quickly before Putin had a chance to invade. But they didn’t. They encouraged the invasion by doing this for so long. \n\nAnd again, if Americans can elect strong Presidents and not corrupt ones like Obama and Biden then this ceasefire will keep. But if people like you stick to vote blue no matter who, then keep dreaming about war.",
                                                                                                                                                    "score": 4,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "OSHAstandard",
                                                                                                                                                            "body": "So not a single thing to refute what I just said. What about what about what about. I think the problem your having is you realize your wrong and you have jump through hoops now to defend dear leader.",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Competitive_Board909",
                                                                                                                                                                    "body": "I addressed each sentence in its own paragraph. I’ve seen you comment in this sub for a long time. I’m getting the impression you’re a Reddit bot that was recently updated to Ukraine simp mode. Bc an ancap sub simping for another country is the furthest thing from ancap",
                                                                                                                                                                    "score": 2,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "OSHAstandard",
                                                                                                                                                                            "body": "You addressed trump giving Russia everything with a what about with Obama. If Obama was weak what does that make trump? And yeah I’m a 8 year old bot here.",
                                                                                                                                                                            "score": 2,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        },
                                                                                                                                                                        {
                                                                                                                                                                            "author": "OSHAstandard",
                                                                                                                                                                            "body": "Dying over here to hear how Obama was weak because of 2014 but dear leader trump is a big strong great leader for bending the knee to Russia.",
                                                                                                                                                                            "score": 0,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "author": "Competitive_Board909",
                                                                                                                                    "body": "And also, don’t be a little baby and delete your posts. I get emails for each one. I can post them here for everyone to see.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "OSHAstandard",
                                                                                                                                            "body": "Haven’t deleted a single fucking post",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Time_4_Guillotines",
                                                                            "body": "The couch fucker is a suka blyat.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Handsome_Warlord",
                                                                                    "body": "Zelensky is an actor, whose goal is to extend the war as long as possible.",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Time_4_Guillotines",
                                                                                            "body": "Prove that. Like actually back that up with something besides an Alex Jones video.",
                                                                                            "score": -2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Handsome_Warlord",
                                                                                                    "body": "He ruled out peace talks and negotiations from the beginning. \n\nAnyone with the functioning brain noise you should at least try to have peace talks and negotiations, if they don't work then go to war. \n\n But at least talk first. \n\nZelensky's orders were to wage war as long as possible so the US politicians can launder their money in the most corrupt country in Europe.\n\nZelensky only learned Ukrainian in 2016, he isn't even a proper Ukrainian. He's a puppet.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Time_4_Guillotines",
                                                                                                            "body": "Citation needed",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Time_4_Guillotines",
                                                                                                                    "body": "Ok, someone invades the US. Say China. They take the east coast, all of it. The Putin negotiates with China, without the US, for China to stop if we give Putin half our oil. Also, China keeps the land they’ve taken so far.\n\nAt what point does saying fuck no make us the bad guy in this scenario?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Ok-Section-7172",
                                                            "body": "we are not golden gods just because we are american.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Ifyouwant67",
                                                    "body": "Because they are losing their ass.  There is no scenario where it's going to end well for the Ukrainen people. Zelensky and his cronies have stolen enough that they'll leave the country and live in luxury. The people are fucked.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "> Because they are losing their ass. \n\nWhat are you talking about?  The occupation zone hasn't shifted in over a year.  Ukraine has recently started attacking targets in Russia itself.  At best, they're at a perpetual stalemate.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Ifyouwant67",
                                                                    "body": "Give me a fucking break. You don't think mainstream media hasn't become the propaganda department for Ukraine.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "serious_sarcasm",
                                            "body": "So might makes right, NAP be damned?",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Secretsfrombeyond79",
                                            "body": "> They are already giving away mineral rights for the US's help.\n\nBut I thought they were ungrateful and weren't repaying anything.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "angrypassionfruit",
                                            "body": "You clearly didn’t watch the news.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "heresyforfunnprofit",
                                            "body": "Trump wasn’t offering help in return for the mineral rights tho.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "webdevverman",
                                                    "body": "It's what they are working on, no?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "heresyforfunnprofit",
                                                            "body": "No. Trumps “offer” was that Ukraine signs over mineral rights, but offered no security guarantees in return. That was the situation from the start, and it never changed. \n\nThey established a “framework” for discussion which they claimed they could work out in person, and then they staged this (with Russian state TV invited into the White House) to publicly drop Ukraine by claiming they tried to negotiate with Zelensky. But at no point did Trump offer any aid, arms, or security guarantees in return for those mineral rights. \n\nThis was theater for Trump’s supporters and Russia. Pretty sickening.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "webdevverman",
                                                                    "body": "So it's not worth it. And Trump is telling Zelensky it's not worth it, and it's time to talk peace with their enemy. It's not pretty or ideal, but the US should not be involved. We can't keep being the world's police.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "heresyforfunnprofit",
                                                                            "body": "The US already made a treaty with Ukraine to defend their territorial integrity - that was why they denuclearized in the late 90s. That context is important, and people want to ignore it. We already agreed to do this a long time ago.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "webdevverman",
                                                                                    "body": "Did the Budapest Memorandum go into detail about how much support would be given? There's a limit, right?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "heresyforfunnprofit",
                                                                                            "body": "What limit do you think has been passed? The US has sent no troops, moved no active military assets into action, and has taken no direct action to protect the border integrity and thus fulfill its obligations under the agreement. They have only sent outdated assets which were sitting in warehouses waiting to be decommissioned. Contrary to Putinist propaganda, this has saved us nearly as much in disassembly and disposal as it has cost us in “aid”. \n\nRussia violated the treaty through action - by invading. The US violated the treaty through inaction - by watching. Russia’s violation was one of perfidy, while the US’s violation was one of cowardice. \n\nRectifying the situation and fulfilling our obligations now requires far more than it would have if we had acted decisively in 2014 or 2022. The longer we wait the higher that eventual cost will be. \n\nYou’re making the arguments of those who fear that Ukraine, a non-nuclear state, will “cause” WWIII, and ignore that abandoning Ukraine will **guarantee** WWIII. \n\nYou are arguing for “peace in our time”. There is no peace to be made until Russia’s imperial ambitions are destroyed. \n\nHistory has taught this again and again and again, yet there are always those who believe they can trust the words of an imperialist despot.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DungBeetle007",
                            "body": "did zelenskyy invade russia?",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "The_Business_Maestro",
                            "body": "I’m not the most informed on the matter. But aren’t the terms that all seized land gets to be kept by Russia and wasn’t Zelensky not even involved in the actual negotiations?\n\nVery much feels like the bully getting rewarded. All ancaps should realistically lean in favor of Ukraine given the whole nature of the NAP",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "4nonosquare",
                                    "body": "Ancaps understand nuance and do root for Ukraine to hold on long enough so russia gives up as the cost of war rises civilian unrest.\n\nConservative npcs like OP turn on Fox News and other republican propaganda channels, or in the case of online creators sometimes even straight kremlin propaganda (Tim Pool, Dave Rubin, Lauren Southern and the whole Tenet Media group) so their world view is always gonna be what the state tells them to think.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "The_Business_Maestro",
                                            "body": "Yeah. Sad though",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jimboslyce04",
                                    "body": "I’ll put it this way. The only reason we cared about Ukraine in the first place was that they could help destabilize Russias military. They’re now very weakened. Are we now just going to continue funneling billions to them?  It sucks they lost territory but it’s not our fight. The same people complaining about the US being the worlds police now want us to be said police.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "The_Business_Maestro",
                                            "body": "As far as the country goes it is indeed very beneficial to continue helping Ukraine. The US pours so much into defense spending it can afford to portion some of that over to help Ukraine without anything changing internally. The benefits is that they garner a loyal ally, continue to weaken Russia on the geopolitical stage which makes China more hesitant to act, and if handled correctly they can make a phenomenal trading partner out of Ukraine (who already we decent for their impressive agriculture, but imagine if they turned into the next Germany).\n\nMaybe I’m just a decent person, if I see someone getting robbed I’ll step in. It’s not just about my freedom, but the freedom of everyone that I care about. Because it makes the world better for everyone when more of us are free.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "jimboslyce04",
                                                    "body": "Aww you’re so nice. Pay for your benefits with your own money. We’re tired of paying for Zelenskyy’s ego.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "The_Business_Maestro",
                                                            "body": "But you’re not. Of all the things to complain about government spending money on, support to Ukraine is both numerically and ethically low on the list. Let alone that a big part of it was offloading old military equipment that was costing the military to store.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Secretsfrombeyond79",
                                            "body": "> They’re now very weakened. \n\nNot destroyed. And if the war pays off for them they are gonna get revitalized. \n\n> but it’s not our fight\n\nLet's see if it's gonna be your fight when more and more of the world pulls out of the dollar and starts negotiating with the BRicks, who are gonna inevitably spread socialist dictatorships to create satellite countries, like they've already been doing in Venezuela, Brazil, Malasya, etc.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "jimboslyce04",
                                                    "body": "Well we aren’t going to “destroy” a superpower (however weakened) by sending money to their rival. Do you want to destroy them?  That’s called WW3 and looking at this sub, that’s not popular, nor should it be. \n\nThe US dollar is still supreme. Your doom and gloom means nothing. No one is pulling out of the dollar because Zelenskyy got his feelings hurt.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Jumanian",
                                                            "body": "We’re not sending money though we’re sending equipment",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "jimboslyce04",
                                                                    "body": "https://apnews.com/article/fact-check-us-aid-ukraine-money-equipment-714688682747  \n\nFalse",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Secretsfrombeyond79",
                                                            "body": "I'm talking figuratively, by destroy I mean cripple, do enough damage that perdures in time. \n\n \n>The US dollar is still supreme.\n\nyeah, and my house is clean, since it's clean, maybe I should dump an entire gargabe truck inside of it, I mean, it's clean after all, I'm sure after I do everything I can to dirty it will still be clean, because it's impossible for my house to be dirty.\n\nIs my analogy good enough ? Did you get the point ? \n\n>No one is pulling out of the dollar because Zelenskyy got his feelings hurt.\n\nFuck Zelensky and fuck his feelings. I'm talking about world powers spreading socialist dictatorships around the fucking world. Something that should at best be a little bit worrying to anyone with two funcitonal neurons.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "jimboslyce04",
                                                                    "body": "You mean like we’ve already done. Face it, Russia is a shell of its former self. Let’s not go into even further debt helping someone who is not even a legal ally. \n\nNo your analogy wasn’t good. What currency is more stable. I get we have our debts, that I personally can’t stand, but China’s built on a house of cards, Russia is Russia, and the EU is teetering on social collapse. We have our problems sure, but the US is still the gold standard. \n\nSocialism is an issue that needs to be addressed. As Venezuela, Malaysia, and Brazil go does not dictate how actual superpowers go. Those countries have flirted with socialism before (looking at you Venezuela) but they aren’t representative of the world at large. You wanna fuck up your own country, be my guest.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Secretsfrombeyond79",
                                                                            "body": ">You mean like we’ve already done. Face it, Russia is a shell of its former self. Let’s not go into even further debt helping someone who is not even a legal ally.\n\nAlready done ? You think a small economic crisis is enough to cripple a country ? Did the 2008 crisis crippled the USA ? Shell of it's former self ... and China is already crumbling any time now !.\n\n>No your analogy wasn’t good.\n\nYou not liking it doesn't make it not good. You not getting the point is what would make it not good. And I think you got it.\n\n> I get we have our debts, that I personally can’t stand\n\nIt's not about just debts, it's about lost of soft power, constant increase of debt ( of which Trump already is trying to approve an increase of 4.5 more trillions to it's ceiling ), but most importantly, about your enemies becoming stronger as time goes on.\n\n>but China’s built on a house of cards\n\nOh yeah I'm sure that the dictatorship that didn't collapse because 70 million of it's people starved to death, is about to fall because they may have a 5% decrease in their GDP. Aaaaany second now, maybe tomorrow even who knows ! \n\n>We have our problems sure, but the US is still the gold standard.\n\nNo one is discussing that the US is not the most powerful country on earth and the most influential. I am arguing about the continuity of said status quo and what that means for the rest of the planet, given who is clearly going to replace that position.\n\n> As Venezuela, Malaysia, and Brazil go does not dictate how actual superpowers go.\n\nThey are not the superpowers  EInstein, they are the satellite states.\n\n>You wanna fuck up your own country, be my guest.\n\nDo you even know what you are talking about ? Russian and Cuban troops were found in Venezuela during the times of Chavez, they helped the corrupt part of the army to remain in control. Russia backed the dictatorship to flourish with economic support in exchange for natural resources and debt. China is doing the same on Africa and Asia.\n\nThe world is slowly turning to the Bricks by influence and political takeovers.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Gemini_Of_Wallstreet",
                                    "body": "The reality is we don't know what the fuck trump is cooking in his peace term because he's literally said nothing.\n\nThe only thing trump 100% confirmed is that the US will not support Ukraine's NATO bid. that's all.\n\nThe realistic scenario is probably russia keeps the annexed territories, with the establishment of a DMZ and UN, or European NATO troops moving to keep the DMZ.\n\nObjectively that is the best deal which minimizes loss of life and prevents future conflict. \n\nBut again we have no clue, who tf know what Mango is cooking anymore, just enjoy the shitshow.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "The_Business_Maestro",
                                            "body": "Pretty much like everything with Trump does. Genuinely feels like watching America strangle itself. Makes me happy to live in the nanny state that is Australia lol",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Kyle_Rittenhouse_69",
                                    "body": ">But aren’t the terms that all seized land gets to be kept by Russia\n\nSource?",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "The_Business_Maestro",
                                            "body": "That’s what I was asking you. The onus to provide evidence is on you as you’re the one making the initial argument against Zelensky and Ukraine",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Time_4_Guillotines",
                                    "body": "https://preview.redd.it/4jyk7fl5h3me1.jpeg?width=1164&format=pjpg&auto=webp&s=f6304d22ece9a2ddcb4f5787e966aed0506c9f24",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jmmgo",
                            "body": "A person in his position should have kept his cool.\n\nBut it's difficult to blame him. They have suffered so much because of Russia. I sympathize that, the world has suffered so much because of that one country. Russians have suffered too, but they can't help themselves to cause all this havoc.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Kyle_Rittenhouse_69",
                                    "body": ">A person in his position should have kept his cool.\n\nHe should also wear different clothes for a change, the optics on that outfit are wearing as thin as the material",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "jmmgo",
                                            "body": "I have no idea what you are talking about. I could not care less how another man dresses.",
                                            "score": 18,
                                            "replies": []
                                        },
                                        {
                                            "author": "xdisappointing",
                                            "body": "Imagine being so concerned with the way another man dresses.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Foch155551",
                                            "body": "Ahh, but when Elon Musk is in the Oval office, he can wear anything right?",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "FranknessProductions",
                                            "body": "I think he has more important things to worry about right now than packing a suit",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ribblan",
                            "body": "If trump wants peace he needs to meet both parties in the middle, not only meet putin on his terms. you can't have russia and us negotiating about ukraine when russia is invading them and the US is blaming ukraine for the war.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "MaineHippo83",
                                    "body": "he's trying to speed run a cease fire because he wants a Nobel prize like Obama got, thats it, that is all he cares about. Everything else is just smoke and mirrors.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Competitive_Board909",
                                            "body": "He wants a ceasefire bc that’s all any country can help coordinate. Whether or not they adhere to that ceasefire is on those countries involved. Putting American workers inside of Ukraine was the security guarantee. If Putin attacked Ukraine while American workers were there, do you think Trump would have let him get away with that? Absolutely not. He’s not going to take kindly to American lives being threatened. That was the security guarantee. You all just have your heads so far up your asses that you thought money, troops, and more weapons is the only way to make a security guarantee. Use some logic. And stop simping for a country that has no benefit to the US and is located on the other side of the planet.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "MaineHippo83",
                                                    "body": "Americans were already killed in the current invasion.\n\nThe mining wouldn't be right on the border. If Russia sent troops in the workers would be evacuated.\n\n\nAlso trust us bro was already given to Ukraine for their nukes and soon how that worked out",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Competitive_Board909",
                                                            "body": "During the Obama administration. Not during Trump’s. Trump told Putin he would blow up Moscow if he invaded Ukraine during his first term. And guess what? Putin didn’t invade Ukraine during Trump’s first term.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "MaineHippo83",
                                                                    "body": "And trump is only in office for 4 years. You are proving Zelenskys point. In 4 years Russia can rearm and train a new army to finish the conquest.\n\nThis is why actual binding guarantees are needed.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Competitive_Board909",
                                                                            "body": "Or, in four years the US will elect another strong president who will keep Russia in check regarding the ceasefire. And not elect and corrupt weak POS like Obama or Biden who allowed and encouraged Russia to invade Ukraine. You just confirmed to me how corrupt every other administration was and how Trump’s admin is the only legitimate one.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MaineHippo83",
                                                                                    "body": "Siding with Russia and i6t's narrative isn't strong. Extorting the weaker country let alone your ally for its resources isn't strong it's being a bully.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ClimbRockSand",
                            "body": "You got brigaded by deep state bots and shills.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ribblan",
            "body": "Yes clearly she is not worried that this is doing irreparable damage to Ukraine US relationship and that will cause ukraine to be in an disastrous position in the war.",
            "score": 174,
            "replies": [
                {
                    "author": "Beneficial-Piano-428",
                    "body": "Who cares? Not our winless war and we’ve funded it long enough.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "nzricco",
                            "body": "What do the non Trump supporting Americans think is going to take to win this war for Ukraine? As the war goes on, Russia slowly takes more territory. Its still about two more years before Russia runs out of stockpiled equipment. Do they want US troops to win the war for Ukraine, and start WW3?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "fitandhealthyguy",
                                    "body": "They delusionally believe that Ukraine can beat Russia.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Null_zero",
                                            "body": "History has shown that with support a smaller country can beat a much larger one on its own land. Vietnam showed that and the discrepancy in forces between Ukraine and Russia is much smaller than n. Vietnam vs the USA.  The afghans did the same to the USSR and to the USA. \n\nSo it’s not a matter of it being winnable.  It’s hard to say we shouldn’t be supporting Ukraine as we’re the ones that disarmed them of nukes for that support in the first place.  If we had just minded our own business then I doubt Russia goes after a nuclear Ukraine.  \n\nSo yeah we can renege on the deal now but don’t expect anyone else to make any agreements with the us going forward. We don’t honor our contracts.  Just ask the natives. Doing business with the us is ironically Russian roulette.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "fitandhealthyguy",
                                                    "body": "You are talking about countries with little centralized authority and almost all soft targets. Do you believe that Russia couldn’t level Kiev if they chose to? The goal does not appear to be the total destruction of Ukraine. In fact, there has been little fighting beyond the Russian speaking eastern regions that Ukraine was trying to get under control",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Null_zero",
                                                            "body": "Sure it could, and that would be EASIER.  That's the whole point.  Could the Ukraine stand toe to toe with the full might of Russia if they wanted to level the country? No.  Can they make it cost more than what Russia would get out of it? Yes.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "fitandhealthyguy",
                                                                    "body": "The question is, what does Russia want out of it if they don’t want the destruction/total takeover of Ukraine?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Null_zero",
                                                                            "body": "https://www.visualcapitalist.com/mapped-ukraines-mineral-resources/",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "fitandhealthyguy",
                                                                                    "body": "They would get even more by leveling Ukraine. Mining wouldn’t be impacted. I don’t buy that Russia is doing this for rare earths.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Null_zero",
                                                                                            "body": "If they level Ukraine then they'd have to replace the workers that are in the mines, the equipment they destroyed and all the other infrastructure that helps move and refine the minerals.\n\nNot to mention if you go total war in Europe you're going to solidify action against you.  You can't ignore the political environment that exists if you just start carpet bombing non-combatants.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "fitandhealthyguy",
                                                                                                    "body": "There won’t be total war in Europe over Ukraine or it would have happened already. Russia already has those regions and doubtful they will give them up.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Null_zero",
                                                                                                            "body": "You were the one proposing total war by Russia vs Ukraine not me.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "fitandhealthyguy",
                                                                                                                    "body": "You stated all out war in Europe which suggests the rest of Europe being involved - perhaps this is not what you meant?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Null_zero",
                                                                                                                            "body": "Ukraine is in Europe.  If you do total war against Ukraine you're committing total war in Europe, the continent, not the EU political organization.  The rest of Europe the continent, is not going to view that favorably.  \n\nHope that clears up the confusion I can definitely see where I could have been clearer.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "fitandhealthyguy",
                                                                                                    "body": "In my opinion(and probably not just mine). They want an “independent” Ukraine with a friendly government/president that won’t pursue NATO membership. They want to maintain that buffer that has shrunk over the last 30 years.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Null_zero",
                                                                                                            "body": "Which is still a limited goal that doesn't involve nuking or conventionally bombing Kiev to nothing.  So is your opinion that the Ukraine can't possibly win against Russia's limited goals even with material help from other nations?  You started out arguing that Ukraine can't win because Russia can level Kiev.  And I said that they don't want to do that and Ukraine can win in defensive war just by making the cost unpalatable and now you're saying that Russia doesn't want to level Kiev.  It seems like you're arguing my points.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "fitandhealthyguy",
                                                                                                                    "body": "It depends on the definition of winning. As long as Ukraine is at war, Russia gets what they want - no NATO membership. That is winning for Russia. How can Ukraine come out of this with all of its territory intact and NATO membership? They can’t. That would be winning to Ukraine.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Null_zero",
                                                                                                                            "body": "Maybe, if the US drops NATO like musk is proposing, then that's not a forgone conclusion.  However I think Ukraine getting out with its territory intact would be enough for Ukraine to have won.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "fitandhealthyguy",
                                                                                                                                    "body": "Do you see that as a likely outcome? The second part not the US leaving NATO. I think the only way that happens is with a guarantee of no NATO membership for Ukraine (even then not so sure about it) and Zelensky has vaguely said security assurances which is a veiled reference to NATO membership. I appreciate the dispassionate, reasoned discussion!",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Null_zero",
                                                                                                                                            "body": "It gets less likely with the US backing out, as it then falls to Europe, but I think saying we(whether or not that we continues to include the US or not) agreed to protect Ukraine from aggression for disarming and we will do so. Even if they are not part of NATO that gives the reasoning to provide support.  \n\nWith enough support and continued sanctions Russia isn't going to be able to keep up financially.  Its essentially the exact same playbook that was used in the early 80s in Afghanistan.  It was a mire that was one of the reasons the USSR eventually failed completely.   I don't see Russia staying so long they bankrupt themselves, its just not worth it. Its been 3 years, we were in Afghanistan for twenty years and the same people are in power now as when we left.  I don't think Russia can keep things up that long. \n\nRight now with a pro Putin president in office its their best time to take advantage of things.  If they can entrench their position to the point that it costs the rest of Europe too much to dig them out then it works the other way.  So even if they weren't in a good place Putin would make sure to the world it seems like they're the strongest they've ever been. I don't think Russia can keep it up for 10 years and they need an end faster than the Ukraine does (assuming Ukraine keeps getting material support).\n\nThe thing that could change the long term war would be support from China.  They weren't a factor in Afghanistan in the 80s because of their conflict with Russia in 69.  If they start supporting Russia financially and materially then the entire war could be extended for a decade or more and the outcome would be a tossup especially if the US stays out of it.\n\nAll I can say is regardless of the outcome I hope this stays a proxy war.  The potential for WW3 is all too real if it breaks containment.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "2ShredsUsay39",
                                    "body": "Taking Ukraine is Russia's first step in resurrecting the Soviet Union. If they take Ukraine, Ww3 is much more likely.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Beneficial-Piano-428",
                                            "body": "They don’t want all of Ukraine.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "nzricco",
                                            "body": "Russia can't go any further into Europe without getting NATO involved. NATO may have weakend over the last few decades, but the Russian military is in no position to take on any first class military.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "2ShredsUsay39",
                                                    "body": "You must have missed the part where Trump is on a path to abandon NATO. Without the U.S. NATO loses a lot of its effectiveness. Especially when it comes to air defense, air power, intelligence, signal intelligence, and logistics. A few countries are pretty good, many are not up to standards. But the U.S. brings the best and most important stuff.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PacoBedejo",
                            "body": "This. There literally isn't an available win condition.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "According_Gazelle472",
                            "body": "I agree 100 percent. Not our fight .",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Ribblan",
                            "body": "I would accept that, no problem for me, but the 3 years already funding the war sort of getting thrown in the bin, due to bad peace negotiation favourableyo russia. the whole point of funding the war was to give ukraine better card. but now trump has literally told the whole world ukraine has no cards left. trump could at least make a deal with EU for them to take over funding like let's say over a year, the way it's done now is just so bad for ukraine. and just not using harsh rethoric against ukrainr would even strengthen his position, and that wouldn't cost a dime, even if trump didn't like zelinsky personally, he shouldn't express it publicly he should have taken that in the backroom.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Beneficial-Piano-428",
                                    "body": "Naw fuck all of that. There’s no transition needed. You want money go get it from the rest of the world. We paid our share. We’re out. We did our best and we shouldn’t be required to pay another penny.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Ribblan",
                                            "body": "Not only are you out, you are making sure US will never step in again, because of trump blaming ukraine for the invasion. this is extremely beneficial knowledge for russia to see this on full display. now everybody know exactly where the red line is for trump, and that's bad. russia know they can push hard on ukraine without trump stopping him. that's exactly why trump didn't really negotiate for ukraine, he have ukraine an ultimate on russias terms.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Pristine_Tension8399",
                                                    "body": "Ok. I don’t care about Ukraine. They can grift money elsewhere.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Ribblan",
                                                            "body": "I know you guys don't care, and thats fine, but you don't need to back the aggressor just because trump does, you can still defend ukraine without giving them aid.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Pristine_Tension8399",
                                                                    "body": "Fine. I’m rooting for Ukraine to win without my tax dollars. 🇺🇦",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ribblan",
                                                                            "body": "Thats great and can't you tell your leader to fk off and not sell ukraine to putin while u are at it 😉",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Beneficial-Piano-428",
                                                    "body": "Not my or americas problem. Zelenskyy did this to himself, he’s an ungrateful bastard that will get many more of his own people killed before it’s all said and done.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Ribblan",
                                                            "body": "While trump is calling zelinsky a dictator, zelinsky still says he is thankful, not sure what more he could do though. You want zelinsky to bend the knew to trump and wrongfully admit that zelinsky was responsible for the war to get weapons. how many russia talking points dmwould you say ukraine need to submit to so they are allowed to buy military aid from the USA?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "That’s not how Zelynskys name is spelled first and foremost…. Let’s start with these basic corrections.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ribblan",
                                                                            "body": "I was typing on a phone, if i want to be judged on my spelling rather than my arguments, ill join a spelling bee",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "*bend the KNEE",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "sadson215",
                                    "body": "Not true.  Deal can be made with Russia for rare earth minerals.  See win win situation.  Regardless of outcome US win.  Russia win.. US win.  Ukraine win US win.  Russia and Ukraine win.... UD win!",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Ribblan",
                                            "body": "If u think a promise from russia is worth anything, I think need a history lesson. Ukraine already gave away their nukes for their independence, and now they are going to give 20% of their land AND their minerals, what's really left of their independence at this point.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "fitandhealthyguy",
                                                    "body": "Kind of like the promise not to expand NATO?\n\nhttps://nsarchive.gwu.edu/briefing-book/russia-programs/2017-12-12/nato-expansion-what-gorbachev-heard-western-leaders-early",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "shelf_paxton_p",
                            "body": "You are aware of the benefits US receives as global hegemon? If you abdicate that role as you are, then not only is your time as number 1 at an end but you’ll also lose those privileges. If the USD no longer the reserve currency your borrowing costs will increase significantly and a significant percentage of your wealth will be gone forever.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Beneficial-Piano-428",
                                    "body": "What wealth? We’re in a huge deficit and spend billions of dollars a day. We don’t have any wealth we’re trillions in debt. Are you referring to our currency and banking standards? What benefits are you referring to specifically?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "shelf_paxton_p",
                                            "body": "Look, if your time in the sun has come to an end fair enough, I’m just shocked that it’s come from within and not from a competitor nation. You may have huge debts (relatively not that bad) but they will become bigger by losing the status of THE global reserve currency.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Beneficial-Piano-428",
                                                    "body": "How so? Why aren’t people on the yen right now?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "shelf_paxton_p",
                                                            "body": "https://en.m.wikipedia.org/wiki/Exorbitant_privilege",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "You just got shit on intellectually. Literally give me your thoughts on what you just said. You have an opinion right? Let me hear it from you",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "shelf_paxton_p",
                                                                            "body": "‘I got shit on intellectually’? Is the level of discourse you think qualifies as intellectual? Are you American by any chance?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Beneficial-Piano-428",
                                                                                    "body": "So no opinion?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "shelf_paxton_p",
                                                                                            "body": "Go and play outside the adults are talking 😘",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "shelf_paxton_p",
                                                            "body": "Good Russian Bot",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "Try to be more clever I know it’s hard. I believe in you.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "shelf_paxton_p",
                                                                            "body": "![gif](giphy|klKH2pAqArqF2)",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "Free Taiwan.🇹🇼 china bot",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "shelf_paxton_p",
                                                                            "body": "![gif](giphy|ocdVPFPABhpte)",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DumpyDoggy",
                    "body": "Clearly not, Ukraine elites has already been in a disastrous position for years and kept feeding their people into a meat grinder to keep the money flowing.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "serious_sarcasm",
                            "body": "Do you really think America wouldn’t initiate a draft if it were invaded, like the both sides did during the Civil War?",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Alternative-Dream-61",
                                    "body": "We initiated a draft to throw people into Vietnam. Of course we'd draft for an invasion.  But we'd also have a ton of volunteers.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "daennie",
                                            "body": "> But we'd also have a ton of volunteers.\n\nThere were tons of volunteers in Ukraine too. They just... ended.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ifyouwant67",
                                            "body": "Probably around 80 million",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "serious_sarcasm",
                                            "body": "So then you admit that JD acting like Zelenskyy was King George forcing conscription was complete fucking horseshit?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Alternative-Dream-61",
                                                    "body": "I don't know of a single nation that wouldn't resort to conscription during a defensive war when their territorial sovereignty was threatened.  So yea, attacking him for conscription is dumb.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "FieryBalrog",
                                                            "body": "Maybe take a look at this thread and watch some of the clips of *how* they do it: https://x.com/mylordbebo/status/1895752927991792126?s=61&t=evNHbId4xE3cjzEfQbNSqA",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Alternative-Dream-61",
                                                                    "body": "No shit.  It's conscription. He doesn't want to go.  The fuck you think happened to draft dodgers during Vietnam or WW2 in this country?\n\nNo, I don't think it's good.  It fuckin sucks.  I also don't think it's good that Russia invaded in the first place.  This is how the sausage gets made.  War is hell.\n\nAnd yet every country on Earth would do this if they were invaded.  The USSR even put men with guns behind the conscripts so if they ran they got shot too.  Saw rumors that Russia was doing the same at Bakhmut.\n\nAgain.  War is hell.  Should Ukraine just give up half their country and half their resources for no guarantee it won't happen again?",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "serious_sarcasm",
                                                            "body": "So then the asshat conservatives astroturfing for Putin in this thread are part of the problem. \n\nAt least I am an honest library loving liberal.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "AgainstSlavers",
                                                                    "body": "I oppose conscription when Americans do it, too.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "serious_sarcasm",
                                                                            "body": "Yeah, right, because you’re totally not a novelty account pushing propaganda for Russia.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Hostificus",
                                            "body": "You’ll have ZERO volunteers in 2025 if Mexico backed by china invaded.",
                                            "score": -21,
                                            "replies": [
                                                {
                                                    "author": "tim310rd",
                                                    "body": "You'd have at least one in me, also how the hell is China supposed to back Mexico in such a situation? Their navy is a bit of a joke, we could just blockade the coast and they really couldn't do shit. Plus, have you seen the poor excuse Mexico has for a military?",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "IntentionCritical505",
                                                    "body": "LOL I'd be a freelancer.\n\nYou do realize that this is low-key the dream of at least 100 million armed Americans, right? A rifle behind every blade of grass.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "inter71",
                                                    "body": "You’re right. Because that war would last one day.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Beneficial-Piano-428",
                                    "body": "Is this actually a serious question?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "serious_sarcasm",
                                            "body": "Yeah, there’s a fucking a difference between conscripting soldiers to die in foreign invasions, and a draft to protect from a foreign invasion.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Beneficial-Piano-428",
                                                    "body": "So what’s that have to do with your question? We wouldn’t draft people we would just force any able bodied man to serve like in Ukraine right now? No I I don’t think that will happen.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "serious_sarcasm",
                                                            "body": "It’s cool. I wasn’t expecting anything but disingenuous bullshit from you.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "I didn’t expect an actual rebuttal from you so we’re square as a bear.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "PacoBedejo",
                                    "body": "I think the US government would definitely enslave men into its defense. I know that I would definitely shoot those who attempt to enslave me and mine. But, I'd also defend my local community against outside invaders. I just wouldn't give a fuck if one of the Florida Keys was occupied by Guatemala and I sure as fuck don't care one sliver about Ukraine and its enslaving regime.\n\nDo you support slavers?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "serious_sarcasm",
                                            "body": "Fuck your loaded question and sophistry. \n\nCowards like you are the reason we have to have governments to promote the common defense.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "PacoBedejo",
                                                    "body": "It would be cowardly of me to not head down to the Florida Keys from my Indiana home to fight off Guatemalan invaders?\n\nIt's cowardly of me to not give a fuck if the corrupt government of Ukraine falls to the corrupt, aggressive government of Russia?\n\nThis is really about corrupt, enslaving governments battling over land on the other side of the planet. That isn't sophistry.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "serious_sarcasm",
                                                            "body": "Yeah, draft dodging during an invasion is cowardly. Why is your neighbor in Indiana worth saving, but not the one in Florida?\n\nAnd fuck your sophistry.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "PacoBedejo",
                                                                    "body": "So, you'd be willingly enslaved? Weak.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DumpyDoggy",
                                    "body": "There has been an invasion going on the last 4 years, haven’t seen a draft yet",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "serious_sarcasm",
                                            "body": "Okay, kid.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ncdad1",
                            "body": "Soounds like Rusia could screw them over by quitting and going home.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "sadson215",
                            "body": "Ukrainians be driving Maybachs all over Europe.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GurlNxtDore",
                    "body": "Relationship that began when? ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "IntentionCritical505",
                    "body": "How can it be put in a worse position than it is in?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ribblan",
                            "body": "because instead of Ukraine having one superpower against him, there now is two",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "IntentionCritical505",
                                    "body": "You think not giving them unlimited amounts of my grandchildren's money is being against them?\n\nAre you in on the grift?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "mhostetler66",
                                            "body": "Huh, didn't know Lockheed Martin, Northrop whatever, Raytheon, ect were Ukrainian...\n\n\nHilarious you think we just hand them cash...",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "IntentionCritical505",
                                                    "body": "We do. We're paying for the pensions of their civil service as well as their salaries. Do you have a pension?\n\nWe gave them $200 billion and they can't account for half of it. How much of the spending would survive an honest audit?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "mhostetler66",
                                                            "body": "I mean our defense budget isn't exactly batting a thousand either as far as 'accounting for it'.\n\n\nhttps://thefulcrum.us/media-technology/us-funding-ukraine-pensions",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "IntentionCritical505",
                                                                    "body": "So because of waste in the Pentagon the Democrats and Zelenskyy get to steal $200 billion from my grandchildren?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "FriskalPox",
                                                                            "body": "Keep in mind 3/4 of this has been in stockpiled us military assets, built and payed for long ago. the only person stealing your grandchildrens money is the gov contractor getting their 8 million dollar \"bonus\" at the end of the quarter. Israel has gotten far more over that time, and that's a war that will never end.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "IntentionCritical505",
                                                                                    "body": ">Keep in mind 3/4 of this has been in stockpiled us military assets, built and payed for long ago.\n\nThat's the official lie and it's not true. We're sending modern equipment, we've depleted our stockpiles, and we could easily sell it to actual allies instead of giving it to the cokehead. Everything we give away has to be replaced and that costs money.\n\n> the only person stealing your grandchildrens money is the gov contractor getting their 8 million dollar \"bonus\" at the end of the quarter. \n\nYou do realize that the cokehead's war enables that, right?\n\n>Israel has gotten far more over that time, and that's a war that will never end.\n\nHow does that justify this waste and corruption?",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ribblan",
                                            "body": "no not unlimited, just not from the support we have been giving to 0, that's not good, especially when russia knows this, thays just a gift to putin.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "IntentionCritical505",
                                                    "body": ">no not unlimited\n\nReally? What is the limit? \n\n>just not from the support we have been giving to 0, that's not good, especially when russia knows this, thays just a gift to putin.\n\n$0 dollars should have gone to this money laundering operation in the first place. And no, not destroying the country to pay for some random forever war is only a gift to the American people.\n\nWe have ZERO obligation to Ukraine or any other country.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Ribblan",
                                                            "body": "couple more years would show if putin would also have to escalate or ramp down himself. But trump telling the world they are out, thats just leaves out any option for negotiation. what can USA use to deter russia if they already said they won't back ukraine. it's the worst way to negotiate that you give a date on peace, putin can give unreasonable demands and trump would look bad for not coming to terms, thats why every expert on geopolitics are scratching their head and asking what trump really wants.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "IntentionCritical505",
                                                                    "body": ">couple more years would show if putin would also have to escalate or ramp down himself.\n\nYears? GTFO. We're broke.\n\n>But trump telling the world they are out, thats just leaves out any option for negotiation.\n\nSo we have to send unlimited money to the war machine forever because otherwise the world might think we're out of the conflict? \n\n>what can USA use to deter russia if they already said they won't back ukraine.\n\nDeter them from what? \n\n>. it's the worst way to negotiate that you give a date on peace, putin can give unreasonable demands and trump would look bad for not coming to terms, thats why every expert on geopolitics are scratching their head and asking what trump really wants.\n\n\"Every expert\"? You mean the people who lied and got us into this mess? The people who said sanctions would cripple Russia within months? The ones saying Russia would implode?\n\nMaybe those \"experts\" could just listen to Trump since he clearly says what he wants.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CakeOnSight",
                    "body": "Ukraine is a criminal enterprise. she should be worried and little Z should be even more worried. Dictators don't do well out of power.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ribblan",
                            "body": "True putin shouldn't be allowed to do what they are doing",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "deaconxblues",
            "body": "The propaganda is working on OP",
            "score": 102,
            "replies": [
                {
                    "author": "nutidizen",
                    "body": "https://edition.cnn.com/2025/02/28/media/tass-russian-state-media-oval-office\nEveryone should read this.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "No_Net8312",
                    "body": "Yeah. The whole thing was scripted to publicly scuttle the peace talks and keep the conflict rolling. Then the US will just have to keep sending money, because, ya know, it's the right thing to do. \n\nHow did the cameras happen to capture this reporter just at the moment she has a mental moment about the show going on in front of her? \n\nAll the world's a stage.",
                    "score": -18,
                    "replies": [
                        {
                            "author": "morabund",
                            "body": "There were damn near more cameras than people in that room. Also she's very important and involved in the situation being discussed.\n\nThis isn't reality tv. That's a real person having an understandable reaction.",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "CakeOnSight",
                                    "body": "prove anything is real",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "No_Net8312",
                                    "body": "Ok, well, I guess time will tell if I'm right. If the peace deal fails, I'll take my victory lap.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "morabund",
                                            "body": "There not being a deal doesn't mean your right about an insane theory they staged this whole thing to continue aid",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "No_Net8312",
                                                    "body": "When the failure of the peace deal is accompanied by a US aid package, and it will be, I'm sending you mail.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "morabund",
                                                            "body": "Feel free. \n\nIf you think this white house is going to sign another aid package then I don't know what to say.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SuchVanilla6089",
            "body": "Why billions are spent to support the war and literally zero spent on finding a way for peaceful resolution?",
            "score": 14,
            "replies": [
                {
                    "author": "DonaldLucas",
                    "body": "Many people tried but Putin don't want a peaceful resolution.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "flyingchimp12",
                    "body": "Because these people are evil and their supporters are emotional",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Petrarch1603",
            "body": "Many critics argue that America is failing in its role as an ally, but the more pertinent question is: where has Europe been? This war is taking place on its doorstep, yet European nations, despite years of warning, have done little beyond incremental, often hesitant support for Ukraine. The response has been marked more by risk aversion than strategic foresight, leaving the United States to bear the overwhelming financial and military burden.\n\nAt what point does this imbalance become unsustainable? An indefinite security guarantee for Ukraine, absent a long-term strategy, is neither a prudent use of American resources nor a sound basis for transatlantic cooperation. History offers a cautionary tale—Washington once extended similar assurances to the RVN, only to watch its position unravel when domestic appetite for endless commitments waned. The lesson is clear: alliances must be reciprocal, and strategy must be anchored in realism.",
            "score": 33,
            "replies": [
                {
                    "author": "Midnight-Bake",
                    "body": "https://www.ukraineoversight.gov/Oversight-Work/Oversight-Work/\n\n\nAccording to December 2024 numbers the US has only actually sent 80 billion out of a committed 120 since the official Russian invasion.\n\n\nThe EU has committed some 140 billion although because it comes from a number of different sources it is harder to know how much actually has been disbursed.\n\n\nI think it's wild to say the EU has only been incremental compared to the US.  France has said they'd commit troops to a security guarantee if a peace deal is reached but the US has not done so, while also demanding a 500 billion dollar pay out.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "mahvel50",
                            "body": "The problem is the EU is still bank rolling Russia by buying their gas still. Everything they are sending to Ukraine is being equally distributed to Russia because they refused to change energy sources. \n\nhttps://www.theguardian.com/world/2025/feb/24/eu-spends-more-russian-oil-gas-than-financial-aid-ukraine-report",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Midnight-Bake",
                                    "body": "The Kiel institute site isn't loading for me, interesting to see how they track EU contributions. The total the EU has allocated over 3 years is well over 100 billion and much more than the oil (~60 over 3 years). Even if every dollar of oil bought goes to Kremlin profit 150-60= 80 billion net for Ukraine at the same as US disbursed funds.\n\n\nI agree there are tons of issues on Ukraine support.\n\n\nSimilarly the US buys finished or modified petroleum goods from India and Turkey which originated from Russian oil.\n\n\nThis isn't to say the EU is doing all they can do, just to say they aren't insignificant compared to the US.\n\n\nMore importantly it seems very weird that Ukraine has to pay the US for Putin to stop attacking without the US committing any defense or troops for that pay out. What exactly is the Ukraine paying the US for? Why do they need to bribe Trump to get Russia to stop the invasion? Very strange stuff.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "451e",
                                            "body": "US also buys uranium from Russia",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GurlNxtDore",
                            "body": "Rwanda is at war with the DRC. Which side should we back and send billions of dollars of money and assets to?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Midnight-Bake",
                                    "body": "The comment you're replying to is a response to the claim that the US is shouldering significantly more of the defense costs than the EU. It is not a wholesale agreement that we should support Ukraine or any random war with billions spent.\n\n\nThat being said: we should not be friendly with expansionist authoritarian regimes. I fully support sanctions on Russia and don't think they go far enough. The US asking for a bribe to negotiate peace with Russia without any material guarantees for Ukraine is an insane suggestion, and trying to cut Ukraine out of peace negotiations as Trump suggested is disrespectful. If Trump wants to back out of supporting Ukraine, put full sanctions on Russia and wash our hands of the situation... fine. But that's not what he's doing.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IntentionCritical505",
                    "body": "Since when were we an ally with Ukraine?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "rebornsgundam00",
                    "body": "Pretty sure macron and skarmer committed some troops in a year. Problem is zelensky was likely told dont get too greedy with trump and he tried anyway( i cant blame the guy for trying but trump aint gonna fall over for you lmao)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Secretsfrombeyond79",
                            "body": ">( i cant blame the guy for trying but trump aint gonna fall over for you lmao)\n\nyeah, Zelenksi is no Putin. Edit- considering you upvoted me seems you misunderstood my joke. I'm saying that Trump falls over to Putin, as evidenced by late events.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "> Many critics argue that America is failing in its role as an ally, but the more pertinent question is: where has Europe been? \n\n[They've been right there, sending supplies, weapons, and money to Ukraine](https://www.ifw-kiel.de/topics/war-against-ukraine/ukraine-support-tracker/):\n\n> European donors have been the main source of aid to Ukraine since 2022, especially when it comes to financial and humanitarian aid. \n\nhttps://i.imgur.com/BB4Q35u.png\n\n\n\nWhere have *you* been that you don't know this?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Petrarch1603",
                            "body": "[Guardian: EU spends more on Russian oil and gas than financial aid to Ukraine\n](https://www.theguardian.com/world/2025/feb/24/eu-spends-more-russian-oil-gas-than-financial-aid-ukraine-report)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_up_and_atom",
            "body": "Wtf are all these pro war comments? The emotional leftist propaganda is working well on all you people.",
            "score": 30,
            "replies": [
                {
                    "author": "Jumanian",
                    "body": "Is it pro war to defend yourself now? Is the NAP not something that exist for you?",
                    "score": -12,
                    "replies": [
                        {
                            "author": "jupit3rle0",
                            "body": "The US funding a foreign nation is not considered self defense. Quit warmongering you fake ancap.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Jumanian",
                                    "body": "How spineless can you be? Also that’s not even what I said I’m talking about self defense for Ukraine. Can you even read?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "CakeOnSight",
                                            "body": "bot",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "jupit3rle0",
                                            "body": "As Trump stated, Ukraine has no cards left to stand on. It's time to face reality.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "_up_and_atom",
                            "body": "Is the US Ukraine? When did we get attacked?",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Jumanian",
                                    "body": "Did I say that? And anyway is it wrong to help someone who has their NAP violated?",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "_up_and_atom",
                                            "body": "You literally asked is it pro war to defend YOURSELF. Again, did the US get attacked?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "kaves55",
                                                    "body": "I don’t think they were referring to the US being attacked. \n\nThey were speaking in the perspective of the country being attacked when they responded to your question about “Wtf are all these pro war comments”",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unlucky-Pomegranate3",
            "body": "My take is that she’s a real person who understands that a long term mineral rights deal is going to be the most effective Russia deterrent that they can hope to get anytime soon.\n\nNATO sure as hell isn’t going to induct them and for the time being at least, the appetite in the US for eternal war funding has dried up.\n\nThis is simply Zelenskyy taking advantage of the highly visible stage to manipulate world opinion and gain concessions that either give him an out with his money and freedom or keeps the war machine purring.",
            "score": 18,
            "replies": [
                {
                    "author": "mesarthim_2",
                    "body": "If he was such a scumbag, taking the deal under any circumstances would be the way to go.\n\nHe's already rich as fuck, he can end the war, be a hero and if Russia attacks again, it will be Trump to take the blame for pushing Ukraine into the deal.\n\nThere's literally no reason not to take it. The alternative is losing everything.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Jumanian",
                            "body": "If he’s rich as fuck why would he stay in Ukraine? Ya know they place that is being invaded and he can be killed in.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Unlucky-Pomegranate3",
                            "body": "He’s facing impeachment proceedings internally, there’s a hundred billion unaccounted for, and if he wanted to follow the will of his people, he’d remove martial law and allow for an election.  His only probable out is to get US assurances that Trump will not push for an investigation or to keep the war going to buy time.\n\nAnd I highly doubt Trump would get blamed by anyone who matters, just virtue signaling European heads of state who decry him pushing for an end to the war but also refuse to replace the US as Ukraine’s sugar daddy.   Trump’s voters want to stop funding it and the Ukrainian people want to stop the roving bands of kidnappers and press gangs looking for more bodies for the meat grinder.\n\nAnd if anyone actually deserves blame for another Russian incursion, it’ll be the ones who squandered the money and goodwill of the people who gave a damn in the first place. Endless support no matter what isn’t a reasonable expectation for anyone.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EccentricPayload",
            "body": "Just get us out of this war please.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Competitive_Board909",
            "body": "When did an ancap sub become a simp from Ukraine? You guys got co-opted",
            "score": 15,
            "replies": [
                {
                    "author": "_up_and_atom",
                    "body": "Same shit that happened when COVID first started. People here were quick to throw away freedoms because they got emotionally manipulated by the propaganda.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "KaimonJRP",
            "body": "Ok, russian bot.",
            "score": 23,
            "replies": []
        },
        {
            "author": "morabund",
            "body": "People have a right to defend themselves. \n\nNon-interventionism is one thing. But the white house is actively trying to help russia over ukraine. Trying to extort half a trillion dollars from these people does not support liberty.\n\nIt looked like they invited zelensky just to put on this show. What a disgrace",
            "score": 19,
            "replies": [
                {
                    "author": "framingXjake",
                    "body": "I don't think that's the point. Altruism is not a sustainable reason to continue to invest in a never-ending war. But if we have a legitimate economic interest in Ukraine, then we have a legitimate reason to want to defend it.\n\nTrump is banking on the hope that Putin is more concerned with not starting a war with the US than he is with invading Ukraine. So he believes that this deal would end the war without escalating the conflict and risking more lives.\n\nI don't know if he's right but what's the harm in trying? Sure, I'd rather not be involved with Ukraine at all. But if you're bent on ending this war, I personally believe this would be a good place to start.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "The 'deal' is moronic -- Ukraine has no incentive to take it, it's lopsided in favor of Russia, and sends a message that initiating wars of aggression can be an effective way of getting what you want in the geopolitical arena.  \n\nThere's a good reason why it's bad policy to negotiate with terrorists.  The US doesn't *have* to be involved at all, but if we are going to be involved, it should be to maintain a hard line against the *instigators* of wars, and absolutely not to rush this particular war to a fast conclusion in a way that will encourage future aggressors to start new wars.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "framingXjake",
                                    "body": ">Ukraine has no incentive to take it\n\nThe deal gives the US a strategic reason to tell Russia to get the fuck out of Ukraine. \"We have a deal, you fuck with our deal, we come after you.\" Telling Russia to fuck off has literally zero impact on anything without this deal, and funding a never-ending war for the sake of posterity and altruism only gets more people killed. Ukraine's incentive to take this deal is to end the goddamn war by giving Putin a reason to want to pull out of Ukraine without killing anybody else. You may want the death and destruction to continue, but the rest of us don't.\n\n>it's lopsided in favor of Russia\n\nIt only helps Russia if Ukraine decides their minerals are more important to them than their lives and independence. Russia wants this war to continue, America doesn't, so I don't buy that all this is meant to help Russia. Saying such just scream propagandist bullshit.\n\n>sends a message that initiating wars of aggression can be an effective way of getting what you want in the geopolitical arena.\n\nSo we should just continue to funnel money into this war forever and expect something to change when that hasn't worked for 3 years now? Trump's plan attempts to end the war without escalating conflict. I don't know if it will work but for fucks sake, I'm willing to try it if it means people might stop dying in this war.\n\n>it should be to maintain a hard line against the *instigators* of wars\n\nI see no reason why striking economic deals with allies to scare enemies into retreating should not be considered a legitimate strategy to do exactly this. If it doesn't work, then the deal falls through anyways, *because Ukraine will belong to Russia and the deal won't mean shit at that point.* If it works, the war ends, lives are saved, the deal stands, and there won't be any reason to end it, so we can continue trading with Ukraine and they can use the money for whatever the fuck they want (reconstruction, for example).",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "> The deal gives the US a strategic reason to tell Russia to get the fuck out of Ukraine.\n\nThis is meaningless.  We'd only be making the deal because we *already* have a strategic interest in ejecting Russia.  If we don't have an interest in doing that, then there's no reason to make the deal from the US side.  The Russians aren't stupid, and using this deal as a pretext for intervention will be completely transparent to them.\n\n> It only helps Russia if Ukraine decides their minerals are more important to them than their lives and independence. \n\nAny outcome that allows Russia to retain the territory it's occupied rewards Russia for waging a war of aggression.  It doesn't matter how the Ukrainians feel about it.\n\n> Russia wants this war to continue, America doesn't, so I don't buy that all this is meant to help Russia. \n\nIt doesn't matter what it's *meant* to do, it only matters what actual outcome it produces.  If Russia initiates a war of aggression, and the end result is a peace treaty in which Russia retains *any gains at all from doing so*, then that treaty is incentivizing future wars of aggression.  \n\n> So we should just continue to funnel money into this war forever and expect something to change when that hasn't worked for 3 years now?\n\nNo.  The status quo is untenable.  There are two possible paths here.  Either (a) we disavow all further involvement, and allow them to fight out a war of attrition, but give Russia a stern warning that escalation to non-conventional warfare will trigger swift intervention, or (b) we *extend* our involvement, and along with an international coalition, commit enough resources to tilt the balance in favor of Ukraine and enable them to swiftly reclaim their territory.\n\nHalf-assed interventions, like trying to strongarm Ukraine into accepting an unfavorable settlement, are a recipe for disaster.  We need to shit or get off the pot.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "framingXjake",
                                                    "body": ">This is meaningless.  We'd only be making the deal because we *already* have a strategic interest in ejecting Russia.\n\nThe only one we have now is altruism which is not sustainable and *not ending the war.*\n\n>If we don't have an interest in doing that, then there's no reason to make the deal from the US side.\n\nThe reason to make the deal is to make a return for the money we are putting into a forever-war while giving ourselves a reason to justify doing so beyond \"because fuck Russia.\"\n\n>The Russians aren't stupid, and using this deal as a pretext for intervention will be completely transparent to them.\n\nJFC 🤦 That's the point. How is a deal supposed to deter them if we keep it a secret from them?\n\n>Any outcome that allows Russia to retain the territory it's occupied rewards Russia for waging a war of aggression.  It doesn't matter how the Ukrainians feel about it.\n\nThat's bound to happen if we just keep funding this war as is. Again, you may want the forever-war to keep going, but I fucking don't. Something has to change.\n\n>If Russia initiates a war of aggression, and the end result is a peace treaty in which Russia retains *any gains at all from doing so*, then that treaty is incentivizing future wars of aggression. \n\nNow you're just assuming Russia retains anything from their invasion. I never said they would. Nor do I want them to. And I'm not going to operate with your assumption because it's a bad faith argument.\n\n>(b) we *extend* our involvement, and along with an international coalition, commit enough resources to tilt the balance in favor of Ukraine and enable them to swiftly reclaim their territory.\n\nAh, so, WW3? Excellent, let's go with that. 🤦\n\n>Half-assed interventions, like trying to strongarm Ukraine into accepting an unfavorable settlement, are a recipe for disaster.  We need to shit or get off the pot.\n\nTrying to scare Putin into retreating without killing anyone with a paper deal is half-assed? God forbid the US get a return for funding a 3-year long war. I'm fucking tired of people like you who just want to shovel more and more money to exacerbate conflict in other countries that's killing innocent people. And when someone attempts a strategy that could end the killing in a non-conventional way, you oppose it because you straight up just don't like the guy proposing it.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "> The only one we have now is altruism which is not sustainable and not ending the war.\n\nAgain, meaningless.  Either we support Ukraine or we don't.  If the political will exists, then we can just do it, and if not, then we won't.  The US government doesn't need to create a pretext to motivate *itself* to act.\n\n> How is a deal supposed to deter them if we keep it a secret from them?\n\nAgain, this 'deal' is completely irrelevant.  Either we are backing Ukraine or we aren't.\n\n> Ah, so, WW3? \n\nHopefully not.  Whether it escalates into that is up to *Russia*, which is who it is *already* up to.  \n\nPersonally, I think WW3 is more likely if we *fail* to respond to initial provocations.  WW2 likely would not have happened, or would have been much smaller in scale, if the allies had acted immediately when Hitler invaded Czechoslovakia, instead of emboldening Germany and giving them another year to prepare to invade Poland.  \n\nAppeasement *does not work* against aggressors.  We've already been through this once and saw how it turned out.\n\n> Trying to scare Putin into retreating without killing anyone with a paper deal is half-assed?\n\nYes. 100%.  Responding to violent provocations with talk is always half-assed, and when that talk involves giving concessions to the aggressors, its a sign of weakness that emboldens them further.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "plug_play",
            "body": "Why would the USA government have to launder any money? Makes no sense to anyone with a processing brain",
            "score": 8,
            "replies": []
        },
        {
            "author": "TheRealStepBot",
            "body": "Wow way to spin this comrade. It took a couple hours for you figure out how you were gonna do it but you got there eventually. You guys really need to run a night shift to keep up with events in the US a little better.",
            "score": 32,
            "replies": [
                {
                    "author": "PacoBedejo",
                    "body": "Why is this warmongering take upvoted here?",
                    "score": 42,
                    "replies": [
                        {
                            "author": "IndraBlue",
                            "body": "Bots",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "kurtu5",
                            "body": "bots and brigades?   We really don't ban here.  Its not like vote counts matter.  What matters is that normies see ancap ideas being discussed.  We win no matter what.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "tdacct",
                            "body": "Self defense is not war mongering Chamberlain.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "PacoBedejo",
                                    "body": "States that claim ownership over citizens involuntarily have no right to \"self\"-defense. Ukraine's citizens tried to flee. The Ukrainian state enslaved the many of the men into its corrupt and feckless war, many to their deaths.\n\nYou're a fucking idiot if you think this is anything like what Chamberlain dealt with. You're a fucking idiot if you don't understand the reality of nuclear weapons.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "theodorelogan0735",
                                    "body": "Wars between states are not \"self-defense\"",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Turban_Legend8985",
                                            "body": "Defensive wars are justified wars. Is Ukraine just supposed to give lands to Russia and let Russians rape, torture, and murder Ukrainians without any opposition?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "> murder Ukrainians \n\nbut its not murder when I force some young Ukraine boy into a conflict that gets him killed?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "BendOverGrandpa",
                                                            "body": "Strange how you only care about Ukrainian boys and not Russian boys.\n\nI've noticed the Moscow glazers never talk about the dying Russians.\n\nAlways this fake ass virtue signal \"oh think of the Ukraininan children! They must all surrender!\"",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "kurtu5",
                                                                    "body": "Strange how the subject is protecting Ukraine subjects and here we have those protected subjects dying?\n\nAre you paying attention now to the topic?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "theodorelogan0735",
                                                    "body": "Who exactly do you believe the Ukrainian state has defended?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "FranknessProductions",
                                                            "body": "Themselves??? For the past 3 years, maybe????????",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "theodorelogan0735",
                                                                    "body": "You seem to be under the apprehension that the Ukrainian state=the Ukrainian people.\n\nr/lostredditors",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Jumanian",
                                                                            "body": "Are you actually this delusional?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PacoBedejo",
                                                                                    "body": "If Ukraine's military was voluntary, you might be onto something. It is not, so you are not.",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Jumanian",
                                                                                            "body": "Now this is just dishonest.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "PacoBedejo",
                                                                                                    "body": "> [Now this is just dishonest.](https://i.imgur.com/pifZn5K.png)\n\nYou're a fucking idiot.\n\nhttps://en.wikipedia.org/wiki/Conscription_in_Ukraine",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "[removed]",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kurtu5",
                                    "body": "I like the recent Michael Malice podcast where he talks about people like you.  Your talking point is almost a hundred years old now.  And you cling to it like a magic feather.\n\nNazis are your bogey man.   Peace is appeasement!\n\n\nI wonder if people used the memory of the Mongols this way.  \"You just want Temujin!\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Jumanian",
                            "body": "How is defending yourself warmongering?",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "PacoBedejo",
                                    "body": "A state isn't a \"self\". A state is an organizational claim to vast swathes of land, resources, and the people who live there. That claim is 100% illegitimate once it extends beyond the bounds of a voluntary collective in a limited geographic area. The Ukrainian government has no right to defend itself. The people who live there attempted to flee. The corrupt Ukrainian government enslaved many men into its service against their will. Nothing good is happening there. Nothing virtuous. Nothing moral. It deserves zero support.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "You've got it backwards.  The \"warmongering take\" is the one that supports the aggressor in a war of aggression, not the defender.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "PacoBedejo",
                                    "body": "Quote and link the Russian support.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "Encouraging Ukraine to take a 'deal' that allows Russia to annex its territory rewards Russia for instigating a war of aggression.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "PacoBedejo",
                                                    "body": "\"rewards\"... as if there's a choice against a nuclear armed aggressor\n\nHead out of the clouds (or your ass) please.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "During the Cold War, the whole point of maintaining nuclear parity was to deter the other side from ever using nukes; i.e. \"mutually assured destruction\".  But if MAD holds, then it has no bearing whatsoever on *conventional* wars, because the incentive structure that deters initiating a nuclear war applies whether you're starting a nuclear war from scratch, or escalating an ongoing conventional war to a nuclear war.\n\nIf we allow nuclear-armed powers to initiate wars of aggression, then threaten to escalate them to nuclear wars in order to deter defensive intervention, that amounts to allowing any nuclear-armed state to essentially hold the entire world at gunpoint any time it wants anything from anyone else.  But in order for that threat to hold weight, the aggressor to be willing to follow through on his threats, because the threat has no weight if you're going to cave in the moment someone calls your bluff.\n\nIn other words, **allowing nuclear-armed states to use the threat of nuclear war to get whatever they want from other states *increases* the possibility of a nuclear war actually happening**.\n\nIn this situation, allowing Putin to invade Ukraine and annex its territory without opposition simply because he has nukes would embolden him to threaten any other country he wants territory from with war under the assumption that no one else will respond.  \n\nSo this scenario will repeat over and over again, and will be used by other aggressor states, e.g. China, until someone eventually *does* call their bluff, and the only choice they will have will be to follow through on their threats.\n\nYou have it completely ass-backwards.  The fact that Russia has nukes means that there's a *greater* need to respond to their conventional aggression with conventional defense, and double down on nuclear deterrence if they threaten to escalate.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kyle_Rittenhouse_69",
                    "body": "Okay statist. I hope you enjoyed the war because it's coming to an end wether you like it or not. You'll just have to go back to posting cuck porn on 4chan instead of the usual war rekt webms you normally post",
                    "score": -27,
                    "replies": [
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "\"If you don't let other countries invade you, you are a statist\" That's some wild take.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ur_a_jerk",
                            "body": "it's not coming to an end, it's literally the opposite lmao and it sucks. negotiations are paused, because Trump and Vance went on the offensive on Zelensky and he didn't handle it well.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "kurtu5",
                                    "body": "> literally \n\nget a new intensifier",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ur_a_jerk",
                                            "body": "sorry, how is Trump announcing that negotiations are halted not what I said above?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "Your intensifier is cliche.  Get a new one.  Its fucking boring.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ur_a_jerk",
                                                            "body": "any suggestions?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "kurtu5",
                                                                    "body": "> Get a new one",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JJvH91",
            "body": "Go to /r/conservative, here people don't swallow Russian propaganda like this.",
            "score": 11,
            "replies": [
                {
                    "author": "theodorelogan0735",
                    "body": "In this subreddit we understand that war is always a racket.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "No, we don't \"understand\" that people defending themselves against a foreign invasion is a \"racket\".  The invasion itself might be a racket on the part of the invader, but that doesn't implicate the defender in any way.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "theodorelogan0735",
                                    "body": "The Ukrainian state is a greater aggressor against the Ukrainian people than is the Russian state.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "You are batshit insane.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "john_the_fisherman",
                    "body": "If you think anarcho capitalists support forever wars I think you might be the one in the wrong sub",
                    "score": 8,
                    "replies": [
                        {
                            "author": "JJvH91",
                            "body": "Big difference between supporting forever wars or this unsubstantitated Kremlin drivel, dipshit.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "john_the_fisherman",
                                    "body": "Fact: Russia is gay and retarded.\n\n\nFact: Ukraine is a corrupt nation and has been for a long time.\n\n\nFact: The Pentagon is a corrupt institution, and has been for a long time.\n\n\nFact: The world has given billions (trillions?) in in aid to Ukraine to fight Russia \n\n\nFact: Republicans, led by the only Ukrainian-american in Congress, spearheaded the American response in 2022.\n\n\nFact: The Republicans, including the only ukrainian-american in Congress, began opposing continued aid packages because they didn't feel it was audited enough\n\n\nFact: The recent budget proposal has annual 8% budget cuts to American defense spending-or $50 Billion annually.\n\n\nI genuinely would like to know how you can identify as an Anarcho capitalist and support this forever war with less that satisfactory guarantees that aid is actually reaching the right hands. Particularly when we this government is simultaneously cutting it's own defense spending at the same time. ",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "JJvH91",
                                            "body": "I don't support a forever war. I object to OPs framing, I have been clear about that.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "john_the_fisherman",
                                                    "body": "Yes and I think I think my last comment has been very clear that referring to the aid we've already sent to Ukraine as \"a billion dollar laundering scheme\" is a fair accusation. ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JJvH91",
                                                            "body": "What is not a fact is that the ambassador, and by extension Zelensky, are directly and intentionally involved in any inefficiencies and corruptions, as this post asserts. So no, it is not a fair accusation at all.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "john_the_fisherman",
                                                                    "body": "What an incredibly useless and semantic argument. Let me try it out!\n\nYou suggested OP's post was \"unsubstantiated Kremlin drivel\" and referred to me as a \"dipshit.\"\n\nI am not technically a dip, nor a shit. Certainly not a dipshit. And there is no source that directly implicates OP as recieving this post from the Kremlin. Therefore you have a false framing of this post. You should go back to r/GayRetard, here people don't swallow propoganda like this.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JJvH91",
                                                                            "body": "Haha, ok, you are not a serious person.\n\nMAGA is continuously trying to undermine the Ukranian government, this is absolutely not a mere semantic argument. If you disagree you are naive or disingenuous.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mal_intent4u",
            "body": "That boot your licking must taste SO good.",
            "score": 13,
            "replies": [
                {
                    "author": "FluxFreeman",
                    "body": "*tips fedora",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "jankdangus",
            "body": "If only Trump had that same attitude towards Israel. 🙄\n\n\nI guess this is still a good first step though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ripyurballsoff",
            "body": "They must have something  if trump was using minerals as a bargaining chip with Ukraine. But they still have infrastructure and natural resources to exploit. They wouldn’t invaded if there wasn’t something to be gained.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ncdad1",
            "body": "https://preview.redd.it/cu2n284066me1.png?width=896&format=png&auto=webp&s=eb3f5cda71001b2950e28433040f7e828b6824ab",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jester388",
            "body": "I just wanna say, there's a view of libertarians/anarcho-capitalists/whatever that you would walk by a woman getting raped on the sidewalk and go \"well it's not my problem\"\n\nWe are NEVER beating that allegation. Ever.\n\nPick a better fucking hill to die on, or enjoy getting 0.03% of the vote every fucking election.",
            "score": 6,
            "replies": [
                {
                    "author": "Competitive_Board909",
                    "body": "Exactly. And yet this whole post is simping for Ukraine as if it’s America’s problem and the US needs to be involved. Makes no sense",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Jester388",
                            "body": "Thanks for telling me youd walk past the woman getting raped. It's not simping to support other people fighting for freedom and liberty.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Competitive_Board909",
                                    "body": "Ancap doesn’t support defending another country on its own taxpayer dollars. That’s not an ancap sentiment. This sub has been co-opted by leftists",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Jester388",
                                            "body": "I never said you had to send tax dollars, my whole point is that you guys will never beat the allegations of being emotionless fucking robots incapable of empathy for others.\n\nProbably because a lot of us, like you, are emotionless fucking robots, incapable of empathy for others.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Competitive_Board909",
                                                    "body": "The difference between you and me is: I don’t let my emotions control me and my decision making. You clearly do. And your ad hominem attacks tell me that I’ve already won this debate",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Jester388",
                                                            "body": "Enjoy always being the 9th party behind hippies, Ben Shapiro.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Competitive_Board909",
                                                                    "body": "Further proving my point. Deranged leftists just can’t control their emotions.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sovmerkal",
            "body": "The Israeli ambassador is throwing a party",
            "score": 2,
            "replies": []
        },
        {
            "author": "fk_censors",
            "body": "I fail to see how taking the side of a communist superpower has anything to do with anarcho-capitalism.",
            "score": 1,
            "replies": [
                {
                    "author": "rrzibot",
                    "body": "They also fail, but hey it is trump. So everything he does is as god intended /s",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "captain_lampshade",
            "body": "Man this sub is BLINDING lately",
            "score": 1,
            "replies": []
        },
        {
            "author": "MurosMaroz",
            "body": "Wow, I know this sub has been taken over a long time ago, but it's getting even worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Ebb_5201",
            "body": "OP probably thinks “Ukraine money bad, Israel money good” because that’s what his master said.",
            "score": -1,
            "replies": [
                {
                    "author": "jankdangus",
                    "body": "Nah, Anarcho-capitalist and libertarians are ideologically consistent. They oppose all foreign aid full stop. So no more for Ukraine and Israel. Personally, I think there are shortsighted on the idea of soft power though. I’m ok with soft power if it means we bring down defense spending.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DEPMAG",
            "body": "More like the face your mom makes when you comment.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Conaman12",
            "body": "Or maybe she is sad Trump is bullying an already tortured man for not caving to terrorists of the worst kind",
            "score": -8,
            "replies": []
        },
        {
            "author": "Time_4_Guillotines",
            "body": "OP should go violate terms of service on themself.",
            "score": -4,
            "replies": []
        },
        {
            "author": "MonadTran",
            "body": "What's up with all the bots here? Two warlords have been fighting and blowing innocent people up with the help of their slave armies. A third warlord has been funneling our money into that war and into Raytheon. None of them ever cared about \"Russia\", \"Ukraine\", or \"America\". \n\n\n\"Oh, but I am rooting for warlord number 2 because warlord number 1 invaded territory that rightfully belonged to warlord number 2 and warlord number 3 is such a bad person he needs to keep stealing our money and throwing it into the meatgrinder because my favorite team of unwilling slaves is going to win this war any day now who cares about a few hundred thousand lives!!!\" - like, wow, are you dense? Or are you an actual bot? If you're not a bot, you do realize none of the warlords have ever cared about the lives of the innocent people, and none of the territory or the money has ever rightfully belonged to any of them?",
            "score": 0,
            "replies": []
        },
        {
            "author": "ncdad1",
            "body": "Trump was so embarrassing supporting Russia's conquest of Ukraine.  If Trump wants peace, just tell Putin to go home.",
            "score": 0,
            "replies": []
        },
        {
            "author": "elcalrissian",
            "body": "OP doesn't realize most American \"cash\" was really shells, thanks, and anti material weapons. \n\nBut you're doing a great job simping for the MAGA cause.",
            "score": -6,
            "replies": [
                {
                    "author": "_up_and_atom",
                    "body": "Hell yeah OP is such a boot licker. Simping for the MAGA cause which is... brokering peace. What a loser!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "elcalrissian",
                            "body": "I dont think capitulating to an invader is brokering peace.\nBut I guess you have less self respect than I do.\n\nAre You going to let that burglar take half your stuff, just to get him to leave?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Rollercoasterfixerer",
                                    "body": "Shhhh, your surface level knowledge of the situation is showing…",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "elcalrissian",
                                            "body": "Im sorry you're unable to cultivate a larger view.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "antisubversion",
            "body": "Thats how to breed Terrorism...",
            "score": -12,
            "replies": []
        }
    ]
}