{
    "title": "🚨🇦🇷 Argentina’s economy surges",
    "author": "vicenpyl",
    "subreddit": "Anarcho_Capitalism",
    "rank": 59,
    "score": 445,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 27,
    "url": "https://i.redd.it/k8twuy17l5me1.jpeg",
    "id": "1j1bf1y",
    "selftext": "",
    "comments": [
        {
            "author": "SrboBleya",
            "body": "I hope the LIBRA mishap will not stop the wave of liberty in Argentina.\n\nObviously the 7.1% GDP growth is extraordinary, especially when combined with a reduction of the poverty rate from \\~50% to \\~32%, and on top of that inflation is finally much more manageable and showing a downward trend.",
            "score": 73,
            "replies": [
                {
                    "author": "Secretsfrombeyond79",
                    "body": "My only worry is that the memory of the average Argentinian is as long as that of a cat. My fear is that they take the new status of economic stability and growth as a given and vote for the next moron offering them free shit ( Peronistas ). \n\nI'm voting Milei all the way anyways. Hopefully this country doesn't do another Macri. For now situation is improving slowly, so hopefully they will not.",
                    "score": 62,
                    "replies": [
                        {
                            "author": "Rjlv6",
                            "body": "Does it feel better on the ground? Seems like the hyperinflation easing is a real day to day reminder, no?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Secretsfrombeyond79",
                                    "body": "Overall is pretty better than during Alberto's last year. Shit is improving albeit very slowly, some stuff is even lowering it's prices. But I'm afraid of people loosing patience on the crawling improvement.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GunkSlinger",
                    "body": "\\>I hope the LIBRA mishap will not stop the wave of liberty in Argentina.\n\nWhy would it?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Wookieman222",
                    "body": "What was the LIBRA mishap?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SrboBleya",
                            "body": "Oh, so LIBRA is a cryptocurrency that crashed, causing some people to lose money. Milei  had promoted it on social media by \"mistake\", later claiming he was defrauded by the cryptocurrency's creators. The opposition wants to impeach him over this, and his approval rating has slightly dropped because of the whole thing.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HairyTough4489",
                    "body": "I mean, they only stole a few hundred million. Compared to the previous governemnts that's peanuts",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rieux_n_Tarrou",
            "body": "When ur done AFUERAing, all u can do now is ARRIBA, ARRIBA Y LEJOS",
            "score": 20,
            "replies": [
                {
                    "author": "Kiornis1",
                    "body": "AFUERA!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scarsdale81",
            "body": "There's nothing new under the sun. This wasn't a gamble that he's trying out. The reason that economic policy doesn't work is that your leaders are psychopaths.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Inside-Homework6544",
            "body": "this isn't really any new data, we already knew argentinian economy grew in q4 of 2024 and was projected to grow rapidly in 2025. although this appears to be a different source for the prediction, I think the first was IMF.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Head_ChipProblems",
            "body": "I hope It break expectations again like last time. Seeing a 10% growth would be glorious.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Responsible_Goat_24",
            "body": "Remember if you allow the United States to do what they want on your land and to your minerals your policies will work too. Lol. No really I think it's great i hope he continues",
            "score": 6,
            "replies": []
        },
        {
            "author": "frisbm3",
            "body": "I bought ARGT to profit from this and to help invest in Milei's success and that of the Argentinian people. Anybody have any other ideas for investing in Milei's experiment?",
            "score": 5,
            "replies": [
                {
                    "author": "VodkaToxic",
                    "body": "I did too.  Tremendous growth at fist but now it's stalled at 83.  Still very glad I did.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-One9890",
            "body": "Coincidentally in time for elections",
            "score": 7,
            "replies": []
        },
        {
            "author": "crinkneck",
            "body": "Viva La libertad carajo",
            "score": 1,
            "replies": []
        },
        {
            "author": "WOJ3_PL",
            "body": "https://preview.redd.it/ma9miqwix5me1.png?width=1200&format=png&auto=webp&s=3abfd5a1bbd7fce755a3f45f31c4628d51e8dccc",
            "score": -21,
            "replies": [
                {
                    "author": "Click_My_Username",
                    "body": "Perhaps you should look at the updated stats commie ",
                    "score": 18,
                    "replies": [
                        {
                            "author": "WOJ3_PL",
                            "body": "it's becoming worse",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "VodkaToxic",
                                    "body": "No, it isn't.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "WOJ3_PL",
                                            "body": "my mistake, but it hasn't improved compared to the previous administration and is still disastous. my main problem is prioritizing economic growth instead of combating the material problems that regular people face",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Click_My_Username",
                                                    "body": "It's actually better than what he inherited by a significant amount. Poverty was 44% when he took office.\n\n\nWhat you need to understand is that he isn't prioritizing economic growth, he ended the inflationary crisis which was the best thing he could possibly do to help the people's material conditions.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Basdala",
                                    "body": "source?",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Exp5000",
                    "body": "Yeah, the useless government workers are jobless what's the point?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "WOJ3_PL",
                            "body": "yeah the useless retirees should just starve 😃",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}