{
    "title": "I thought they said that they were only trying to protect children, that adults could make these decisions. I guess that was... a lie?",
    "author": "bluefootedpig",
    "subreddit": "Anarcho_Capitalism",
    "rank": 25,
    "score": 23,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.kxan.com/news/texas-politics/texas-house-bill-ban-gender-affirming-care-transgender-adults/",
    "id": "1j3dttv",
    "selftext": "",
    "comments": [
        {
            "author": "Baller-Mcfly",
            "body": "Let adults cut there genitals up. Just don't allow them to use tax dollars for it. I also don't want to see my health insurance go up to handle new insurance expenses.",
            "score": 67,
            "replies": [
                {
                    "author": "mt_2",
                    "body": "So allow the free-market to decide? This is the state telling companies what they can and can't cover.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "GunkSlinger",
                            "body": "Yeah, the people for which this sub was made know that already.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Sombo_76",
                            "body": "That's happening already to an extent. You can't go to your doctor and tell them what you want and expect insurance to automatically cover. Every insecure person on the planet would be getting plastic surgery.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "GravyMcBiscuits",
                                    "body": "That isn't how insurance works.\n\nJust because they \"cover\" it, doesn't mean it's free.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Sombo_76",
                                            "body": "That's not what I said, Sea Biscuit. Most insurances will not cover procedures that are not medically necessary, ie elective cosmetic procedures.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Baller-Mcfly",
                            "body": "Yes, allow free trade. The problem is that many people get Medicare and other government subsidized health care, including crazy people who think they are in the wrong body. If we could do away with that, I would bet this Texas law wouldn't have a place.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "mt_2",
                                    "body": "This Texas law isn't about what the states money can do, its about what private insurance companies are allowed to offer, so regardless of your personal views on what is crazy, this law has no place, the state shouldn't be collecting/spending money on \\*any\\* healthcare anyway.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bluefootedpig",
                    "body": "I don't like that my insurance is up to cover fat americans, yet here I am.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Baller-Mcfly",
                            "body": "I with theybwould Give me a discount if I stayed healthy.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "bluefootedpig",
                                    "body": "It is called just denying coverage to anyone outside a healthy BMI. Just like anyone with high blood pressure, even in that middle ground should be dropped too. Keep my rates low.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "frozen_pipe77",
                            "body": "Cheeseburger in one hand, Marlboro in the other.  Complaing about others not pitching in for its bypass surgery",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "feedandslumber",
            "body": "Yeah, not ideal, the law does give exemption if you go to counseling for twelve sessions, which has a good intent, but is not something I want the government dictating to adults.",
            "score": 6,
            "replies": []
        },
        {
            "author": "StedeBonnet1",
            "body": "Operative word \"could\". Before everyone gets their panties in a bunch, let see if it passes. Mainstream Americans and I'm sure mainstream Texans don't care what you do as  an adult. Activists have a habit of proposing bills that will never pass so they can say they did.",
            "score": 10,
            "replies": [
                {
                    "author": "10lbplant",
                    "body": "The average Texan voter is a religious boomer that doesn't want people smoking delta 8 lmao. Wtf are you talking about?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "StedeBonnet1",
                            "body": "Let's wait and see if the bill passes.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "GravyMcBiscuits",
                                    "body": "Why? Wait for what?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "IntentionCritical505",
                                            "body": "For fake outrage.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "GravyMcBiscuits",
                                                    "body": "What makes it fake?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "IntentionCritical505",
                                                            "body": "A bill proposed by one guy in the Lege, which hasn't passed, isn't something to get worked up about. Plenty of dumb bills never leave that stage.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "GravyMcBiscuits",
                                                                    "body": "Why submit dumb bills?\n\nWhy is calling out bills for being dumb \"fake outrage\"?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "IntentionCritical505",
                                                                            "body": "It hasn't been passed. Someone needs some remedial schoolhouse rock.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GravyMcBiscuits",
                                                                                    "body": "Why should anyone wait to pass judgement until a bill has passed?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "IntentionCritical505",
                                                                                            "body": "Because it will likely not pass. Here, OP is trying to blame an entire party for a bill that exactly one member supports, at the state level at that.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "GravyMcBiscuits",
                                                                                                    "body": ">OP is trying to blame an entire party\n\nWhere? Seems like your imagination at work. At most, it looks like they're calling out a specific faction in the party.\n\nEven if they were ... why do you feel the need to protect the \"entire party\" from criticism? What drives a person to go into r/Anarcho_Capitalism in order to defend one of the primary parties from criticism you think?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "IntentionCritical505",
                                                                                                            "body": ">Where? \n\nThe title, moron:\n\n>I thought they said that they were only trying to protect children, that adults could make these decisions. I guess that was... a lie?\n\nWho is the \"they\" in that sentence?\n\n>Even if they were ... why do you feel the need to protect the \"entire party\" from criticism? What drives a person to go into r/Anarcho_Capitalism in order to defend one of the primary parties from criticism you think?\n\nI like arguing with socialists. Socialists make dumb arguments like the above and shriek when people point out that they're dumb or dishonest.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "GravyMcBiscuits",
                                                                                                                    "body": ">Who is the \"they\" in that sentence?\n\nThe people who are being called out for hypocrisy? \n\n>I like arguing with socialists.\n\nAnd let me guess ... a \"socialist\" is anyone who doesn't worship the GOP and your Trump emperor right?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "IntentionCritical505",
                                                                                                                            "body": ">The people who are being called out for hypocrisy? \n\nWhat hypocrisy? What people?\n\n>And let me guess ... a \"socialist\" is anyone who doesn't worship the GOP and your Trump emperor right?\n\nNah, a socialist is a socialist. Like you they worship Marx.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "GravyMcBiscuits",
                                                                                                                                    "body": ">What hypocrisy? What people?\n\nHa. This is the part where you play the dumb dumb. I get it.\n\nEnjoy that GOP boot. I'm sure they'll make your theology state a reality for you any day now.. The heathens will be groveling at your feet begging for forgiveness any day now I'm sure.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "IntentionCritical505",
                                                                                                                                            "body": ">Ha. This is the part where you play the dumb dumb. I get it.\n\nTo establish hypocrisy you need to show someone doing one thing while saying another. OP just made something up and is pretending one member of a group represents the whole.\n\nThat's the sort of dishonesty that is the hallmark of a socialist.\n\nBetter a GOP boot than a socialist boot.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IntentionCritical505",
                    "body": "This is the usual pattern of the far left pretending an introduced bill is a law.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bluefootedpig",
                            "body": "I hope it doesn't go anywhere, but you can't ignore that the state, when given the freedom to do what they want, having people in power trying to push this. When people on the left say, \"people in government want to restrict your rights\" and you say, \"nah, that is fear mongering\", this is the kind of people who given a chance, would pass this. \n\nLet's remember, the GOP wrote in the margins, so bad we literally couldn't read it, to pass a tax cut that primarily benefited them and their donors.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "IntentionCritical505",
                                    "body": "I don't care that there are people in power that do this. Others do far worse and succeed at it. \n\n>Let's remember, the GOP wrote in the margins, so bad we literally couldn't read it, to pass a tax cut that primarily benefited them and their donors.\n\nThis isn't true, but if it was I'd be okay with it. Tax cuts rule.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LiberalAspergers",
            "body": "Anyone who ever mistook the GOP for something other than the Evangelical version of the Taliban was an idiot.",
            "score": 20,
            "replies": [
                {
                    "author": "GunkSlinger",
                    "body": "Agreed, and the other side is just as bad, so abolish the state or at least allow secession so anti-statists can get away from their stinky breaths.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "hblok",
                    "body": "So the Taliban is into pump and dump crypto shit coins as well? Exciting!",
                    "score": -2,
                    "replies": [
                        {
                            "author": "mt_2",
                            "body": "unironically, yes, they dumped an official taliban coin a couple months ago",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "LiberalAspergers",
                            "body": "Sadly, yes.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "General-Priority-757",
            "body": "Why am I not surprised",
            "score": 4,
            "replies": []
        },
        {
            "author": "Bagain",
            "body": "Oh no, who would have guessed that the state would decide that it’s in charge of things it should be!",
            "score": 2,
            "replies": [
                {
                    "author": "bluefootedpig",
                    "body": "The state could decide to lock you up tomorrow, doesn't make it right. And bigger, the people who said they wouldn't, are now doing it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bagain",
                            "body": "Agreed… that’s exactly my point.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Darmin",
            "body": "I do not care if an adult or child cuts off their dick, or flips their pussy inside out. \n\n\nThey are not hurting me or anyone else. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Freeze_Wolf",
            "body": "“Land of the free” my ass. These people need to learn to fuck off out of peoples’ private lives. The state should NOT be involved in what grown adults do in their own lives, so long as it doesn’t harm others, as intended by the Constitution.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SorosAntifaSuprSoldr",
            "body": "Yes. That was very obviously always a lie.",
            "score": 1,
            "replies": []
        }
    ]
}