{
    "title": "Walrus in search for land",
    "author": "Significant_Snow_718",
    "subreddit": "CrazyFuckingVideos",
    "rank": 11,
    "score": 938,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 100,
    "url": "https://v.redd.it/v10d1cbskape1",
    "id": "1jdjnwo",
    "selftext": "",
    "comments": [
        {
            "author": "hmclaren0715",
            "body": "Well fuck... That's depressing..",
            "score": 124,
            "replies": [
                {
                    "author": "moonpuzzle88",
                    "body": "Yeah, really sad to see. Poor guys don't know what they're getting into when they start to climb up.",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "Baronvr",
            "body": "I can easily picture humans instead of walruses. We are living in a similar fashion in some places.",
            "score": 212,
            "replies": [
                {
                    "author": "snattleswacket",
                    "body": "Just look at Justin Long.  It's possible!",
                    "score": 43,
                    "replies": [
                        {
                            "author": "Emadyville",
                            "body": "I had that I understand this reference.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Consistent_Room_9097",
                            "body": "The \"not-see-party\"",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cheeseandrum",
                    "body": "*Most places\n\nInsert limited resource analogies: job market, housing etc",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "theoldestghostever",
                    "body": "You mean the entirety of the northeast coast of America? Every time I have to go there for work I just can’t wrap my head around it. Morning rush hour starts at like 4 AM 🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Precious_Angel999",
            "body": "Wow I fucking hated that.",
            "score": 76,
            "replies": [
                {
                    "author": "Dollbeau",
                    "body": "Pretty devastating clip...",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "AdrianDarkmoore",
            "body": "I'm wondering how this influences their evolution?\n\nWill climbing walrusses die out? Will the ones with better eyesight survive? Will they become stronger because they have to fight more often?\nWill they adapt a bit more to living on land again?",
            "score": 87,
            "replies": [
                {
                    "author": "dethskwirl",
                    "body": "I would suspect that the ones climbing way up there are way too late to the party to mate anyway, so none of those behaviors will contribute to evolution. Instead, the behaviors that led to the early crowd who successfully made it to the beach and hunted and mated will live on, such as: being a better navigator and making it to the beach first, being a better hunter and feeding first, being larger and stronger to fight for mates after finding a desirable spot on the beach, etc.\n\nthis is why they have evolved to this point in the first place.  what we see in nature is evolution rewarding those who can see best in the water (better hunters/navigators), and big fat strong fellas with big tusks and big dicks (better fighters/maters).",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Responsible-Buyer215",
                            "body": "If it didn’t, nothing would exist on the planet today. This is not the first time major climate change has impacted the world, natural selection has made it so that every species today will have ancestors that coped with some kind of climate disaster. It’s not that evolution happens as a result of these disasters, more that the evolutionary traits that might allow them to survive already exist and as natural selection removes the animals without these variations the ones with the competitive genes survive and reproduce, passing on the genes.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "photobummer",
                                    "body": "There are mass species extinction periods. We’re at the beginning of one now.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BOYR4CER",
                                            "body": "Says every redditor that reads another comment on reddit saying the same thing. Cycle repeat",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "ChocIceAndChip",
                                                    "body": "We predict humanity has wiped out 83% of living mammal and plant species since the dawn of civilisation. \nNot even mentioning what we wiped out alongside our other humanoid cousins before.\n\nWe aren’t in the beginning of one, we’ve been in one for nearly 7000 years.\n\nThis is supported by a literal megaton of evidence, anybody denying this is just plain ignorant.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Beautiful-Night2456",
                                                            "body": "The past 500 years have been particularly brutal",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ApacheAttackChopperQ",
                            "body": "Literally the opposite.   The climate on this planet has never stopped changing, and happens even faster than humans could ever influence outside of a nuclear winter, but even then, there was a mass extinction event that killed 99% of everything that's happened several times,  which would be indistinguishable from a nuclear winter event.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Hopeless_Slayer",
                                    "body": ">happens even faster than humans could ever influence\n\nSo you deny the role fossil fuels play in climate change?",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "LordAnon5703",
                                            "body": "He literally just said climate changes faster than humans can influence it, he could not care less about reality. Let alone the role fossil fuels are playing in climate change. ",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CuntsNeverDie",
                    "body": "At best, they will evolve in to monsters and be successful at the NYSE. /s",
                    "score": 4,
                    "replies": [
                        {
                            "author": "DunDunBar",
                            "body": "Walrus Street",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LordAnon5703",
                    "body": "Probably go extinct. ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AdrianDarkmoore",
                            "body": "I don't expect them to go extinct tho, a lit might die, but i guess not all",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Key_Complex_150",
            "body": " That's so fucking sad. My god.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Not_Not_Matt",
            "body": "Fuck this is depressing. We’ve really screwed this planet’s delicate ecosystem hey? I wonder what this planet would be like today if humans never entered the picture",
            "score": 67,
            "replies": [
                {
                    "author": "RabidTongueClicking",
                    "body": "Fortunately there’s still just enough left that we can imagine it. The forests outside our cities would simply cover everywhere we no longer were, along with the life within them. Some species would still be here that no longer are, some plants would grow that no longer do. But ultimately, we are only ever a few minutes away from what could have been.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "NzuahVI",
                            "body": "I'm so so happy that I don't live in a big city, I have woods all around my small town and it takes only a couple of minutes to get out there.  I spent most of my free time out there mountain biking and exploring every inch of it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Not_Not_Matt",
                            "body": "Can we wind back the clock on global warming though? If we hadn’t discovered fire and developed automation/industry/etc we can assume the world would be a whole lot cooler today.\n\nMy city has just come out of one of the driest summers on record, with only 21mm of rain for the entire season. And while there’s some relief coming with “0-3mm” of rain on Thursday, we can only pray it genuinely gets better.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Brexsh1t",
                                    "body": "Short answer is no, not even if we stopped all pollution tomorrow. \n\nWe have created lots of toxic and nuclear waste that will remain hazardous to life, in some cases for literally millions of years.\n\nAir quality would improve immediately and would be good within weeks to months.\n\nThe oceans would stabilize within a few years, as no more pollution would mean the acidification of the oceans would cease. Without cleanup efforts it will take a really long time for all the plastics to cease causing widespread damage to sea life, decades to centuries or longer.\n\nClimate change would take centuries to millennia to recover, pollution in the upper atmosphere will continue to warm the planet for centuries. The ice in the artics and Greenland will continue to melt for centuries and global sea levels will continue to rise, also for centuries.\n\nBiodiversity will take millennia to recover. Animals that are considered endangered will pretty much all go extinct as conditions will still worsen in the short term and will take too long to improve.\n\nIt’s actually so strange that individuals will tell you they love their kids and grandkids etc but on the other hand as a collective we don’t give a shit about them. If we actually cared about them we would collectively be working to make the planet better (and we have the technology and the means to do it), but instead we have politicians with tiny penises making war, threatening to annex sovereign nations and generally being dickheads. “Drill baby drill”\n\nSo again the answer sadly, is a loud resounding no. The next 100 years it’s going to get wild, massive food and water shortages, rapid extinction of species like bees and other pollinators resulting in a huge threat to global agriculture. The destruction of natural habitats increases zoonotic spillover, so there will be lots more diseases like covid or worse. \n\nGenerally just happy times ahead really",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "id0ntexistanymore",
                                            "body": "This sincerely makes me just want to die. I wish humanity never happened. So much selfishness and suffering. I understand it didn't start that way, but the fact that we now know better and still do it is too much for me. It just hurts to exist knowing all the shit that's happening out of my control. How are you supposed to live with that? If I try to ignore it I feel even worse. Like, there is no upside. This planet and it's non human inhabitants deserve so much better.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "XKloosyv",
                                                    "body": "Dot worry. We raised the temperature of this planet and we can cool it down when necessary. The powers that be would love trade routes opened in the Arctic. Once they have that, we will seed some clouds and get back to normal.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Embarrassed-Bass272",
                    "body": "hahahaha no we have not done anything. The greedy corpos have which of course if you are using any sort of tech you have in some ways benefited from them doing so and likely you lake the conviction to do anything to change anything but that does not matter does it?\n\neven if we did do something the corpos will always be in control and even if they were not the earth changes regardless of human interaction. We could stand to be more kind and conscious of the world around us but in the end it will change as it has been for longer than you could count. Actually The earth alone has gone through so many world ending events and been fine that really there is no reason to worry outside of being taken advantage of by greedy corpos.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "macncheesy1221",
                    "body": "I don't know if it's that delicate, it's adaptable. I think humans are too brutish.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Material-Hurry-4135",
            "body": "Florida during spring break?",
            "score": 20,
            "replies": [
                {
                    "author": "GreenSmokeRing",
                    "body": "Too many full sets of tusks",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "dethskwirl",
                    "body": "100%",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "20grae",
            "body": "The cut out the main portion\n\nAll was true except the fact that they were stranded up top with a polar bear closing in on them the walrus instinct is to go twords the water it just happens there at the top of the cliff. Polar bear closes in walrus fall polar bear walks down easy dinner.\n\nIt was a docuseries 7 worlds 1 planet",
            "score": 22,
            "replies": []
        },
        {
            "author": "RedModsRsad",
            "body": "People often forget just how vast the effects of global climate change permeate. ",
            "score": 52,
            "replies": [
                {
                    "author": "PermaXanned",
                    "body": "Not even forget, most don’t even know to begin with",
                    "score": 16,
                    "replies": [
                        {
                            "author": "_JosefoStalon_",
                            "body": "Others know but don't care. Industries have been aware of this ages ago yet they only speak in money. You see Nestle for example having hypocrite green propaganda, along with many others while destroying the planet at the same time.\n\n\nDid you know the recycling symbol no longer means plastic is recyclable? you have to know what the numbers inside mean instead. They go to great lengths to, instead of making any change in their products for a better world, get high cash anyways by ridding of their consumers' guilt.\n\n\nI hate multinational businesses. I hate Wall Street, so on. Fuck them all.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "phooydan",
            "body": "Wow, that bummed me out",
            "score": 4,
            "replies": []
        },
        {
            "author": "LysergicPsiloDmt",
            "body": "Whenever I see someone being short sided now I'll say \"like a walrus falling down a cliff.\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "Red_Pillinger",
            "body": "“Largest gathering of Walruses on the Planet?” \n\nHave you been to San Antonio?",
            "score": 3,
            "replies": []
        },
        {
            "author": "LongliveTCGs",
            "body": "God, that’s so sad. Reminds me of loneliness in today’s society - we don’t seek help and some leave this world as fast as the walrus that fell down that cliff",
            "score": 3,
            "replies": []
        },
        {
            "author": "robaroo",
            "body": "This is awful.",
            "score": 2,
            "replies": []
        },
        {
            "author": "XKloosyv",
            "body": "Is it wrong to picture a humanitarian effort in which volunteers on these cliffs give the walruses little backpack gliders?",
            "score": 2,
            "replies": []
        },
        {
            "author": "meach61",
            "body": "so sad! Made me blubber :(",
            "score": 2,
            "replies": []
        },
        {
            "author": "raisedredflag",
            "body": "#Walrus Jeff Hardy",
            "score": 3,
            "replies": []
        },
        {
            "author": "CATNIP_IS_CRACK",
            "body": "**PUBLIC SERVICE ANNOUNCEMENT: Never forget, this video’s disclaimer exists solely as a direct reference to Disney forcing hundreds of living beings off a cliff to their deaths.**\n\n**Mass murder of “lesser animals” in the form of forced suicide,” given the choice between falling to their deaths or being murdered by Disney. Disney then intentionally lying to their uneducated viewers, told everyone it saw a cute, silly “oopsie” video like a cat rolling out of bed, all to “entertain” and “educate”, but more importantly to make a quick buck. Of course, Disney still denies having knowledge that the animals in their film were being murdered and not voluntarily killing themselves.**",
            "score": 2,
            "replies": [
                {
                    "author": "AKnGirl",
                    "body": "I am confusion!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CATNIP_IS_CRACK",
                            "body": "There’s an old urban legend, lemmings commit mass suicide by jumping off cliffs. Once one lemming chooses suicide the rest *’follow like lemmings’*. It’s *’if your friend jumped off a bridge would you?’* for animals. The phrase was popular vernacular for half a century, all thanks to Disney. \n\nDisney wanted to include “lemming behaviors” in their nature documentary *’White Wilderness.’* Unfortunately lemmings are relatively intelligent living beings with a sense of self preservation and desire to live under normal circumstances. Disney quickly realized they weren’t getting any film of lemmings committing mass suicide. \n\nThe solution was to capture hundreds of lemmings, release them on the edge of a cliff inside a barrier, then slowly move the barriers, forcing what might as well be puppies and kittens toward the edge of the cliff until they jumped en mass. After multiple takes the “result” was a single, short scene with a limited field of view showing hundred of lemmings falling to their deaths, decades of widespread misinformation, a video game franchise that’s endured for >30 years, and Disney still denying any culpability for their film and trying to blame a single person.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GUTTERMANN",
            "body": "At least there is room for one more now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Chud_Mudbutt",
            "body": "I bet this smells awesome",
            "score": 3,
            "replies": []
        },
        {
            "author": "MavajaXe",
            "body": "But atleast corporations keep getting better profits! /s",
            "score": 2,
            "replies": []
        },
        {
            "author": "lost21gramsyesterday",
            "body": "Why did this remind of Sid from Ice Age?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HistoricalIssue8361",
            "body": "Hes finee",
            "score": 1,
            "replies": []
        },
        {
            "author": "BenjiGValue",
            "body": "It’s nine o clock on a Saturday, regular crowd shuffles in…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substantial_Cook2168",
            "body": "This is from the series \"our planet\"\nI learnt a lot from it and feel everyone should see it once atleast",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeenisPeiner",
            "body": "The gathering of the Waloros.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LibbyTardo",
            "body": "Acts of animal abuse? WTF. You think someone's pushing them off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wesker07",
            "body": "This video always makes me cry. Those poor creatures.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mirage01",
            "body": "The side of climate change that isn't seen enough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FifthChan",
            "body": "We did this...",
            "score": 1,
            "replies": []
        },
        {
            "author": "dgsphn",
            "body": "That somewhat reminds me of india",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoyalWigglerKing",
            "body": "I hate this. I love Walruses this sucks",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hopwater",
            "body": "Did Disney push that walrus off the cliff?\n\n(Like the lemmings documentary)",
            "score": 0,
            "replies": [
                {
                    "author": "Dollbeau",
                    "body": "By being a gross representation of corporate scum & the worst ideals? Yes!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "JimNasium",
            "body": "First walrus - 10/10 on my scorecard.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Cleveland5teamer",
            "body": "Free food for the polar bears",
            "score": 0,
            "replies": []
        },
        {
            "author": "ricky302",
            "body": "'the ice has retreated away to the north '\n\nCamera pans up to show miles of ice in the background.",
            "score": -2,
            "replies": [
                {
                    "author": "bramble_",
                    "body": "They must be lying eh?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "ricky302",
                            "body": "It's a joke, the ice in the background isn't sea ice.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jaggoff81",
            "body": "I mean, at least the polar bears will eat well.",
            "score": -1,
            "replies": [
                {
                    "author": "windraver",
                    "body": "I think polar bears have the same issue though. They're drowning due to not finding land so...",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Dollbeau",
                            "body": "Polar bears are stuck on another piece of ice, starving to death...",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ForFucksSake66",
            "body": "By ‘natural’ phenomena you mean humans ruining the planet, global warming?",
            "score": -6,
            "replies": [
                {
                    "author": "dethskwirl",
                    "body": "humans are natural so ....",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "replies": []
        },
        {
            "author": "kaminsod1",
            "body": "I fucking hate  humanity.",
            "score": -5,
            "replies": []
        },
        {
            "author": "ghostofstankenstien",
            "body": "Its like watching my wife get out of bed in the morning.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Qyoq",
            "body": "Fred!!! For fuck sake, basejumping requires a shute!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Sad_Vegetable_8377",
            "body": "Is this why they weren't given arms and legs...so they could endure the worst fucking rolls?!",
            "score": 0,
            "replies": []
        },
        {
            "author": "nofingwaydude",
            "body": "So that's where the idea for Waldorf's Journey on UFO 50 came from.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Accurate-Donkey5789",
            "body": "Wallrush",
            "score": 0,
            "replies": []
        },
        {
            "author": "AcademicPainting23",
            "body": "I once saw a video of a cat trying to commit suicide…and now I have seen a walrus kill itself. Reddit break time.",
            "score": 0,
            "replies": []
        },
        {
            "author": "AskinggAlesana",
            "body": "Omg.. it’s WALDORF’S JOURNEY!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Singh255",
            "body": "He’s the Darwin of seals",
            "score": 0,
            "replies": []
        },
        {
            "author": "BlackVQ35HR",
            "body": "Burning Walrus",
            "score": 0,
            "replies": []
        },
        {
            "author": "MightyManGT",
            "body": "I feel bad for laughing at it flailing, but yeah it truly unfortunate the impacts climate change has on different species of animals.",
            "score": 0,
            "replies": []
        },
        {
            "author": "boatflank",
            "body": "He's alright(Dad)",
            "score": 0,
            "replies": []
        },
        {
            "author": "rinisini",
            "body": "It's incredible tragic that walruses die every year due to falling of cliffs due climate change\n\n  \nhowever the mental image of 200kg+ walruses cartwheeling down mountains like a fucked up hambeast Doctor Eggman is pretty damn funny",
            "score": -4,
            "replies": []
        }
    ]
}