{
    "title": "Was I just a weird kid or is this normal?",
    "author": "Derpistlord",
    "subreddit": "ask",
    "rank": 14,
    "score": 3,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/ask/comments/1jeivdj/was_i_just_a_weird_kid_or_is_this_normal/",
    "id": "1jeivdj",
    "selftext": "For context, In my childhood there was several times I was scared to death my family members were replaced by imposters, with literally no evidence to assume this. Most likely this is just an active child mind, correct?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# &#128227; Reminder for our users\n\n>1. **Check the rules:** Please take a moment to review [our rules](https://www.reddit.com/r/ask/about/rules), [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), and [Reddit's Content Policy](https://www.redditinc.com/policies/content-policy).\n>2. **Clear question in the title:** Make sure your question is clear and placed in the title. You can add details in the body of your post, but please keep it under 600 characters.\n>3. **Closed-Ended Questions Only:** Questions should be closed-ended, meaning they can be answered with a clear, factual response. Avoid questions that ask for opinions instead of facts.\n>4. **Be Polite and Civil:** Personal attacks, harassment, or inflammatory behavior will be removed. Repeated offenses may result in a ban. Any homophobic, transphobic, racist, sexist, or bigoted remarks will result in an immediate ban.\n\n**&#128683; Commonly Asked Prohibited Question Subjects**:\n\n>1. Medical or pharmaceutical questions\n>2. Legal or legality-related questions\n>3. Technical/meta questions (help with Reddit)\n\nThis list is not exhaustive, so we recommend reviewing the [full rules](https://www.reddit.com/r/ask/about/rules) for more details on content limits.\n\n**&#10003; Mark your answers**!\n>If your question has been answered, please reply with `Answered!!` to the response that best fit your question. This helps the community stay organized and focused on providing useful answers.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LowBalance4404",
            "body": "Uhhh...I'm going to go with weird kid.",
            "score": 3,
            "replies": []
        },
        {
            "author": "WinterMagXXX",
            "body": "This is not medical advice:\n\nMore than likely just a random anxious/intrusive thought that children get. If it wasn’t an obsession, and didn’t mess with your overall functioning you’re generally ok\n\nThere’s a mental disorder with this as a sole symptom, capgras syndrome/disorder.\n\nOn the other hand, I have schizotypal personality disorder and it’s also a symptom of my paranoia. I’ve experienced these delusions and similar during adolescence and seldom do in adulthood.\n\nNowadays it’s more “what if the whole world has been replaced by NPCs?” and an “episode” like this is pretty rare.",
            "score": 2,
            "replies": [
                {
                    "author": "Derpistlord",
                    "body": "Gotcha, appreciate the info. I was reminded of this stuff that used to happen when I was watching a video earlier so I decided to post it here and see what Reddit thought. It was actually a lot grosser than just imposters as I thought that people were stealing their skin and wearing it, I would ask them personal info to see if they would remember it to prove it was them. Scared me quite a bit but then again I am generally extremely paranoid.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CostcoHotdawgs",
            "body": "Hahaha this just reminded me that when I was small and my mom was sick of me she would pretend not to be herself and be someone named Gayle instead who was apparently her twin sister. My mom doesn’t even have a sister lol",
            "score": 1,
            "replies": [
                {
                    "author": "CostcoHotdawgs",
                    "body": "I never doubted that she was my mom. Or any of my other family members had been swapped out tho. Thank goodness because her antics may have spooked me if I thought like you did",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Derpistlord",
                            "body": "Thats funny, glad it didnt spook ya!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MingusPho",
            "body": "I went through the same but I thought they were aliens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RMW91-",
            "body": "Did you watch “Invasion of the Body Snatchers” when you were little? That one left quite an impression on me.",
            "score": 1,
            "replies": [
                {
                    "author": "Derpistlord",
                    "body": "Nope, never watched it in general nor any movies with the premise of body snatchers to my knowledge.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Latter-Wash-5991",
            "body": "Psychosis. Some kids go through that.",
            "score": 1,
            "replies": []
        }
    ]
}