{
    "title": "Have you ever been attracted to someone specifically because you could see the aura of tragedy and loneliness in them or am I crazy?",
    "author": "kitty-84",
    "subreddit": "ask",
    "rank": 7,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ask/comments/1jej0ci/have_you_ever_been_attracted_to_someone/",
    "id": "1jej0ci",
    "selftext": "When it’s a guy it makes me attracted to them, when it’s a woman it makes me intrigued and want to be friends ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# &#128227; Reminder for our users\n\n>1. **Check the rules:** Please take a moment to review [our rules](https://www.reddit.com/r/ask/about/rules), [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), and [Reddit's Content Policy](https://www.redditinc.com/policies/content-policy).\n>2. **Clear question in the title:** Make sure your question is clear and placed in the title. You can add details in the body of your post, but please keep it under 600 characters.\n>3. **Closed-Ended Questions Only:** Questions should be closed-ended, meaning they can be answered with a clear, factual response. Avoid questions that ask for opinions instead of facts.\n>4. **Be Polite and Civil:** Personal attacks, harassment, or inflammatory behavior will be removed. Repeated offenses may result in a ban. Any homophobic, transphobic, racist, sexist, or bigoted remarks will result in an immediate ban.\n\n**&#128683; Commonly Asked Prohibited Question Subjects**:\n\n>1. Medical or pharmaceutical questions\n>2. Legal or legality-related questions\n>3. Technical/meta questions (help with Reddit)\n\nThis list is not exhaustive, so we recommend reviewing the [full rules](https://www.reddit.com/r/ask/about/rules) for more details on content limits.\n\n**&#10003; Mark your answers**!\n>If your question has been answered, please reply with `Answered!!` to the response that best fit your question. This helps the community stay organized and focused on providing useful answers.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "naraitb",
            "body": "I used to be like this, until I realised these kind of people expected me to be trapped in their tragedy, so I was often depressed in these interections until I gathered the courage to leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bright-Invite-9141",
            "body": "No, that makes sense but as a boy on girl, bad boys will take advantage of her. A nice guy will pick her up and brush her off, the hard bit is knowing the good from the bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "LFAmarante",
            "body": "I don't want to be with someone out of pity. So most of the time I don't interact with such people too closely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dkpatkar",
            "body": "It's just being empthatic i guess",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational-Air-4651",
            "body": "I prefer partners that have had tragedies in their past, and worked on themselves to overcome it. There is a strength, calm and empathy in them that makes them excellent partners.\n\nBut frankly, who hasn't been is some kind of trauma these days when you're a bit older. The once that refuse to accept or face it though, they are only going to bleed on everyone around them. And probably drag their partners down with them if they can.",
            "score": 1,
            "replies": []
        }
    ]
}