{
    "title": "Discord not available on OS X anymore?",
    "author": "brighty4real",
    "subreddit": "discordapp",
    "rank": 3,
    "score": 248,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 42,
    "url": "https://i.redd.it/bfv7ltraxdpe1.png",
    "id": "1jdy0oc",
    "selftext": "Got this pop-up today when trying to launch Discord on my 2015 MacBook Pro. It's on 10.15.7, says Discord only works with 11 (Big Sur) or later. Tried re-installing and doesn't seem to fix. Not available on my OS anymore? It's not the end of the world if so, i can always use the web app. thx.",
    "comments": [
        {
            "author": "AdministrativeMap9",
            "body": "I had a 2015 MBP for work and it had MacOS 11. Might be worth it to try to upgrade the OS to a newer version, swap the OS for Linux, or use a slightly newer machine that meets the minimum reqs. And as you mentioned, the web version works fine too and really the \"app\" is just a chromeium wrapper called electron for the website anyway.",
            "score": 81,
            "replies": []
        },
        {
            "author": "dada_",
            "body": "macOS 10.15 Catalina went end-of-life on November 30, 2022.\n\nIf you can't upgrade on your device, you might want to look into the OpenCore legacy patcher that allows unsupported macOS versions to install on older hardware.",
            "score": 53,
            "replies": [
                {
                    "author": "Mr_Zomka",
                    "body": "Monterey (which is macOS 12) is supported for their MacBook. They can just go to settings and install the update there.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "dada_",
                            "body": "Good call. In that case, yeah, they should just do that. macOS actually spams you about the updates regularly, so they should definitely not be ignoring that.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gh0stofoctober",
            "body": "op, FIY you can use opencore legacy patcher to upgrade up to even macos sequoia on your device!",
            "score": 27,
            "replies": [
                {
                    "author": "24257",
                    "body": "This! I was able to achieve the same on my mid-2012 Mac Pro tower with OCLP. OP feel free to hmu in DMs if you need help doing this",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Decent-Law-9565",
            "body": "2015 Macbook Pro is now 10 years old. Chrome now requires MacOS 11 so there's a ticking time bomb until the web app also stops working. Now would probably be a good time to upgrade to one of the M series laptops or install Linux.",
            "score": 171,
            "replies": [
                {
                    "author": "zambulu",
                    "body": "I don’t have a problem using the web version on Safari, but yeah, probably time for OP to upgrade.",
                    "score": 25,
                    "replies": []
                }
            ]
        },
        {
            "author": "chaous2000",
            "body": "This shouldn't come as a surprise to anyone using an OS that is beyond EOL. Please see the following link for supported operating systems. It is common practice (whether good or bad is not something im commenting onhere) to end official support of an application running on software that is no longer maintained. [https://support.discord.com/hc/en-us/articles/213491697-What-are-the-OS-system-requirements-for-Discord#docs-internal-guid-09be9a94-7fff-2c2f-1ad4-48886516463f](https://support.discord.com/hc/en-us/articles/213491697-What-are-the-OS-system-requirements-for-Discord#docs-internal-guid-09be9a94-7fff-2c2f-1ad4-48886516463f)\n\nIf you click on the \\[known issue\\] mac os 10.15 youll find a link provided by discord that gives you a version of discord that will always work, as long as you do not install a newer version.",
            "score": 39,
            "replies": [
                {
                    "author": "Lewd_boi_69",
                    "body": "For exploit, security, and stability reasons right?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "-rikia",
            "body": "according to [the system requirements page](https://support.discord.com/hc/en-us/articles/213491697-What-are-the-OS-system-requirements-for-Discord) it needs MacOS 11, so yes OS X is no longer officially supported.\n\nhttps://preview.redd.it/9w71fx0gydpe1.png?width=499&format=png&auto=webp&s=dcae0dd52a8ccfdeee18d37354893095ec679ca2",
            "score": 10,
            "replies": []
        },
        {
            "author": "DeckT_",
            "body": "discord works great on mac os but you havent updated your shit in like 5 years dude obviously everything is gonna start not working eventually if you never update anything",
            "score": 29,
            "replies": [
                {
                    "author": "jackluke",
                    "body": "Huge believer that developers should make efforts to keep their products working on older systems. But there's always going to be a limit. At some point you can't justify spending 100k on .1% of the population.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "vitobru",
                    "body": "ahh the apple fanboy ass response. shouldn't have to update from what's comfortable when there's nothing on the backend API that's changed enough to prohibit the use of their macbook",
                    "score": -76,
                    "replies": [
                        {
                            "author": "DeckT_",
                            "body": "I dont even own a single apple product ? lol , im sorry but if you try to install discord on a fuckin old windows device im not sure how well that would work either ? to be fair i havent tried but all i know is if you never update anything, eventually apps starts not working anymore because they arent supported. you cant expect devs to update their app and keep supporting every single version of every single everything thats ever existed since the dawn of humankind.\n\n  \nif your gonna be an apple user , the least you can do is understand that you need to update stuff if you want it to work. I fucking hate apple but even I can understand that ?",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "PLASMA_chicken",
                                    "body": "Discord ( Electron ) doesn't work on Windows 7 either. There are even a few posts in the subreddit about that.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "vitobru",
                                    "body": "Considering that linux users are able to avoid updates for like half decades at a time and have most of their apps still work, I'd say it's not impossible.",
                                    "score": -58,
                                    "replies": [
                                        {
                                            "author": "ThyDankest2",
                                            "body": "Linux distributions are maintained and have entire teams and communities to keep apps up to date and stable. Any good Linux user is also ensuring their system is getting the updates it needs\n\nThat version of MacOS is EOL. Regardless of which OS you are using an EOL OS is not getting the updates needed to keep up with current web technology. Discord and it's underlying technology can't be expected to maintain legacy support nor can apple continue to keep supporting legacy versions. The only reason this works with MOST Linux distros  is it's open source nature allowing passionate developers to collaborate to ensure as much support as possible. It financially doesn't make sense for apple to pay employees to make sure that an outdated version of their operating system continues to get updated.\n\nEven on Linux if you are using an older distro or version you likely would not be able to install discord without a bunch of extra work ensuring you have the needed packages and build. It's likely that it is still possible to get discord to run on that version of Mac OS but it is probably more work than it is worth...",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "SarahKittenx",
                                                    "body": "\"keep up with current web technology\"\n\nAs a person responsible for writing similar apps, what are you smoking? They don't have to add anything new, old version from many years ago alone will work fine, and it's the same for phones, it's never switched \"technology\" once as long as api calls are done it will work perfectly fine",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "PLASMA_chicken",
                                                            "body": "From Security Updates to html5 and new browser features like PassKey Login there is a lot. \nAlso Electron has some native calls, those are obviously deep in the OS and refactoring code might get rid of old dependencies.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mr_Zomka",
                                            "body": "If you actually used Linux, you would’ve known this is bullshit. Just because you’re not using the latest release of your distro doesn’t mean you’re not using the latest version of the dependencies necessary for the software you used.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "DeckT_",
                                            "body": "I said windows for a reason.\n\neveryone knows linux is superior",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "teh_maxh",
                                            "body": "Even Debian stable only has a five year cycle. Catalina was released in 2019.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Mr_Zomka",
                                                    "body": "And most software would not even get feature updates on anything that is like 2 major versions of Debian stable behind.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "InflationCultural785",
                            "body": "Windows does similar. Putting windows 11 upgrades in the face of people",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "randomusername12308",
            "body": "Update to monterey",
            "score": 4,
            "replies": []
        },
        {
            "author": "theRealtechnofuzz",
            "body": "opencore for macs might help you upgrade to a newer OS.  It's not for the average user though...  I would recommend it if you're somewhat tech savvy...",
            "score": 2,
            "replies": [
                {
                    "author": "Mr_Zomka",
                    "body": "OP doesn’t need OCLP. Monterey which is a major version above the minimum required one is still supported on the 2015 MBP.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CoolGamer730",
            "body": "You can use bootcamp now",
            "score": 2,
            "replies": [
                {
                    "author": "sushir0les",
                    "body": "bootcamp can only officially do windows 10 (it doesn't emulate the TPM module) and it doesn't play nice with non-microsoft iso-s. their best bet is linux or a macos patcher",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CoolGamer730",
                            "body": "Masgrave",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lhakryma",
            "body": "Can't you just do some registry hacks to get it to run, like on windows?\n\nI mean I know macos is incredibly rigid compared to windows (and especially compared to linux), but isn't it possible to run it in like a linux environment?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mangothefoxxo",
            "body": "Still works on catalina for me",
            "score": -1,
            "replies": [
                {
                    "author": "Mr_Zomka",
                    "body": "Only old builds of Discord’s official client will work.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mangothefoxxo",
                            "body": "Odd, i haven't had any issues when i originally installed it. Maybe they changed it",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Mr_Zomka",
                                    "body": "Just because you’re not on the latest build, doesn’t mean you’ll instantly run into issues.\n\nYou should really consider updating to a newer macOS version unless your MacBook doesn’t have a Metal GPU (ie. doesn’t officially support Big Sur).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "mangothefoxxo",
                                            "body": "Im planning to go to Monterey anyway, that seems to be a stable build according to the comments when i asked on oclp",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Mr_Zomka",
                                                    "body": "Eh, Monterey just hit EOL iirc. I would just either do Ventura or switch to Linux if I were you. Sonoma and Sequoia are heavy af.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "mangothefoxxo",
                                                            "body": "Im actually planning to remove linux and stay on macos, arch has caused me.too many headaches",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SilverCutePony",
                                                                    "body": "Arch? You're using an OS aimed at those who love the terminal and building all programs from source and you're surprised at the headaches? Try something like Linux Mint, if you want a simple and intuitive OS",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "One-Importance6762",
            "body": "Install bazzite or fedora silverblue or just use hackintosh to upgrade to a newer macos",
            "score": -1,
            "replies": []
        },
        {
            "author": "Melodic_Advisor_9548",
            "body": "As it should be on all Apple OS machines.",
            "score": -9,
            "replies": []
        }
    ]
}