{
    "title": "Is it possible to revert the new discord in game overlay?",
    "author": "sami8s",
    "subreddit": "discordapp",
    "rank": 4,
    "score": 30,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 43,
    "url": "https://i.redd.it/b4nsogh4ifpe1.png",
    "id": "1je26p2",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "If this is a bug report or technical issue, please also post a ***properly formatted comment*** in the Monthly Megathread pinned at the top of the subreddit. It is closely monitored and prioritized by Discord. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/discordapp) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "wEatheR_579",
            "body": "https://preview.redd.it/tjorcfh6qfpe1.png?width=783&format=png&auto=webp&s=e156edde91c174fd893e655c9694e0a724efffae\n\nIdk why few people are saying getting the old overlay is not possible? it's literally in front when you open the \"game overlay\" option in settings?",
            "score": 40,
            "replies": [
                {
                    "author": "Mr-Sid_0000",
                    "body": "Idk I was just looking at mine today and didn’t see a legacy overlay option? Maybe I just did t see it lol",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Mr-Sid_0000",
                    "body": "Idk I was just looking at mine today and didn’t see a legacy overlay option? Maybe I just did t see it lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AndrewFrozzen",
                    "body": "Because 90% of people are technology illiterate and if they change ANYTHING that's not obvious, they lose their shit.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "the_grand_teki",
                            "body": "Because 90% of Discord's features are forcibly updated both functionally and visually with NO WAY whatsoever to turn it back to the old one",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AndrewFrozzen",
                                    "body": "It doesn't hurt anyone to CHECK in the settings before asking on Reddit.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Farcery",
            "body": "This overlay only works if your game is in borderless mode. So if you put the game into full screen it should switch to old version of overlay with some shitty \"you're missing out on the new overlay\" notification.\n\nOr if you have legacy overlay option in settings.",
            "score": 7,
            "replies": [
                {
                    "author": "sami8s",
                    "body": "Thank fuck, you're an angel for the legacy option <3",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Farcery",
                            "body": "Only till discord itself allows the option... and that won't be for long. They are pushing these weird changes without any alternative option.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kowiix",
            "body": "A bit out of the topic, but what game is that, looks cool",
            "score": 6,
            "replies": [
                {
                    "author": "sami8s",
                    "body": "\"Spirit City Lofi Sessions\" It's basically a customizable lofi music player x3",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Kowiix",
                            "body": "Oooh, i need to check it out",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "styxinghalos",
            "body": "when im in bitching competition and my opponent is discord user",
            "score": 2,
            "replies": []
        },
        {
            "author": "One-Importance6762",
            "body": "Just not use the overlay which eats your performance to give you actually nothing",
            "score": 1,
            "replies": []
        },
        {
            "author": "spikee_j",
            "body": "My issue with the new overlay is that when I'm on VC it auto deafens when I toggle the overlay",
            "score": 1,
            "replies": []
        },
        {
            "author": "FuzzyKnowledge1649",
            "body": "No you can't revert it, anyway, people complain about anything there is to complain about.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VasekFortygameCZ",
            "body": "I got the update for this as well, and must its have some plus and so mimus features. So far I noticed, the only way to hide it to click specific window the overlay and set it as you like. Also, you can \"unpin\" it, when its active, so its hidden.\n\nTo be fair, its looks better, but not many info about it. Also, you cant open Disocrd Text Channels, which is big minus for me, when I am playing on 1/2 monitors.Probably morr info would be added about it.\n\nEdit: You can also move with those windows, so you can put people talking in corners or literally into middle of monitor if you want.",
            "score": 1,
            "replies": [
                {
                    "author": "sami8s",
                    "body": "The whole not being able to open discord channels is for me literally removing the whole point of it.\n\nAll of the clutter that's thrown onto the screen should just be in an OPTIONS MENU!\n(Again I wish the screenshot would show it all, for some reason it gets hidden)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Woofer210",
                            "body": "Fwiw it is all option, give rover the elements and hit the blue plus icons and they won’t show up in game any more, you can also click and drag elements wherever you want them.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "VasekFortygameCZ",
                            "body": "Just opened the Setting for it. Looks like, you may turn back on the Legacy version.   \nSettings > Game Overlay\n\nAnd yes, the Text channels removed is bad thing. We should be able to write, while not alt-tabbing\n\nhttps://preview.redd.it/7xelquczbhpe1.png?width=851&format=png&auto=webp&s=b3c2471a0439e5cf23d7b109ce4345955a422cf0",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -3,
            "replies": [
                {
                    "author": "sami8s",
                    "body": "Well fuck, are there any news on how long the test period is? So I can at least know when I can turn it back on once they've either abandoned this update or enabled people to choose?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Lateboring",
                            "body": "Some updates aren't reversible. So this one will also stay. Unless the community hates on it on reddit or X for a few months.. so sorry man",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sami8s",
                                    "body": "RIP, guess I won't have an in game overlay anymore or have a quick button to the chat a friend messaged me in xD",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "MrBeansWhippyCreams",
                                            "body": "You can. Theres a legacy option in the settings",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "sami8s",
                                                    "body": "Thank fuck, you're an angel <3",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "MrBeansWhippyCreams",
                                                            "body": "I hated it as well. Hopefully they keep the option to have legacy",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Woofer210",
                    "body": "This is not true, you can enable legacy overlay and disable this overlay in game overlay settings.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Narzaru",
            "body": "This shit is blocking in game click to the left top corner.",
            "score": 0,
            "replies": [
                {
                    "author": "sami8s",
                    "body": "There's about 5 other massive boxes that for some reason doesn't get captured by printing the screen on windows. But even if it wasn't for all of that. The gray overlay you see is blocking you from interacting with the game.\n\nSo say you're playing an FPS and a friend messages you, you can get this screen in the way if you have the overlay enabled and BAM, you can't shoot for a few seconds. And well, we all know that seconds feel like eternities in tense situations",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "shuuwastaken",
                    "body": "Do you have more information on this specific problem? We've spent a lot of time making sure that doesn't happen. But if you could share a video, or tell us what game it's in we can take another look.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Narzaru",
                            "body": "I don't know the steps to reproduce the problem, it happens in zenless zone zero only, my cursor changed from in game cursor to os cursor in that area. But the fix is ​​to close discord.\n\n[https://imgur.com/a/KYaIyr7](https://imgur.com/a/KYaIyr7)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sami8s",
            "body": "It's an immensely annoying downgrade making all of this clutter cover the screen when you click the message you get sent.\n\nIs there any way to revert it to work the old way of \"Ah I got a message, I'll click it and it takes me to the chat with my friend\" rather than \"Let's cover the screen with clutter and disrupt both you being able to chat with your friend and playing the game.\"\n\nThe screenshot sadly doesn't even show all of the clutter, but there's about 5 or so more giant things covering the screen with options that are... Very irrelevant to me just wanting to see the message I recieved.\n\nI know I can disable the in game overlay, but I do want the pop up thing to quickly get to the chat. But if it's either having nothing or having this mess, I'd prefer having nothing tbh.\n\nHopefully whoever reads this isn't part of the unlucky 5% who got this test feature ;v;",
            "score": -1,
            "replies": []
        },
        {
            "author": "CrawlingCryptKeeper",
            "body": "Wow that overlay looks like complete shit.",
            "score": -2,
            "replies": [
                {
                    "author": "Woofer210",
                    "body": "Why does it look like complete shit?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CrawlingCryptKeeper",
                            "body": "It just does. The bar at the top is particularly horrendous.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Woofer210",
                                    "body": "What about it though? It’s more consistent with the in app voice call ui now. \n\nCan’t fix something if you can’t express what’s wrong with it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "CrawlingCryptKeeper",
                                            "body": "Just looks obnoxiously minimalist whilst somehow having too much going on. All of that stuff could be on the left-hand side or on the bottom of the screen.\n\nIt doesn't look consistent to voice calls to me. \n\nMan, I just want Windows 98 era program design back.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Woofer210",
                                                    "body": "It can be on any side you want, you can move all of the blocks to where you want them. The buttons that are there are all of what you need, mute, deafen, camera, screen share, soundboard, hang up. \n\nProbably because the new voice call ui is also being rolled out still, so not everyone can see it. They will match soon™️",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CrawlingCryptKeeper",
                                                            "body": "Okay.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shuuwastaken",
                    "body": "Would love to learn more about what you do / don't like. I read the other comment thread with Woofer, but you are able to move all of the elements on the screen around and such to your liking.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ilikerocket208",
                            "body": "I want to be able to see the text channels in the overlay",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Boxersteavee",
            "body": "Turn it off and use steam overlay.",
            "score": -3,
            "replies": []
        }
    ]
}