{
    "title": "Nitro Scams, Malicious Content, & Account Support",
    "author": "Pruvided",
    "subreddit": "discordapp",
    "rank": 0,
    "score": 1121,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/discordapp/comments/tkgivh/nitro_scams_malicious_content_account_support/",
    "id": "tkgivh",
    "selftext": "Hi all! This is a resource to help prevent users from falling for malicious behavior. Scammers attempt to trick you through trust, like accepting a \"prize\" through a malicious link or by using scare tactics, where they convince you to act immediately because something \"bad\" could happen, so be wary and mindful of your interactions with others. There's helpful information on avoiding scams and what to do if you fall for one below.\n\n### Always report malicious/scamming behavior, as well as anything else that breaks Discord's Terms of Service (*see \"Reporting Malicious Content/Behavior\" below*)\n\n---\n###\"Accidental\" Steam/Discord Report & Impersonation\nA common scam is if a user claims you've been accidentally/falsely reported to Steam or Discord for an infraction or fraud. Don't follow instructions provided by anyone claiming to have accidentally reported your account. The most common things that identify this scam are if someone:\n\n- Says your account has been falsely or accidentally reported\n- Directs you to speak with someone through online chat to resolve an investigation or pending ban\n- Requests your account credentials or directs you to perform specific security-related operations\n- Requests an authentication code sent over email, SMS, or anywhere else\n- Says they represent Discord, Steam/Valve, or any other official entity\n- Says you must complete a purchase of ***any*** kind\n\n**You can find some additional info for Discord-related scams [here](https://discord.com/discord-recruitment-scams) and Steam-related scams [here](https://help.steampowered.com/en/faqs/view/3195-9FFB-BA06-F25B).**\n\n---\n###Free Nitro Scams\nIf you believe you have received a possible scam from a bot or user account, consider if they:\n\n- Are new, unfamiliar, or unverified (in the case of bot accounts) contacting you unprompted.\n- Are not from Discord in the form of an email or [System-tagged account](https://support.discord.com/hc/articles/360036118732).\n- Have poor grammar, spelling, or misuse of punctuation/capitalization.\n- Offer things that are \"too good to be true.\"\n\n**Official Discord gifting uses the `discord.gift` & `discord.com` domains and will generate a special embed, as [shown in this image](https://support.discord.com/hc/article_attachments/360100559094/Screen_Shot_2021-01-19_at_5.32.44_PM.png) (in-app) or [this image](https://support.discord.com/hc/article_attachments/1500001750501/Screen_Shot_2021-01-19_at_5.38.00_PM.png) (link). Scams are not possible through the official browser/client pages/menus.**\n\nIf these types of bots are repeatedly sending you messages, you can:\n\n- Use Mutual Servers to determine the server(s) they share with you and disable Direct Messages from server members for those servers.\n- If you cannot find any shared servers, you can disable DMs from all servers under your User Settings\n\n---\n###QR Codes, Fake Games, Programs, & Downloads\nA user may pretend to be your friend or use a friend's compromised account to get you to download something. Consider if they want you to:\n\n- Scan a QR code\n- Check out a video\n- Test a game they made\n- Practice running code they wrote\n\nThese are common forms of malicious behavior. If a user asks you to scan/download something or click an unknown link, this could give away your login information and/or allow a malicious program to enter your computer, which can also compromise your account.\n\n---\n###Compromised Accounts\nIf your account sends these kinds of messages, your account has been compromised. If you...\n\n- ...downloaded and executed malware: You should try and use a different device entirely to change your password (e.g., your phone). You should then [follow these steps](https://support.discord.com/hc/articles/115004307527--Windows-Corrupt-Installation) to completely uninstall Discord, run a complete anti-virus scan, and then re-install Discord. If your account is compromised again when logging in afterward, you may need to factory reset your computer.\n- ...entered your password into a malicious/fake website: You should change your password. \n- ...something else: You should change your password.\n\n---\n###Reporting Malicious Content/Behavior\nThere are several methods to report behavior you believe is a scam/malicious.\n\n- Use the integrated \"Report Spam\" button, as [shown in this image](https://assets-global.website-files.com/5f9072399b2640f14d6a2bf4/61fb18b9858fe1dcb545ec01_5nSurukZcGFFFZd2fy7rNC93Da3CPtpvG0cNEJfEKzKyvHPWxqlGWpjXA1I6PcNelWtTLho4cU6i7T2WAfiCMJ05YgKY5f5-OgowIeoPt2u3hXoWYndHzxRGayEIcBydlNSKK1lN.png).\n- You can learn how to properly report content by checking out [this article](https://dis.gd/howtoreport).\n\n---\n###More Helpful Resources\n\n- [Scams and What to Look Out For](https://discord.com/blog/common-scams-what-to-look-out-for)\n- [Protecting Against Scams on Discord](https://discord.com/blog/protecting-users-from-scams-on-discord)\n- [Claiming a Nitro Gift FAQ](https://support.discord.com/hc/en-us/articles/1500001829622-Claiming-a-Nitro-Gift-FAQ)\n\n---\n###Discord Account Support\nThis subreddit is not the most appropriate location to ask for/receive support for account-related issues. These issues include:\n\n- Login\n- Payment\n- Phone verification\n- Email\n\n**This subreddit is operated by a group of volunteers who do not work for Discord,** and the community is incapable of solving these kinds of issues, so the best way to seek help regarding an account-related issue/request is to:\n\n- [Read the subreddit's account support FAQ page](https://www.reddit.com/r/discordapp/wiki/faq#wiki_how_long_does_support_take_to_respond.3F)\n- [Search Discord's support knowledge base](https://support.discord.com/hc/en-us)\n- [Send a ticket to Discord’s support team](https://dis.gd/contact)\n\n**If you have not received any info/updates for an existing ticket after a week, or if your ticket is marked as closed, create a follow-up using the original ticket. Discord's support queue is likely incredibly massive, so please be patient. It sucks, but there really isn't much you can do other than wait.**",
    "comments": []
}