{
    "title": "the asset flipping here is crazy",
    "author": "Bitter_Position791",
    "subreddit": "Steam",
    "rank": 17,
    "score": 3361,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 69,
    "url": "https://i.redd.it/5a83341216pe1.png",
    "id": "1jd32ge",
    "selftext": "",
    "comments": [
        {
            "author": "rock1m1",
            "body": "Out of sight, out of mind. Steam never shows me these games, I only see these on this sub.",
            "score": 1778,
            "replies": [
                {
                    "author": "SuperSocialMan",
                    "body": "Same here lol",
                    "score": 261,
                    "replies": []
                },
                {
                    "author": "Sandramortonx",
                    "body": "Just wait until they start selling “asset flip simulator 2023!”",
                    "score": 117,
                    "replies": []
                },
                {
                    "author": "TheWhisperingOaks",
                    "body": "If you did discovery queue, you'd see games using that asset pack very often.\n\n99% of the time I put them under \"ignored\"",
                    "score": 62,
                    "replies": [
                        {
                            "author": "AquaBits",
                            "body": "Bingo.\n\"Out of sight out of mind\" is a horrible attitude towards most things lol, quite literally ignoring problems. \n\nLike going to community hubs on steam, and most of them are filled with the most vile, bigoted slop you can see and absolutely unmoderated. But hey, if you dont look at it, it magically isnt there right?",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "CockroachCommon2077",
                                    "body": "Unfortunately there isnt much we can do besides ban certain tags and just hit ignore for every one of them which doesn't solve the issue completely. It's up to Valve if they want to go ham on quality control when it comes to games. That's what Steam Greenlight was supposed to be for, well kinda, it was mainly because of their limited capacity but now you can get hard drives with dozens of terabytes of storage. They put their foot down for Crypto and NFT shit. So they can do the same for asset flips and games made generally for a quick buck. Steam is getting a surge of virus games lately which would put them in a bad spot to do something, like quality control. \n\n\"Out of sight, out of mind\" seems like it's a horrible attitude but that's all we can do unless we pull a #FixTF2 move but Steam quality control kind of crap. Which the easiest way imo would be the same thing as Steamdeck verified but for quality made games that the community/Steam deems worth having. We got the tools to help it ourselves, but to permanently do something, it's up to Valve",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "AquaBits",
                                            "body": ">They put their foot down for Crypto and NFT shit.\n\nBarely lol\n\nThe problem is with Valve, but thats a conversation few people have because \"steam is totally great and has no faults\" is repeated ad nauseam- especially here.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "CockroachCommon2077",
                                                    "body": "So they didn't ban NFT and crypto games from being released on Steam then?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "AquaBits",
                                                            "body": "What do you think \"Banana\" and \"Egg\" are, if not just nft games using the steam market?\n\nAnd their stuff with AI? Call of duty is obviously using AI and theyre still on steam.\n\nSo... yes. \"Barely\".",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "CockroachCommon2077",
                                                                    "body": "Riiiiiiiight..... Forgot about those damn games. Just been ignoring that shit everytime I come across it. But Steam still gotta get their shit together with getting rid of the trash",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "mrRobertman",
                                    "body": "But what is the solution to this? If Valve starts to remove games *they* deem to not quality, that would likely end up with Valve becoming incredibly arbitrary on where they draw the line. Valve has commented before that they don't want to be the taste police - because there are plenty of games that you or I would consider garbage but surprisingly there are people that like them. \n\nThese games in OP's screenshots are shit games, but otherwise they aren't malicious or breaking any laws, so why no leave it up to the users to decide on whether they want to buy it or not? With the way that Valve handles visibility on the store, these games aren't popular so you generally won't see them unless you intentionally seek them out. \n\nUnlike the community hubs, you can easily browse Steam without seeing the incredibly low effort ones in OP's screenshot. You will occasionally see some bad games, but you generally only if they are somewhat popular.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "AquaBits",
                                            "body": ">But what is the solution to this? If Valve starts to remove games *they* deem to not quality, that would likely end up with Valve becoming incredibly arbitrary on where they draw the line.\n\nOh come on.\nFirst step?\nStop the \"$100 to put your trash on steam\".\nSecond? Limit games that have access to steam inventory and trading to games verified by Valve. \nThird? Take user reports seriously. Right now you can report plenty of shit and Valve just pisses the reports away.\nFourth and onward? Investigate heavily negative reviewed games. If a game is sitting at a 80% negative review rating for 6 months, chances are its not a good game on the platform. Investigate when a game is predominantly sold through activation keys. Investigate how often a game goes on sale and how much, so shit like above doesnt happen. Remove EA game, or fully release games that havent had an update in more than a year. \n\nThats just shit i came up with off the top of my head, certainly the most popular, profitable storefront for PC gamning can muster up some better ideas. \n\n>so why no leave it up to the users to decide on whether they want to buy it or not?\n\nBecause its slop that gets in the way of *genuine* games. Not to mention is opens things up for scams.\n\n\n>these games aren't popular so you generally won't see them unless you intentionally seek them out. \n\nNot true at all\n\n>Unlike the community hubs, you can easily browse Steam without seeing the incredibly low effort ones in OP's screenshot. You will occasionally see some bad games, but you generally only if they are somewhat popular.\n\nAgain, not true at all. Discovery queues were basically destroyed, not to mention if you just wanted to search up by tag or name, you do have to scroll through this shit. Cant really find indie gems or diamonds in the rough, because of all this \"rough\".",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "mrRobertman",
                                                    "body": "> First step? Stop the \"$100 to put your trash on steam\".\n\nSo what do you propose as the replacement? Entirely Valve approved? Good luck to the small indie developers. Increase it? Again, goodbye small indie developers. \n\nThis is where part of the \"taste police\" issue comes in. Further limitations to getting a game on Steam will absolutely prevent a number of the small indie developers from being able to release their game on Steam. People would often complain that their favourite niche game couldn't get enough votes on Greenlight.\n\n> Second? Limit games that have access to steam inventory and trading to games verified by Valve. \n\nThere already are limitations to the profile features. All of the games from OP's screenshot are limited. Sure, currently it's limited based on sales/profit, but then that leaves the decision to users to buy the game - if the game is not popular, then the profile features are limited as we see with these.\n\n> Third? Take user reports seriously. Right now you can report plenty of shit and Valve just pisses the reports away.\n\nWell, when the current rules allow these, what do you expect the user reports to do? And again, the taste police issue.\n\n> Investigate heavily negative reviewed games. If a game is sitting at a 80% negative review rating for 6 months, chances are its not a good game on the platform. \n\nWhy does it matter if a game with negative reviews are on Steam? With how Valve handles visibility, these don't get recommended unless they are currently popular (ie, big AAA releases)\n\n> Investigate how often a game goes on sale and how much, so shit like above doesnt happen.\n\nValve already has limitations on frequency of sales to prevent abuse.\n\n> Not to mention is opens things up for scams.\n\nScams currently get removed.\n\n> Again, not true at all. Discovery queues were basically destroyed, not to mention if you just wanted to search up by tag or name, you do have to scroll through this shit. Cant really find indie gems or diamonds in the rough, because of all this \"rough\".\n\nI would hardly call it destroyed. I just did a few queues and only had a couple of really low-effort games. Most of the smaller games (<1000 reviews) it recommended are just fine, nothing amazing but not trash or anything.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "AquaBits",
                                                            "body": ">So what do you propose as the replacement? Entirely Valve approved? Good luck to the small indie developers. Increase it? Again, goodbye small indie developers. \n\nImmediate access with a publisher, or approval with Valve. \n\"Small indie devs\" do try to get their game out there, and you act like Valve will just auto deny anythinb and everything.\nOh no! Valve having quality control! \n\n>This is where part of the \"taste police\" issue comes in. Further limitations to getting a game on Steam will absolutely prevent a number of the small indie developers from being able to release their game on Steam. People would often complain that their favourite niche game couldn't get enough votes on Greenlight.\n\nHowso?\nIf an indie developer wants their **actual** game on steam, they submit it to valve. Valve approves because its an actual game. \nScam developer of \"5000 achievement game 100% click now\", doesnt get approval. Simple as that.\n\n>There already are limitations to the profile features. All of the games from OP's screenshot are limited. Sure, currently it's limited based on sales/profit, but then that leaves the decision to users to buy the game - if the game is not popular, then the profile features are limited as we see with these.\n\nAs I said, this doesnt stop the massive amount of trading card and steam inventory spam. \nIts like you completely ignored my comment.\n\n>Well, when the current rules allow these, what do you expect the user reports to do? And again, the taste police issue.\n\nActually, according to Valves rules, no. Just that they dont enforce their rules. If a game has broken achievements for example, it isnt permitted on steam. Know what happens when you report a game known for having broken achievements?\nNothing!\n\n>Why does it matter if a game with negative reviews are on Steam?\n\nWe are talking about Valve implementing quality control, and you are asking would negative reviews matter. \n\nThink long and hard about that.\nIf a game has a bunch of valid negative reviews, probably means that game is of poor quality, doesnt work, etc and *shouldnt be sold on the platform*.\n\n>Valve already has limitations on frequency of sales to prevent abuse.\n\nRead that comment again.\n\nAnd no, there is not enforcement of these rules and limitations. See: above, or GTA V going on a super sale for a split second, then to the usual sale price. \n\n>Scams currently get removed\n\nNot really lol\n\n> I just did a few queues and only had a couple of really low-effort games.\n\nSo... you *given* evidence of the problem, ignore it/dont think its bad, then act like theres no problem?\n\nAlright then lol.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LD_weirdo",
                                    "body": "I keep hearing about this vile, bigoted slop. About fascist groups congregating etc. etc... Where do you people find this stuff? Do you go looking for it specifically? Where is it?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "aVarangian",
                            "body": "the rate of new flips is higher than how quickly you can ignore them",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "heyuhitsyaboi",
                    "body": "I stumble into them once in a blue moon, its easy to look away",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dreamspitter",
                    "body": "Because theyre puzzles?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zechariah_B_",
            "body": "I want 3D PUZZLE - Actually Enjoyable Edition",
            "score": 110,
            "replies": []
        },
        {
            "author": "MadFroggeo1",
            "body": "The developer spent 1300 dollar so they could release this garbage. Crazy.",
            "score": 324,
            "replies": []
        },
        {
            "author": "mage_irl",
            "body": "How are these games hundreds of dollars, this is insane lol",
            "score": 328,
            "replies": [
                {
                    "author": "vertopolkaLF",
                    "body": "it's obviously fake for \"-95%\" in the list",
                    "score": 377,
                    "replies": []
                },
                {
                    "author": "Echo8625",
                    "body": "It tends to be for those “random key bundles” sold on different sites. If you check the pice history of the games, it starts dirt cheap, dev adds some positive reviews to crank up the good rating, increases the price to an exorbitant amount so no one will review it. Then it technically meets the qualifications for the “premium” bundles of keys sold on various sites, as it has a high rating, and is priced high.",
                    "score": 201,
                    "replies": [
                        {
                            "author": "Am_aBoy",
                            "body": "Am curious then can't there be a 20 ISH group of people who got review bomb it when it's at such low prices and then just refund it lmao",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "sociocat101",
                            "body": "How do premium bundles work? Don't people still need to buy the game to be able to get the key for it?",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lurus01",
                    "body": "For G2A mystery bundles so they can claim the value of the games you get from the mystery is that high and you end up with these games from your mystery pulls.  They also ensure they keep good reviews since key reviews dont count so they get like 4 or 5 people to review the lot and then can sell it to G2A as a high value and mostly positively rated game.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Deven1003",
                    "body": "money laundering at its best",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "Seekret_Asian_Man",
                    "body": "So it can always come out top of highest discount list every sales.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "superhyperultra458",
            "body": "Sometimes, I think Valve should cross-check these \"games\" whether they should be allowed to put Steam. Obviously, probably it will never happen lol",
            "score": 110,
            "replies": [
                {
                    "author": "genoforprez",
                    "body": "Valve used to be a lot more strict about what games they let on Steam, then people gave me them sh\\*\\* about it. So then they tried a more intermediary system like Steam Greenlight, but people didn't like that either for different reasons. At the end of the day, people wanted basically a free-for-all, so that's kinda where Steam ended up. There are pros and cons with that, and this is one of the cons.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "AquaBits",
                            "body": "People did not want a free for all. Valve just wanted a handsoff approach, and opened the flood gates.\n\nThere is no quality control on Steam, which is why you get slop like this, scams, speculation games, broken games and such.",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "genoforprez",
                                    "body": "No, if you go back to around 2007 or 2008, Valve was more strict. The biggest complaint in those days was that Valve was not accepting anyone's games. Or it would accept to distribute some indie games but not other ones, and nobody could figure out what you were supposed to do to please Valve so that they would distribute you. Valve was accused of \"gatekeeping\", boosting certain games or developers they liked, while holding other ones back. That sort of thing.\n\nValve did not enjoy making the call of what to publish or not. They didn't want to allow everything onto the platform, but they didn't want everyone giving them sh\\*\\* for not allowing games onto the platform either.\n\nSo they tried out Steam Greenlight for a while, which was an interesting experiment, but it had its own problems and didn't take into account certain developer concerns. Tbh gamers online are often dumb and angry and don't know what they're talking about.\n\nThis system was replaced by Steam Direct, in which most games that want to get published do get published, as long as they meet certain requirements. Valve DOES do a certain amount of quality control to make sure e.g. they aren't selling you spyware or bitcoin miners. But valve doesn't care if you think Bad Rats is a quality game or not.\n\nThis developer is engaging in the ancient practice of shovelware. Valve does take steps to try and stop the kind of shenanigans this person is engaged in, but whatever steps they take, they have to make sure they're not hurting innocent devs at the same time. This is an arms race at the end of the day.\n\nThis is clearly annoying, but it's just ignorant to suggest Valve does nothing, has no plan, and doesn't care. I know it's annoying, but things are more complicated than that.",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "AquaBits",
                                            "body": "What on gods green earth are you talking about bro?\n\nYou can see the history of games released on steam here:\nhttps://steamdb.info/stats/releases/\n\n>Valve did not enjoy making the call of what to publish or not. They didn't want to allow everything onto the platform, but they didn't want everyone giving them sh\\*\\* for not allowing games onto the platform either\n\nWhat type of revisionist history is this lol\nValve genuinely doesnt care about anythiny but making an extra buck. They *used* to care about quality of their platform and games but full on stopped around ~2014/15 \n\nPeople *loved* steam greenlight. Problem is, valve auyomated it towards the later half of its life cycle, which just resulted in bad actors botting their asset flips and kickstarter scams which got accepted but genuine indie games didnt.\n\nSo in turn valve just opened the flood gates. Hell, it was one of the things that made Jimquisition so popular because she would showcase the massive amount of slop being released and Valve doing nothing about it.\n\nLets not forget the games that were a bit miner, one that used the steam inventory feature to literally scam people, speculation games like Banana and Egg, purposefully offensive games, and the the droves of shovel ware made soley for card farming all allowed on steam no question asked.\n\nNow personally, if I had a storefront that I was proud of, I wouldnt just allow a product to be sold just because the seller gave me $100 and a single exe file, but I also have standards. Unlike valve.\n\n>Valve does take steps to try and stop the kind of shenanigans this person is engaged in,\n\nThey genuinely dont.\nThey just recently made the choice to add a line of text that tells if an EA game has been updated recently. Thats like.... the bare minimum of quality control. \n\n>it's just ignorant to suggest Valve does nothing, has no plan, and doesn't care. I\n\nThey genuinely dont. They have showcased *so many* times that they really dont do anything, and dont care.\nThey do have a plan. Its just \"hands off, well only do something if someone makes a stink about it\".",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "aVarangian",
                                                    "body": "tbh there is an absolute minimum. A whole \"developer\" of card-farming shovelware got banned a few years ago, maybe 2020 if I had to guess.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "AquaBits",
                                                            "body": "Is that \"developer\" completely banned or are they still operating under a different name lol\n\nNo is my bet.\n\nHow many more popped up?\nThe bare minumum would be not allowing shovel ware games to be card eligible, or limiting account creations/activity from problem ips and areas.\n\nHell, look at TF2. 70% of active players are bots idling for drops. Youre telling me valve has done the absolute minimum for banning one developer? Come on lol",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "doublah",
            "body": "Just click ignore.",
            "score": 21,
            "replies": []
        },
        {
            "author": "This-Insect-5692",
            "body": "I've never seen this shit but it should be banned",
            "score": 15,
            "replies": []
        },
        {
            "author": "PooPineUpper",
            "body": "Least obvious money laundering schemes be like",
            "score": 21,
            "replies": [
                {
                    "author": "SocietyAlternative41",
                    "body": "what money is changing hands here? do you even know what money laundering is? lol",
                    "score": 5,
                    "replies": [
                        {
                            "author": "PooPineUpper",
                            "body": "That’s where you wash money in a washing machine right?",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "jonmacabre",
                            "body": "Put a game up for $100, buy it yourself. Clean money as income from Steam.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "theyellowjester",
            "body": "We need someone to make Asset Flipper Simulator.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Brother_Bongo",
            "body": "Looks like he's made around 20-80k per game. His best game he sold was 3D puzzle - Old House. At the ~80k. Still 20k per game putting in little work not bad. Need a lil side cash? Crap one out.",
            "score": 3,
            "replies": []
        },
        {
            "author": "EinsHardth",
            "body": "bruuhh... at least make thumbnail consistent for all that bother",
            "score": 3,
            "replies": []
        },
        {
            "author": "TinyTusk",
            "body": "that is most likely money laundering actually",
            "score": 9,
            "replies": []
        },
        {
            "author": "Far_Yesterday4059",
            "body": "Wait until you see the aim trainers",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdreKiseque",
            "body": "Interesting prices",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zealousideal-Tax-496",
            "body": "Remember when Digital Homicide were the worst developers on Steam? \n\n\nNow it's doors wide open to every two-bit scumcunt out there.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Creepyman007",
            "body": "If i had to guess these are being sold as keys as one of those \"5 random steam games\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tiyanos",
            "body": "I made a similar angry rant against all the \"something store simulator\" most of them, made in 2023-2024, are just \"shovelware\" using 99% of the same asset, mechanics and gameplay loop with a very VERY small theme change",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hlidskialf",
            "body": "This is bad but some AAA games does the same but no one say anything",
            "score": 2,
            "replies": []
        },
        {
            "author": "saul2015",
            "body": "I miss when Steam had quality control",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dinasourus723",
            "body": "Would never buy a asset flip game lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Carteli_Boi",
            "body": "They are on my ignored list. Just use the \"discovery queue\" function.",
            "score": 1,
            "replies": []
        },
        {
            "author": "squidgymetal",
            "body": "Valve doesn't care as long they make money",
            "score": -13,
            "replies": [
                {
                    "author": "SpookyScaryClown",
                    "body": "Valve is probably the most consumer friendly gaming corporation…",
                    "score": 28,
                    "replies": [
                        {
                            "author": "squidgymetal",
                            "body": "Notice how I never said anything about them being anti-consumer. Valve much like any other corporations goal is to make money. It doesn't matter if they are the most consumer friendly one, the goal remains the same which is self evident by the fact that they allow asset flip games on their store because it makes them money. If they cared at all these games wouldn't be on the store in the first place.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "SpookyScaryClown",
                                    "body": "Okay mate. First of all, I was agreeing with you. It’s sad that Valve leaves these games up just for a few bucks, even when they’re a billion dollar corporation. And considering that they’re the most consumer friendly, what about the other ones. No need to crash out.",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "squidgymetal",
                                            "body": "Tone is hard to convey over text and considering I'm being down voted it seemed like you weren't. But I'm not crashing out, reddit isn't that deep lol",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AquaBits",
                            "body": ">most consumer friendly gaming corporation…\n\nI would not consider making children addicted to gambling and harboring bigoted racist, sexist and xenophobic people to be \"consumer friendly\".\n\nI think devolver digital or redigit are far more consumer friendly \"gaming coperation\", or maybe even gog. Certainly not Valve though.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Immediate-Monitor-79",
                            "body": "Two things can be true at once lil bro",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SpookyScaryClown",
                                    "body": "Alg lil bro, maybe read in between the lines.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Immediate-Monitor-79",
                                            "body": "People used to use words and statements when a purpose",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Maleficent_Load6709",
                    "body": "Valve doesn't care, why should I?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "squidgymetal",
                            "body": "No one says you have too bud",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "squidgymetal",
                            "body": "Yet they still allow thousands of them to remain on the store",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sith_Lord_Marek",
            "body": "Idk how. But I'm convinced this is somehow a money laundering scheme.",
            "score": 0,
            "replies": []
        }
    ]
}