{
    "title": "Any coop games that are relatively simple and relaxing but keep you hooked for hours?",
    "author": "icebrandbro",
    "subreddit": "Steam",
    "rank": 15,
    "score": 85,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 123,
    "url": "https://www.reddit.com/r/Steam/comments/1jdrr6k/any_coop_games_that_are_relatively_simple_and/",
    "id": "1jdrr6k",
    "selftext": "Title says most of it. Played Deep rock galactic and loved it. Need a game my friends and I can all play and relax with again. We have many of the popular ones. Was thinking about potentially Payday 3 because we loved payday 2, even if it’s worse than 2. Anything else out there that’s a good coop game?",
    "comments": [
        {
            "author": "oheyitsdan",
            "body": "Minecraft",
            "score": 15,
            "replies": []
        },
        {
            "author": "lemonmeringuecrossin",
            "body": "kingdom 2 crowns!",
            "score": 9,
            "replies": [
                {
                    "author": "thegakinator",
                    "body": "Came to recommend this, my husband and I just sank a solid 5 hours into this last night before I had to work in the morning. It was unintentional lol. Such a zen-like experience, with just enough strategy/things to figure out to make it interesting and fun to play with a friend! Might only be two player, however, which might not be enough players for you it sounds like.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "lemonmeringuecrossin",
                            "body": "oh that's my bad! i thought i read it as OP and 1 other friend. unfortunately as fun as Kingdom Two Crowns is, it is only a 2 player game. :(",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "-demesne-",
            "body": "Raft ♡",
            "score": 17,
            "replies": [
                {
                    "author": "d1ld0_shw4gg1ns",
                    "body": "I love Raft but the shark drives me nuts",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Commercial_Gene4984",
                    "body": "Did not like it because of all the mindless busywork the game throws at you. I think Void Train delivers the formula quite well, though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "radish-salad",
            "body": "it takes two",
            "score": 8,
            "replies": [
                {
                    "author": "SHv2",
                    "body": "Split Fiction after that",
                    "score": 2,
                    "replies": [
                        {
                            "author": "miyotto",
                            "body": "and A Way Out after that",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wind_Yer_Neck_In",
                    "body": "There's a little cottage industry of tiktoks and youtube shorts of couples playing this where one is a long time gamer and the other is trying platforming for the first time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gabaloo",
            "body": "Enshrouded is a fun exploring/building/dungeon game",
            "score": 8,
            "replies": [
                {
                    "author": "PlaquePlague",
                    "body": "Enshrouded has ruined every other survival crafting game for me.  So much quality of life in every aspect.  And the combat is actually fun instead of feeling like a frustrating chore?  \n\nCriminally underrated game. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FrozenMongoose",
            "body": "Get Ready or Not instead of PayDay 3. I would not exactly call these games relaxing though. Get Astroneer, Raft, Satisfactory, The Survivalists or Valheim if you want relaxing.",
            "score": 26,
            "replies": [
                {
                    "author": "A_Coin_Toss_Friendo",
                    "body": "Ready or Not is literally the opposite of relaxing. I love it though!",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "Nekroin",
                    "body": "RON is a mixed bag. It was fun until you realize every mission is basically the same. The enemies are the same no matter if hostage situation in a school or meth lab. the ybehave the same no matter what and I think that's a huge oversight.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "laylu-bug",
            "body": "valheim ! payday 3 is butt imo :(",
            "score": 27,
            "replies": [
                {
                    "author": "dumplingcum89",
                    "body": "Love valheim. U play it ?",
                    "score": -4,
                    "replies": [
                        {
                            "author": "SleeplessYeet",
                            "body": "OBVIOUSLY IF THEYRE RECOMMENDING IT TO SOMEONE",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "laylu-bug",
                                    "body": "LOLOL ty for not making me say the obvious xd",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "tinkerfizz",
                                    "body": "...I sometimes recommend games I haven't played. I have kids and I buy the games, so I look into way more games than I personally play.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bluefieldsj",
            "body": "If you find one let a girl know 😉",
            "score": 12,
            "replies": []
        },
        {
            "author": "theweefrenchman",
            "body": "Satisfactory. Although your idea of relaxing might be different from mine.",
            "score": 24,
            "replies": [
                {
                    "author": "Gex2-EnterTheGecko",
                    "body": "I don't find satisfactory stressful at all. Unlike Factorio there are no resource limits, there are no enemies that will show up and destroy all your shit, and there's no real sense of urgency. I've put over 1000 hours into it just chilling and listening to podcasts and I still keep coming back for more.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "adampm1",
                            "body": "Some settings in factorio can stop enemies and ensure you did not run out of material.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BorgorCat",
                    "body": "Satisfactory is such a vibe",
                    "score": 4,
                    "replies": [
                        {
                            "author": "zjcarter",
                            "body": "Just started this game solo and am stumbling through it. It’s so much fun but makes me feel like I could be doing things more efficiently",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "RussNP",
                                    "body": "That’s literally the whole point of the game.  You will build something and move on to the next thing.  Then come back around to visit that original item you were making and make a much better version using your knowledge you have gained.  It’s a cycle of improving efficiency that is the hook. ",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fawkter",
                    "body": "Agree with this. I'm not even into crafting. My friends build. I kill and collect while exploring. All fun and relaxing.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MessaRanger",
                    "body": "Satisfactory is so dangerous. You starting the game and then realise that 12 hours jus disappeared",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mage_irl",
            "body": "Farming Simulator. It's pretty chill and you can build a small farm with as many friends as you want! It's pretty great to play on the side while watching movies too.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Atilla_For_Fun",
            "body": "Stardew valley",
            "score": 10,
            "replies": [
                {
                    "author": "Merry_Little_Liberal",
                    "body": "Traveller's Rest!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fakeguy011",
            "body": "Terraria is king.",
            "score": 14,
            "replies": [
                {
                    "author": "-Great-Scott-",
                    "body": "Terraria is life.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "kanec_whiffsalot",
            "body": "Define relaxing? Magicka is a bit frenetic, but iits pve if you don't count the friendly fire. (There's a lot of friendly fire). Can be a blast.",
            "score": 5,
            "replies": [
                {
                    "author": "Humpelstielzchen-314",
                    "body": "It starts as PvE but it does not end there. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pkaramazov",
            "body": "Valheim might be the most relaxing-tense videogames ever.\nRisk of rain 2 also recommended",
            "score": 5,
            "replies": [
                {
                    "author": "Old-Benefit4441",
                    "body": "Past tense, present tense, relaxing tense.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "janas19",
            "body": "If you're looking for something that's really cozy and chill, check out Webfishing",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lewa358",
            "body": "It Takes Two, A Way Out, and Split Fiction are the obvious ones, though those are only two-player.\n\nOtherwise...\n\n- Sackboy\n- Rayman Legends\n- Plate Up\n- Gunfire Reborn \n- Helldivers 2\n- Baldurs Gate 3\n- Divinity Original Sin\n- Diablo",
            "score": 4,
            "replies": []
        },
        {
            "author": "CuteWest7213",
            "body": "Tiny tina's wonderlands",
            "score": 3,
            "replies": []
        },
        {
            "author": "cyb3rofficial",
            "body": "The long Drive",
            "score": 3,
            "replies": []
        },
        {
            "author": "Haunting-Pound7728",
            "body": "Enshrouded",
            "score": 3,
            "replies": []
        },
        {
            "author": "ZestyPyramidScheme",
            "body": "EchoPoint Nova was fun as hell. I can’t even explain it, but the game isn’t complex. It’s like if Destiny 2, Skate3, Quake, and Risk of Rain 2 all had a baby. FAST pace shooter. Really no drawbacks to dying. You can pull off some ridiculous trick shots. You can easily get 15 hours of gameplay out of it. Then you can play on different difficulties. There’s a skill tree. Character Customization. I definitely recommend checking it out",
            "score": 3,
            "replies": [
                {
                    "author": "-sharkbot-",
                    "body": "This game is so fun, chaining quad jumps and grapples to launch yourself up a giant mountain to hit a nasty trick shot. Chefs kiss.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Invader13",
            "body": "Raft, Palia, The Forest, Sons of the Forest, Ark",
            "score": 6,
            "replies": [
                {
                    "author": "A_Coin_Toss_Friendo",
                    "body": "The forest and sons of the forest have to be played in a very specific way for it not to be stressful or frightening.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "-sharkbot-",
                            "body": "Yeah just turn on indestructible buildings and it solves the main problem of not being able to chill.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FromTheRez",
            "body": "Risk of Rain 2 is a blast with friends",
            "score": 4,
            "replies": [
                {
                    "author": "A_Coin_Toss_Friendo",
                    "body": "That game gets stressful fast. I love it though!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TwitzyMIXX",
            "body": "Satisfactory\n\nOvercooked\n\nPlate Up",
            "score": 5,
            "replies": []
        },
        {
            "author": "-_-__----",
            "body": "Luma Island! Maximum simple maximum relaxing and coop. There ya go!",
            "score": 2,
            "replies": []
        },
        {
            "author": "perc10",
            "body": "Raft",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sketch_0",
            "body": "Sonic the Hedgehog.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LolcatP",
            "body": "halo master chief collection",
            "score": 2,
            "replies": []
        },
        {
            "author": "CreamPuzzleheaded300",
            "body": "Heroes of Hammerwatch 2 is neat.",
            "score": 2,
            "replies": [
                {
                    "author": "CrixXx88",
                    "body": "So is Heroes of Hammerwatch 1 and Hammerwatch 1.\nHammerwatch 2 unfortunately isn't as good any of the others but still better than you'd think when reading the reviews.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rennfan",
            "body": "I wouldn't call Payday or Deep Rock relaxing",
            "score": 2,
            "replies": []
        },
        {
            "author": "DnZ618",
            "body": "Corekeeper",
            "score": 2,
            "replies": []
        },
        {
            "author": "dongless08",
            "body": "Not sure if it’s the type of “relaxing” you’re looking for, but Left 4 Dead 2 and Killing Floor 2 are up there with DRG for me",
            "score": 2,
            "replies": [
                {
                    "author": "SuumCuique1011",
                    "body": "My kid and I have side-by-side PCs and Killing Floor 2 was awesome to play together. He's very flighty, though and he lost interest.\n\nIt wasn't \"relaxing\", but crushing a stage together and being able to high-five each other is something I won't soon forget.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "dongless08",
                            "body": "That’s really nice, which classes did you both tend to use? And did you manage to beat Hell on Earth together at any point? lol",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SuumCuique1011",
                                    "body": "He liked the \"Commando\" and \"SWAT\" classes. I almost always like support classes in PvE games, so I was usually the \"Field Medic\" in KF2.\n\nWe usually jumped into or created random instances. I don't specifically remember running \"Hell on Earth\", but we may have done it(?)\n\nEither way, it was really fun just sitting side by side and coordinating what we were doing and giving each other high-fives when we crushed a run.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "A_GOATS_FART",
            "body": "Helldivers 2. \n\nBut hear me out. It is HILARIOUS. While there is a lot of fighting, the shit that happens will have you laughing all the way through missions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MessaRanger",
            "body": "Helldivers 2 - the best Coop game for playing with friends",
            "score": 3,
            "replies": []
        },
        {
            "author": "10F1",
            "body": "Helldivers 2, Marvel Rivals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pev4a22j",
            "body": "rabbit and steel, relaxing on lower difficulties",
            "score": 1,
            "replies": []
        },
        {
            "author": "witchrinnie",
            "body": "I found out that kicking the shit out of giant monsters in Monster Hunter World with a giant-hammery looking musical instrument does wonders for my relaxation \n\nI'm serious.\n\nSadly I can't play Wilds, sigh. (Oldish pc)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fionacat",
            "body": "Gunfire reborn, the headliners, aloft",
            "score": 1,
            "replies": []
        },
        {
            "author": "DemeaRisen",
            "body": "I came over to DRG after putting about 400 hours into Remnant: From The Ashes. It's definitely not relaxing at the start though 🤣😭. But the drop in/drop out style of co op is really nice for me personally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BRADLIKESPVP",
            "body": "Risk of Rain 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Pride6624",
            "body": "If you’re fine with online pvp TF2, or I’d recommend nuclear nightmare, and sons of the forest",
            "score": 1,
            "replies": []
        },
        {
            "author": "azoicxx",
            "body": "Stardew Valley. \n\nI am surprised this was not the first answer...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Professional_Low_893",
            "body": "Brotato",
            "score": 1,
            "replies": []
        },
        {
            "author": "According_Medium_442",
            "body": "Legion Td2 pretty cool in classic mode Tower defense with pvp!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Timinator01",
            "body": "minecraft",
            "score": 1,
            "replies": []
        },
        {
            "author": "antisimpdude",
            "body": "Left 4 dead 2 all the way",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoloDev_SJB",
            "body": "My heaviest played co op game that was relatively simple was wwz",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Spcy-",
            "body": "minecraft, palworld, raft,",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deven1003",
            "body": "monster hunter worlds, iceborne,wilds.\nSatisfactory\nI wouldnt play payday 3. just play 2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bam_904__",
            "body": "I would say schedule one it hasn't released yet but they have a demo and I just keep finding myself playing it over and over the game comes out on the 26th and it's really fun",
            "score": 1,
            "replies": []
        },
        {
            "author": "FriendlyITGuy",
            "body": "Kind of surprised I haven't seen Among Us on the list.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InsertCleverName007",
            "body": "I enjoyed playing Timberborn. Tiny Glade, Wildmender, and My Time at Portia.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DUBBV18",
            "body": "Baltro - my wife plays and I give commentary :P",
            "score": 1,
            "replies": []
        },
        {
            "author": "MyStationIsAbandoned",
            "body": "* Conan Exiles\n* 7 Days to Die\n* Minecraft\n* City of Heroes Thunderspy Server\n* Final Fantasy 14's endless Free Trial (I've been playing it for over a year now)\n* Dark and Darker\n* Dead Island 1 and 2 (open world zombies, you can play the whole game co-op)\n* Dying Light 1 and 2 (open world zombies with parkour, you can play the whole game co-op)\n* Monster Hunter Worlds and Wilds\n* Once Human\n* Vindictus\n* Warhammer Space Marine 2\n* Tony Hawk 1 and 2 Remake (not really coop per se, but you can all goof around and skate together)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TedBehr_",
            "body": "Raft is the quintessential relaxing survival game. Throw it on easy so you don’t lose gear when you die, and you can just float and build and float and build.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Heamsthornbeard",
            "body": "Vermintide 2 has been my go to lately",
            "score": 1,
            "replies": []
        },
        {
            "author": "Carnitopia-is-sad",
            "body": "No achievments, but a massive fleshed out game called Sky:Children of the Light is my fav to play w friends :) its a cute open world/mmo with a focus on the social aspect",
            "score": 1,
            "replies": []
        },
        {
            "author": "aunghtetnaing",
            "body": "recommend sea of thieves, The game is all about collecting cosmetic and fooling around with friends",
            "score": 1,
            "replies": []
        },
        {
            "author": "batarei4ka",
            "body": "The Binding of Isaac Rebirth, Terraria, Rimworld, Balatro",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Janekene_",
            "body": "Magicka \nTrinity\nNo man's Sky \nSeries of games called Dark Pictures (only it is not very relaxing..but story wise and gameplay is easy) \nNecrodancer (rhythm game) \nParty animals",
            "score": 1,
            "replies": []
        },
        {
            "author": "GalgamekAGreatLord",
            "body": "Minecraft",
            "score": 1,
            "replies": []
        },
        {
            "author": "silentflaw",
            "body": "Valheim, Enshrouded, Brotato, Castle Crashers, Core Keeper\n\nThose are just some of the ones that stood out as enjoyable with my fiance and kiddos. \n\nAlso just picked up Windblown, only played for a few hours but seems promising.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Simubaya",
            "body": "Weirdly, for me, 7 Days to Die is mostly relaxing. As long as you are careful, the game isn't too hard. I have Blood Moons every 30 days so I can explore and have fun killing wandering zombies. My friend and I play it together.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sealchoker",
            "body": "Relaxing... I would say Stardew Valley fits that bill nicely. But, I play it with my wife, it may be too relaxing unless you got a squad with a plan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Protectem",
            "body": "Zombie army 4. Dead war.\n\nYou're just killing zombies. It's pretty fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JawidKhan096",
            "body": "Echo Point Nova is the meaning of relaxing coop",
            "score": 1,
            "replies": []
        },
        {
            "author": "signofdacreator",
            "body": "i mean, if Payday is your cup of tea, then there are so many coop games that you can play.\n\n[https://store.steampowered.com/category/multiplayer\\_coop/](https://store.steampowered.com/category/multiplayer_coop/)\n\nunless you're like me you don't like first person games or pvp, then your choice is more limited\n\nhere are some suggestions\n\nLeft 4 Dead / Back for Blood  \nPortal 2  \nDeep Rock Galactic  \nGrounded  \nNo Man Sky  \nValheim  \nRarft  \nSea of Thieves  \nHalo  \nSons of Forest  \nReady or Not..",
            "score": 1,
            "replies": []
        },
        {
            "author": "99-STR",
            "body": "Divinity Original Sin 1 & 2, Baldurs Gate 3, Valheim, Enshrouded",
            "score": 1,
            "replies": []
        },
        {
            "author": "DamnedDoom",
            "body": "Stardew Valley",
            "score": 1,
            "replies": []
        },
        {
            "author": "vessel_for_the_soul",
            "body": "Abiotic Factor\n\nSpace Engineers\n\nDark and Darker\n\nPalworld\n\nBarony",
            "score": 1,
            "replies": []
        },
        {
            "author": "evestraw",
            "body": "plate up",
            "score": 1,
            "replies": []
        },
        {
            "author": "bones10145",
            "body": "Stardew Valley ",
            "score": 1,
            "replies": []
        },
        {
            "author": "-garu",
            "body": "my gf and i have been playing baldurs gate 3 lately and having a blast!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neridity",
            "body": "Have you considered Helldivers, there's even two of them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thomas5020",
            "body": "Astroneer",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valgaar",
            "body": "How about a classic? Portal 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "rsmseries",
            "body": "I still love Plate Up. It’s less stressful than Overcooked and more fun IMO. Way, way less yelling, lol.\n\nUp to 4 players online, on one screen, or a combination of both. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "OrphanageTorcher",
            "body": "Subnautica. A calm and relaxing underwater base building game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Schlaggatron",
            "body": "I know it’s really basic but Minecraft is amazing for this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "schrammelhammel",
            "body": "Lego. I can't loose, it's kinda funny. my daughter and I really enjoy those. dead cheap also.",
            "score": 1,
            "replies": []
        },
        {
            "author": "brunoji",
            "body": "Valheim",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nextflix",
            "body": "Stardewwwww Valleeeeyyyyyy",
            "score": 1,
            "replies": []
        },
        {
            "author": "apotatoperson",
            "body": "Dont starve together is relatively simple, but it is very interesting if you like survival games",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dear-Specialist-4201",
            "body": "Ready or Not.\n\nIt's not relaxing lmao but it's great.\n\nAlso Wobbly Life is very chill and somehow addicting\n\nAlso\num\n\n\nWarframe? That would be fun if y'all don't have a speed runner friend who kills all the enemies ahead of y'all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deebster2k",
            "body": "REPO is coming but I doubt will do what you are looking for with the hours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scared_Lack8939",
            "body": "dying light,  ready or not",
            "score": 1,
            "replies": []
        },
        {
            "author": "Super-Spot4791",
            "body": "Helldivers 2.\nOutriders.",
            "score": 1,
            "replies": []
        },
        {
            "author": "winkysteiner",
            "body": "Butt tickler 2 deluxe edition",
            "score": 1,
            "replies": []
        },
        {
            "author": "J3vyn",
            "body": "Terraria for sure. Simple graphics but really fun when playing with friends.",
            "score": 1,
            "replies": []
        },
        {
            "author": "carl-btw",
            "body": "i like playing chivalry 2 but our ideas of relaxing coop might be different",
            "score": -1,
            "replies": []
        }
    ]
}