{
    "title": "why is lethal company in my top left corner, it dosent do anything and dosent even act like its there, it just... bothers me",
    "author": "Snom_gamer0204",
    "subreddit": "Steam",
    "rank": 10,
    "score": 534,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 28,
    "url": "https://i.redd.it/sso3udt3dcpe1.png",
    "id": "1jds90m",
    "selftext": "",
    "comments": [
        {
            "author": "Charrison947",
            "body": "steam bug, it happens to me all the time.",
            "score": 403,
            "replies": [
                {
                    "author": "Painted-BIack-Roses",
                    "body": "The library bugs out so often for me, it's been happening for the past couple months :(",
                    "score": 83,
                    "replies": [
                        {
                            "author": "Rhinoseri0us",
                            "body": "Mine keeps bugging out too, I keep ending up with games being added at sales prices :(",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "DuhVirus",
                            "body": "The quarterly steam store bug is here.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Kossmikh",
                    "body": "Same here, almost every time I use Steam, I encounter with this bug. Sometimes I also see \"Loading\" pop up like that. (on the area where it says \"Steam\" at the top left corner.) I just close Steam completely and open it again to fix it.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "JNorJT",
            "body": "Did you remember to fulfill your quota?",
            "score": 70,
            "replies": [
                {
                    "author": "DeluxeGrande",
                    "body": "Asset great great asset asset, asset great great asset",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Master_Shake23",
            "body": "Is it the last game on your list? Those bug out sometimes for some reason.",
            "score": 32,
            "replies": []
        },
        {
            "author": "Present-Basil-1003",
            "body": "I have different FNaF games there. Firstly i thought Freddy possessed Steam now i see this is just a bug.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Wei5252",
            "body": "steam bug/glitch, what i do is hover over other games on the left then move my cursor away, which usually fixes it",
            "score": 5,
            "replies": []
        },
        {
            "author": "ScaR-x-FacE",
            "body": "Idk why this fixed it for me because this seems to be the only thing that's permanently stopped from happening again. \n\nAdjust the width of the games list to be wider. Possibly wider than any games you have installed (not sure if that's a part of it) but just make it a bit wider. I did that and it's stopped happening to me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdPretty7033",
            "body": "rotmg",
            "score": 2,
            "replies": []
        },
        {
            "author": "AwkwardAssociate4401",
            "body": "Visual bug, close Steam completely and re-open it",
            "score": 4,
            "replies": [
                {
                    "author": "Psychological_Tower1",
                    "body": "No just go back and hiver over the game again.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZeroMarkov",
            "body": "Naruto Storm Connections bugs for me like 9/10 times cause of its giant name that invades the games screen sometimes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nakina4",
            "body": "I've had this happen to me a lot.  Usually if you hover over the game itself in your library it makes it go away for a little bit.  At least it does for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tarrs92",
            "body": "Mine does this with 7 days",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExcellentCarpet8777",
            "body": "Sounds like a weird glitch. Restarting Steam might help. If not, try toggling the Library View, sometimes that refreshes things",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcroboticX",
            "body": "Deltarune chapter 3 and 4 release tomorrow I promise",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spankey_",
            "body": "Bug. Hover over Lethal Company in your library to fix it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "twofaced125",
            "body": "steam being a shitty client as usual #killelectron",
            "score": 1,
            "replies": []
        },
        {
            "author": "foxferreira64",
            "body": "Happened to me as well, and fixing it is as easy as closing Steam entirely and reopening. Should take seconds! Same fix works for whatever UI bugs you find. I once got a store page preview permanently stuck on my screen, and a restart of the client worked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jewsusgr8",
            "body": "It's just hovering there... \n\nMENACINGLY",
            "score": 1,
            "replies": []
        },
        {
            "author": "kosmogamer777",
            "body": "Same here but with halo mcc",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thansxas",
            "body": "rotmg spotted",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlucky_Tea2965",
            "body": "i had same thing happened\n\njust visual bullshito",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gorgon654",
            "body": "Call me a grumpy old bastard but it kinda annoys me we’ve got to the point where people post about stuff like this on Reddit rather than trying for just like 5 minutes to fix it themselves. It’s an easy fix but so many people don’t wanna think for themselves or try things nowadays. Instead they just post on Reddit, the other funny thing is they make their own post instead of even searching to see that like 50 other people have posted the same thing before them.\n\nIt’s developing laziness in people as a whole.",
            "score": -11,
            "replies": [
                {
                    "author": "twofaced125",
                    "body": "what fix exactly? it’s a client bug",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}