{
    "title": "Dog has become reactive over basement door",
    "author": "for_the_love_of_corn",
    "subreddit": "Dogtraining",
    "rank": 413,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i4d9rx/dog_has_become_reactive_over_basement_door/",
    "id": "1i4d9rx",
    "selftext": "Hi! My 1yo pitt mix, has become more reactive in recent months. Specifically about the basement door and my roommate. \n\nI live in the lower level den of a split level house, and the basement door is in my \"room\" so my roommates have to pass through to get to the laundry machines down there. My dog has started getting excited and barking and jumping when I even touch the door. \n\nMy roommate however only comes downstairs for the basement so as soon as he opens my door, my dog goes insane. He acts the same way as he acts towards the vaccuum, which is barking and nipping/biting at my roommates heels and jumping. Normally when its just me hes barking at i can command him to go to his bed and he usually will, but he becomes insane when my roommate goes downstairs. \n\nHOWEVER he only acts this way when im home. He doesnt make a peep when Im gone.\n\n Im afraid i have been doing all the wrong training methods and ruined him. Hes such a good boy, if not a bit wild but he is only 1. Ive started keeping his food in the basement and giving peanut butter whenever i go to the door and trying to do it more often than just when i do laundry. \n\n  \nI dont want him to get to the point that he cant be around visitors, even though im not able to have visitors in my current house due to another dog that is reactive towards new people (my dog does not interact with this dog).\n\n  \nPlease, if any body has any advice. Im searching around for reactive dog training but I want to still do what I can and all methods ive found online seem to be making things worse.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "for_the_love_of_corn",
                    "body": "I have tried making a safe space for him which is his bed, and in those moments of high stress I try to instruct him to go to his bed. I know my patience gets short and I do my best not to get loud but that is not always the case when he is barking. I try to do treats when he remains sitting and quiet by the basement door but he sometimes associates the treats with the basement and starts barking if i touch the bag.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "The gold standard in trainers are Veterinary Behaviorists who are board certified by the ACVB or CAAB. You can use [this link](https://www.dacvb.org/search/custom.asp?id=4709) you might have to use 500 miles as your search criteria), then request an online consult if they are not near.  Sometimes one session is sufficient. They are amazing (life changing) but they are expensive and there are few.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unique-Public-8594",
            "body": "> “A 1 year old pit bull that is barking, nipping, biting, and jumping.”\n\nSounds like it could be resource guarding (guarding you)?\n\nMaybe try the same process as seen [here](https://m.youtube.com/watch?v=tdFK5rGbjJ0)?  On leash.  Rewards for calmer behavior?",
            "score": 1,
            "replies": []
        }
    ]
}