{
    "title": "Potty trained at one home, but not the other ",
    "author": "DeadButGay",
    "subreddit": "Dogtraining",
    "rank": 407,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i4ojtr/potty_trained_at_one_home_but_not_the_other/",
    "id": "1i4ojtr",
    "selftext": "I adopted a 4 month old Malinois mix and she’s picking up on basic training well. She also seems to have potty training down pretty well at my partner’s place (house with fenced backyard); we go out frequently, she goes to the grass and pees/ poops, we celebrate, we go inside. However, at my place (an apartment with landscaping and some grassy areas) she’s struggling to make the connection. \n\nI take her out quite often, go to the grassy areas, and walk her around on the leash for quite a while sniffing. There are a couple spots she has peed or pooped, and I take her to those spots to see if that will prompt her. I have left a rag with her pee on it in one spot, and have left some of her poop in another spot (sorry neighbors!). She also finds other dogs’ poop but that doesn’t prompt her either. It seems like she’s not sure why we’re out there, and will come inside only to pee/poop on the floor a little while later. Whenever it happens I take her outside right away, and clean up all messes thoroughly with an enzymatic cleaner to eliminate the smell.\n\nI have a crate coming in a couple days, and will start crate training at that point but until then I’m not sure what to do. Just stick with it? She gets it at my partner’s place, so I’m hoping she’ll make the connection here soon as well. Just want to make sure I’m not missing something! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "DeadButGay",
                    "body": "Hello! I have listed in the post which things I have tried, and one that I plan on trying in the near future. I appreciate your help!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "I think the crate will help. \n\n(Sounds intense but Some people tether a dog they are house training.)",
            "score": 2,
            "replies": [
                {
                    "author": "DeadButGay",
                    "body": "Thank you! I actually had her tethered to me for the first couple days and still do some of the time as we’re working on leaving the cats alone. Perhaps I need to tether her to me all day again while we get potty training sorted out.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}