{
    "title": "Dogs and training for food ",
    "author": "pettythief5",
    "subreddit": "Dogtraining",
    "rank": 402,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i4uras/dogs_and_training_for_food/",
    "id": "1i4uras",
    "selftext": "My dog is a 16 month old jack russell, generally a very loving playful dog but sometimes when it comes to food not so much. \n\n\nI moved in with my partner when she was around 6 months old (my dog) and my partner has 14 month old toy caboodle. They each eat at the same time with bowls on the ground no problem. Sometimes swap mid way through meals.\n\nNow sometimes if I give them something from hand like something off my plate or even when we are just eating our own food. Sometimes treats. She gets very defensive and will go to pretty much attack my partners dog. \n\nLooking for an effective way to train this behaviour out of her? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "pettythief5",
                    "body": "I haven’t found what I need, I’m looking for advice for my dog to be nicer with treats when with another dog.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rebcart",
                    "body": "Which parts of the wiki page on resource guarding have you already implemented? (The links at the bottom give dog-dog protocols)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pettythief5",
                    "body": "I have tried most but they don’t correspond to what I need as it’s not to do with me taking food but behaviour toward another dog",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}