{
    "title": "How can I get our pup to be calm at the door before we let him outside? ",
    "author": "Nearby-Sorbet-769",
    "subreddit": "Dogtraining",
    "rank": 397,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i536iv/how_can_i_get_our_pup_to_be_calm_at_the_door/",
    "id": "1i536iv",
    "selftext": "We have a pretty crazy little dude (Dalmatian/border collie mix, about 4.5 years old) who has very little impulse control and very big feelings, and he’s not afraid to show them. Whenever I go to the back door (or even in the same room as the back door), he does the classic spin/bark bark bark/jump on door/bark bark bark. \n\nI’ve tried practicing the “chill out, my dude” method by walking to the back door, then calming saying “no” and walking out when he goes bonkers. This hasn’t really lead to any changes; he just barks and follows me back in and repeats the process when I walk back to the door.\n\nI suspect this ain’t just related to the door, as he tends to do this type of things when she interprets anything as a cue to play or be active. I get up out of my office chair to pee? BARK BARK BARK JUMP SPIN BARK! I walk to the front door? BARK BARK BARK JUMP SPIN BARK! I enter the room with his crate where he gets fed even remotely near his lunchtime? BARK. Bark. b a r k.\n\nSo I think we just need to teach him calming cues. He’s capable of relaxing and happily will do so, but any shift from stillness to movement gets him amped up.\n\n*The tricky part is that we are a two dog household.* Our older dog (Momo) is a horrible demon shit goblin and will get overstimulated when I have this younger dog (Beetle) in an enclosed room away from her via barrier frustration. We absolutely can’t train them in the same room because they’ll fight over treats.\n\nWhat types of techniques can I try to help shape calmness/impulse and emotional control in Beetle? He’s clearly getting over aroused, but I don’t know how to mitigate that!\n\nThanks, y’all!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Nearby-Sorbet-769",
                    "body": "I have used several resources from various trainers online to try to address this issue, as mentioned in the post. There are a few TikToks from positive reinforcement trainers that I’ve tried for impulse control, but our Beetle bug boy doesn’t really respond well to them. \n\nWe’ve tried the “look at me” game where I hold a treat and give it with a YES! when he makes eye contact with me as a reward for calmness and communication and focus on me\n\nWe’ve tried practicing getting near the door/leaving  my chair/etc and then rewarding with play once he’s calm  (in fact, as I typed this, I sat up and he popped up with me and did a slow spin, and I sat back down. He laid down and is still at attention to the back door, but is calmer now. I stood back up when he calmed down, approached the door, and he did the bark/spin/jump.)\n\nWe also took him and our other dog to a trainer about a year ago, but about 1/3 of the way through training, the trainer insisted on e collars, so we left and haven’t looked back. What a waste.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}