{
    "title": "Help training a puppy to be more social? ",
    "author": "None",
    "subreddit": "Dogtraining",
    "rank": 379,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i5vq3p/help_training_a_puppy_to_be_more_social/",
    "id": "1i5vq3p",
    "selftext": "We rescued a puppy from a hoarder house a few months ago. She was 6 months old at the time and the first 5 months of her life she was locked in a basement with 40+ other dogs and no real human interaction. We’ve been trying really hard to socialize her w our friends and family and she’s gotten a lot better but still pretty skittish and barks and growls a lot initially (she’s a GSP, lab, mastiff, cane corso mix so she’s 8 months but a solid 70 pounds with a scary bark lol). She loves her dog brother but she’s pretty skittish with new dogs and will nip at them. We’re trying to expose her young but does anyone have any tips to help this? I would love to have her dock dive and be a hunting dog but I know she needs other work first. \nI’m experienced with obedience and hunting training and she’s very smart and picking up commands quickly. Socializing a scared dog with trauma is somewhat new to me so any help would be appreciated! TIA ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "I have found that puppy socializing is best as slow introduction and allowing them to watch with treats and slowly integrate them with patience. I am still wondering people’s opinions/advice on how to handle certain situations with a dog w trauma as my dog came from a terrible hoarder situation and spent the first 5 months of her life with no interaction with anybody, and didn’t start her “normal life” until she was 6 months old",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}