{
    "title": "Dog refuses midday and evening walks",
    "author": "Hubis77",
    "subreddit": "Dogtraining",
    "rank": 360,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i6rmci/dog_refuses_midday_and_evening_walks/",
    "id": "1i6rmci",
    "selftext": "Hi\n\nmy dog is 6ish and adopted 4months ago. At first he was eager to go for a walk anytime we wanted, but right now he is really hesitant to go in the afternoon and in the evening. Outside he’s unresponsive and often stops Mid walk.  In the morning he’s completely fine and goes without any hesitation. Problem started after fireworks on New Years Eve. We’ve tried to reward leaving the house and random reward when he walks well but with no effect. There aren’t any apparent triggers that would stress him during walks. Medically he's checked out and started antianxiety drugs 2 weeks ago with slight improvement. I’m hoping for some advice",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Hubis77",
                    "body": "we've been to the vet, we're patient and don't force him to go when he's scared and we're trying to do positive reinforcement of walks",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}