{
    "title": "Dogs not getting along",
    "author": "Ready-Educator6652",
    "subreddit": "Dogtraining",
    "rank": 350,
    "score": 8,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i6vl80/dogs_not_getting_along/",
    "id": "1i6vl80",
    "selftext": "My girlfriend and I moved in together at the end of November. She has a 4 year old female pit/vizsla and I have a 4 year old male lab/pyrenees/etc. They moved in because my girlfriend’s landlord was selling the house. My apartment is pretty small, so we’re just riding out my lease and planning to get a bigger place together. \n\nHowever, our dogs ain’t having it. My dog, who previously was very calm and sweet, goes after his new sister periodically. There’s not necessarily anything that leads up to it. Certain times, my girlfriends or I might play with her a little “actively” and he perceives it as cause for concern. I believe his behavior to be mostly resource guarding, as my girlfriend’s dog is pretty high energy. \n\nMy question is, where do I go from here? Medicating for anxiety? Maybe, but I’m not crazy about turning my dog into a vegetable. Behaviorist? Probably smart, but a large investment from what I’ve read. I don’t need them to be best friends in the world, but I do need them to stop fighting. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Ready-Educator6652",
                    "body": "My dog was taken to the vet, it was deemed behavioral and the option to Medicate was given",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RLaminin",
            "body": "Best bet would be to get a trainer to your house. They can see a bit clearer of a picture and would be able to give you a good starting point.",
            "score": 14,
            "replies": []
        },
        {
            "author": "thepumagirl",
            "body": "Medicating wont turn your dog into a vegetable. The idea is to bring their stress/anxiety down while they learn new behaviours. So it goes hand in hand with training. I just had my 4year old rescue on meds as she does not like the puppy we got in spring. She was getting better adjusted but we put her on meds for a few months to help her learn and adapt to the new situation with less stress. But it wasn’t just meds- i also had to teach her and manage the dog’s routines. That being said meds might not be what is needed. More seperation of the dogs and calm controlled interactions (starting small and slowly increasing time as). Resource guarding has nothing to do with a dogs energy levels- here is a great write up if you want to learn more about it;https://dogmantics.com/resource-guarding-protocol/",
            "score": 9,
            "replies": []
        },
        {
            "author": "Logical-Variation-76",
            "body": "Medicating for anxiety doesn’t turn your dog into a vegetable. If you were giving them gabapentin, then maybe but not Prozac or something of that sort.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Directly-Bent-2009",
            "body": "Breed wise the high energy/nervous undertone nature of a vizla and the livestock guardian nature of a Pyrenees will need boundaries and training together in a neutral area to be able to mesh better. Although it is an investment, getting a trainer who understands both breeds behaviors will help a lot. Yes, a behavioral trainer will be more expensive, but you won't need more than a few sessions once you understand the protocols you'll need and if you both do your \"homework.\" The sooner you address the issues the better, so they don't create negative habits with one another in the new environment. Walking them together outside is a great place to start and allowing them their own space where possible in the apartment until you can get someone there to help.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub's wiki article on [dominance](https://old.reddit.com/r/dogtraining/wiki/dominance).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "flynk-9",
            "body": "I'd keep them separate except for sessions where one or both are on leash and you can work on just existing together and what the rules are. Examples - I teach my dogs they can't steal the others' food. If I'm petting or interacting with one, another can't come shove her way in PET ME. I work on taking treats from me one at a time by name. Some dogs don't understand other's body language and you have to explain that if your friend is turning her head away and rolling her eye at you, stop what you are doing. If there's a growl or lip lift, leave the personal space of the other dog immediately. Some dogs need to be taught what's an appropriate correction. \nAlso, if you watch closely, your dog's body language may give you clues that he's about to go after the other dog. Intense stare, dropped shoulders, tense body, for example. \nCalling in a trainer is a great idea as well. This stuff can escalate very quickly. Don't let them practice behaviors you don't wish to have long term.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tazmaa2018",
            "body": "It sounds like he is uncomfortable with that high energy play, some dogs are like this. Try to refrain from amping up the female dog inside the house, save play for outside only.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UniqueFox6199",
            "body": "Maybe don’t engage in play while they are both in the same room, while they are still getting to know each other. Take the dogs out separately to walk or play outside so they have their own space and individual needs are met.\n\nMake their food and water separate. Keep the home calm since play seems to be a trigger. Just until you get a new space, which will be new to both the dogs. And hopefully larger so there is more space to share.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules) and [guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), as well as our wiki pages on [punishment](https://old.reddit.com/r/Dogtraining/wiki/punishmentproblems) and [correction collars](https://old.reddit.com/r/Dogtraining/wiki/prongandecollars).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImportantBiscotti112",
            "body": "How long has it been? In my experience the first week is the absolute worst. \nI wouldn’t even let them come in contact the first week except for taking them on walks together.",
            "score": 1,
            "replies": []
        }
    ]
}