{
    "title": "1 year old dog is destructive when unsupervised + crate-related separation anxiety",
    "author": "astrostruck0",
    "subreddit": "Dogtraining",
    "rank": 349,
    "score": 9,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 29,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i6ydpw/1_year_old_dog_is_destructive_when_unsupervised/",
    "id": "1i6ydpw",
    "selftext": "My boyfriend and I rescued a pyrenees-pit mix 3 months ago, who is currently \\~ 1 year old. We both work full time. He was supposedly crate trained (according to his foster), but it turns how he is crate trained if we are home. If we left, he would escape the crate. We tried starting over, but it ended up that he would bend the wires on the crate and broke a couple welds. Once he broke out he was not destructive outside of his crate, so we gave up on crate training for a little while.\n\n  \nNow he has become destructive. He chewed up shoes (we then started dog-proofing things on the floor), a couch, pillows, a coat on a coat rack, and a book that was on a shelf. One day, he pulled everything off the counter in the kitchen and chewed it up, so we purchased a baby-gate to confine him to one room. Today, he knocked down the baby-gate and chewed up a pair of motorcycle gloves that were on the counter (but none of the food).\n\nWe purchased an Impact Crate, I took a week off work, and we re-started crate training. He will sleep in it during the day sometimes and eats in it/hangs out in it fine with the door closed. During the week of crate training, sometimes he was fine and I could be gone 30 minutes without a problem and other times, he scraped up his nose trying to nose his way out of the crate and I would come home to a torn up dog bed. We have a baby camera, but it is hard to watch him every minute of every day when we are not in the house.\n\nWe do training or puzzle games with him every day, plus he gets 2-3 45 minute walks per day (we have a dog walker every other day that we are at work). We are in a group training class 1x per week. He has access to several toys, and several types of toys all the time. We tried doggy-daycare but he started getting over-excited with other dogs and showing leash reactivity, so we have to put a pin in that for a little while while we teach him to be dog-neutral. We live in a one bed one bath home with a small backyard. We cannot leave him in the backyard because he will dig and eat our landlords plants. My boyfriend and I are not sure what else we can do. He doesn't show any of these behaviors when we are home, and it isn't every day he is destructive, but there is no pattern.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "The wiki suggests providing stimulation, and I tried that by providing puzzles, training, and long walks every day. It suggests trying to leave him somewhere comfortable, he was not comfortable in his crate so we let him loose in the house. We have also been training independence. \n\nI need help with a way to stop his destructive behavior as crating (a commonly referred method for destructive dogs) is not working due to separation anxiety that appears only when crated.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lizdance40",
            "body": "So you mention a lot of destruction, but you aren't mentioning anything about soiling in the house while you're gone? Usually dogs with separation anxiety are having a true panic attack.   They pee and poop all over the place almost as soon as they realize they're alone. They'll also try to claw or chew their way out Whichever door you left by.  So it does seem like separation anxiety. \n\nIt seems to me it's a high energy dog that needs a job and does not have one.  Great! Pyrenees are livestock guardians. Pitbulls are not, but they can be very high energy.    \n\nJust my opinion, and I'm not saying you can't work it out, but the amount of energy this dog has maybe a mismatch for your lifestyle.  I wouldn't recommend people who work all day get a high energy Springer spaniel or German shorthaired pointer either.   Your lifestyle would probably be more suited to a dog who's willing to be a couch potato for 8 to 10 hours a day, 5 days a week.",
            "score": 10,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "No soiling luckily! It seems like it may be some mild separation anxiety, but it does not seem consistent. It occurs \\~once a week. I'm not sure if its true separation anxiety or just his young age.\n\nWe adopted him as he was listed as a lab mix (and looks like one), so we were surprised when he came back only about \\~10% lab haha. I am hoping we can work it out and I can find something to substitute - I've done some research and it seems that many pyrs can be fine patrolling/watching what they consider to be their home. The pit part is a little tricky and I do think that's where his energy comes in.\n\nWe are trying to make sure he gets enough exercise. I do think we are going to move to an area and a house where we will have more room for him in the next year or so. He loves his obedience training and we are making great progress on excitability with other dogs. I am reaching out hoping to try something new, or see if anyone has ideas, before we throw in the towel. :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Lizdance40",
                            "body": "Lol.  I think everything is listed as a lab mix these days. \n\n Once a week isn't the worst.  But still too much.  Is there any consistency to when in the week this happens? Like always on a Monday?   If she doesn't give enough exercise before you leave for work?   On a day that the dog walker doesn't come?  \n\nShe has a ways to go for maturity to kick in.  But it's sad if she's self-injuring.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "astrostruck0",
                                    "body": "Yeah, I think so too. There is not any consistency to when it happens that I've picked up on - sometimes on walking days, some days that we haven't been working but jaunted to the grocery store, some days that we have been working. Sometimes it only takes 15 minutes for him to become destructive, sometimes it will take over an hour.\n\nWe always walk for \\~45 minutes, puzzle/train before work, and rotate toys before work, so it doesn't seem tied to our before work routine.\n\nI am hopeful it is something that will simmer down with age, ideally in the next year, but I don't really think this is typical puppy behavior.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Lizdance40",
                                            "body": "Well it sounds like you're knowledgeable owners, and it seems like you're also putting a lot of time effort and attention in. Have you talked to your trainer or behaviorist about some relaxation and  Independence training? \n It's not unusual for puppies not to know how to entertain themselves. And because you're putting so much time into enrichment and exercise, maybe the puppy has not quite developed the ability to relax unless he is being worked?  \n   I'm just spitballing ideas. The amazing thing is a year from now, doggy will grow out of a lot of the adolescent nonsense. And 15 years from now when you're getting a new puppy you will have forgotten how much freaking work they are (hahaha). (Something I remind myself of on a regular basis every time I think about getting another dog)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "phantomsoul11",
                    "body": "Dogs don't always soil from separation anxiety (SA) attacks. For one thing, they might not need to go. Watch closely on camera how your dog behaves in your absence.\n\nSA panic is very determined, desperate behavior. When watching it on camera, you'll see that.\n\nA boredom rampage is much more random, in which the dog will be showing a mood that is more curious than anything else. He might tear at fabric, for example, because the experience is remarkably similar to tearing at flesh, which is how all canines (including your dog, instinctively) feed in the wild.\n\nDid you try leaving a high-value, long-lasting treat for your dog while you step out (and watch him on camera, of course)? A dog merely prone to boredom rampage will engage the treat the same way he would in your presence. A dog suffering from SA, however, will engage the treat markedly less than he would in your presence, if at all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "strange-quark-nebula",
            "body": "Some dogs unfortunately cannot be crated. My dog is like this. He becomes wildly anxious and destroys anything he can touch from the crate. It would take heavy medication to make him crateable, and even then he was losing weight and not thriving. We no longer crate him except in emergencies or rare occasions, and never longer than 4 hrs. He also can’t be unattended in the house. We rely on doggy daycare and a work from home rotation. \n\nIt doesn’t mean you won’t find a solution for your dog, but it’s the case that not every dog is suited for every life situation. It may not be anything you’re doing wrong, he just might not be crateable for many hours a day. Young working dogs like this one are probably the least crate tolerant.",
            "score": 6,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "That is fair, and kinda what we were feeling and why we moved away from continuing crate training in the first place. Thank you for sharing your experience! I am the only one that can work from home (bf is blue collar), and I cannot swing it every day or every week at the company I am currently at. Perhaps we need to try to revisit doggy daycare for him until our schedules are offset enough or otherwise I can work from home more often...",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Responsible-Stock-12",
                            "body": "Are there any trainers near you that do small daycare? Regular daycare can cause reactivity and behavioral issues like the ones you saw after he went. We go to a day school that is run by certified R+ trainers. There’s some small group play, 1:1 training sessions, nosework, etc. Free For All daycare styles can be really damaging",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hilldawg17",
            "body": "Be Right Back by Julie Naismith is a great book for separation anxiety.",
            "score": 3,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "Thank you for the rec! I will look into it more. :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Responsible-Stock-12",
            "body": "I highly recommend reaching out to a certified R+ trainer, KPA is a really good program and they have a directory online. I fostered puppy mill releases with similar issues and it took a lot of creative thinking.",
            "score": 3,
            "replies": []
        },
        {
            "author": "pr3tty-kitty",
            "body": "Your dog sounds bored. Separation anxiety is not intermittent, it's constant and gets better over time. There's can be periods of regression but it doesnt just come and go",
            "score": 3,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "That is good to know! Perhaps it is more boredom, as other commenters have mentioned. :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "phantomsoul11",
            "body": "Separation anxiety is marked by near-continuous panic behavior but only in your absence. High-pitched barking, whining, excessive drooling - the kind you slip on when you get back home, sometimes voiding, but not always, even though otherwise successfully house trained, lots of frantic pacing, mainly between things that smell like you and the barrier he saw you leave through - both may take on damage and/or the dog can suffer injury as he attempts to defeat the barrier in his panic despair to rejoin you. \n\nThis behavior does not improve on its own. The dog may eventually stop panicking, but don’t mistake that for contentment. Rather, the dog has resigned to learned helplessness and may become depressed from it. This can impede on other training you want to do with your dog because he won’t be able to focus over constant worry of being left behind. \n\nYou have to address this with desensitization and maybe drugs if your dog limits out at an amount of time from desensitization alone that is too short - say mere minutes. If you don’t know how to go about this, you need to engage a veterinary behaviorist for help (not to be confused with an obedience trainer). In the meantime, the fear must be managed by always leaving the dog with a sitter or boarding/day-care anytime you go somewhere you can’t take him with you.\n\nThis is a serious quality of life issue for both you and your dog. The humane thing to do is address it correctly. Or the hard truth is, if you don’t have the resources for it, you should consider rehiring the dog to someone who does.",
            "score": 3,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "Thank you for sharing! We discussed what we were seeing early on with our vet (as he broke out of the crate and was painfully doing so) and the differences we see when he is not in a crate. Between your information and pr3tty-kitty, it sounds like maybe he isn't exhibiting true separation anxiety. He does not soil the house, excessively drool, or pace constantly. He sleeps most of the day when we are gone, with intermittent destruction, which does not sound like a full-blown panic attack.\n\nThe crate is a separate issue, but from the feedback I've gotten, it sounds like amping up his activities and/or slowly reintroducing cratework may be the best path forward. I am meeting with an individual doggy daycare with optional training program to see if we can integrate this into the mix and give him a little more stimulation some days during the week.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "phantomsoul11",
                            "body": "If he's just bored, you may see him nap for a while and then calmly go \"exploring\" - which is when random things might start getting chewed up.\n\nIf you leave him with some of his favorite toys, does he ever play with them when you're gone? If yes, then you might have a dog who is bored and looking for something to do. However, a dog panicking from separation anxiety will not show any interest in his favorite toys nor his favorite treats in your absence, Instead, he'll only focus on anything and everything it might take to immediately reunite with you.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Opposite-Ad3069",
            "body": "I am raising a lab (for a service dog org). He was way more destructive. Ate tons of books etc. it has taken time but he has calmed down. Your baby will probably also calm down. Try kongs with frozen peanut butter, snoops, quizles. All really good toys that take them a while to eat (the treat inside). I don’t see what your dog is doing as anything unusual.",
            "score": 2,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "This is great to know! Thank you for sharing your experience :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WittyNomenclature",
            "body": "Is the dog fixed? Hormones and brain development go kinda wacko at that age. It’s the crazy teenage time. You definitely want to talk with an experienced behaviorist, not just someone who teaches puppy kindergarten at the local store.",
            "score": 2,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "He is fixed! Good to know that a big part of it is age.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "greenebean18",
            "body": "Our pup had issues being in the crate while we’re home and/or being put in his kennel during the day. Our trainer suggested higher value treats that he only gets under certain circumstances, like when you’re about to leave the house. Maybe when you leave and when you get home would be helpful. But these need to be different rewards than what you give him for going in the crate while you’re home with him or if he sleeps in his crate.\n\nWe’ve used mozzarella balls or small pieces of chicken or hot dog. Start with leaving the house for shorter periods of time to establish the association with behaving inside of his crate if you can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Physical_Cod_8329",
            "body": "Do you cover the crate? My dog can’t stand to be in her crate unless I put a blanket over it, then she falls right asleep. \n\nI do think he needs more mental stimulation as others have said. Maybe add a training session on to your normal routine to help tire him out more. Even just doing a solid round of fetch and having him run around the yard a bunch can help tire him out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot_Boss_3880",
            "body": "I mean, it's really not appropriate to 1) mix those breeds and 2) keep them as indoor dogs. Great Pyr are known for wandering incredibly great distances every day, miles and miles, and when they are working dogs, they typically will not come indoors at all and prefer to be outside even at night. They are LGDs. Pits are high energy so unless this dog is going to have some freedom, it's gonna be a bad time for you trying to tame that spirit into a lazy indoor \"apartment dog\". Plus, large LGDs tend to have a longer puppyhood than some. He's still very much a puppy.",
            "score": 1,
            "replies": [
                {
                    "author": "astrostruck0",
                    "body": "As I mentioned, he is adopted and we did not know his genetic makeup ahead of time, nor did we breed him. I am hoping and trying to still give him a good quality of life.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}