{
    "title": "Dog immediately drops toy",
    "author": "oscarbelle",
    "subreddit": "Dogtraining",
    "rank": 351,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i6zuit/dog_immediately_drops_toy/",
    "id": "1i6zuit",
    "selftext": "I'm attempting to teach my dog \"fetch\" via backchaining. I've successfully used clicker training to get him to take a toy in my hand when given the \"take\" command, which is excellent. My problem is that he doesn't hold it, he just drops it immediately, no pause. I'm stumped on a process for teaching him to hold on to a toy until told to drop it. Thoughts?\n\nPossibly relevant information: hound mix, one or two years old, not motivated by toys as far as I can tell (he doesn't have a favorite, or indeed display any interest in a given toy or toys after having them for a day or so). Not interested in chasing thrown objects. Does like treats.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "oscarbelle",
                    "body": "Your resources on Fetch do not include information on immediately dropping toys. That was an interesting donkey video, though. I'm specifically trying to get him to hold a toy and *then and only then* drop it on command. I keep my hands on the toy, he lets go immediately. If I let go of the toy, he drops it before I give the command to drop. I've been using behavioral shaping and clicker training so far,  and I'd like any thoughts on a more detailed approach or sequence. Thank you. Cool wiki.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fehnder",
            "body": "When he takes the toy, wait 2 seconds before clicking and rewarding. If he drops it immediately, don't click or reward, just pick it up and have him \"take\" again. You're showing him that you've upped the ante and he needs to work out how to get the reward now that the criteria has changed.\n\n  \nIt's important when starting this that you make the duration really really small, like 2 seconds is absolutely enough, then when that's consistent, start increasing the duration.\n\n  \nYou could also keep hold of the toy, might be worth looking at videos on people training an igp retrieve or similar. They often backchain in a smilar way.",
            "score": 1,
            "replies": []
        }
    ]
}