{
    "title": "Dog only barks when partner isn’t home",
    "author": "1008261",
    "subreddit": "Dogtraining",
    "rank": 352,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i71jav/dog_only_barks_when_partner_isnt_home/",
    "id": "1i71jav",
    "selftext": "I have a 1 y/o standard goldendoodle. For a puppy, I’m actually very proud of how good his behavior is. He’s a really sweet and well behaved boy! I (25f) and my boyfriend (28m) live together. When my boyfriend is here, all is well. Our doodle doesn’t really bark at anything. Maybe occasionally, but nothing out of the norm. When I am home alone, my doodle is barking incessantly at everything. We live in an apartment complex so any time he hears someone in the hallway, keys jingle, a door open, he is barking like crazy. He stares out the window and barks at all the people getting out of their cars. A barking episode probably occurs every 15 minutes. I have also noticed this is more common at night and not during the day. I work from home during the day and he is peacefully sleeping, but in the evening he seems much more on guard. Is this a thing? It could be that there’s just more foot traffic in the evening. \n\nI assume he feels the need to protect me more since my boyfriend isn’t home. Once my boyfriend comes home, he doesn’t bark at everything outside anymore. It’s not that my boyfriend commands him not to bark, he just doesn’t even do it in the first place when he’s home. He is no longer staring out the window barking at people. While I appreciate this gesture, and I do think dogs are the best deterrent to crime and he makes me feel safe, his barking episodes are too frequent and I am getting headaches. How do I reduce this or train him out of this? I don’t even know how I would approach this! \n\nAlso, my neighbors thankfully don’t hear him. We are in a high rise so we have concrete in-between units. I can’t hear my neighbors and they can’t hear us, we did check in with them and asked if they could hear his barking, to which they said no. You can just hear movement in the hallway. So it only annoys me, thankfully! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "1008261",
                    "body": "I have read the module on barking such as out of fear & reactivity, as well as separation anxiety. Those don’t apply to my situation since it is owner dependent and seems more like protection",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "> “a really sweet and well behaved boy!”\n\nGreat!\n\n> “barking (someone in the hall, keys, a door opening, activity out the window) - my neighbors thankfully don’t hear him.”\n\nAmazing that your place is sound proofed so well!  Have you tried dog TV or d wave music or diffusers?\n\n> “more common at night, during the day and he is peacefully sleeping”\n\nJust wondering:  maybe if he had more exercise, training, sniffing, licking during the day he might sleep more at night?  \n\nSome people count out 10-20 treats a day/night to reward calmness as a way of communicating, this is what I want more of.  \n\nSome people put “frosting” on the glass window at dog level (temporary stick-on film) to reduce stimulation (or close curtains/shades).\n\n> “I assume he feels the need to protect me more since my boyfriend isn’t home. I do think dogs are the best deterrent to crime and he makes me feel safe”\n\nNot saying he can read your mind but maybe he senses this?\n\n[more ideas](https://www.reddit.com/r/Dogtraining/comments/12w9wnd/comment/jhe8zq3/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)",
            "score": 1,
            "replies": []
        }
    ]
}