{
    "title": "My Dog Resource Guides Me",
    "author": "honeybunchezofGoob",
    "subreddit": "Dogtraining",
    "rank": 334,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i7ro81/my_dog_resource_guides_me/",
    "id": "1i7ro81",
    "selftext": "Hi everyone! I recently adopted a 5yo French Bulldog. She's a total snuggle bug and lover, but she's a former mill mama and doesn't like to share me with my cat.\n\nMy cat is doing better with her than he ever has done with a dog, but when the cat tries to jump on my lap or snuggle, she will either growl at the cat or try to snap at him.\n\nHow can I help her so she doesn't feel like she needs to resource guard me? I want to be able to snuggle my cat without drama. \n\n  \nThanks in advance!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "honeybunchezofGoob",
                    "body": "I have read the guides and the trade up technique and the steps for ending guarding focus on food or an object being guarded. I’m not sure how to respond when my dog guards me from my cat. \n\nVet has ruled out pain. She’s already been spayed, had her nasal passages opened and the cleft procedure. She’s a frenchie. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Comparisons",
            "body": "Remember the basics - rewarding good behaviour even if that good behaviour is silence and calm. \n\n1. Set up a comfy place for your dog to lie near-ish where you sit - eg a comfy corner 2m away. Do this without your cat in the room. Ask your dog to go lie down there. Click and reward. Keep rewarding by throwing a treat in there every so often and telling him he’s doing good. When he’s consistently lying down, relaxed - might take a few days - move onto step 2\n\n2. Get your dog sitting happily in his happy corner. Introduce the cat slowly. Ideally a friend would come into the room holding the cat, but not sit close to you. Be super good at rewarding the dog sitting calmly. He may get up. Try again, or end the session and try again later, or work more on step 1. (if he’s very reactive, you’ll need to work lots on step 1 before introducing cat. And go very slowly. In an extreme case, if he really goes mad on seeing the cat, you could try excluding him for 1min (taking him to another room) when he goes mad but that is rarely necessary)\n\n3. Gradually move the cat closer to you. So maybe your friend would sit closer to you. Always keep rewarding dog. Rinse and repeat. Until the friend is giving you the cat but your rewarding and praising doggo lots.\n\nEventually doggo will learn that it’s great to sit in his comfy corner watching you with the cat because then he gets tasty treats.\n\nGeneral tips \n- make sure you’re using treats he really likes \n- try when he’s had a good walk and is more relaxed \n- make sure he’s getting lots of affection generally",
            "score": 3,
            "replies": [
                {
                    "author": "honeybunchezofGoob",
                    "body": "Thank you. She's just such a velcro dog and always next to me. But these are great steps and I'll give it a try!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "honeybunchezofGoob",
            "body": "Oops! Meant to say GUARDS me.",
            "score": 1,
            "replies": []
        }
    ]
}