{
    "title": "help my dog won’t stop peeing in the house.",
    "author": "Cheekyxrose",
    "subreddit": "Dogtraining",
    "rank": 319,
    "score": 25,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i7y271/help_my_dog_wont_stop_peeing_in_the_house/",
    "id": "1i7y271",
    "selftext": "I’ve had my dog for 3 years and I can’t get him to stop going potty in the house. \n\nA little back story. We got him from a home that was very neglectful. The owner kept him kenneled 24/7 and was never home. She did not make time to go home and walk him so the dog would sometimes spend days in a kennel not being let out. He would piss and poop in the kennel. \n\nThe first thing we tried, since the problem was him going to the bathroom when we weren’t home,was kenneling him. \nI have never seen a dog freak out more in my life. I spent months trying to retrain him in the kennel with zero improvement. \nI’ve tried Positive reinforcement, pairing the word potty with outside, rewarding every time he goes outside. \nWe tried more frequent walks, longer walks, more mental stimulation. \nwhen we had the schedule for it we had routine times. NOTHING has worked. \n\nNow hes peeing while we are asleep. \nHe will tell me when he needs to go when i’m awake (something i’ve also rewarded) \n\nI feel like i’m living in piss. \n\nwe’ve been to the vet to rule out physical problems, We’ve also tried medication for separation anxiety. \n\nHe has specific spots he likes to pee on. \nwhich i clean every time with an enzyme cleaner \n\nIm at my wits end. please help. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Cheekyxrose",
                    "body": "I have ruled out medical issues and separation anxiety.  I have tried multiple forms of positive reinforcement, potty training from the basics, kennel training, deep cleaning with enzyme cleaner, longer more frequent walks. scheduled walks. sprays that are supposed to deter a dog from going to the bathroom in that spot.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "the_last_part",
                    "body": "I had a similar thing with one of my rescues. Just simply couldn't train her to go outside.\nI ended up getting a big shallow tub and moved some grass into it. Put it inside in the spot she was going to the toilet and  day by day would move it slightly closer to the back door. \nAfter a while of reinforcing that's her place for her business I moved it outside by the door. It worked. I had to leave the tray out there for a while, but now she knows the outside grass is the toilet.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sootspiritgarden",
                    "body": "Maybe try using a dog diaper at night? He may not like it being wet so he will choose to hold it. Also make sure you walk him immediately before bed and immediately upon waking up so that he learns the routine. I had a similar issue with a dog who was living on the streets and didn't know how to hold it. Consistency in our schedule really saved us because she knew when she'd have access to the outside.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sib3r1an",
            "body": "Have you considered maybe treating him like a puppy and going back to taking him outside every hour to reinforce that outside is where you potty? I know it would suck to do that at night, but just like a puppy, his subconscious might start to understand that outside is where he does his business only.\n\nDo you have a room in the house that has hardwood or tile that you can babygate him in when you are at work/away? Maybe put down some pee pads. We put our pup in the kitchen with food, water, toys, and his bed and just babygate the entryway. That way, we don't have to keep him in a crate all day while we're at work.\n\nEdit to add: What about trying a different style dog crate? If he's in a wire crate try getting one of those shipping crates and put it next to your bed. Then work on slowly getting him comfortable with being in that one and sleeping in there at night.",
            "score": 62,
            "replies": [
                {
                    "author": "stoicjester46",
                    "body": "My dog at age 5 had the same issue as the OP. We did, *leash jail*. Every hour dog goes out, otherwise even in the home, the dog is leashed to one of us. He got a treat immediately outside when he did his business. Since we knew cheese is his treat of all treats, we focused on using that. We did this for 2 weeks. After that we haven't had issues again, and we don't even have to crate at night anymore. \n\nHe's 9 now. So YMMV.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "No-Development6656",
                            "body": "Leash jail is so underrated. Everytime I've had to use it, the problem is solved so fast, we didn't need it anymore in record time. It's perfect for dogs with separation anxiety, too, that like to leave you to pee or chew. We used it on our beagle and now he only pees in the house when he's home alone *and* the potty schedule is off.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Embarrassed-Paper588",
                                    "body": "Can I ask, what is leash jail?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "No-Development6656",
                                            "body": "A dog with separation anxiety won't mind being on the leash next to you. It's less stressful for them than a crate if the crate is a stresser. You can keep an eye on the dog and it makes it easier to remember the frequent potty schedule. \n\nWith puppies that won't settle down, it also safely helps with teaching them to relax. They figure out they can't go anywhere when you're sitting and learn to lay down when it's chill time. Then you can reward that behavior.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Embarrassed-Paper588",
                                                    "body": "Thank you. Wish I’d known this with my sep anxious lab. She’s 3 now and we still have the same issues as OP.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "No-Development6656",
                                                            "body": "I used it most recently on an elderly (10 then, now 12) beagle that we got from a bad home. It does help. I'm not sure how to handle nighttime pottying, though, aside from going onto a puppy schedule of waking up every few hours for a potty.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gremlinsbuttcrack",
                    "body": "I tried this with my dog. Rescued him a few years ago from a similar neglect situation. Nothing ever worked. I place pee pads on his favorite pee spots and he's very good about peeing right in the center of them. Same deal though, only when we're asleep. Occasionally when he's left alone too, and it can be less than an hour. When his anxiety kicks in he goes and pees on a pee pad 🤷‍♀️",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Big-Challenge-9432",
                    "body": "Totally agree with taking steps back to basics with potty training. He might have too much fear, resulting in inappropriate pottying. You have to help show him what’s appropriate and safe…\n\nI think there’s also a few different ways of management, depending on what you’re ok with. Potentially take up carpet in the areas he likes to potty so it’s not as “nice” of a place? Or, put down potty pads so you can pick them up to throw out easier. \n\nRather than a different style kennel, maybe try using a baby gate to keep him enclosed? I’d assume any kennel would be too traumatic based on his history…",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Merrickk",
            "body": "I know people here hate indoor toilets, but they can be a very good option.\n\n\nWe use one because our dog is hairless and we live where it gets too cold for him to go outside. \n\n\nI wish I had a specific recommendation, but the one we use was discontinued.",
            "score": 15,
            "replies": [
                {
                    "author": "Apprehensive_Dot2890",
                    "body": "I have pads , too cold here and they can't always get out side in time , they don't use it exclusively , but they do use it consistently . I only just don't like when the boy pees on stuff , something new , or a washed pillow or something and I don't know how to stop it . \n\nAlso hate when they do business not on the pad somewhere in house , it doesn't happen a lot but something like that even 1 time per month is a nightmare to deal with since it's usually in a carpet area . \n\nHe also was not socialised and this makes life very hard but I don't know how to train well , as a puppy they are easier , at this stage I feel i lack the ability",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Merrickk",
                            "body": "Our dog had a major regression when we moved (he is 4). We had to up our vigilance (baby gates would have been helpful but we just ran all over the house to keep eyes on him and closed existing doors), and go back to more frequent rewards for going in the proper place.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "8901Rg",
            "body": "Have you considered “litter box training” with potty pads? You could utilize the same spots and have it be a little cleaner. Or you could reach out to a behaviorist but that can get expensive",
            "score": 12,
            "replies": [
                {
                    "author": "Admirable-Reward9415",
                    "body": "I usually don't support pee pad training, but this seems to be a situation where it would be a viable solution. A waterproof tray with pads/artificial turf  or something that the dog can use to prevent further damage to the floors would seem a significant improvement. I  would pull up any carpets or rugs or gate off  carpeted areas as well.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "slave_et",
            "body": "I understand your frustration, I've been there. If all physical medical issues (uti, cancer, stones, etc.) has been ruled out you may need to consult a behavioral therapist.\n\nHowever, as another user suggested, you may want to try going back to square one and treating your adult like a puppy. A very structured play, feed, potty, sleep, potty type schedule over a frustrating long duration (it may need to be life long, who knows?) may be needed. You can teach an old dog new tricks if you are very, very consistant, patient and find your dog's motivator (food, play, affection, whatever). You may also try tethering him to you while you are home and restricting him to a bathroom or other easily cleaned floor while you're out.\n\nI understand your use of enzyme cleaners (I tried those too) but I can pretty much gaurentee your dog can still smell the urine. Replacing the flooring (and painting the subfloor to hopefully seal it) is the only way to get rid of the smell after being peed on so many times. Maybe block access to the preferred spots until you can get him more reliable and then replace the floor when you can?\n\nI know how frustrating this problem can be but don't give up, bring a professional and be ready to spend the next 6 months working on this problem. You (and your family) can do this!",
            "score": 8,
            "replies": []
        },
        {
            "author": "Unique-Public-8594",
            "body": "I think his freaking out in the crate and having a history of using the crate as potty means the crate will be an ineffective technique. \n\nIf it were me, I would use a black light to check for untreated spots in the house and recognize that after 3 years of not being house trained this dog’s habits are now ingrained. \n\nYou have a choice, you can decide to just manage it. You can set up a pen and linoleum flooring. \n\nOr you can attempt to modify his behavior.  You could tether him to you. You could try an [ACVB trainer](https://www.dacvb.org/search/custom.asp?id=4709)\n online session. You could give his full amount of food outside as reward for peeing outside but this is late in the game to fully retrain and I’m not confident these things would work. \n\nI hope so though and hope you will update us. ",
            "score": 7,
            "replies": [
                {
                    "author": "TheEmpressEllaseen",
                    "body": "I'd like to add that black lights only work on *dried* urine. I sent one back the other week because I thought it was faulty and had to order it again when I realised my mistake 🤦🏻‍♀️",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "StrangerThingies",
            "body": "This isn’t a permanent solution but will he tolerate diapers or belly bands? Also could try spraying pee pads with an attractant.",
            "score": 5,
            "replies": [
                {
                    "author": "Fun_Orange_3232",
                    "body": "Yeah tbh I do this when my dogs aren’t trustworthy. So if she’s going to be alone for over 6 hours, diaper. She can hold it, she simply will choose not to.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Aceisalive",
                    "body": "I second this. It can be a little bit of an investment up front (I had horrible luck with disposables with a large dog), but they have saved my carpets as someone with an elderly dog who has incontinence.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Roz150",
            "body": "I had a dog that was super claustrophobic after spening his pupoy years kenneled for a long hours days on end.  My dog never got past that trauma, and I was never able to kennel him.  It just terrified him.  \n\nLimiting access to the entire house I believe is still your solution.  Dogs do not like to urinate where they are sleeping. \n\nConsider some of the fencing on Amazon.   Or maybe try leashing him.   I was always able to leash my dog and he did not have a problem with that.  \n\nI didn’t have to do it forever. We did it for a while and then he figured it out.",
            "score": 4,
            "replies": []
        },
        {
            "author": "wckd24",
            "body": "For kennel training: I always left my crate open so my dog could get in whenever she wanted to. I’d give her a treat to show her that her crate was a good and safe space. What I personally would do, is lay down treats close to the kennel and eventually inside the kennel. Don’t force him in or near the kennel, just let him explore on his own. If he does get in to pick up a treat, don’t react to it straight away and definitely don’t lock it yet. Just let him do his thing and discover there’s good things in there. Eventually, you can start with closing and opening the door slowly. Just for a second at the start, and build your way up. You can hide treats in there as a distraction.\n\nFor the peeing: those sprays usually don’t work… If you can, try to block off the areas where he likes to pee so he can’t go there anymore. Just a box or something could do. Excessive positive reinforcement when he does pee outside is really good (my neighbours probably thought I was crazy when they saw me celebrating a peeing dog), and now five years later and fully potty trained, I still verbally reward her when she pees outside (link a verbal reward with a treat, so that you can eventually slow down on the treats but still reward him by saying something). When he pees inside, don’t get angry at him, as much as you want to be. Ignore what he’s done (because you don’t want to reward that behaviour with any type of attention), and try to clean up when he’s not around (you don’t want him to think that “oh, they’ll clean up for me anyway”). Try to find any sign in his behaviour that could lead to him needing to pee, and react to that whenever possible by letting him out (you’ll be one step ahead of him and you’ll learn a sign, and he’ll learn that if he does that specific thing, he’ll get to go outside to pee and get rewarded). I’d suggest puppy training pads, but since he’s already mainly potty trained, I wouldn’t take a step back by reteaching him to pee in the house.\n\nMaybe, hopefully, eventually, you can use the kennel to train him to hold his pee throughout the night… I’ve never had a dog with this type of issue, but I am just trying to find small solutions that could help you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DescriptionSea3431",
            "body": "Behavioural Therapist maybe?",
            "score": 3,
            "replies": []
        },
        {
            "author": "taydatay88",
            "body": "Belly bands are going to be your new best friend. Get them online.",
            "score": 3,
            "replies": []
        },
        {
            "author": "vminnear",
            "body": "I have similar issues with my rescue who wasn't let outside for the first months of his life. We also don't kennel, he sleeps on the sofa. He is fine when we are around and will go to the toilet in the garden or on walks, and he's fine when we are at work, but at night he goes to the toilet on the rug.\n\nI've recently tried feeding him before his evening walk, rather than afterwards to give him a chance to empty his bowels properly on his walk. Then we let him out for a final wee when we go to bed. This seems to 🤞 be working, I've been doing it for a week and he hasn't peed on the floor once where before it was pretty much a nightly occurrence. Maybe something to consider.",
            "score": 3,
            "replies": []
        },
        {
            "author": "celticRogue22",
            "body": "Use vinegar to clean the area. It worked with our dog. The other thing I tell everyone is never ever use puppy pads even when they are little it just tells them it's ok to pee in the house. \n\nDo you crate your dog at night? Generally, they won't pee in their own bed.\n\nIf you have checked out any medical reasons and all is well is set an alarm and get up through the night to let the dog out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thwonkk",
            "body": "Diapers as a bandaid solution then treats when he goes potty outside.",
            "score": 2,
            "replies": []
        },
        {
            "author": "roboticArrow",
            "body": "I made going outside a game. It's a whole routine. She needs to go out? We go to the door, she sits, I go out, look around, make eye contact, she runs out. When I need her to go quickly, I tell her to heald college. Sometimes just \"college\" lol. \"Get in get out get ahead!\" She can't pee fast enough. She knows the faster she goes, the bigger the treat. She gets all the treats for going outside. And we do this roughly every hour.",
            "score": 2,
            "replies": []
        },
        {
            "author": "chrismelody",
            "body": "I had the same issue rescuing a dog that was over-kenneled in foster care, and was able to overcome it with positive reinforcement and retraining him like he was a young puppy. Putting him in the kennel guarantees he will pee, even now, so I don't do that. \n\nBest to use positive reinforcement -- treats and high praise for doing his business outside. \n\nLock step positive reinforcement with training him the way you would a puppy. Religiously take him out before going to sleep at night, right after waking up, and right after he wakes up from any nap or gets up from any prolonged period of inactivity. Before and after his every meal. Right before leaving the house. Every 1-2 hours for durations outside of those landmarks. \\*\\*Yes, every 1-2 hours at first.\\*\\*\n\nIt took time but my pup got it and is cured of going in the house. It wasn't a linear fix, and he did have some periods of regression along the way, after he seemed to get it (possibly late adolescence-related, possibly anxiety-related, especially if I did not set him up for success with a walk right before leaving the house and making sure he peed multiple times and final last pee attempts resulted in less than droplets, every time before leaving the house, even if he went out 45 min. earlier and I was only leaving for 20 min.) \n\nHe will get it faster than a puppy, and you're restarting from scratch and undoing some learned behaviors, so please keep expectations in check. \n\nThe frequency sounds excessive, but you can dial it down after you learn his patterns, which takes at least a few weeks. It helped me to write things down. After any mistake, start again at a higher number of preemptive potty breaks. \n\nLastly, give him positively-framed pep talks when preparing for and going outside. I tell mine 'Finn potty-poopy time outside' repeatedly. And after I walked him and am about to leave the house, I briefly remind him 'Finn potty poopy outside later with mom'. Praise sounds like 'good Finn potty-poopy outside' on repeat. And as usual, I visualize these things in my mind when saying them.\n\nYou two can do it!  Good luck!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lizdance40",
            "body": "Yep get him a potty patch. Essentially an indoor toilet. I know some people with tiny dogs, it's the only way their dog was ever going to be toilet trained. Dogs can actually use an indoor litter box as well",
            "score": 1,
            "replies": []
        },
        {
            "author": "gremlinsbuttcrack",
            "body": "My dog is like this. I rescued and rehabbed him from a severe neglect situation as well. I use pee pads and it works great. Haven't had pee on the floor in quite awhile. It's kind of gross to have to clean up but a hell of a lot better than on the floor. Although it seems to smell more on the pee pads because the pee is just there on the surface, but as soon as you toss the pee pad it's all good again",
            "score": 1,
            "replies": []
        },
        {
            "author": "sowellhidden",
            "body": "Save yourself so much hassle and put down pee pads. It took me way too long to come to this realization.  My dog finally stopped after years, there is hope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Detective6322",
            "body": "Just an idea not sure how it would work out but maybe a real grass patch? (like freshpatch) and put it on top of his preferred potty spot. Then slowly move it (like an inch every few days) to and then out of the closest door ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarryMeDuffman",
            "body": "Put diapers on him while you're figuring it out. It's better than pee everywhere.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dudimentz",
            "body": "Dog Diapers have saved my sanity from dealing with a dog that loves peeing inside. [these are the ones I use](https://www.amazon.com/dp/B0B98RGMZN?ref=ppx_pop_mob_ap_share)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Haunting_Cicada_4760",
            "body": "Can you install a dog door so the dog can take itself outside? \n\nSince it was kenneled and ignored, the idea that it can come wake you up at night and you’d get up and take it outside is probably a foreign concept. \n\nI’d treat it like a puppy, wake up at night on a schedule to take it out. This will hopefully get it to realize that you will and can get out of bed to take them outside.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please don't recommend pseudoscience/snakeoil supplements, especially as this one has been tested and found to not help with anxiety in dogs, and interferes with liver function so can cause bad interactions with medications.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "rebcart",
                                    "body": "There’s literally a research paper showing it deactivates trazodone when given simultaneously, unfortunately many vets have insufficient training in evidence based medicine and get taken in by supplement marketing. But you’re welcome to start by going to the r/AskVet wiki and seeing what they’ve got there on the topic.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "obnoxiousseahorse",
            "body": "You should check out dirty dog syndrome if you haven't already. We're dealing with the same thing right now, but she also doesn't know how to hold it because at her last house, she had access to the outdoors whenever she wanted so she doesnt know how to ask out, and her \"i gotta potty\" is subtle. The things I've read do say to keep them in a crate for a while, but I think if you can block off a space so the dog is in your eyesight at all times it works the same way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Danimotty",
            "body": "I don’t have any advice because I’m also living in piss, and I have been since I was 7 years old. My dog just never got fixed (ignorant parents). We are watching a rescue dog rn, which used to be mine but was given away to my uncle bc he attacked me, and he is also an olympic pisser. He’s not fixed either (due to medical issues he has). It’s awful. I’m sorry. If your dog isn’t fixed, then try that first. But I assume he probably is already. I’m sorry :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "saltseasand",
            "body": "Have you considered a belly band?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mel_bert_",
            "body": "Get him checked by vet. Could be issues with kidney/bladder.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Numerous-Cod-1526",
            "body": "My dog had a uti and it stopped for a while and she’s peering in the house again I’m Leaving pads in my room cuze she feels safe there  and leaving pads when I leave , and  I have  another dog , and the. My cousins have 2 dogs as well , so it chaos and intends to be loud  , we’ve gone through trauma  with my parents both passing and had new people move in with us  quickly causing her ro regress , I put a sweater on her and it made her confident , but I took it off after the uti went away , but it’s coming back , maybe because of changes and rearranging and she pees when she gets excited as well if she’s on the couch and but she back to peeing , in my room , but she doesn’t like outside unless I’m there and I’m going on vacation In a few days , what can I do  to fix it",
            "score": 1,
            "replies": []
        },
        {
            "author": "J-D-T",
            "body": "You don't think you're neglectful for allowing this to go on for years?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "Cursethewind",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules) and [guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), as well as our wiki page on [punishment](https://old.reddit.com/r/Dogtraining/wiki/punishmentproblems).  \r\n\r\nUsing this as a punishment is inhumane and this can cause UTIs and other health issues.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "QSN-Quix",
            "body": "Diapers. \n\nMy dog started urinating everywhere w age and it was a nightmare. Until I thought of diapers. Saved my sanity. \n\nI use reusable cotton ones at home (wash on hot water) and disposable when traveling. (Tried traveling locally w reusables and that…just doesn’t work)",
            "score": 1,
            "replies": []
        },
        {
            "author": "pinotgriggio",
            "body": "Take your dog for a walk, twice a day preferably...take him outside as much as possible and mother nature will do the rest.",
            "score": -5,
            "replies": []
        }
    ]
}