{
    "title": "Rescue dog wont go outside",
    "author": "estenezz",
    "subreddit": "Dogtraining",
    "rank": 332,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i84o5h/rescue_dog_wont_go_outside/",
    "id": "1i84o5h",
    "selftext": "About a week ago I got my adoptive pup from a shelter in Romania. He’s around 5–6 months old, and as you can imagine, it’s been a huge adjustment for him. Just the car ride for him och was 27 hours.\n\nHe’s very scared of going outside. Every time we try to take him out, he freezes and refuses to walk. I’ve had to carry him out, but once we’re outside, he whines and immediately tries to run back home. Even if we manage to stay out for a minute, the tiniest sound will set him off. I’ve tried everything—treats, taking small steps, standing still to help him acclimate—but nothing seems to work.\n\nWhen we do get back home, he ends up using the puppy pads to do his business, as he’s too scared to go outside. It breaks my heart to see him so frightened. I live in a relatively noisy area, which I’m sure doesn’t help his anxiety.\n\nDoes anyone have advice or tips to help him feel more comfortable and confident outside?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "estenezz",
                    "body": "\nSo far, I’ve tried:\n\t•\tEncouraging him with treats.\n\t•\tTaking very small steps and letting him move at his own pace.\n\t•\tSimply standing still outside to help him get used to the environment.\n\t•\tAvoiding busy times of day to reduce noise exposure.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "If you own or have access to a car, Would you be able to drive him to a secluded area (just to help him initially)?",
            "score": 1,
            "replies": []
        }
    ]
}