{
    "title": "Dog Barking in crate",
    "author": "Gold_Add45",
    "subreddit": "Dogtraining",
    "rank": 321,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i8gtim/dog_barking_in_crate/",
    "id": "1i8gtim",
    "selftext": "I know there is alot of posts about this on this subreddit and I apologize in advance.  \n  \nI’m reaching out because I feel uncertain and desperate about my 6-month-old pitbull. I live in a small apartment complex, and despite my best efforts to train him, I’m struggling with a specific issue that could lead to problems with my neighbors—or even my living situation.\n\n**Background:**\n\n* **Working from Home:** When I first got my puppy, I worked from home, giving me plenty of time to train him. I started by crate training him for short periods, gradually increasing the time. Over time, he got used to it and tolerated the crate without much fuss.\n* **Sleeping Habits:** At night, he has no trouble settling down. He might whine a bit initially when I put him in his crate, but he always falls asleep quickly and sleeps through the night with minimal interruptions.\n\n**The Issue:**\n\n* **Crate Anxiety When I’m Gone:** The main challenge is when I leave the house. When I worked from home, I occasionally went to the office for a few hours and would leave him in his crate. However, he never seemed to settle during these absences, and now that I’m back in school, I need to leave him alone for 3–5 hours each day.\n* **Current Situation:** During this time, he barks and howls uncontrollably, which is upsetting my neighbors. I’m worried that if it continues, I could get complaints or even face eviction. In the morning, he’s usually fine for the first hour or so, but after that, it’s almost constant barking and howling.\n\n**What I’ve Tried:**\n\n* **Frozen Kong with Wet Food:** I’ve given him a frozen Kong with wet food before I leave, but he barely touches it while I’m gone. He devours it when I’m home, but it doesn’t seem to help with the barking or howling.\n* **Bones:** He loves chewing on bones, but only when I’m home. He shows no interest in them when I leave the house, even though he’ll happily chew for hours if I’m around.\n* **Baby Monitor:** I’ve set up a baby monitor that allows me to talk to him through the camera. This seems to calm him down briefly, but I can only use it between classes, and the relief is short-lived.\n* **CBD Oil/Adaptil:** I’ve tried CBD oil and Adaptil, but I’m not sure if they’re making a noticeable difference.\n\n**Additional Info:**\n\n* **Mental Stimulation & Exercise:** He gets plenty of mental stimulation, and he’s walked and run daily. He also gets a lot of attention when he’s out of the crate.\n* **Crate Use:** I’ve seen concerns online about leaving him in the crate for extended periods, but he seems content to spend time in his crate even when I’m home. He occasionally chooses to go in there on his own. The issue only seems to arise when I’m not at home.\n\n  \nI have also considered not using a crate during the day but even when I leave to go outside he cries and barks at the door so I'm not sure if this is a good option. This is the only problem I cant seem to fix with him, every other area in training has gone very well but I cant seem to make any progress on this.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Add45",
                    "body": "ive read the seperation anxiety pages but still would like additional input",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "Looks like the Separation Anxiety pages have plenty of info for you. ",
            "score": 1,
            "replies": []
        }
    ]
}