{
    "title": "Too late for dog/cat relationship?",
    "author": "lapetitetomate",
    "subreddit": "Dogtraining",
    "rank": 318,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i8jgcr/too_late_for_dogcat_relationship/",
    "id": "1i8jgcr",
    "selftext": "Apologies for any errors, and length. Been reading heavily, but my first time posting on here. TLDR at end.  \n\nJust about two weeks ago me and my husband adopted a 1 year old male pit (may be a pit mix, unknown) from our local shelter. When we adopted, we were mostly concerned about him getting along with our female senior pit/lab mix who doesn’t really like other dogs. In the end though, they are amazing together….but the new puppy can’t do cats, of which we have 2. \n\nFor some background, he was a rescue who came from an abandonment situation where he was with 2 other dogs. Suffice to say that he was wildly emaciated by the time he was brought into the shelter. He had no background with cats so we didn't know how he would be, but he’s a very gentle boy overall so we thought it may fit after some getting used to. Right from the start he was aggressive and barking when he saw the cats. We took precautions across the board when we brought him into the house, but on day 3 we had a small slip up, which blew up into a HUGE thing because the cat happened to be where he got into. To shorten things (sorry this is so long), the cat ended up with a broken jaw and puncture from the bite/clamp-down during the attack, plus of course emotional trauma. So overall decidedly very bad. Cat has had surgery and is ok now, just in recovery mode. \n\nWe made moves to surrender the puppy back to the shelter, but literally on the day we did, they shut down all new intakes due to a rash of CIRDC there that was unresponsive to treatment. So now, we are weeks in, and naturally WILDLY attached already because he is literally perfect in every other way leaving aside the cat thing. Like literally angelic. \n\nSO. What we need to know at this stage is: \nIs it too late? Does the fact that he successfully attacked the cat mean that this will never ever ever be trainable? I.e. has he cemented the behavior forever now. We don’t need them to be friends by any stretch, we just need it to not be dangerous to the cats we love. We have no issue keeping them separate when we are gone (puppy is crate trained), but when we are home it seems unfair to expect the cats to be secluded away at all times. He’s only 1, and mentally he’s even younger due to the fact that his whole first year was survival mode. We had high hopes before the incident that we could get there with the cat relationship. But now that his prey drive has resulted in him successfully attacking the cat, we just worry that we can never get him to mentally retrain/recover from that. \n\nI would pay thousands in training if that’s what it took, but if he’s never going to get there, we can’t stomach additional weeks of getting attached, and would need to surrender after the ban is lifted. \n\nThank you for reading. Any answers (even the painful ones) welcomed. \n\nTLDR: 1 year old puppy we adopted attacked our cat after a few days. Given that there’s now been an attack, is there no way forward at all? Is he now “stuck” and never likely to be trainable to be at least tolerant from a distance? (Don’t need him to like cats). ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "lapetitetomate",
                    "body": "*  Specific examples of which parts of the wiki instructions you HAVE successfully done, and which parts you are having trouble with:\n   * Successfully done: attempted to match energy levels when selecting new pet (outside of cat aggression, the dog is otherwise very chill). Kept the dog leashed (minus singular incident mentioned above, accidental). Use of baby gate. Reinforced positively where possible, prior to incident, after which they have been kept separate due to cat's surgery recovery.\n   * Having trouble with: the dog can't overcome the baby gates, but the cats can jump over, and probably eventually will if given the chance. We can easily keep them separate when we are away, even indefinitely if needed, but when we are home we would prefer to not keep the cats under lock and key ALWAYS. When away, they would be upstairs, and dog downstairs in crate. When home, baby gates would create \"no dog\" areas for cats to seek alone time in, but the worry is if they try to come into shared spaces there could be further attacks, no matter how much training we attempt.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "So, I’ll be upfront about my likely bias. I was working a dog walking job when a pit ran across the street at us. Afaik the dog I was walking  (GSD) had not even made eye contact prior, the GSD ended up with 60 stitches. \n\nI think a good rescue agency determines accurately whether a dog is ok with children and/or other pets/cats. \n\nIt’s not clear to me why you adopted a pit mix when your current dog doesn’t really like other dogs. \n\n> Right from the start he was aggressive when he saw the cats, bite/clamp-down during attack, resulting in surgery.  We made moves to surrender the puppy but shelter  shut down.\n> perfect in every other way leaving aside the cat thing. \n\nDon’t “leave aside the cat thing”\n\n> will he ever be trainable? \n\nNot worth risking your cat’s life to find out imho. \n\nThis dog needs to be placed in a home without cats  you should not have been accepted as a placement for this dog  ",
            "score": 2,
            "replies": [
                {
                    "author": "Unique-Public-8594",
                    "body": "[this post](https://www.reddit.com/r/Dogtraining/comments/1i87gvy/update_dog_snapped_at_baby_help/) may be of interest. It describes what one family did to avoid rehoming their dog.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "lapetitetomate",
                            "body": "Thank you so much! I will check this out now. I do worry about the understanding \"gap\" between a cat and a child, who can be taught things about dog body language. Plus the existence of prey drive when it comes to a cat who runs away and triggers a chase. But on an initial scan there seems to be some great stuff in there. Will do a deep dive! Thanks again :)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Unique-Public-8594",
                                    "body": "You’re welcome.\n\n(hugs)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lapetitetomate",
                    "body": "Thank you for your reply! :)\n\nWe actually very carefully chose this dog, after taking our current senior dog on meet and greets. They did very well together, and have since blossomed into friends. Our senior pup has cohabitated with other dogs before, she's just on the picky side (EX: doesn't love huge dogs, or any dog who humps a lot). I did not mean to give the impression she is unable to have dog friends. So long as she knows them and it is a good fit, she can actually enjoy the company--was trying to keep things short on an already very long post!\n\nI appreciate your honest feedback! I do want to be clear that the agency is very much responsible, and did warn us in advance there was no cat history, so it was entirely possible he may not do well in a home with cats. We knew in advance the possibility--they are very much not at fault. He had not yet been into one of their foster placements, which is where this determination would have been made, as he was a new rescue. In the end, it was down to the timing of it that meant we went in without this information at hand.\n\n  \nAlso, I do hope to be clear we are very much not intending to \"leave aside the cat thing.\" I apologize for the language sounding loose and casual, I very much assure you we are taking this seriously and we love our two kitty boys very much. We are fairly certain we will need to surrender, but I would have kicked myself if I did not do all the necessary research first.\n\nThanks again for feedback!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Unique-Public-8594",
                            "body": "Excellent to hear the additional info and your plan. I wish you the best possible outcome. Take care.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}