{
    "title": "My cocker spaniel keeps running off upstairs and weeing on the bed",
    "author": "Spetznaaz",
    "subreddit": "Dogtraining",
    "rank": 293,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i9vfy2/my_cocker_spaniel_keeps_running_off_upstairs_and/",
    "id": "1i9vfy2",
    "selftext": "I did check the wiki and it mentions that dogs will see parts of the house they aren't normally in as fair game to go toilet, however it didn't really say how to address this.\n\nI usually stop her (8 month old cocker) going up there unless i'm up there as well, in which case she doesn't wee or poo. However as soon as she manages to get up there without anyone with her, she will straight away go and wee on the bed and leave a poo on the landing. I'm starting to think she's doing it to spite me lol\n\nI have also noticed when i put a new wee matt down in the downstairs room she's always in (i have to for my partners dogs as she won't house train them) she will usually go and do a massive wee on it, i've never caught her in the act, but the wee is massive and our other dogs are tiny maltese's.\n\nShe was completely house trained before all this and i stopped going outside with her / giving her treats for going toilet a while ago.\n\nWould would be the correct course of action?\n\nI'm thinking maybe start from scratch - Take her out at set intervals, get her to go toilet, praise, treat.\n\nAlso, perhaps playing with her more upstairs and on the bed... Although i feel like more is needed to stop her but not sure what.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Spetznaaz",
                    "body": "The wiki mentions about new rooms and new houses but this is the only advice it gives which doesn't help regarding new rooms of the house: \n\n\" If you move house, or adopt a previously housetrained dog, your new house is a new location compared to the place where the dog was originally housetrained, so you need to retrain from scratch for this home. It is likely to go much much faster than the original training process, though, because of the prior housetraining.\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "Sounds super frustrating!\n\n> I usually stop her from going up there \n\nI suggest you use gates to limit her range. If I had a not house-trained dog it would not free roam my home. \n\n> I'm starting to think she's doing it to spite me lol\n\nI think experts agree that dogs don’t operate from spite  \n\nThey follow instincts and rewards.  How do you respond?  Is it rewarding?\n\n> wee matt \n\nI’ve heard that Dogs interpret pee pads as permission to pee indoors. \n\nHave you used a black light to determine if there is urine that has not been saturated with an enzyme cleaner?\n\n> i stopped going outside with her / giving her treats for going toilet a while ago.\n\nHave you started again?  How’s that going?\n\n> I'm thinking maybe start from scratch - Take her out at set intervals, get her to go toilet, praise, treat.\n\nThis sounds like a really good approach.\n\nGood luck!  :)",
            "score": 1,
            "replies": [
                {
                    "author": "wckd24",
                    "body": "Puppy pads can be a good way to potty train dogs. I’ve never used one, but they could be good if they’re used the right way.\n\nYou just put it down somewhere (preferably just one), and kind of teach them to use it. Once they’re used to it, you slowly start moving the pad towards the front/back door and after a while, you remove the pad. The dog will look for it at the door and if their owner is quick enough, they’ll see it as a sign that their dog has to pee or poop, and take their dog out as quickly as possible. Positive reinforcement is really important here, and the dog will eventually learn: if I go to the door, I can go outside to do my business and I’ll get rewarded for it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Spetznaaz",
                    "body": "I never trained her on wee matts, but unfortunately i need to have them down for my partners dogs. \n\nThere probably are wee remnants everywhere due to two other untrained dogs in the house, although the room she is mostly in with carpet has been peed on so much yet she never goes toilet in there. Unfortunately it's not viable for me to clean the upstairs hallway with an enzyme cleaner as my partners dogs just wee there daily (don't even get me started on how bad it is). \n\nI will try starting again with the basics and hopefully that will help. Cheers.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}