{
    "title": "Help! Dog gets super overexcited for only ONE person",
    "author": "1-objective-opinion",
    "subreddit": "Dogtraining",
    "rank": 288,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ia44ag/help_dog_gets_super_overexcited_for_only_one/",
    "id": "1ia44ag",
    "selftext": "My large otterhound goes nuts whenever my dad comes to visit. Can't stop whining, jumping, quivering  - it's a lot. Even after my dad leaves, my dog can whine and bark for sometimes hours afterwards. This is the only person he has this response to. Jumping etc. hasn't been a major issue otherwise. We think it's because my dad used to look after him when he was a puppy and we went on trips and the dog is really attached to him. But it's making it so it's almost impossible for my dad to visit. My dog ruins the whole visit. We've tried ignoring him and tried training him to sit and nothing is really working. Does anyone have some kind of training routine i can try?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "1-objective-opinion",
                    "body": "I browsed the resources but didn't find anything related to when the behavior is only related to the presence of one person.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "All I can think of is see if your Dad can make some extra visits and be as dull as possible. Have your Dad  seated in a chair already in the home when you walk in with the dog. Have your Dad keep his hands completely still. No play. No treats. Try to respond to the dog as little as possible. No eye contact. Barely talk, talk very quietly and calmly only. Reward your dog for calmness in that scenario. \n\nDo that again. \n\nAnd again. \n\nAnd again.  \n\nNow obviously, your Dad will want to come to life and be fun again at some point but this is what I would do to “reset.”\n\nDog training, often, is first changing the human’s behavior in an effort to set the dog up for success. ",
            "score": 1,
            "replies": [
                {
                    "author": "1-objective-opinion",
                    "body": "Thanks! I think that's good advice.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}