{
    "title": "Nighttime Sleeping",
    "author": "HomeAgain83",
    "subreddit": "Dogtraining",
    "rank": 257,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ibxlk0/nighttime_sleeping/",
    "id": "1ibxlk0",
    "selftext": "I have 1 year old cocker spaniel that is crate trained . I’ve been trying to train him to sleep outside the crate in our bedrooms . He does not settle at night and will explore . However he does not do this if he’s outside the crate at night in the living room (sleeps through the night) . \n\nScenario : he will be sleep on the couch and the family goes to their bedrooms and we get to the bedrooms, lights off and 5 minutes later he’s off his bed and looking for toys or a shoe but he doesn’t do this if we slept in the living room.  We just put him back in the crate which is in the bedroom and he goes right to sleep since he is a lil busy body . \n\nAny thoughts would be helpful . ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "HomeAgain83",
                    "body": "Did not see ? Answered through the search . I used terms for crate training and settling . Settle could be a command since he does know extended stay but I don’t know if that works when the family has dosed off.\n\nCrate training he’s has no issues with the crate or sleeping there . \n\nWasn’t sure what other search term to try .",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}