{
    "title": "Signal for Uppies - Brainstorming",
    "author": "Atayasomin",
    "subreddit": "Dogtraining",
    "rank": 232,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1idkols/signal_for_uppies_brainstorming/",
    "id": "1idkols",
    "selftext": "Good day all, \n\nMy partner and I own a female 4 month old Italian Greyhound. She is very well behaved but due to her springy breed she enjoys jumping up at our legs. \n\nMy partner wants us to train her out of jumping up. However, I'm concerned if we allow no jumping up then in situations where she gets tired or scared on a walk and wants uppies that she will be unable to ask for it. My partner says to train sitting as a request for uppies but this is confusing as sitting can also be a request for food and treats as we make her sit for her food. \n\nI want her to be able to communicate her wish to be picked up without jumping up as per my partners wishes.\n\nDoes anyone have any ideas on a signal that I can train her to give me that means she wants to be picked up and snuggled. \n\nI thought of having her place a paw on my foot but this could lead to the scratching and punching sort of behaviour that my parents dog has after being taught to give paw. \n\nPlease help! Any ideas welcome. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Atayasomin",
                    "body": "I need help with a signal for my dog to give me that means she wants uppies as currently she jumps up which my partner Dislikes. I can train her out of this and have been but I want her to be able to communicate this want to be picked up in an unobtrusive manner. I need Ideas on signals.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "phantomsoul11",
            "body": "Teach your dog to sit anytime she wants something from you, from asking to end a walk to asking for snuggles when lounging, to asking to go out for a potty break. When you see her sit down without a cue, use the context of the situation to figure out what she wants. It's the canine equivalent of saying, \"please.\" There might be some trial and error to start, but both you and your dog figure out the patterns pretty quickly.\n\nSitting is a great gesture for requests because you either can and do respond favorably to her request or if you can't, you don't. Either way, there is no way for her to escalate a \"sit\" when she can't get what she wants, like the scratching and punching you mentioned with a paw gesture.\n\nGood luck!",
            "score": 10,
            "replies": []
        },
        {
            "author": "Lizdance40",
            "body": "Jumping is indeed an undesirable, but natural behavior. Encouraging the dog to sit as an acceptable alternative to jumping to get attention is the normal alternative. Paying any attention whatsoever to jumping should be discouraged. When your dog jumps, no eyes, no hands, turn away.\n\nTo teach a request for \"uppies\" teach the pup to place a paw, or both front paws, on your shoe/foot.   \n\nYou might find it easier to lure this behavior by using random empty shoes, and sitting on the floor.   Food lure the puppy forward until at least 1 paw touches the shoe.  Say \"yes\", or click the moment the paw is on the shoe and reward.  Continue this exercise until the puppy is firmly placing a foot/feet on the shoe. \n\n Then start swapping to different shoes. Your shoes, your partner's shoes, different styles of shoes to get the same behavior.   \n\nThe next step would be while your foot is in the shoe.   And the next step after that would be your foot, without a shoe on it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ananda_yogi",
            "body": "We're trying to teach our dachshund to give us his paw when he wants to come up on the couch. Maybe you could teach something similar? Sit and paw means I want up?",
            "score": 2,
            "replies": []
        },
        {
            "author": "LucidDreamerVex",
            "body": "My pup is tall, and 45lbs, but I still \"scoop\" her up when needed. Notably to get on my tall bed, and to carry her across the parking lot when there's too much salt put down (ice melter). I can't say I actively trained it, but I'll tell you what we did to shape it anyways \n\n\nWhen she was about 4/5 months old is when I allowed her to come up on my bed, and I would pick her up. She would stand at the side, and I could come beside her and tell her I was gonna scoop her up. Then I could pick her up, and put her up top. \n\n\nIt's so freaking cute. Cause now that she's 3 years old, she'll still go to the side of my bed, and raise her front paw on my side so I can easily get my arm around her chest to support her and scoop her. When I tell her outside (to go over ice salt) that I'm gonna scoop her up, she'll do the same lifting paw thing. \n\n\nSo anyway, my advice would be to train it in a controlled setting so she knows she's only allowed up when given the cue, and you're the one that chooses when that is? \n\n\nSorry if that wasn't actually helpful, best of luck",
            "score": 1,
            "replies": []
        }
    ]
}