{
    "title": "Having trouble with \"Speak\" command...",
    "author": "veccster",
    "subreddit": "Dogtraining",
    "rank": 207,
    "score": 8,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1iejtzd/having_trouble_with_speak_command/",
    "id": "1iejtzd",
    "selftext": "Hi, I have read the guide and this has not been covered.  \nI am trying to teach my dog the \"speak\" command. We want him to use it when we let him outside....so he learns to tell us when he has to go out.\n\nThe problem is that his 'speak' is like a noiseless chomp of his mouth. On some occasions, he will get some vocals behind it - and I very clearly reward him when he does. But sometimes, it's a faint use of his vocals. And when he does that, he seems to think he accomplished the task. If I do not reward the air chomp or quiet vocal, he gets frustrated and starts doing his other tricks (spin, sit, etc). \n\nI'm afraid I'm confusing him when I do not reward the subtle vocals.\n\nAdvice?\n\nVideo of the command in question - [https://photos.app.goo.gl/oXsCgCXF9F2o4r4p6](https://photos.app.goo.gl/oXsCgCXF9F2o4r4p6)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "veccster",
                    "body": "Hi, I read several sections of the guide but have not found an answer to my question.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Can_I_name_it_pickle",
            "body": "Don't train \"speak\" for this. Better command is bell training. Teach the dog to tap a jingle bell when outdoor potty is needed. Very easy to teach. Google \"poochie bells\" (they're cheap) and hang from a doorknob. Numerous YouTube videos on it. Best thing we ever taught our dog!",
            "score": 28,
            "replies": [
                {
                    "author": "Lizdance40",
                    "body": "This ⬆️\n\nSome dogs just aren't barkers. You have to work with what you've got.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nightcaste",
            "body": "I would recommend teaching them a different \"I need to go out\".\n\nThe doorknob bells for example.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Grungslinger",
            "body": "Yeah, you're confusing him. \n\nWhen you're sometimes rewarding for just opening the mouth, and other times rewarding for vocalization, he doesn't actually learn that you want him to vocalize, but instead that he can do either to get the reward.\n\nOnly reward when he actually barks.\n\nI would start from the beginning: present the treat and wait. When he barks, reward him. This is a command that is taught by frustration, there's really not much way around it.\n\nMy best advice is to just be patient. It's not the end of the world if he's a bit frustrated. Of course, if he looks like he's in actual distress, stop the session.",
            "score": 5,
            "replies": []
        },
        {
            "author": "PandaPuhl",
            "body": "Hi, we taught our dog to speak using hand signals. We do a \"quack quack duck mouth* kind of shape to imitate her opening and closing her mouth, as if to speak. Also we say \" SPEAK\" LOUDLY until we get the desired response, then reward. Additionally, our girl also used to do the noiseless chomp. We used that as a chance for a fun trick. We say \"SPEAK\" with the hand movement LOUD for a bark, and \"speak\" in a whisper for the no noise chomps,😁",
            "score": 2,
            "replies": []
        },
        {
            "author": "Setsailshipwreck",
            "body": "My problem with “speak” is that my dog already knows “spin” (which is his favorite thing ever) and they sound too much alike for him. It took me awhile to catch on to using a different “speak” command word entirely so now sometimes when you ask him for either you will get both. he will spin and bark at the same time haha",
            "score": 2,
            "replies": []
        },
        {
            "author": "therealcimmerian",
            "body": "I use lout for speak.  Yes they want the treat and will cycle thru all the approved treat rewarding positions.   Your basically getting them frustrated enough they finally bark for the treat and then reward.  Keep doing what your doing they will get it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Visible-Scientist-46",
            "body": "I have seen a hand signal used of making your hand like a barking dog for speak and a hand signal for quiet where the hand's snout is closed. I haven't been able to experiment with this very much, but I feel like it's a bit difficult with a dog who doesn't bark much. I would use a bell or just sitting by the door, or putting the dog on a predictable schedule with a dog who doesn't really bark.",
            "score": 1,
            "replies": []
        },
        {
            "author": "phantomsoul11",
            "body": "Bell ringing is better than barking, mostly because it's an otherwise non-existent behavior from the dog, save for what you train him to do it for: to be let outside. The dog could easily sit at the door and bark at any little critter in the yard he sees as encroaching on his territory, and it has nothing to do with needing to potty.\n\nAt the same time, when you're teaching your dog to ring a bell for a potty break, always take him out on a leash, directly to a designated spot he likes to use and don't talk to him, look at him, or interact with him in any way. If he doesn't go within a few minutes and/or stops sniffing around, sits, or lays down, he likely doesn't need to go and you should take him immediately back inside. Also, following a bell ring, you should always take him immediately back inside after he potties, to avoid accidentally teaching him that ringing the bell gets him outside play time, or worse yet, attention from you because you have to open the door for him. In this situation, the dog is going to endlessly ask to go in and out and back in again and back out again, etc., for that very reason.\n\nIf you suspect the dog is abusing the potty bell, you'll have to figure out how often your dog typically needs to pee (may involve some trial and error with accidents at first) with the general rule for puppies under 8 months old being 1 hour for every month of his age. If it's not close to this amount of time yet from the last time he went potty when he rang the bell, you know you can ignore it. If he's doing it just to get attention (asks to be let out and as soon as you close the door behind him, he wants back in, then back out, etc.) from you, consider whether you are giving him enough interactive playtime every day at designated times, as per his needs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SkinnyPig45",
            "body": "I mean teaching your dog to bark seems silly to me",
            "score": -1,
            "replies": []
        }
    ]
}