{
    "title": "Potty Trained 1yr Old Dog Having Accidents Overnight",
    "author": "looneygag",
    "subreddit": "Dogtraining",
    "rank": 183,
    "score": 4,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ifyxz1/potty_trained_1yr_old_dog_having_accidents/",
    "id": "1ifyxz1",
    "selftext": "Our puppy was potty trained at a young age, and after a long battle with GI parasites she has basically no accidents inside. But, she still struggles overnight. We'll let her outside to go potty at about 10:30pm every night and by the time I get up at 7am there is pee and poop upstairs. \n\nWe moved her dinner to 4pm and I thought that helped, but then the past two nights she's had accidents. Is 10:30-7 too long to hold it? Is there something we can do to prevent these overnight accidents?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "looneygag",
                    "body": "We've already followed the normal housebreaking stuff. This is more of an edge case since she is already potty trained ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Proper_Jellyfish_",
            "body": "Is she crated during the night? It might solve the problem if any other reason health wise was ruled out.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Haunting_Cicada_4760",
            "body": "If your dog is struggling it is too long for your dog. Dogs are individuals. 8 and a half hours is a long time. \n\nDoes she have a way to alert you that she needs to go potty during the night and for you to take her out? Being potty trained doesn’t work if she has no way to let anyone know she has to go.\n\nGo back to basics, set an alarm and take her on a potty break during the night. My puppies always need a potty break at night. That’s partly why I have them sleep in my room so once they are potty trained and they whine usually between 2 and 5 am I can take them to the bathroom. Then we come in and go back to bed. \n\nThese breaks should also help her realize how to alert you when she needs to go at night. That she can come get you in the night or ring a bell or do whatever it is you teach her.\n\nWhen dogs age they also frequently go to the bathroom, at about 8 years old my oldest dog started waking me up daily at 5 am to go potty and did till she passed.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Living_Bass5418",
            "body": "For now I’d set an alarm for 3 am to let her out halfway through the night. It sucks. But it sounds like 9 hours might be too long for her. Also it would be a good idea to crate at night, most dogs don’t want to go to the bathroom where they sleep.",
            "score": 4,
            "replies": []
        },
        {
            "author": "PrimaryHyena4338",
            "body": "There could be many issues, you'll have to rule them out one by one if it isnt easily obvious what the issue is:\n1) there could be medical health concerns if a young dog cannot hold it in. She could have a uti (pee accidents) or a digestive tract issue (unable to retain or digest food/fluids). A vet visit will be needed\n2) some puppies  have training regression around 1 year but I haven't heard of it re toilet training \n3) some of our rescues had accidents if they were left alone too long due to anxiety. Can you check if she's better if she gets to sleep near you (doesn't have to be on the bed with you but you could leave the door open so she can come \"check\" on you to be reassured)\n4) maybe the length of time doesn't agree with her body. (I walk my dog at 10pm and then by 5.45 am she's ready to go out. I can delay it till 6am but she'll be clawing the door)",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutomaticAnt6328",
            "body": "I'd go back to crating at night.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Optimal_Shirt6637",
            "body": "Have vet check for UTI. Our dog started having accidents and this was why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I have been raising dogs for over 40+ years. And I crate train my dogs for 12 months minimum. You’re getting them ready for the rest of their lives. It’s easy that for them to get sidetracked. They need constant reinforcement and constant positive reinforcement when they do well, every time my puppy pees outside I still have a little party and I’m so happy for her And she’s going on 14 months!",
            "score": 1,
            "replies": []
        }
    ]
}