{
    "title": "my 7 month old puppy doesn't seem to be getting the point of potty training",
    "author": "Gold-Farmer326",
    "subreddit": "Dogtraining",
    "rank": 184,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ig9m7x/my_7_month_old_puppy_doesnt_seem_to_be_getting/",
    "id": "1ig9m7x",
    "selftext": "hi everyone! i'm sure everyone's seen enough potty training questions, but i need some advice with my kind of weird little guy. i have a 7 month old french bulldog, and he doesn't seem to understand why he's being potty trained. he knows that when he goes outside he should pee/poop, and when he does have to go, he'll go near the door and want to go outside. however, he seems to not really understand that he should hold it when he doesn't go out right away? he knows he pees outside, but if he doesn't go outside right that minute, he will use the bathroom in the house no problem. i was out for a half hour the other day, and let him out before i went. by the time i came home, he had pooped inside. he has absolutely no desire to hold it to go outside, and i don't really know what to do about it. he also still pees in his bed and has no problem sleeping in it. i've housebroken dogs before, but i have no idea what to do here. how do i teach him to wait? how do i enforce that going inside is also not an option? thank you!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Gold-Farmer326",
                    "body": "i read through the guide, and i still need help with what to do with my dog. the guide says that dogs typically don't pee in their beds, and mine does. i also have found that my dog does not understand why he is potty training, and why he should wait. he is very stubborn and nothing im doing is working, amd the guide doesn't help me understand how to teach him to wait to go outside.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}