{
    "title": "So much pee",
    "author": "TheNerdiestNurse",
    "subreddit": "Dogtraining",
    "rank": 173,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1igetr5/so_much_pee/",
    "id": "1igetr5",
    "selftext": "We have an Aussidoodle that we got from a family friend, he turned one in November. He has never been fully housetrained and it is killing us. He does perfect with pooping, but the pee oh my gosh so much pee. He pees a trail through our house at least once a day. He's not leg lifting, he's not marking, he's not squatting and fully emptying his bladder. He just dribbles a trail then runs and hides. Once we get him outside he squats and finishes peeing.I have read the wiki so I know it's not guilt it's a reaction to us when he hides. He is doing this if it's been 2 hours or 2 minutes since we took him out. There is no rhyme or reason. He also pees in his crate no matter how long he's in there if we leave, but sleeps all night 8+ hours just fine with no accidents.\nWe recently talked to his groomer because she is very experienced with poodles and doodles. She said it's very common for them to have anxiety and he may be anxious due to be scolding for accidents when we were attempting to potty train. She said we get upset when we see the trail of pee so he gets submissive and pees more. She suggested a belly band during the day so if he does have some dribbles we won't see it immediately and react so he eventually learns not to be on edge all the time and hold it better. We are trying that but he now starts to pee the second we take it off instead of waiting to go outside. She also said some dogs are almost 2 before they can fully control their bladder? But I thought it was 16 weeks when they could control it?\nI just know we are at our wits end and honestly thinking or re-homing him because we can't live like this. Any help is appreciated! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "TheNerdiestNurse",
                    "body": "I read the section about guilt, I know he doesn't feel guilt. We have used positive reinforcement, we have tried everything. We are desperate.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dullbeans",
            "body": "This sounds like a really difficult situations. I agree, it really looks like fear to me, especially the hiding and the peeing in the crate where he sleeps. Dogs (even young puppies) don't want to pee in their \"home\" (where they sleep), humans just introduce complications by not constantly giving them access to places other them home (and they initially lack the bladder control to hold out long enough) or they don't quite understand what all we humans consider part of home (and not just the place we sleep). Have you talked to your vet about it? I would consider talking to a vet behaviorist (and a vet for good measure to rule out urinary issues). \n\nSilly question: do you throw a big enough party for him when he pees outside (and I do mean every time)? :) In my experience, positive reinforcement for the things they do right goes a longer way than any punishing of unwanted stuff. \n\nDo you have enough opportunities to celebrate his (other) wins in general? My undersocialized former-streetdog rescue is reactive (she feels insecure and unsure about the world and then growls/barks/lunges at strangers and/or other dogs she perceives as a threat). Walking her in the first year was a daily nightmare and it was \\_so hard\\_ to hold onto other aspects of our relationship that wasn't reactivity training and measuring whether it's improving or worsening. What really helped is for me to find creative ways to give her tasks she can succeed in and us to be happy about it together. In the long run it made both our relationship happier and it helped her to trust me and enjoy/want to spend time with me, which in the long run helped with the reactivity. If your issue is fear, this might help you too. I hope this helps!",
            "score": 3,
            "replies": [
                {
                    "author": "TheNerdiestNurse",
                    "body": "Yes we have talked to our vet who has cleared him medically. They said they believe it to be behavioral. We try to celebrate every outside pee, and we also celebrate other things like when he learns a new trick or catches his toy successfully. I will try some other things and try to celebrate every single pee outside! Thank you!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Son-of-Anders",
                            "body": "Use very very high value treats. Bacon, cheese, or salmon. Just keep a Ziploc by the door, grab it every time you go out. Once he learns he only gets a reward when he does it outside, you'll be good.\n\nHeads up though, your dog is reading your mood. If you're at your wits end, so is he. However, remember that he also has about the same cognitive mind as a three year old. Teach your dog the same way you would a baby - patience, rewards, celebration, and comfort. Yelling and discipline isn't going to get you anywhere with a puppy.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "TheNerdiestNurse",
                                    "body": "Thank you! We will try that!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "dullbeans",
                            "body": "Hmmm, yeah I think a vet behaviorist might be worth it then. I know how hard these things can make your life, especially because your relationship with your dog is so new. When our adult rescue former streetdog came to us, and her reactivity came out after just a few weeks of shutting down, I found it really hard to bond with her because these issues made me resentful and it's not like we had a pre-existing relationship that could take that weight. And since I felt like I couldn't trust her, she couldn't build a trusting relationship with me either, which felt like a catch-22. So I basically had to trick myself into finding other reasons and ways to trust her and enjoy our life, which funnily enough helped with all of it. Good luck with everything!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TheNerdiestNurse",
                                    "body": "Thank you! Yes it's made it hard to bond with him, but we love him so much already we're trying our best!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "dullbeans",
                                            "body": "Yeah I totally get that! It's great that you got to that point though even with such complications :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Maximum_Still_2617",
            "body": "Can you take the belly band off outside?",
            "score": 2,
            "replies": [
                {
                    "author": "TheNerdiestNurse",
                    "body": "Yes we are trying that now and it's working better!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shinymagpiexo",
            "body": "Do you have a routine for when you take him out? I am wondering if he’s learned that is how you take him outside. Has he been checked by a vet?",
            "score": 2,
            "replies": [
                {
                    "author": "TheNerdiestNurse",
                    "body": "Yes he's been cleared medically by the vet. X-rays scans and urine analysis all clear. He has a routine to go outside, he learned to poke the doorknob with his nose which makes a noise, he's very smart which is why we're not sure what's going on now",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}