{
    "title": "My dog understands that chasing the cat is bad, but still does it anyways.",
    "author": "zblustorm",
    "subreddit": "Dogtraining",
    "rank": 171,
    "score": 5,
    "upvote_ratio": 0.58,
    "num_comments (reported by reddit)": 59,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ighl8e/my_dog_understands_that_chasing_the_cat_is_bad/",
    "id": "1ighl8e",
    "selftext": "So I got my puppy (GSD mix) at about 2 months and he LOVES our kitten, who was about 4-5 months when we brought the dog home. They love each other and played lots, which I personally wasn't happy about because as he got older I didn't want him to smush the cat, but since I was the only one out of the five of us in the house that was going to do anything to stop him from the behavior, I gave up so it wasn't inconsistent signals from different people.\n\n  \nFast forward to now when he is 5 months old, and WAY too big to be playing with the cat, who is unusually small for his age. Most of the time he is actually pretty gentle with the cat, but there's sometimes where he gets mad after the cat gets him with a claw and will get too rough, or the cat is playing in a tunnel and he will full on jump on the tunnel and terrify me that he's going to break the cat.  \nOn top of this, he will CONSTANTLY follow the cat around and chase him through the house expecting the cat to ALWAYS play. Unless one of them is sleeping, he has the cat cornered in its safe spots and will not leave until the cat needs something and decides to leave. Harley, the cat, is a very tolerant cat and gives no hissing, growling, or anything like that, he just simply tries to run away and can't run fast enough before he's pounced on.  \n3/5 of us play with the dog as much as our schedules allow to try and wear him out (inside and outside), take him on walks, and do daily training (sometimes we miss a day.. oops....) but he still will wait for the cat and corner him into play.\n\nI started this thing along with one other person that is every time the dog goes after the cat he gets put in time out and has to be in his area by himself for a few minutes to calm down. Now he's picked up that he's not supposed to play with the cat because he will stare from a distance and look over at me to see if I'm watching before running after him, and he won't respond to his name or \"leave it\" until he hears me get up and start walking towards him to put him in his time out, in which case he will run as fast as possible to try and get around me and run far away from me or any room he's placed in. Sometimes even when I am watching, the cat will just play by himself and it's like the dog can't contain himself anymore and just runs after him to shove the cat's head in his mouth. \n\nI've also started giving him treats every time he chooses to stay at a distance and watch rather than run after the cat, but even after all this it's still not showing much improvement, if any at all. Especially because not everyone in the house is following along and I feel like I'm just teaching him inconsistency. If I'm at my computer doing stuff or in the shower, I can hear him barreling upstairs after the cat, and as soon as I walk up the stairs to come check it out, I hear him run away and jump on his bed to act natural.\n\nThis is super frustrating and makes me genuinely concerned for the cat's safety. I know Fondue, the dog, wouldn't try to hurt Harley on purpose, but he's just so big and clumsy that I fear it will happen on accident if this continues. When Fondue is taken over to other houses, he plays super nice with their cats and dogs and while he will sometimes exhibit this behavior, he also is typically okay ignoring them.\n\n  \nTLDR; dog chases cat even though he knows he gets in trouble when it happens and watches to see if we are watching before chasing after cat. current training doesn't seem to be helping at all.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "Things I've done: daily exercise and training to keep him active physically and mentally outside of cat play time, independent activities such as chew sticks, chew toys, and puzzle feeder mats, reinforced settled down behaviors with treats.  \nThings I haven't done that I will start working on but may need extra guidance: impulse training and frustration tolerance.  \nABCS:\n\nA: Cat walks by doing his own thing, OR is playing by himself  \nB: Dog stares at cat before either stalking him or taking off after him  \nC: Cat runs away and a chase starts OR cat decides to play with the dog back",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BrigidKemmerer",
            "body": "If your dog has a high prey drive, there might not ever be a way to completely \"train\" this out of him without significant professional help, and even then, it probably won't be gone. In a high prey drive dog, their brains are simply wired to chase smaller animals. We have a GSD and two cats, and we have an area blocked off with a baby gate so the cats have a safe area that the dog can't get to. That way the cats are safe, and if they want to engage with the dog, they can, but if they want to be done, they have somewhere to go.",
            "score": 69,
            "replies": [
                {
                    "author": "TeenzBeenz",
                    "body": "Same. We have a wonderful dog but we had to give the cat her own safe space where the dog never goes.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "queenmisdirection",
                    "body": "How does the baby gate work for them? Do they jump over it to get to their safe space?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Unique-Copy-3959",
                            "body": "Baby gate with a second slide up door- search for baby gate with cat door and it will come up.  \n\nMy cat has her own space because my dog loves to chase her/she chases him too now but not the case when I first got him.  Took a few months but she chases him/he chases her and when she’s done she goes in her room and sits on the other side of the gate, menacingly I might add.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zblustorm",
                    "body": "That's unfortunate to hear, but I'm hoping some training could at least help him a little bit. The cat does have his own room blocked by a baby gate, and actually likes to play through it by jumping on the dog and then running into his room and watching the dog struggle. I intend on getting the pup into training as soon as he's 6 months and eligible for my local shelter's classes, so once I'm there I'll hopefully have seen some progress from the tips in this comment thread and talk to them about prey-drive.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "maybeambermaybenot",
            "body": "Unfortunately puppies are known for being playful and annoying!!! I have a puppy and a senior dog, and he annoys her ALL DAY to play by biting her face and ears. You need to give your cat a respite area away from the dog. A baby gate is a good idea because the cat could probably squeeze through or jump over without the dog being able to follow. Let the cat approach the dogs on its own terms when it's ready, and ensure it's got a safe space away from him when it doesn't want to be bothered.",
            "score": 18,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "Yup, our cat has his own room blocked by a baby gate! Honestly, the cat also loves to rile up the dog by pouncing on him and running away to his blocked off room, where my dog then sits tilting his head lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bootyspagooti",
            "body": "Kitty needs vertical escape routes. Cat trees and shelves will be very helpful, as the kitty will have a place to run to that puppy can’t get to. Make sure any cat trees have a heavy wide base so puppy can’t tip them over though.",
            "score": 8,
            "replies": []
        },
        {
            "author": "CatCharacter848",
            "body": "Your cat needs separate places that it  can go to have some peace.\n\nBaby gates are great.",
            "score": 4,
            "replies": []
        },
        {
            "author": "jsk518",
            "body": "So I think you're on the right track with treating when he looks at you rather than chasing. I would continue with that.\n\nBut chasing the cat is SO self-rewarding. What I had to do with my rescue is have him on a leash in the house so I could grab and prevent the chase. And confine him when I couldn't keep eyes on him (crate, other room, baby gate).\n\nI've had several GSDs and now a surprise Husky mix, and was able to teach all of them not to chase.. it's definitely doable. But it takes a lot of intention and management until they get it.\n\nNow my issue is that one of the cats thinks it's funny to try to wind the dog up by dashing around in front of him... Now it's the CAT who needs to be managed 🙄.",
            "score": 5,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "Haha, me too! Our cat (who's also technically still in that \"kitten range\") LOVES to rile up the dog while he's being good. Thank you so much for the advice though. I'll get him on a leash during his overly-excited chase moments.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Classic_Upstairs_525",
            "body": "I'd recommend putting the dog on a leash and making them sit with you. This way you can reinforce the leave it with treats faster. For when you are in the shower I would recommend kenneling him. If the other people in the home can't be consistent then they don't get to have unsupervised by you time w the dog. I might even suggest keeping a shoe string or something on his collar for when he is playing appropriately if he goes to far, he gets put in a down stay next to you and he gets rewarded for looking at you. If he is smart like a GSD he will start to get this. Especially if he is younger. They are sponges. Don't wait to do something about this. Depending on the age of the others in the house, turn it into a game. Something fun. You get to play w the dog 1:1 if you can follow these rules. If the cat initiates play then that's where the string comes in. Something to allow you to grab and redirect the dog. Noticing the problem is the first battle, so  great job! Advocate for your animals. They will reward you 10x over w love!",
            "score": 3,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "Thank you, I like the shoe string idea! And you're right, I've noticed he's been really fast at picking up a lot of commands, he just hasn't been able to leave the cat alone, so hopefully the leash helps him figure it out.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Classic_Upstairs_525",
                            "body": "Great!!! It will help with impulse control which is what he is lacking. You'll need to make not chasing the cat more interesting than chasing the cat- love, treats, tug- whatever motivates him. If he's a GSD love and tug is a great start and throw in a cookie every now and then but don't rely too heavily on treats bc there may be a time you don't have them, he still needs to listen. Highly recommend getting him into a beginner class to help you w a foundation so you can live a long, happy life together!! ❤️",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Warm-Marsupial8912",
            "body": "He doesn't \"know it is bad\", he does know when it is safe (ie when you aren't watching) GSDs are hardwired to spot movement and try to control it and he is a puppy. It's like leaving a toddler with a pile of candy and chocolate cake and expecting them not to eat it because they \"know\" it is dinner time in half an hour. They just don't have the capacity to make great decisions all the time at that age.\n\nBarriers to stop access, because everytime he chases he gets a dopamine reward and the habit gets stronger. Work on impulse control and general obedience training, especially an emergency stop. Get a decent, qualified, trainer in - no-one who suggests an ecollar. Google the \"Look at me\" game and have a read of Simone Mueller's book Hunting Together.",
            "score": 3,
            "replies": [
                {
                    "author": "queercactus505",
                    "body": "Yes, OP, this. The dog doesn't know it's \"bad\" because dogs don't have morals. The dog knows that he has to go do boring things if you see him chase the cat, so the logical conclusion is to chase the cat fast or chase the cat when you aren't looking. Definitely recommend relationship substition training, as this person said, a good trainer, and make sure your cat has plenty of places to go where the dog can't go (via baby gates and high-up places/shelves/cat trees).",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Illustrious-Duck-879",
                    "body": "I was going to comment the same thing and I’m a bit upset I had to scroll so far to find a comment to point this out.\n\nOP: don’t think of the puppy as being naughty or defiant. He doesn’t know any better. All he’s learned is that there’s consequences if you *see him* chase the cat. He hasn’t learned that chasing the cat itself is the issue and it’s just too much fun for him not to do it.\n\nAnd yes, impulse control is key here. Also, teach the dog what you want him to do instead of what punishment (yes time outs are punishments, just very mild ones) he should expect. Punishments just teach him to avoid being caught. Teaching him a different behaviour will be way more effective but it is harder to teach, especially if there’s no consistency. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zblustorm",
                    "body": "I see, I didn't think of it this way (first time dog owner :')), I'll definitely look into these resources and correct myself for the future, thank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChaoPope",
            "body": "This is lack of impulse control.  Most dogs don't have great impulse control, even more so if they are high drive.  I have a high drive working GSD and she had zero impluse control when she was young.  Within a year of starting to work on impulse control, she became a very neutral dog to the point where she could be in the center of a chaotic situation and will lie there and quietly watch what is going on.  There are many ways to teach implulse control and neutral behavior, but you have to know your dog pretty well and what will work for your dog.  And if you have multiple people in the house, everyone has to enforce the rules.  I suggest you engage with a professional trainer if you want to do this type of training as it's advanced stuff.  It took me about a year to get my dog rock solid with her impulse control and that was with building that training into everything we did as well as specific exercises to reinforce it.  Dogs and cats can learn to get along, play appropriately, and even become besties if you make a little effort.  My previous shep had a pet cat and when she passed, the cat became my current shep's pet until the cat passed.",
            "score": 3,
            "replies": []
        },
        {
            "author": "tnemmoc_on",
            "body": "Your cat is in danger. High prey-drive dogs will kill cats. Your cat needs safe places.",
            "score": 2,
            "replies": []
        },
        {
            "author": "goosie7",
            "body": "I agree with other comments about giving the cat areas to get away from the dog, baby gates are very good for this. It is not safe for them to be in the same area without direct supervision.\n\nAnother thing that I have found helpful is teaching a \"steady\" (or \"slow\") and \"gentle\" commands so that when they are in the same space you can guide him towards appropriate ways to interact with the cat. Never being allowed to approach the cat makes it seem much more forbidden and fun, and since he knows he is in trouble for pursuing the cat at all it makes sense to try to do it at top speed before you can stop him. This way he knows that as long as he goes slowly he is allowed to try to go near the cat, and as long as he is gentle he is allowed to sniff the cat, and it is going too fast or being too rough that ruins the fun. The easiest way to teach these commands is with a leash or long line, not allowing them to get closer unless they follow the steady command and pulling them back when they do not follow the gentle command, and giving heavy praise for progress. I don't suggest using treats in these interactions because if there's any resource guarding tendency, especially if the cat shows interest in the treat, it can make things more tense rather than less.\n\nThis is especially effective for dogs who have herding drive (which is what GSDs were originally bred for). For some dogs having to go slow makes the activity pointless and they would still be desperate to chase down the cat if they could and want it to try to run away, but dogs with a herding instinct generally enjoy the game created of trying to creep up slowly enough that the cat won't bolt and figuring out how to maneuver to get the cat to go where they want it, and they will figure out that the slow and gentle approach is actually a better way to get what they want than charging in and having the cat run in a random direction.\n\nI still would never leave them without direct supervision in the same area, but this makes it *so* much less stressful to keep an eye on them, reduces the chance of situations you have trouble controlling, and makes it so that if they accidentally end up unsupervised together the odds are much better that everyone will be ok.",
            "score": 2,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "This makes a lot of sense, thank you so much! This along with leash leave it is hopefully going to help. He's a really good boy and doesn't have any resource guarding tendencies, but I'll still keep the treats out. Would toy-playing praise work instead? Honestly he's not really one for lots of pets, he only accepts them for about 2-3 seconds and then gives signals that he just wants to be next to me without them, so I've had to try and find other ways to praise him for good behavior (which is typically treats or play).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "goosie7",
                            "body": "You don't necessarily need an external reward for this - getting to move closer to and sniff the cat is a reward. Play would sort of interrupt the interaction and probably scare off the cat so it might not work well during the session, but playing after you've moved away from the cat is a good way to reward disengaging after interactions and help him learn to redirect the playful energy the cat makes him feel.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Enticing_Venom",
            "body": "Puppies are pushy and annoying, especially GSDs. The best thing you can do to socialize your puppy is have him interact (safely) with other dogs. He will learn proper play manners that way. Since your cat isn't giving warnings (and they're different from dog warnings anyway) your little guy is just being pushy. That's normal for the breed. \n\nTry puppy classes, daycare, play dates, etc. Whatever you can do to expose him to other dogs who will teach him how to play by taking turns and not getting too aggressive. Another dog isn't going to put up with him jumping and pinning them like your cat is. \n\nAs someone else said, you may need to keep them separated as he gets older. But it's worth socializing him first before making that call.",
            "score": 2,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "My pup loves to interact with our neighbor's puppy (a little older but about the same age) through the fence, so I'll reach out to them about a play date and see if maybe he can socialize that way.\n\nI know their puppy has grown up with an adult dog around, so I'm hoping this will be a good way to learn manners.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoOffer8580",
            "body": "Instinct will trump training every time. It took months for me to teach my pit bull (low overall energy but fairly high prey drive) not to chase the cat. Still don’t trust her. I kept her separated from the cat unless I was right there to manage it. She got really good at not chasing him or bothering him but the risk to the cat was not worth it for me to trust her completely. She is fine with other dogs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vancouvermarina",
            "body": "The puppy wants to play. He might not even trying to hurt your cat. I have two dogs and a cat. The older dog was alway good to cat. Mostly ignored  him. But second dog, while tiny but vicious, likes chasing our cat. The older dog follows. So we make sure cat has place to escape. He has a tall cat tree where dogs can’t get. His food is served on top of cat tree too, we can eat in peace. We also let him go to rooms that dogs don’t by having a gate in between. But at same time, I often see them chilling together.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kaneshadow",
            "body": "That's just what happens with negative reinforcement.  That's why it's frowned upon by trainers.\n\nGet a favorite toy- or one of those chasey balls, or treat puzzle things, and when you see he's itching to go after the cat distract him with treats and toys.  Pair it with a command, like \"go get your moose!\" And he'll start to associate the moose with treats and when he chases the cat tell him to go get his moose.  \n\nYou have a stuffed moose right?  Everyone has a stuffed moose.",
            "score": 2,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "I do not have a stuffed moose, I wasn't aware this was something I should have! I cannot believe I have deprived my first pup of a stuffed moose. I will get on this right away, and thank you for the advice!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please do not invite people to message you privately. It robs other sub members of the benefit of your advice and prevents the mods from being able to filter out bad advice.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lizdance40",
            "body": "A 5-month-old puppy is not sleeping as much, and is more active. This behavior is totally normal for his age. What sort of training are you doing? You should be working on sit, down, stay, wait, place, leave it, give/drop, and a recall.  These are things you should cycle through all day, every day. Especially with a German Shepherd.  Just a few minutes here and there sprinkled throughout the day to practice every single one of these, and any others you would like to work on.  Stay and place and leave it are cues that help build a puppy's impulse control.  If you don't know how to teach any of this, please get into training immediately. Puppies should start training on the basics at 8 - 10 weeks, as soon as they come home.",
            "score": 1,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "I do these trainings cycled around with some more \"fun ones\" so he doesn't get bored very often! At least once a day every day, sometimes something will come up and I may accidentally skip a day, but as much as I possibly can the puppy is getting trained. As soon as he reaches 6 months I plan on enrolling him in beginner classes at my local shelter. One thing I've noticed though is that sometimes he just doesn't care about commands unless he knows he's going to get rewarded, so that's been my biggest struggle there.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lizdance40",
                            "body": "He's 5 months old... 5 months olds are going to challenge you, and will continue till about 2 years.  It's going to be the challenge for you to continue to change things up, and make sure that you are using a marker to start extending your rewards.  \n\n You should also be sprinkling in life rewards.   Like going outside. Playing with a favorite toy.  \n\nAnd there are some things that you never stop rewarding profusely. Recall!   Recall is always rewarded like the best thing your dog ever did.  \n\n If there are things that your dog is ignoring, blowing you off, or just not all that interested in doing, then you need to reevaluate in order to motivate.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules) and [guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), as well as our wiki page on [punishment](https://old.reddit.com/r/Dogtraining/wiki/punishmentproblems).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MalamuteRunner",
            "body": "I fully agree with a safe space for the cat as per other comments.  My recent experience is having 3 cats, 18yo void and 2 x 5yo ginger tabbies. I got 2 malamute puppies who were smacked in the face by the ginger tabbies on day 1, thus establishing their place. The void was a big hippy and loved everything. The pups gave the gingers a wide berth as they grew up. The void was a huge curiosity to them and they got very excited with her.  In a few months they got up to about 25-30kgs and the void was around 4kgs. They were never left unsupervised as it’s really not worth the chance with high-prey drive dogs (malamutes, huskies, GSDs etc) but one of the pups managed to jump on the couch on top of Jasmine (void). Fortunately the couch took a lot of the weight but she was physically hurt and had to have pain killers for a week or so. The pup didn’t mean to hurt her but she still did. Please setup a tall baby gate so the cat can be safe.  This is a tragedy waiting to happen. Now my dogs are 18 mths and I do not trust them with the cats at all. Even the gingers now who will hiss and scratch them. They get far too overexcited to be able to make good decisions (they still have puppy brain). \n\nAll it takes is one excited nip and the result could be a massacre for your cat. Please separate them, especially when you are not there.",
            "score": 1,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "Don't worry, I forgot to mention it in my original post, but I do have a baby gate up for a room that is entirely the cat's. It's one of those cat baby-gates and allows the kitty to have his own free time, complete with a litter box, food, and water in there. I've gotten a lot of comments for the cat to have separate spaces like this and I can't reply to all of them, but he's been given a wide variety of spaces he is safe ever since the puppy arrived. :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Extra_Simple_7837",
            "body": "They have to have a learning curve. You have to tell them good job when they manage and sit them down and talk to them when they don't. But it's also important to be realistic and expectations of the young dog. I have two dogs and one of them is almost 2 years old. I have eight cats and some of them are neurologically challenged. I have some large, tall skinny cardboard boxes that I cut openings on either end and a lot of arrangement for safe closet for cats so that they can scoot along and eBay the younger dog. They have to feel safe. They have to be protected. I have a sofa with an area behind it that the cats walk along. And then I actually have a closed off cat area where there's the food and the water and little houses and beds and cat litter. That the dogs can't go in. It's a cat safe place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Extra_Simple_7837",
            "body": "And yes, my dog both of them are German shepherds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MsLaurieM",
            "body": "You have a dog that is high energy and chases things that move.  It is who your dog is and you aren’t going to change that.  He will always chase the cat if he can, it’s an overwhelming instinct for him.   \n\nThe cat can and will get away from him if she doesn’t want to engage if you give her a safe space to go where he can’t. \n\nYou are right to worry about him being too much but you have to solve the problem by keeping the cat safe. You can’t train instinct out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smooth-Operation-709",
            "body": "I adopted a dog that was guessed to be at least 2 years old. It is a small 15-pound dog. I've had this dog for 1.5 years now. I have 3 cats. The dog still chases my cats. 1 cat, Hunter, it especially likes to chase.  I do have a very tall gate that blocks off the living room from the rest of the house.  The cats can jump over the gate to stay away from the dog, but then they are away from me instead of on my lap.  My cats used to spend a lot of time on my lap getting pets.  Now, this dog is always on my lap. Hunter is the only cat that spends time in the living room with the dog. Dog loves to put its mouth around Hunter's neck still. For such a small dog, it is a terror.  I do wish i could get rid of this dog, but it has so many problems. I really dont think there is a single person that would keep this dog. \nAs much as I dislike this dog chasing my cats, I'm pretty certain he would be put down due to all its additional problem behaviors. That is the only reason I keep him and continue to work on his behaviors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PerfectPollution6400",
            "body": "this is prey drive, and its not a behavior the dog is choosing to do. training may help, but management is key here! a dog cannot control the way their brain is wired",
            "score": 1,
            "replies": []
        },
        {
            "author": "fkmylife007",
            "body": "He did the math and is totally worth it:) cats and dogs...",
            "score": 1,
            "replies": []
        },
        {
            "author": "InfluenceFormal",
            "body": "I think you’re dealing with 2 things:\n1 - Puppies age \n2 - Prey drive \n\nSome of this might calm down as the puppy gets older, but you’ll still need to deal with the prey drive. Right now, your dog is getting most value out of chasing your puppy, part of this is prey drive kicking in. I’d recommend fulfilling your dog’s prey instinct in other ways; structured play through flirt pole, fetch, etc. I say structured in that you introduce obedience into the play, overtime. It’ll take some maturity for your dog to really grasp it, but if you start now, your dog should learn to listen to you at times when it really wants something. More value comes from you. Pair this with working on recall, especially around the cat, and the dog’s value of the cat overtime should go down.\nI’d also put up baby gate to give your cat some space from the dog when it needs it. \n\nAbove is what I did with my GSD, took probably until the dog was close to 2 before she fully disengaged from the cat. Eventually they were able to sleep side by side with no issues and the dog stopped seeing the cat as a toy.",
            "score": 1,
            "replies": [
                {
                    "author": "zblustorm",
                    "body": "This is really heart-warming to hear and gives me hope for the future with my pup. I do have a question though, how do I add obedience into the play? I already consistently ask him to sit and/or stay before throwing a ball for fetch or presenting him with a squeaky toy, is this what you mean or is there a different obedience training for play?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "InfluenceFormal",
                            "body": "Yeah you got it. With my dog I will put her in a sit or down, throw the ball, then release the dog. Overtime you can mix different elements. Main goal is to teach the behaviour of listening and impulse control with items of desire.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dfinkelstein",
            "body": "\"My pointer understands that pointing at people is rude, but I can't make him stop.\"\n   \n\"My border collie knows we punish her for herding guests during parties, but she refuses to stop even though she knows it's wrong while she's doing it.\"\n      \nAnd this isn't even a species specific instinct. This is an older more basic one. Older than the instinct to give a shit about you as a human at all.\n  \nMaybe you could have some success with training, but it would be a surprise only ever to you if and when the dog chases or even bites/kills  the cat out of excitement. Even after ten years of peace, other experienced owners would shrug and say \"yes, we told you every step of the way this might happen.\"\n   \nAnd of course every time this happens, the cat might just leave and never come back. That's not unusual. They're smart. They can and do decide their home is no longer safe, and quite deliberately go and find another one, and may refuse to return.",
            "score": 1,
            "replies": []
        },
        {
            "author": "duketheunicorn",
            "body": "Please rehome this cat, your dog is going to kill it.\n\nThis dog doesn’t “know” it’s not supposed to, and that prey drive you’re allowing it to engage with is going to overcome him.\n\nYour household does not appear to have the will to take this on, because it will need to be a concerted training project with 100% prevention of access to the cat—crating, leashed supervision, gating for the whole day, as well as cat trees and high escape routes in every room. You’re already starting from behind.\n\nRehome this cat so it doesn’t die.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Professional_Fix_223",
            "body": "Yup.",
            "score": -1,
            "replies": []
        }
    ]
}