{
    "title": "My Puppy is Chasing my Cat",
    "author": "Alternative-Rip-3044",
    "subreddit": "Dogtraining",
    "rank": 168,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1igr7n9/my_puppy_is_chasing_my_cat/",
    "id": "1igr7n9",
    "selftext": "My husband and I just adopted a puppy from our local shelter. We believe she is a retriever mix, but looks like a hound. She is 10 weeks old. We have a 10 yr old female cat and 4 yr old female cat. Our 4 year old female cat has a very dominant personality (orange cat energy). She is very friendly with all people, but is the “boss” with her cat sister as well. She has booped the puppy on the nose a few times when the puppy has gotten near to sniff her. Unfortunately, the puppy is now retaliating by chasing her and barking at her. I would like some advice on how to calm these interactions and make the dog not interested in the cat. I’m just so nervous she’s going to bite the cat.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Alternative-Rip-3044",
                    "body": "I have rewarded the cat and dog with treats when they are calm towards each other. I would like more advice on how to train the dog with this.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}