{
    "title": "Dog Keeps Taking Off",
    "author": "julyinaugust",
    "subreddit": "Dogtraining",
    "rank": 156,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ihr8ql/dog_keeps_taking_off/",
    "id": "1ihr8ql",
    "selftext": "Hello. I have a one year old Jack Russell/Blue Heeler mix. He’s a great dog and is very smart. However, he likes to take off and sprint around our allotment and unfortunately he’s extremely fast, so if he doesn’t want to come back or be caught he won’t be. He always comes back on his own and knows exactly where he lives. This is causing some issues with our HOA neighborhood. We have little kids so he gets out when they open the doors to leave for school etc. This happens maybe a handful of times a month. \n\nIs this something I can curb somehow or hire a trainer for? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "julyinaugust",
                    "body": "I don’t see a section in the guide about dogs who “run off”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Momshie_mo",
            "body": "Leash the dog",
            "score": 2,
            "replies": []
        }
    ]
}