{
    "title": "Can't pin the reason for my dog's barking or what to do next",
    "author": "ShockTasty2956",
    "subreddit": "Dogtraining",
    "rank": 134,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ij75gk/cant_pin_the_reason_for_my_dogs_barking_or_what/",
    "id": "1ij75gk",
    "selftext": "The barking resources in the guide are great. I don't think 3 and 5 are available anymore. 4 is there, just doesn't point directly to it. I think this could be demand or boredom barking based on the articles, but I don't know what he's asking for. Rocco's my first dog and I want to do right by him, thanks for all the help in advance.\n\nSince October, we've had a now 1yo, 25lb Chihuahua mix (mostly Husky, but lots of other stuff in there too. I think his Embark is in my post history) that gets 3 or 4 walks a day and a few hours at the dog park each week. Partner works from home and I just started working hybrid, previously full time in-office. Over the past week, when we are both home, our dog constantly whines and sometimes this escalates into barking. Fiancé says he still barks in the mornings when I'm in-office but he ignores the behavior. When I'm home sometimes he throws in husky howls. He does stop if ignored, but only after a long time. These episodes of his usually happen before 10am. But, when we *both* leave our apartment, he's fine. We check in on him with our Barkio and he entertains himself with his toys or just naps. Doesn't make any noise.\n\nI'm having a hard time ignoring it, and of course I don't want to reward or enforce it. From what I've read and how he acts when alone, I don't think this is separation anxiety. But I don't think this is boredom or demand barking either? I don't know how to make it stop. He doesn't seem to care for pets, and when I choose from several of his toys, he doesn't care too much about playing with them either. Like whatever he may be demanding, I can't figure out what it is. He has a kong and a pupsicle that are good at keeping him occupied, but it doesn't stop him from returning to that behavior after he's finished.\n\nEDIT: Could this have anything to do with him still being intact? He was really riled up this morning and I took him out to relieve himself, maybe he didn't empty enough during the regular morning walk? But he ended up pretty much leading me to a female also out on her morning walk. I'm noticing now too that he's taken a sudden interest in looking out of our windows.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "ShockTasty2956",
                    "body": "I read the articles given on the guide about barking and the causes. I've narrowed it down to maybe demand or boredom barking but I still need help as I can't find the direct cause. I'm also finding conflicting information on teaching \"quiet,\" so maybe people can chime in on this thread. He understands the \"leave it\" command in any other situation, but I think in this instance there's nothing for him to \"leave.\"",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}