{
    "title": "Happy Barking on Walks",
    "author": "zero-jazz",
    "subreddit": "Dogtraining",
    "rank": 118,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ijyshd/happy_barking_on_walks/",
    "id": "1ijyshd",
    "selftext": "So I got a dog about a month ago named Obi. He’s a husky/border collie mix from what I can tell, definitely some other stuff mixed in there. He’s 2 (turning 3 in a few months), and indoors he is the best boy. He doesn’t bark much, loves to play, not destructive with anything except his own toys (which is fine). He grazes on his food and water without scarfing it down, and is pretty much potty trained. Even knows some tricks like “off”, “sit”, “shake”, etc. \n\nThat said, Obi is kind of hellish once we go for walks. I do my best to do 2 walks a day and then some days we do a trip to the dog park and then a nighttime walk instead. Any car, person, or dog that Obi sees he immediately starts barking and pulling towards them. The barking is repetitive and loud, but his tail is always wagging and I can tell he just really wants to play with the dog. It’s NEVER aggressive from what I can tell, but I’ve already had a few interactions with people while walking him where they’ll cross the street with their dogs or kids bc they think he’s aggressive :(\n\nI would love some suggestions on how to train him against this. Admittedly, I’ve tried a lot. I tried treats because he’s very food motivated indoors, but he usually just spits them out on our walks. I use a harness, but I tried walking with his collar once and that didn’t make a difference. We use a short leash, so I can hold him better. I tried a mesh muzzle, he got it off within minutes because he’s so smart. I tried a clicker and he ignored it. Dog whistle was the same result. My partner and I tried to reinforce “no” and “bad” but his tail just keeps on wagging, not a care in the world. \n\nI have a feeling it might be that he’s overstimulated? He came from the country and we now live in the city, so it’s all new to him. That said, I’m becoming concerned because I really love taking him with me as much as possible, but it becomes almost impossible to walk him if there’s any other thing (person, car, dog) around. \n\nAny advice?? I’m desperate. He’s such a good boy and I just want to make progress. Nighttime he does a lot better, so I know it’s a sensory thing, I just don’t know what to do. Help! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "zero-jazz",
                    "body": "The guide told me to say what I’ve tried, I listed that all above! I’d love the community’s advice and help.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Cursethewind",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules) and [guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), as well as our wiki page on [punishment](https://old.reddit.com/r/Dogtraining/wiki/punishmentproblems).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zero-jazz",
            "body": "Update! His barking is now turning into full on lunging and barking, again never aggressive but clearly not taking no. Advice needed!!",
            "score": 1,
            "replies": []
        }
    ]
}