{
    "title": "Looking for advice to become a dog trainer",
    "author": "Gearbear94",
    "subreddit": "Dogtraining",
    "rank": 82,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ilxcsf/looking_for_advice_to_become_a_dog_trainer/",
    "id": "1ilxcsf",
    "selftext": "I live in Charlotte NC and don't really have any dog training schools close to my area to go to, so I was wondering about the credibility of these online programs such as CATCH, Karen Pryor, ABI, and academy for dog trainers. I currently work full time at a doggy daycare and love every second of it and I know that working with these animals is what I want to do with my life. Any tips and recommendations of how to get into this line of work would be greatly appreciated. I've thought about finding a mentor but don't really know how I should go about that.",
    "comments": [
        {
            "author": "rebcart",
            "body": "Post flair has been changed to [INDUSTRY].\n\n[INDUSTRY] threads have [relaxed professional verification requirements](https://www.reddit.com/r/Dogtraining/comments/rtjrtd/new_post_flair_industry/). This means we do not remove comments claiming to be a trainer, even if the user has provided no proof whatsoever that their statement is true. \n\nAll the regular rules still apply.\n\n---\n\nOP, did you check our wiki article on [becoming a trainer](http://www.reddit.com/r/Dogtraining/wiki/becomedogtrainer)?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jephersun",
            "body": "A few years ago, I was in your shoes, eager to learn more about dog training. I started by gaining hands-on experience at local daycares, which gave me valuable insights into canine behavior and body language. To build a solid foundation, I completed the CATCH Canine Trainers Academy program in 2023. I found it quite helpful, and they offer mentor support for the skills assessment. I already had a mentor going in, an honors graduate of the Academy for Dog Trainers. I chose to take the full course with CATCH without a mentor.\n\nAs you know, dog training is a constantly evolving field, with new research emerging all the time. Continuous learning is essential. Even now, I supplement my CATCH training with additional courses—I'm currently enrolled in two. My goal is to attend the Academy for Dog Trainers myself, hopefully this year or next.",
            "score": 2,
            "replies": [
                {
                    "author": "Gearbear94",
                    "body": "Did the CATCH program help prepare you to get the CPDT-KA certification?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jephersun",
                            "body": "I think the program is great for those preparing for the CPDT-KA certification. It has given me the confidence to answer all practice exam questions with ease. However, after extensive research, I’ve decided to pursue certification through the PPAB instead.\n\nLet me know if you have any specific questions on the program. :)",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "jephersun",
                            "body": "I’d say the Academy for Dog Trainers is the most comprehensive program, given its two-year commitment. KPA, ABI, and CATCH are also excellent options. No matter which school you choose, you’ll spend a good amount of time on theory, which will be valuable for any certifications you pursue later.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}