{
    "title": "If you’re thinking of buying a Zoom Room franchise, please read this first!",
    "author": "Pygmypandacowx",
    "subreddit": "Dogtraining",
    "rank": 64,
    "score": 191,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 26,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1im0c3c/if_youre_thinking_of_buying_a_zoom_room_franchise/",
    "id": "1im0c3c",
    "selftext": "If you are thinking of buying a Zoom Room Dog Training franchise, please read this entire post before proceeding. The TL;DR is: don’t do it.\n\nThis is a very difficult post to write, but I need to warn others about this vampiric business and save them from making a life-destroying mistake.\n\nFor context, I have worked with multiple Zoom Room locations in my area for six years. I have led my stores to some of the most profitable days, months, and years in Zoom Room franchise history (to be clear, even when breaking records, it’s hard to turn a profit). I have been in the loop on corporate communications, and I have seen people buy into this franchise, only to have their locations shut down within a year—over and over again. Let me tell you right now: this company is not what they claim to be.\n\n1. They claim to be professional dog trainers.\n\nI can tell you with certainty that the majority of the corporate team consists of some of the most inexperienced trainers I have ever encountered. They lack basic skills and the ability to train beyond neurotypical, standard dogs. When they sell these franchises, they target people who have never trained a dog in their lives—people who may have only ever owned a pet—and promise them that they will be taught everything they need to know to become professional trainers.\n\nThis is a lie.\n\nEven if their training were done properly (which it isn’t), Zoom Room’s methods barely cover the fundamentals. Proper training requires hours and hours of apprenticing just to develop the motor skills necessary for even the most basic training maneuvers. Corporate training is often rudimentary, led by people who just want to go home early.\n\nIf you have already purchased or are considering buying a franchise, you have probably met Ashley, who runs corporate training. I have attended trainings with her. Her lack of basic knowledge and practical application is truly astonishing for someone who has been in the industry for as long as she has—especially for someone in such a high-ranking position within the company.\n\n2. They will tell you it’s a profitable business.\n\nDog training is a rapidly growing industry with the potential to be very lucrative. Many of these franchises could be viable if it weren’t for the absurdly high royalties and franchise fees that new stores are burdened with—before they even have a client base.\n\nAnyone considering purchasing a Zoom Room franchise should compare their agreements to literally any other franchise. Zoom Room contracts are notoriously difficult to get out of, and the hidden fees and mandatory expenses make profitability nearly impossible.\n\nIf anyone from Zoom Room corporate is reading this: if you don’t want your stores to continue dropping like flies, stop charging astronomical royalties during the first year before they even have a client base. The more viable stores you have collecting some revenue, the more money you’ll make—rather than milking each franchisee dry and forcing them into financial ruin.\n\nMany of the fees they charge are for services they never actually provide. One major expense is the “national advertising campaign” fee. Ask yourself: Have you ever seen a Zoom Room advertisement that wasn’t posted by an individual location?\n\nAsk your franchise representative about the average success rate of stores. They will try to hide how frequently stores shut down. Franchisees are promised the world, only to end up spending their life savings and taking on massive debt to keep a business afloat that cannot be financially successful under its current structure.\n\nDo your research. Call multiple locations and ask them about their financials. There’s a reason Zoom Room corporate doesn’t want you to visit or apprentice under other locations. It’s because those owners will tell you the truth: this is a huge mistake. I have seen countless people lose life-changing amounts of money to this parasitic company.\n\nThere’s so much more I could say to dissuade you from buying a Zoom Room franchise, but I no longer have the energy to keep up the structured format of this post.\n\nThe bottom line: These people do not have your best interests at heart. They claim to have a “magic formula” for success, but that is simply not true. Every single corporate-owned store is losing money. They would rather let franchisees suffer than admit they are wrong.\n\nI have personally seen corporate stores take over failing franchises—not purchase them, but take them over—when owners could no longer afford to keep the doors open. Even those stores, under corporate management, continue to lose money while supposedly following the “magic formula.”\n\nYou will see:\n\t•\tIndependent franchisees limited to a maximum sale discount of 25% (not just by policy but literally—the system won’t allow larger discounts).\n\t•\tCorporate-owned stores in the same areas running 50%-60% off sales, undercutting their own franchisees.\n\t•\tLocations being stacked too close together, forcing stores to cannibalize each other’s business.\n\nZoom Room locations should not be placed within an hour of each other (without traffic). But corporate does it anyway, stealing clients from existing franchises and driving them out of business.\n\nThere is no brand consistency, despite what they preach. And once you’re in, there is no support. They simply don’t have the infrastructure to handle the number of locations they keep opening.\n\nIf you’re a prospective franchisee:\n\nI promise you, this will be one of the worst financial decisions you will ever make. Save yourself the trouble and start your own independent dog training business.\n\nIf you don’t know how to do that, there are resources. \n\nIf you’re an existing franchisee:\n\nI’ve been in this business and this industry for six years, training for eight, and I can confidently tell you: everyone is struggling, not just you.\n\nIf you work for Zoom Room corporate:\n\nThis concept looks good on paper, but the execution is parasitic and cruel.\n\nIf you have been with this company for a few years, you know it doesn’t have the legs to last. Mark is too greedy, and the entire system is designed not to benefit people or dogs—but to benefit him.\n\nIf this structure doesn’t change, the whole thing will collapse. It doesn’t have to be this way, Zoom Room could be great, but the way it operates right now is so catastrophically flawed that it harms anyone who tries to participate.\n\nIf you’re a client at any Zoom Room location:\n\nPlease continue to support your local small businesses. They need you, and they genuinely care about you and your dog. If you like the service you receive, leave a review and recommend them to friends.\n\nBUT—do not buy large packages, like annual passes. If the business goes under, your money goes with it. If you find yourself in this situation, try contesting the charge with your credit card company.\n\nI’m sorry to anyone who is struggling. This is not to say that no Zoom Room locations are successful—but the majority fail due to the poor design of the system itself.\n\nPlease, do your research before making what could be a life-ruining decision. I have watched so many good people get ruined. ",
    "comments": [
        {
            "author": "rebcart",
            "body": "Post flair has been changed to [INDUSTRY].\n\n[INDUSTRY] threads have [relaxed professional verification requirements](https://www.reddit.com/r/Dogtraining/comments/rtjrtd/new_post_flair_industry/). This means we do not remove comments claiming to be a trainer, even if the user has provided no proof whatsoever that their statement is true. \n\nAll the regular rules still apply.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrettyLittleSkitty",
            "body": "I got my start at a ZR (I’m on the East Coast) and this is so disheartening to hear. It’s so upsetting how corporate greed can cause so much downfall.",
            "score": 17,
            "replies": []
        },
        {
            "author": "OneFaithlessness5416",
            "body": "This really got posted the day after my first day at a location (just as a trainer, not as an owner) lol",
            "score": 13,
            "replies": [
                {
                    "author": "Pygmypandacowx",
                    "body": "It’s a great place to get a foot in the door. Just make sure it’s not the only place you learn from! Good luck!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "OneFaithlessness5416",
                            "body": "Thank you! That was my thinking - especially because I can’t afford to quit my current job to pursue dog training full time (which basically every other dog training job was hiring full time or asking for experience). I figured this was a good way to get experience with dogs and see if I even like the “people training” aspect of dog training or not.\n\nIt’s funny, right before I started this job I had looked up stuff about ZR on Reddit to see what other people had to say and it’s mostly positive, but I couldn’t find any info about the internal workings of it, so this is a really interesting perspective you’ve posted. Thank you for that!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Whisgo",
            "body": "So far, my experience with the franchise has been mixed.  \n\nOur location was not corporate and recently did shutter, which was disheartening.  Corporate refused to buy them out.  That said, I had a lot of conversations with the staff during our time there, and many of them held accreditation from CCPDT.  \n\nThe challenge I ran into is that there's a lack of local small businesses offering force and fear-free training.  Balanced trainers surround me - it's a big reason I opened my own business, but I do private sessions and don't have a brick-and-mortar. I needed a space to bring my youngest dog to work on her challenges (stranger danger) and access to agility, as it interested both of us.  \n\nI'm now at a different location, which is corporate, and I'm seeing a sort of difference - on the one hand, it's a new environment for my dog to work in, which is great...  but man, the facilities are definitely not as good as the gym that just shut down.  \n\nI have to take your word for the royalties and fees - I know nothing about what goes into franchises...   That said, I didn't experience training that barely covered fundamentals.  We went through basic and advanced obedience, the curriculum of which was based on AKC's CGC test requirements - which is what I would expect from obedience classes. So perhaps it's similar regarding folks looking at Petco or PetSmart training classes where YMMV depends on the location.  I think it's important to take the proper steps to vet any business someone patronizes.  \n\nBut I have a bias in a way - I wasn't learning anything in those obedience classes -  I was using them for controlled access to other dogs for working on Cha-cha's stranger danger and confidence building for her.  It was a relief to have a space where I didn't have to advocate every minute of the class for her with trainers who, honestly, had experience but were also not certified using aversive methods and nonsense theories.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Latii_LT",
            "body": "Zoom room also has some of the lowest paying hourly for trainers in my city, on top of not supporting continued education and certification. They don’t want their trainers to develop enough education to be over-qualified or need higher pay. Very few of their trainers have certifications either, in my city beyond AKC evaluator. \n\nI started as a client at zoom room and now work as a trainer at an amazing science backed non-profit dog training facility. I get paid more there as someone in the process of getting my CPDT-KA as a certified trainer at zoom room. A handful of trainers who use to work at zoom room (they trained my dog) and now work at the same place as me have just gotten their CPDT-KA equivalent in the last year or so despite working in the industry for a number of years. They were not making enough income nor getting the necessary education to feel successful at investing in a certification. \n\nEverything I’ve heard on the employee side makes them a terrible company full stop. Also their criteria for education and resources on the client side is not great either. We often get zoom room clients switch over that have been progressing through specific training but not actually meeting the criteria. Some of the more intense, behavioral considerations (which makes sense. A lot of the trainers only have professional experience with typical pet dogs and mild behavior concerns)  also don’t get addressed well and the clients end up switching to us. But even with that trainers from ZR are discouraged from referencing out to more credential, educated facilities as the owners want to keep everyone in network. Usually people find our facility and notice that half our staff are from two local ZR and have trained their animals prior. We never shame but the trainers who worked there will usually just say something along the lines of , “ZR did not give me the same opportunity to grow my education and experience in different avenues of dog training.”",
            "score": 6,
            "replies": [
                {
                    "author": "Pygmypandacowx",
                    "body": "This is often location specific I’ve found but I definitely agree with you",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "candyapplesugar",
            "body": "Sorry I can’t read this all but an hour away? We have 2 about 40 min away from each other maybe 60 with traffic but still both are too far from me. I’d sign up if one was within 20. Working full time with kids driving 30 min 1 way is too much.",
            "score": 6,
            "replies": []
        },
        {
            "author": "firelitdrgn",
            "body": "So question…our local Zoom Room closed recently (they announced via Facebook) and we bought training packages with them. Who, where, and what do I contact to get my money back? Is contesting with my credit card company like you said the only way to do it?\n\nWhile it wouldn’t kill us to lose the money it would certainly suck and from what it sounds like in your post, corporate doesn’t give a shit.",
            "score": 2,
            "replies": [
                {
                    "author": "Whisgo",
                    "body": "Hey looking at your account history, sounds like it was the zoom room I was at as well.  Did you send an email to Christina?  I sent a request for a partial refund but have not heard back.  That location was not owned by corporate so it's unlikely their corporate offices would issue any refunds.\n\nThere was an email sent out Feb 2nd.  \n\n>As such, the responsibility for any refunds or outstanding services rests with the business owners under Lucky Paws NW, LLC. The franchisor, nor any other franchised locations, are involved in these matters.\n\n>If you have prepaid for services and would like to request a refund, please contact the business owners directly at [christina@zoomroom.com](mailto:christina@zoomroom.com).",
                    "score": 3,
                    "replies": [
                        {
                            "author": "firelitdrgn",
                            "body": "I haven’t yet, I will send an email at some point tonight and will keep you posted. I think we may have to reach out to our credit card company at this point sadly.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Pygmypandacowx",
                                    "body": "That seems like the best course of action at this point",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "filmbum",
            "body": "I interviewed at one a few years ago and when the new franchise owner told me I had to pay to go to California to take a week long class to become one of their trainers(or something along those lines) all out of my own pocket I’m pretty sure I laughed in the poor woman’s face because I certainly did not hear back!  \n\nIt finally did open near me and I thought it’d be fun to take my dog for a class, but $60 per class for a group class is insane! Horseback riding lessons are cheaper ffs",
            "score": 1,
            "replies": [
                {
                    "author": "Pygmypandacowx",
                    "body": "I’m very surprised the franchise owner didn’t volunteer to foot the bill. Asking employees to pay for their own training is wild. I haven’t heard that one before.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Altruistic_Bit5138",
            "body": "Ouch.. someone in my family is opening one soon",
            "score": 1,
            "replies": [
                {
                    "author": "Pygmypandacowx",
                    "body": "See if there is any way out of it 😬",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Altruistic_Bit5138",
                            "body": "At this point there is no way to talk this person out of it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Pygmypandacowx",
                                    "body": "Well best of luck then. They don’t all go up in flames.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Pygmypandacowx",
                    "body": "I edited the post as requested and reposted a better written one taking out all the things you asked me to 😊",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Manic-Stoic",
            "body": "What prompted you to post this?",
            "score": -7,
            "replies": [
                {
                    "author": "Pygmypandacowx",
                    "body": "I’ve seen this happen to one too many good people and I feel like I need to at least shed some light before more folks get lured into this trap.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}