{
    "title": "6 year old dog pees a little when dog walker arrives (and never any other time)",
    "author": "sash356",
    "subreddit": "Dogtraining",
    "rank": 52,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1in8szk/6_year_old_dog_pees_a_little_when_dog_walker/",
    "id": "1in8szk",
    "selftext": "We’ve recently had our dog sitter (who has sat for us several times) start walking our dog Mars twice a week during the afternoons and from everything I know and can tell, she is a great sitter/walker. However I now have her walking Mars twice a week (while I’m at the office) and almost every time the dog walker comes, Mars pees a little. It looks like more of a submissive or pleasing pee (but then she wags her tail and gives her belly when the dog walker enters) - so the dog walker calls her name before entering our apartment and also gives her treats before and after the walk. Anyone else deal with this? Will she stop this after enough time? What are some tips that I may not be thinking of? Thanks!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "sash356",
                    "body": "I’ve found only general submissive peeing info and mostly on puppies. She doesn’t need a vet and not sure she needs behavioral at this point. I am looking for others experience and if they were able to work through it.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}