{
    "title": "How to stop SDIT from freaking out if my partner walks away",
    "author": "Dragonflykid02",
    "subreddit": "Dogtraining",
    "rank": 51,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1indomt/how_to_stop_sdit_from_freaking_out_if_my_partner/",
    "id": "1indomt",
    "selftext": "Mostly the title. My service dog prospect/in training is 16 weeks old and is only learning basic obedience at this point. we are working on loose leash walking which overall he's doing wonderful at, with one major exception, if my boyfriend walks away from us. If he's walking ahead at all, either far away (25-50+ feet away) or immediately in front of us he's suddenly yanking on the leash and literally choking himself out. Eventually it tends to progress to barking, whining, etc with the pulling until we get close to him again and then he'll walk like a saint. Same issue happens if he knows we are walking to where my boyfriend is located even if he cannot see him. How do I work on this before it becomes a larger/harder issue to deal with? This is an ongoing worry of mine since for the next few months we will primarily be training with my partner present. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Dragonflykid02",
                    "body": "Help still needed after reading wiki. I can't find info that applies to my situation.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}