{
    "title": "Rescue Dog keeps using the bathroom in the house even after going outside with her",
    "author": "Carolinabellee",
    "subreddit": "Dogtraining",
    "rank": 50,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1inif4k/rescue_dog_keeps_using_the_bathroom_in_the_house/",
    "id": "1inif4k",
    "selftext": "We rescued a dog about a month ago who was dumped in our neighborhood. She seemed SO well trained, we were shocked that someone could just dump her. \nThe first week she didn’t have any accidents inside, would use the bathroom outside like we assumed she was trained. After the first week she started to have accidents in one particular room in the house, so we tried to keep that room closed off. Then the accidents moved to another bedroom and the living room. Even right after letting her out to potty. I noticed when we would let her out she would just stand at the door staring at us. Like will absolutely not go to the bathroom if someone isn’t out there with her. So I started going out there with her and she would usually then walk around the yard and go. \n\nI don’t know if it’s because she is getting so distracted by balls in the yard (even if we refuse to touch them until she goes to the bathroom, or just don’t throw them all together while we are out there at that time) that she refuses to go to the bathroom. [She LOVES playing fetch] Or she may pee, but won’t poop. Then we let her inside and within a few minutes she uses the bathroom in the house. \nBut I don’t know what to do. I’m at my wits end. I’m already standing out there with her for a while to go potty, then praising her once she goes. Sometimes throwing the ball a few times once she goes as a form of positive reinforcement. But I don’t understand why she keeps going in the house 😭",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Carolinabellee",
            "body": "I have read the information on house training and separation anxiety and my question has not been answered. I do not think she has separation anxiety.",
            "score": 1,
            "replies": []
        }
    ]
}