{
    "title": "Anxious dog won’t walk on sidewalk",
    "author": "SweatyProgress8927",
    "subreddit": "Dogtraining",
    "rank": 47,
    "score": 1,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1inj09q/anxious_dog_wont_walk_on_sidewalk/",
    "id": "1inj09q",
    "selftext": "\n\nHi everyone, I’ve had my rescue dog, Roki, for a year now. She’s a mutt—German Shepherd, Labrador, and Pit Bull mix. Early on, the vet suggested putting her on Prozac, but I decided to wait and see how she did without it since she was so young her personality hadn’t developed. I’m thinking I may have to revisit that option now. The thing is, she’s still terrified of walks outside. She hates the sidewalk, cars, and being around people in public.  I end up having to carry to 55 pound dog around! (Im a 28 year old girl).\n\n\nHowever, she *loves* hiking. When we’re on the trails, she’s a completely different dog—relaxed, happy, and totally fine seeing people. She also adores other dogs, and the only way she'll walk on the street is if she's with my sister’s German Shepherd.  \n\nI’m about to move to New York, and I need to figure out a solution for her. Has anyone dealt with something similar? Any advice on how to help her feel safe on city streets? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "SweatyProgress8927",
                    "body": "This doesnt help me",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}