{
    "title": "During the death of a pack leader, do I bring the rest of my dogs?",
    "author": "syxtea",
    "subreddit": "Dogtraining",
    "rank": 22,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ipb2t5/during_the_death_of_a_pack_leader_do_i_bring_the/",
    "id": "1ipb2t5",
    "selftext": "I've tried checking this sub for the question and haven't had luck. Maybe I was searching the wrong words or phrasing.\n\nMy catahoula is the leader of my dogs and unfortunately, shes getting old. I was thinking about her eventual passing, and I came to the question of, \"should I bring my other dogs to the vet with us if/when we euthanize her?\" We have 5 dogs, and our 2 youngest dogs see my catahoula as a big sister/mama dog. I know this is an early thought, since she is 10 years old now, but in the off case something happens (cancer, diseases, accident, etc.) I want a clear idea of what I should do. I see her age a lot more now than I did a year ago. The fur on her face is like a slow gradient of white, if she runs too much she gets cranky at night from joint pain, and she prefers to lay around more than when she was younger. \n\nIf any of you have had experience in this, I'd love to hear it. I worry that if my catahoula needed to be euthanized due to anything, and my younger girls aren't there, maybe they'd be confused why she never returned.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "All posts require review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "syxtea",
                    "body": "I've read the guide and I don't believe my question falls under a specific topic. This is a multi-dog household question I believe and I couldn't find anything about it. Thanks in advanced if my post gets accepted.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}