{
    "title": "Spring Steam Sale Megathread (2025)",
    "author": "NKkrisz",
    "subreddit": "SteamDeck",
    "rank": 0,
    "score": 296,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 442,
    "url": "https://www.reddit.com/r/SteamDeck/comments/1jandv4/spring_steam_sale_megathread_2025/",
    "id": "1jandv4",
    "selftext": "This year's spring sale is finally live!\n\nIt will run until March 20th, [see the countdown here](https://steamdb.info/sales/history/).\n\nSadly, there doesn't seem to be a Steam Deck (or dock) sale but you can still pick up some new games at discounted prices.\n\nSome useful links:\n\n* [Steam Store Page](https://store.steampowered.com/)\n* [SteamDB](https://steamdb.info/) \\- browse games, see previous prices etc...\n* [Top played Steam Deck Games](https://store.steampowered.com/charts/steamdecktopplayed)\n\nYou can get some stickers as well by browsing the discovery queue.\n\nI'm sure plenty of content creators and article writers will suggest games as well if you're still unsure about what to get.\n\nPosts about asking which game to buy (eg. a choice between two games) will be removed but you're free to ask for recommendations with the \"Looking for games\" flair and it's template (read the relevant rule).\n\nHappy gaming!",
    "comments": [
        {
            "author": "shuffles03",
            "body": "I only have 37 games in my library. Today, I purchased number 38 and uninstalled everything else. Hello Red Dead Redemption 2. Let’s go see how small horses balls get in the winter.",
            "score": 401,
            "replies": [
                {
                    "author": "FlyingTurtleDog",
                    "body": "Stay off of the RDR2 subs. \n\nRuined the ending for me. \n\n10/10 game for sure.",
                    "score": 173,
                    "replies": [
                        {
                            "author": "Jermtastic86",
                            "body": "Stay off any sub that involves a thing that you're not 100% up to date on that subject, and would not like spoiled. FTFY.\n\n.. but thank you. It's not like I've ever taken my own advice so I'm sure I'd wonder in their about halfway through the game and regret it.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "RobbinsBabbitt",
                                    "body": "Reddit is somehow amazing at recommending posts that are just blatant spoilers for media I’ve never searched but do consume. Drives me crazy. I’m a couple episodes behind in severance and all this last week has been opinions on the latest episode even though I’ve never visited that sub or search the show online",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "KLEG3",
                                            "body": "Google is even worse, thanks to AI garbage. I looked up a specific detail I didn’t understand on a book I just started reading, and the AI summary spat out the completely unrelated ending of the trilogy",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "OhBertSterl",
                                            "body": "Go to Reddit Settings > Preferences > Turn off \"Recommendations in Home Feed\"\n\nReddit has been so much better now that my home feed is just subs I subscribe to again.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FlyingTurtleDog",
                                    "body": "They do OK with spoiler alerts but comments in threads are discussions about the entire game. \n\nIt is also a 7 year old game. Can't really complain.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Jermtastic86",
                                            "body": "No one agreeing with me kind of hurts my case but.. there is no time limit on spoilers imo. I'm about to watch this Bruce Willis movie with a little kid that sees dead people. And know that there's a way people can talk about it without me finding out there's some big twist.",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JPJlpgc",
                            "body": "Does it run well in the steamdeck oled?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "mon0tron",
                                    "body": "I played through the entirety of RDR2's story on my Steam Deck OLED, it runs very smoothly when locked at 30fps (no stutters, good frame times). This sub has a few recommended settings to make sure it looks at its best.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "organicrubbish",
                                    "body": "Runs well on its own. With frame gen mod, unbelievably good",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PhizixHD",
                            "body": "Or anything gaming related. There’s always someone that’s going to post a meme or an essay about games",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "julictus",
                            "body": "that sub is an anthrax",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JCOII",
                            "body": "Should we play Red Dead Redemption 1 first? Or is it alright if I jump straight into 2?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FlyingTurtleDog",
                                    "body": "Not a requirement. There are some characters from RDR1 that are in RDR2, but they aren't the main character. \n\nJust started a second playthrough and it is intense all the shit you can do completely on your own and aside from the story. Very little, if any, ties back to RDR1.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "normalguy26747478",
                            "body": "I want to say “it’s been out for however long”\nBut danm to be you \nPlayed it when it first came out, was amazing",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FlyingTurtleDog",
                                    "body": "Oh, no. I have had it for about a year but didn't start until about a month or two ago. \n\nThe first chapter isn't exactly the most fun. I went to a cold location without a coat on and my guy started to freeze to death and I got annoyed and uninstalled lol \n\nRegret not taking my time and exploring so I started a new playthrough recently.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Narezzz",
                    "body": "You're in for a treat. Legitimately one of the best games of all time.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "deathstrukk",
                            "body": "one of my only two true 10/10 games, the other is disco elysium.\n\nboth of these games have negatively impacted other pieces of media for me for not being as well crafted as them",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Cut-Bruised-Broken",
                                    "body": "Honestly I’ve been considering both of these games for a while now, and for the very reason I’m always hesitant to pull the trigger, well that and the price.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Apprehensive_Bug3944",
                                    "body": "Cool! Rdr2 is my fav game but I still have to give disco Elysium a chance.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GenerousJack",
                                            "body": "Same over here. Witcher 3 imo has been the most definitive video game experience in my life. It runs beautiful on the steam deck but it heats up so am worried i might screw the battery up.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Chaialenor",
                            "body": "The game where game, art, story, music and cinema all come together.\n\nChefs kiss",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "bradderz958",
                            "body": "Can I play it without playing the first? The first is only 20% off and I'd much rather drop money on that when it's way cheaper.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Narezzz",
                                    "body": "Oh for sure. RDR2 is set before the first. So while there's a few characters that exist in both games, it's not essential to play one before the other. They have their own stories and main characters.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cruel-ned",
                    "body": "are you streaming or does it run well on deck? prolly a dumb question",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MLG_Cristian_169",
                            "body": "I’ve been playing on my deck fairly well. I don’t care too much about graphics. Frames mine usually hits 30-50 and it looks great. My only problem is when you put the deck to sleep for sometime the rockstar launcher loses connection and the game doesn’t properly sync with the cloud save and then rockstar launcher relaunches but it never loads and you’re forced to close the game and relaunch but it never sync the save so you lose out the last 10-20 min of gameplay which is so annoying.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "cruel-ned",
                                    "body": "ty",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GamePil",
                                    "body": "Rockstar Launcher is the bane of my existence. I sometimes have to restart my Steam Deck multiple times because \"GTA V is already running\" which I know for a fact it isn't cause I just booted up the deck",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MLG_Cristian_169",
                                            "body": "Yes agreed, it makes the experience really shitty if you play short sessions which I typically do when I’m not home. I wanna finish RDR2 so I can move onto to another game that doesn’t have that issue and I can enjoy in short periods of game sessions.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "GamePil",
                                                    "body": "Well good luck with that. RDR2 is gonna take you a long ass time to beat. I played a while ago for like 20 hours and I think I was barely reaching the 3rd chapter. You'll be spending at least 50 hours and that's only if you ignore basically all the side quests",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MLG_Cristian_169",
                                                            "body": "I’m about 50 in now and started chapter 4 not too long ago. I’m playing the side quest so I get more of the character development. I can def see myself reaching over 100 hours.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "GamePil",
                                                                    "body": "Most likely yeah. I think it's sort of a waste with games like these to not do the side quests. Same way I felt about the 2 recent God of War games. You just don't get much out of them if you just follow the main story. Beating MGSV also took me over 100 hours and that game is basically missing an entire chapter",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MLG_Cristian_169",
                                                                            "body": "I 100% gow 2018 and felt there was a good balance to the side stuff; however, its side quest stuff felt less story building and more busy work(looking at Odin raven).",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GamePil",
                                                                                    "body": "Yeah some of the stuff was just busy work for the sake of busy work (at least in the Ragnarok the Raven Quest gives you some equipment and an extra challenge) but for the most part I really like the side quests. Especially the ones related to the spirits or given to you by the dwarves. Gave some nice world building considering the world otherwise felt pretty desolate. Also after how laughably easy all the story bosses were it was really refreshing to get your teeth kicked in by a Valkery. \n\nIn Ragnarok I'm still in the process. Almost done but I still gotta do the Muspelheim trials (fuck how grindy they are) and then start Valhalla. Gonna be fun to see where the next game will be set... and then wait a couple of extra years until it finally releases on PC",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MLG_Cristian_169",
                                                                                            "body": "Are you playing it on the OLED? I want to beat the original GOW games before beating rag but my library is big rn.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "GamePil",
                                                                                                    "body": "I have played it on my OLED for a bit. Runs pretty good but it's 175gb. Mostly I played on my PC cause I got a pretty beefy rig so I could really enjoy the graphics",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "MLG_Cristian_169",
                                                                                                            "body": "I see. I ask bc I do all my gaming on the go at this time and I’ve been curious how that game runs and horizon forbidden west.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "GamePil",
                                                                                                                    "body": "It runs pretty well. Especially considering it's a newer release. I'd have definitely still played it even if I could only play on the Deck. I didn't try it out in every area but the areas I did play in had no issue hitting the 45 FPS limit I set.\n\nHorizon I don't know about. Haven't finished the first one yet",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "MLG_Cristian_169",
                                                                                                                            "body": "Thanks for your knowledge! I highly recommend horizon it’s the game that got me into playing real games lol. I was a big FPS my entire childhood mostly playing cod and realizing later that amazing games exists outside that toxic bubble of gaming.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "GamePil",
                                                                                                                                    "body": "When I was younger I mostly played TF2 and GTA Online. Got like over 1k hours in TF2 and like 50+ days of playtime in GTA Online. Only started playing more games when I finally had a powerful enough PC.\n\nBut yeah I'll play some more Horizon. I played it for a couple of hours like a year ago. I finished that initiation ritual and I think I was about to go on my journey into the wild. Then life got in the way. But now I'm on vacation and only got my Steam Deck so i could give it another go.\n\nDo you know how well the Remastered version runs on Deck and if it's worth spending the extra $10 on it? I have the base complete edition that originally came out",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "MLG_Cristian_169",
                                                                                                                                            "body": "I see I see! I kinda fell into the same situation playing cod my entire life on a ps4 then getting a pc and exploring more options.\n\nSo from the reviews I’ve seen on the remaster, it’s very very poorly ported to pc. It apparently has a lot of audio issues. I was thinking of buying the upgrade since it’s cheap on sale but idk. I would advise looking into reviews before committing. Most I’ve read says stick to original.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "GamePil",
                                                                                                                                                    "body": "Then I'll probably just stick with the original. The graphics are still good and i don't wanna give money to a bad port. \n\nCOD was never really my thing. I played quite a bit of Black Ops 2 on the PS3 back in the day but only with friends. These days I play a lot more indie games and only get some of the AAA titles if I really think I'll like them or if they've been out long enough to be cheap. It's rare i find an AAA title that's actually worth it. Only game series where I'll definitely 100% buy a new release without hesitation are GTA and Half Life (Half Life Alyx still stands as easily the best VR game out there and if you trust the insiders they seem to be pretty deep into developing a new game with a crowbar wielding character in an HEV suit). God of War maybe depending on what setting they pick for the next game. Kind of tired of Egyptian Mythology after Asgards Wrath 2",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "MLG_Cristian_169",
                                                                                                                                                            "body": "I was looking up reviews apparently people are saying it’s worth it?? I’m not sure now. I’m curious if it counts as a new game entirely or if it takes over your old save and achievements",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Difficult-Feeling849",
                            "body": "With the right settings in can run like a dream! Also this is the only game that's ever made me cry so.. yeah, that's a hard recommendation from me, lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "unpopularperiwinkle",
                            "body": "30 fps is fine",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RolandTwitter",
                    "body": "I haven't had a game captivate me like Red Dead Redemption 2 did in 2018... then Spiderman 2 released on PC and I just beat new game plus on that, but it's been way, way too long",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Griever114",
                    "body": "Did you need the rockstar launcher?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hoopy_93",
                    "body": "Try and keep the one horse throughout  the story bro",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "navalseaman",
                    "body": "Does it run in deck without jumping through 15 hoops?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "shuffles03",
                            "body": "It’s running perfectly- haven’t needed to do anything. Just can’t figure out HDR",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "insomnia4you",
                    "body": "I have 335 games, it’s time to install 336 game.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FrankBouch",
                    "body": "Top 3 all time for me! Such a great game.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "VeeVeevv",
                    "body": "First game I installed on my steam deck. Unfortunately ruined the ending for myself, try to stay as clueless as possible. However, game tips in general have helped me a ton",
                    "score": 1,
                    "replies": [
                        {
                            "author": "shuffles03",
                            "body": "Bruce Willis turns out to be a ghost, doesn’t he….",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VeeVeevv",
                                    "body": "Hey yo no spoilers",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hungarianhc",
                    "body": "I played that game for the first time in November / December last year. SO FUCKING GOOD. Enjoy!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "persepolisrising79",
                    "body": "When you done with the sp give online a try",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Iamstryker",
                    "body": "Enjoy crying in hour..... \\~94, at least for me.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Sjknight413",
                    "body": "Congratulations! You bought one of the most overrated games to ever exist",
                    "score": -24,
                    "replies": [
                        {
                            "author": "NovaSanctum",
                            "body": "Thank you! Every sub glazes this game like it's the Holy Grail.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "MLG_Cristian_169",
                                    "body": "Because it’s literally one of the greatest games of all time lol.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "NovaSanctum",
                                            "body": "Every normie glazes Rockstar games as if they are the epitome of gaming.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "KingOfTheGutter",
                                                    "body": "Show you have no concept of how games are made and the artistry that goes into various facets of them without saying it lol. \n\nWhether you like the game or not, they are literally technical achievements.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "NovaSanctum",
                                                            "body": "Reaching much huh? \n\nThere is more artistry in a single area of a game like Hollowknight or a single planet in Outer Worlds than anything Rockstar can develop. \n\nAs I said, only normies think this is the epitome of gaming. An indie game like Balatro or Inscryption do way more with an inifinite smaller budget than these guys. \n\nI'm not saying by any means that RDR2 is a bad game, but it's overhyped as hell. And if you want to compare to other triple A games, Dark Souls or Bloodborne are way better, they only \"lose\" in raw graphics, which is the most uninteresting part of a game. \n\nSince we are are reaching, let me guess, like the guy above, you think God Of War, Cyberpunk, The Last of Us to be mind blowing games, the epitome of gaming because they dump millions of dollars in graphics and hire famous actors to dub characters. You think a good game design is a game that holds your hand, shoves tutorials down your throat and treats you like a baby, but hey, the cutscenes are pretty and story is like a movie, right guys?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "KingOfTheGutter",
                                                                    "body": "lol someone shit in your cereal today. Yes, all of those games have artistry as well. \n\nThe only one doing any reaching here is you. You literally are shitting on people for liking things that you deem are “for normies”.\n\nI bet you’re miserable to talk to about music as well, because man if it’s too popular, it just must be bad.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "NovaSanctum",
                                                                            "body": "See! You are the one reaching. I just said that the game is overhyped that's all. In every normie sub there is always the \"RDR2 is a masterpiece because of graphics and story\". You assumed things about me and got on a high horse about knowing artistry in video games lol.\n\nMy favorite games are indie, the ones with the most artistry involved! I'm not the one glazing triple A overbudgeted games and getting offended like you trying to defend a overhyped product while acting like a normie.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "KingOfTheGutter",
                                                                                    "body": "\"The ones with the most artistry involved\" lol.\n\nNo one here is glazing anything, you just have it out for things that are popular. I get it, I used to go against the grain too for the sake of it lol.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "NovaSanctum",
                                                                                            "body": "Changing the argument now huh? \n\nFirst was that I didn't know the \"art involved in maling video games\" lol. Now is that I just want to be a hipster \"hating on popular games\" even though I mentioned games like Dark Souls and Bloodborne being miles than better than RDR2.\n\nYou are just a normie that got offended for being called what you really are. 😂",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "KingOfTheGutter",
                                                                                                    "body": "Didn’t change anything lol. You’re not disproving anything though about being a hipster lmao.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MLG_Cristian_169",
                                                    "body": "I mean…. I’m not much of a fan of GTA. I play a wide variety of games, and red dead 2 just happened to strike the right node with me. So I think your statement is uncalled for.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ontopofmyworld",
                                            "body": "It’s barely a game and more “cut scenes with horses in between.” I mean I enjoyed it but it gets way too much hype online. The first one had a much better story imo",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "MLG_Cristian_169",
                                                    "body": "I mean sure there’s some validity to that statement; however, it’s a story mode game. What do you expect? Overall, the gameplay and story telling is what makes it a fantastic game. If you’re not into story mode games, obviously this game is not for you; however, I do not agree it’s over hyped. It’s a gem of a game and it has earned its place as one of the best games of all time. I need to finish the game to see how it compares with cyber punk(another top tier game).",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ontopofmyworld",
                                                            "body": "Was your favorite part of the story the part where Dutch did something bad, or the part when Dutch did something bad? My favorite part was when Dutch did something bad.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dr-cereal",
            "body": "Picked up RE3, Alice Madness Returns, and Metal Gear Solid Collection. Alice was $0.99 so why not. ",
            "score": 55,
            "replies": [
                {
                    "author": "mean_mr_bear",
                    "body": "Madness returns is legit one of the most underrated games on Steam. It’s not perfect, but if you’re into that 2010 era of games, it’s such a good action game.\n\nNo achievements though. Not a huge problem, but I do love looking at past achievements and imagining people being impressed by them🥲 \n\nEnjoy! Great game",
                    "score": 20,
                    "replies": [
                        {
                            "author": "BiBookishBoo",
                            "body": "Does Alice play well on deck? I haven't played it in years. May pick it up",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BiBookishBoo",
                            "body": "Does Alice play well on deck? I haven't played it in years. May pick it up. I noticed playable may have control issues. Is that so?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Dr-cereal",
                            "body": "Thanks for sharing, I actually played the original on PC awhile ago and loved it. May give it another spin on Steam Deck now.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jackdunc",
                    "body": "Wow, looked up Alice and its less than 0.50 cents (USD equivalent) in my region! Anymore deals like this?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dr-cereal",
                            "body": "Maybe go to deep discount section, and look at Valve and indie titles. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SkippyTheKid",
                    "body": "Did you already have RE2?\n\nI just searched the remakes and noticed that RE2 and RE3 are in a Racoon City edition bundle with something called RE Resistance that I’ve never heard of, but the bundle is cheaper than 2 and 3 bought individually ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dr-cereal",
                            "body": "Yaa I had RE2 on its own. I’d pick up the edition bundle. RE Resistance AFAIK is a lame multiplayer game.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SkippyTheKid",
                                    "body": "Noted, thanks",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tillikai",
            "body": "![gif](giphy|3oEjHCWdU7F4hkcudy)\n\nMy back log",
            "score": 76,
            "replies": [
                {
                    "author": "Jackdunc",
                    "body": "Watch me!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "tyranozord",
            "body": "How is Ghost of Tsushima? I know the sale isn’t anything crazy, but I’ve been wanting it for a while. I’m between that and Whitchfire.",
            "score": 34,
            "replies": [
                {
                    "author": "EvansEssence",
                    "body": "If you like old school assassins creed mixed with Jedi Fallen Order you will love it",
                    "score": 17,
                    "replies": [
                        {
                            "author": "AnT-aingealDhorcha40",
                            "body": "Picked up Fallen Order for 3.99 what a time to be alive.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "grammar_nazi_zombie",
                                    "body": "Don’t let your steam deck go to sleep while playing it. Every time I’d lose connection with the EA servers, I could keep playing until the next checkpoint, then the menu at the meditation spot would fail to load and I’d have to kill the game and lose any progress since the last checkpoint. \n\nCompletely killed my interest in the game and I haven’t gone back",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "AnT-aingealDhorcha40",
                                            "body": "Oh fuck thanks for the heads up. It would be so easy to be distracted and let it go to sleep I'll make sure to be careful with it 👍",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rKadts",
                    "body": "If you're not sick of the way open world games have been made for the past 15 years, it's great. It's got a great story and good fighting. But it's also an open world checklist game with hundreds of icons on the map.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "MEGACOMPUTER",
                    "body": "I picked up witchfire but I haven’t gotten a change to play it yet. Hoping it runs well on deck!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Chrononaught",
                            "body": "It does run pretty good on the deck!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ALL666ES",
                    "body": "It's so sick. The fighting combat is super fun.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "bongo1138",
                    "body": "It's fucking great. It is an AC-like, but they do virtually everything better. So expect an open-world checkbox type of game, but you aren't bogged down quite the way AC does it with a million little icons on the screen. Combat is great, too, as is stealth.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PlantBasedStangl",
                    "body": "Amazing game, works amazingly on the Deck. I finished it along with the DLC on Deck only, was an absolute blast. If you like RDR2 style games, it's a 10/10 would recommend.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "tyranozord",
                            "body": "I think you just sold me on it - RDR2 is my all time favorite game",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Dillu64",
                                    "body": "I wouldnt compare it to RDR2. Its much closer to Assassins Creed imo. Beautiful visuals but alot of repetitive side content. You can sneak around or fight enemies heads on and get different items to use in battle. The story is a subjective matter but if you like samurai stories you will enjoy this aswell probably. Imo a good game that didnt live up to the hype.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "konichiwaitches",
                                    "body": "As Dillu64 commented, it’s exactly not like RDR2. \nThe world aesthetics and MC design in ghost of Tsushima are beautiful and I enjoyed the fighting. \nRDR2 is special because of it’s quality in storytelling, character and world building, immersion in general - GOT is sadly not at all comparable, it’s way more arcade.. like why do civilians wear the same short sleeve shirts and sandals in warm regions and in regions where it’s snowing?! \nThe game would have been a dream if it would be close to RDRs immersion\nDon’t want mean to spoil it for you but I was on the same expectations as you, a Japanese RDR game, and I was disappointed and had to drag myself through the main quest line..",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheStixXx",
                    "body": "Writing is terrible. Everything else is very good (visuals and gameplay). I’d recommend it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apophis_",
            "body": "Fields of Mistria. Never heard of it before today, but it looks amazing. I'm excited to play this after finishing Life is Strange 2.\n\nAlso Jedi Fallen Order (played it twice on EA, it's so cheap now), Heavy Rain (historical low, I played it on Epic a couple of years ago) and Pathfinder: Wrath of the Righteous, which I never played before but it seems like something I might enjoy.",
            "score": 39,
            "replies": [
                {
                    "author": "toxikant",
                    "body": "Fields of Mistria has EXQUISITE vibes.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "well_educated_maggot",
                            "body": "It's still early access, how noticeable is this?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "toxikant",
                                    "body": "Not noticeable at all until you get to a certain point in the story where it becomes extremely noticeable. Basically progress is capped past a certain point.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lashiel",
                    "body": "WOTR is very good, I have I think close to 500 hours in it. The main thing I'd say is that the game is VERY HARD, and it is still a fun and perfectly valid experience to play on a low (or even the lowest) difficulty.\n\nIt's also.... a bit buggy. For optimum experience I would recommend looking into installing the following mods, ESPECIALLY if you're playing on a harder difficulty:\n\n*  [Toybox](https://www.nexusmods.com/pathfinderwrathoftherighteous/mods/8). It's kinda (definitely) a cheat mod, but the game CAN just bug out, locking you out of items or even breaking whole quests. Toybox lets you fix that (and also cheat, if like, that's your thing).\n\n* [BubbleBuffs](https://www.nexusmods.com/pathfinderwrathoftherighteous/mods/195). I'm just gonna say this mod is practically mandatory if you're playing on anything at or over the \"Core\" difficulty level (which is kinda PF:WOTR's \"Normal\", but there's way more than 3 difficulties). Harder fights mandate pre-buffing, and having to spend 10+ minutes before a fight casting all your buffs one by one is a real enjoyment ender. It _does_ work on Steam Deck, but you'll need to swap to Mouse+Keyboard mode as there is no controller UI for it. A pain, but doable with some clever shortcut work.\n\n\nAll that said, I'd recommend just forgetting all that at first and trying the game out. It's a very deep, very charming, excellent CRPG regardless of flaws. If you enjoy it, or run into issues, maybe then check out the mods.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Apophis_",
                            "body": "Cheers, thanks for these suggestions! I don't like hard games, I'm mostly having fun immersing myself in the world and the story, so I'll probably adjust the difficulty setting to be lower. I assume this game as an RPG will give me some cool adventures to enjoy!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "lashiel",
                                    "body": "Absolutely.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Nosferatu-Rodin",
                            "body": "What are tje controls like on deck?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "lashiel",
                                    "body": "The game has built in controller support, so fine using that. Pretty good UI for it. It's not as smooth as say BG3 (imo at least), but it's functional. I think it's a game that could benefit from having a trackpad option for some things, so having that available on Deck could be nice.\n\nYou will run into issues with mods though, as I mentioned somewhere, as they mostly assume you're using KBM. But there's workarounds.\n\nFull disclosure though, I've never played it on Deck, and I only played a little with controller on PC (although I was already contemplating a replay even before all the DLC went on sale, so may try it on Deck now).",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Nosferatu-Rodin",
                                            "body": "Is the dlc worth it or should i play vanilla first?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "savingewoks",
                    "body": "Is combat in the pathfinder game like combat in BG3?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "lashiel",
                            "body": "Pretty similar. PF:WOTR has a turn based mode like BG3, but also a RTWP (Real Time With Pause) style battle mechanic where you can set some basic tactics and let the AI handle stuff while you either focus on one character or kinda jump around mixing up tactics as needed. You can also pause (as the name implies) at any point to think or set stuff up.\n\nI wouldn't play real time on WOTR over maybe the lowest 2 difficulties. Which is totally valid and I think you'd have fun. But the difficulty scaling in the game is ABSURD, so you'lll need every advantage you can get the higher you go (the highest difficulty is literally called \"Unfair\" and that is a very apt name).\n\nWOTR is overall a much.... rougher game than BG3 (I say with around 500 hours in both), but I still think it's an excellent entry into the modern CRPG genre.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Biggie-Rice",
            "body": "Got Portal and Doom 2016! Contemplating Ghost of Tsushima Director’s Cut",
            "score": 98,
            "replies": [
                {
                    "author": "OnehitwOnderz",
                    "body": "Ghost of Tsushima is amazing and runs pretty decent on the deck, I locked mine at 40 with low settings and only occasionally saw some drops.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "jollyjam1",
                            "body": "This is pretty similar to how Cyberpunk performs on the SD with the SD specific settings. Is there a link to \"optimal settings\" for GoT?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "OnehitwOnderz",
                                    "body": "Protondb has good suggestions, but I think I used this video https://youtu.be/-aFXzk9mlC0?si=d-zHyVHqw9zNhyQX when I was setting mine up.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "iniquity_rhymes",
                            "body": "The Deck can do better than this. I'm playing on med graphics on the oled with 50-60 fps with forced 1600 mhz. With frame gen it gets around 80.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dr-cereal",
                    "body": "Those are both awesome pick ups ",
                    "score": 6,
                    "replies": [
                        {
                            "author": "backhand_snipe",
                            "body": "I picked it up today, also picked up Rachet and clank, and pre-bought the last of us part 2 even though that one isn’t on sale, I’ve never played it and I just know I’m going to want to dive right in. \n\nGuess this was a PlayStation sale for me.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shadow50000",
                    "body": "Highly recommend ghost, worth it for sure, awesome combat and story and lots of content",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ALL666ES",
                    "body": "Just beat the first act of Ghost last night. It's the game I'm having the most fun with right now. Looks great on deck too.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "owoflux",
                    "body": "i suggest getting the whole valve bundle. its amazing for what you get.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "saltedmangos",
            "body": "First steam sale since I got my deck last week. First gaming device I’ve had in 10yrs. \n\nI got:\n\nDoom 2016,\nRed Dead Redemption 2,\nCyberpunk 2077,\nHogwarts Legacy,\nHades,\nSpiritfarer,\nBorderlands 2, 3 and pre-sequel,\nHollow Knight,\nUndertale,\nBatman Arkham Collection,\nMass Effect Legendary Edition,\nTelltale: Walking Dead,\nRisk of Rain 2,\nDon’t Starve,\nEnter & Exit the Gungeon,\nFrost Punk,\nShadows of War & Mordor,\nStardew Valley,\nMonster Prom,\nStar Wars: Fallen Order,\nSlime Rancher,\nBrotato,\nand Dead Cells\n\nI forgot how dangerous these sales were! There goes my year. Which should I play first?",
            "score": 64,
            "replies": [
                {
                    "author": "kingkobalt",
                    "body": "That should keep you busy for the next decade 😂",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "boiledpeen",
                    "body": "my pick is mass effect, one of the great stories in any media",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "rendyfebry13",
                    "body": "I'm with you, been years since I have any gaming devices, and steamdeck performance is really blow my mind. \n\nThen summer sale happen and I remember why I left pc gaming years ago, steam and its fricking sales make me collect games more than I able to play them, and to make it worse, they run it 4 big sales even now.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "katsushero",
                    "body": "You forgot to get Witcher 3!\n\nDefinately RDR2, after the boring intro (which still looks good and sets the scene) it's incredible",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "oligtrading",
                    "body": "Good gets!!!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cheerstothefirstyear",
                    "body": "Voting Hollow Knight first!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cojack16",
                    "body": "Star dew and maybe see what mods you can install first",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Carlosjld82",
            "body": "XCOM 2 baby!!",
            "score": 19,
            "replies": [
                {
                    "author": "OldTimeGamerNowDad",
                    "body": "Thinking of starting with the first XCOM on Steam deck. Does it play well?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OldMcGroin",
            "body": "Picked up Final Fantasy 13 for less than €10. I remember skipping it when it first released due to poor reviews attacking it for being a bit linear. Now, I'm sick to death of open worlds and happened to see it earlier. Time to give it a go.",
            "score": 39,
            "replies": [
                {
                    "author": "mjb85858",
                    "body": "Personally, it’s one of my favorites in the series. To get a slightly better experience it worth looking into the ff13fix mod, removes some of the jank from the port, especially for 13-2.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "TLOWraith",
                            "body": "How do you download that for the SD?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "mjb85858",
                                    "body": "You can basically [just follow this, you’ll have to be in desktop mode, but it’s just dragging and dropping files](https://github.com/rebtd7/FF13Fix)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TLOWraith",
                                            "body": "Thank you so much!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fullsaildan",
                    "body": "I just finished replaying it yesterday. I had a really great time with it, but just know when you get to chapter 11, the story gets sloppy because they were trying to get the game out the door. \n\nThe only other gripe I had is about the post game. Many guides tell you to focus on the characters primary roles until you finish the main story, and then farm experience afterwards. I personally think that’s a mistake as the leap to post game farming is kinda a high barrier and they lock you out of some of the best available spots pre-final battle once you’ve beaten it. So grind some of the secondary roles out before “beating” the game.  And then post game farming for experience is also quite tedious. Once you beat a few adamantoises, don’t feel bad if you just want to speed it all up with an editor or something. It’s literally not hard, just painfully slow and a bit of RNG involved for some drops if you’re going for trophies. \n\nOn steamdeck you can force it to be 4GB enabled which helps smooth out some of the hiccups just add this to the launch options: PROTON_FORCE_LARGE_ADDRESS_AWARE=1 %command%\n\nI’d recommend using FF13Fix which is just copying over some DLLs. You can also download some nice texture and model upgrades but they require windows to properly install (can just copy the game files over after and it all works).",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "MountainMuffin1980",
                    "body": "Oh shit that is tempting. And I say this as someone who watched my wife play most of it and I did not like what I saw",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "VTwinVaper",
                    "body": "It’s linear just long enough for you to fall in love and want more; and then it gives you more freedom.  A wonderful and sadly often overlooked game.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cardonator",
                    "body": "It's a fun game but the level design for the first half of the game leaves a lot to be desired.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "brimg87",
                    "body": "It’s really good. Combat gets way more complex mid to late game. Don’t judge it too early.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JustDiveInTimberLake",
                    "body": "I saw this exact comment in another thread. Weird.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OldMcGroin",
                            "body": "That was probably me as well!\n\nhttps://www.reddit.com/r/SteamDeck/s/iTJ5SXDcfj",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "JustDiveInTimberLake",
                                    "body": "Ah ok that just surprised me because i read the threads back to back I was thinking it was a bot or something haha.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OnehitwOnderz",
            "body": "Picked up Hades II but still hesitant with ARMORED CORE VI FIRES OF RUBICON. I'm not sure if it will run well on LCD SD.",
            "score": 17,
            "replies": [
                {
                    "author": "namcrg",
                    "body": "It can do a lock 40fps if you lower the settings",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "tyranozord",
                    "body": "Played the entirety of Armored Core 6 on deck. It’s a great experience. Even did some multiplayer. Well worth it.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "OnehitwOnderz",
                            "body": "Thanks! Definitely will get it now!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EverydayFunHotS",
                    "body": "Personally I only play it on desktop. It deserves a big screen. But it runs well on deck. And the back buttons are crucial for AC6, imo.\n\n\nI use the Xbox controller with pack panels on a desktop PC.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "OnehitwOnderz",
                            "body": "Good to know! I recently purchased the back button enhancers because they are so hard to reach on SD with my small hands lol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GOODxAPOLLO",
                    "body": "I've played through the story mode and online with my LCD for AC. About 120hrs. It works incredibly well.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "OnehitwOnderz",
                            "body": "Thank you for the confirmation!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Peperoniboi",
                    "body": "Armored core runs great",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Juliomorales6969",
                    "body": "i only played AC 4 on steam deck. i had no issues",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "that_90s_guy",
                    "body": "Finished armored core 6 to 100% entirely on the Steam Deck. It's black magic how it runs so well on the deck despite the insane fast-paced action/effects and massive maps with mechs. It can easily run at 60fps with ocassional dips if you lower the settings, albeit 40fps runs without frame drops very well with considerable battery improvements. The wild thing is this is one of the few games you don't need to lower resolution for it to run so well. And it's fantastic being able to run this game at the sharp full resolution instead of the usual watercolor 480-680p resolution most recent games require.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "damian20",
            "body": "Is civ 7 1.99 yet?",
            "score": 78,
            "replies": []
        },
        {
            "author": "LordVader1995",
            "body": "In my first big steam sale, I got a total of 11 games lol jesus christ. These sales are no joke. The games I got are:\n\n1. Half Life Complete Collection (Team Fortress Classic, Half Life: Opposing Force, Half Life 1, Half Life: Blue Shift, Half Life 2, Half Life: Source, and Half Life Deathmatch: Source)\n2. Doom Eternal\n3. Lego Pirates of the Carribbean\n4. Star Wars: Jedi Fallen Order\n5. Doom (2016)",
            "score": 14,
            "replies": []
        },
        {
            "author": "Cheesestrings89",
            "body": "I spent £2500 on my new pc. I can’t afford a game and i am forced to play something in my 750+ backlog 😒",
            "score": 133,
            "replies": [
                {
                    "author": "LeeisureTime",
                    "body": "God, how do you even get out of bed in the morning? The horror...\n\n\\*thoughts and prayers",
                    "score": 99,
                    "replies": [
                        {
                            "author": "Cheesestrings89",
                            "body": "thank you, this is an unimaginably difficult time. \n\nI decided to replay cyberpunk instead of playing a new game",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "persepolisrising79",
                                    "body": "Not the worst idea.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kaysolike",
                            "body": "https://preview.redd.it/daegs4roikoe1.jpeg?width=216&format=pjpg&auto=webp&s=407aadb2cc5ea7eb358d6c4ec72076cf783a705b",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "badluser",
                                    "body": "Perfect magic card",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "xCANIBLEx",
                            "body": "He can’t…that’s why he got a steam deck 🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dhs77",
                    "body": "Take a loan out, you just cant miss the sale man, you cant.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "2squishmaster",
                    "body": "That's terrible. Have you considered starting a go fund me?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Cheesestrings89",
                            "body": "i’m actually setting up my only fans as we speak",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "2squishmaster",
                                    "body": "Dope, shoot me a link when it's up.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KennonCOYG",
            "body": "Is Valheim worth it for singleplayer only?",
            "score": 36,
            "replies": [
                {
                    "author": "jsweaty009",
                    "body": "Oh for sure, it was my first SD game and play it every day.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "fabzpt",
                            "body": "Does it run well on the deck ?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "UnusualRestaurant",
                            "body": "South Dakota game?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jsweaty009",
                                    "body": "Yup",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Powers3001",
                    "body": "I will say it’s super hard on the battery. Felt I had to be plugged in with this one as the fan is running hard.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "chadbot3k",
                    "body": "I play it 90% solo and about 10% with some buddies on a separate server/character - i prefer the solo relaxed vibes",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "SamCarter_SGC",
                    "body": "It is really fun with other people because you can all go do or collect something different to really power through whatever goals you have.\n\nStill great as a singleplayer game though.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Gulimusi",
                    "body": "I'm wondering the same....",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "devpunk1",
                    "body": "Absolutely",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rossman117",
            "body": "Rimworld please give me more than %20. I’ve been waiting years.",
            "score": 41,
            "replies": [
                {
                    "author": "Gizmo135",
                    "body": "[https://www.fanatical.com/en/game/rimworld](https://www.fanatical.com/en/game/rimworld)",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "sawyer_lost",
                    "body": "Check gg.deals to see a list of discounts and historical sale data.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Please note that gg.deals contains links to grey market key sellers, who may appear to provide you with a working key, but do not always source their keys from the developer/publisher, and are of 'unknown' origin. This means the keys may not work, or the platform (such as Steam, Origin) may refuse support. Others have poor business practices, such as obligatory fees that only show at checkout.\n\nWe'd recommend against using anything on the site listed under 'Keyshops', but rather look at the section above that for the 'Official Stores'. You can also select 'Keyshops' at the top of your screen, and then select 'Disable' to remove them completely.\n\n[IsThereAnyDeal is an alternative which only uses sellers known to officially source their keys.](https://isthereanydeal.com/) \n\nYour comment has not been removed, this is just a notice.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SteamDeck) if you have any questions or concerns.*",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dickin_son",
                    "body": "At this point just buy it. You're going to put hundreds of hours into it",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "GamePil",
                    "body": "Think they got the same mentality as the Factorio devs. You'll likely never see a deep discount",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Icedvelvet",
                    "body": "Wish I could gift you my copy. I hated it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Crypt_Sermon_80",
                    "body": "stop being so cheap.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "niwia",
                    "body": "Steamdb check. It goes cheap most weeks",
                    "score": -11,
                    "replies": [
                        {
                            "author": "airsign",
                            "body": "are you thinking of Civ VI or something? rimworld is never more than 20% off",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "niwia",
                                    "body": "Mb! I was thinking oxygen not included! Gets mixed up all the time",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZealousidealPart948",
            "body": "I was hoping/expecting for ff7 remake to be on sale, and a bit bummed out it wasn't...\n\n\nPicked up batman arkham series instead + doom 2016... in addition to my already existing backlog should hold over until the next sale (or 2 or 3)...",
            "score": 13,
            "replies": [
                {
                    "author": "sephiroth70001",
                    "body": "I think they are holding off on sales for it to try and push the twin pack.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "savingewoks",
                    "body": "I was hoping for the same. \n\nI’m not interested in buying the double pack to find out I hate the first game. \n\nSo I’ll wait.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ZealousidealPart948",
                            "body": "Same boat as me haha... the plan was to get it for spring sale, and rebirth for winter sale. Oh well, lots of other games to play, and also wanted to play witcher 3, mass effect, and cyberpunk again this year.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Drama913",
                    "body": "Not that it is that much but you can get it for 15% at green man right now",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ZealousidealPart948",
                            "body": "Appreciate the heads up!  Was hoping for 50%, or under $30! Haha.  I can definitely wait for the summer sale and fingers crossed we'll see.   ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "eugenethegrappler",
            "body": "kingdom hearts collection, throne breaker, armored core 6",
            "score": 11,
            "replies": []
        },
        {
            "author": "capycaster",
            "body": "Got Skyrim, Enter the Gungeon, Vampire Survivors and the Bioshock collection",
            "score": 11,
            "replies": [
                {
                    "author": "GenerousJack",
                    "body": "Enter the Gungeon is such a badass game",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Pokabrows",
                    "body": "Vampire survivors is fun, I'm eyeing the dlc for it rn",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "ISD1982",
            "body": "Went into the sale thinking I'd not buy anything,.came out with 6.\n\nSpiritfarer®: Farewell Edition, \nKao the Kangaroo: Round 2, \nTeslagrad Remastered, \nCastle on the Coast, \nStar Trek: Resurgence, \nThank Goodness You're Here!\n\nA couple of indie 3D platforms in amongst the bafta nominee!",
            "score": 10,
            "replies": [
                {
                    "author": "ShinyJangles",
                    "body": ">Went into the sale thinking I'd not buy anything\n\nI'm about to do the same thing. Wish me luck",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "boiledpeen",
                    "body": "glad to see people picking up spiritfarer, it's such an wholesome, emotional game. It's even better if you manage to get couch co-op going with a SO, but it's still amazing alone too",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ISD1982",
                            "body": "I picked it up based on a recommendation from here too! Haven't played it yet though.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "boiledpeen",
                                    "body": "I didn't finish it, but it's a really cozy management type game with a heavy emphasis on characters and story. Really enjoyed the 30 hours I put into it, but I played it all with my ex so not sure I'll be finishing it lol but I hope you have a blast!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "savingewoks",
                    "body": "I can’t decide if I want Star Trek at the price, or if I want to wait longer.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ISD1982",
                            "body": "I've had it in my wishlist for a while, but just bit the bullet. I'm sure it will be cheaper soon, as per usual!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Thunderbear10",
                    "body": "You’re in for a treat with Spiritfarer. Gameplay isn’t too spectacular but the stories just hit home with me in a way nothing else ever has. \nI’ve never cried so much. A beautiful game about caring and loss!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BelBivDaHoe",
            "body": "Snagged THPS 1&2 and Persona 3 Reload",
            "score": 11,
            "replies": [
                {
                    "author": "KingDaDeDo",
                    "body": "I’ve been playing both of these games the past month and both are awesome! You’ll have a great time with them.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Jazzaaaaaaaa",
                    "body": "Great picks",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sbfse",
            "body": "didn't get too much yet but picked up Oblivion GOTY Deluxe, FlyKnight, Revenge of the Colon, and Enter the Gungeon. excited for Skyblivion so i needed to get a copy of Oblivion for it.",
            "score": 20,
            "replies": [
                {
                    "author": "Chaialenor",
                    "body": "Assuming that it works on the deck, Skyblivion is going to be an absolute staple for Steamdeck",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Binary1138",
                            "body": "So from what I read on their site, skyblivion is going to be built from Skyrim’s game of the year edition so I think that’s all you’ll need.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Chaialenor",
                                    "body": "Oblivion too - it uses some voice assets I think, so you need both.\n\nTheres also the growing rumours of Bethesdas own remake of Oblivion so, lots of time in Cyrodiil coming up.\n\nThe other mod you may be thinking of is the Beyond Skyrim mods - which will slap regions together.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Binary1138",
                                            "body": "Ohh good to know! Yea the rumor is within the next couple months for the oblivion remake so I feel for Skyblivion’s team, I hope plenty of people still dive into theirs",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Chaialenor",
                                                    "body": "I don’t think the two will compete. Bethesdas game, assuming it has been made with actual passion, care and attention to detail will be great for console gamers and for PC players/steamdeck players who don’t want to mess around with modding.\n\nWhereas Skyblivion will have that huge Skyrim modding community behind it, and a lot of good will.\n\nIt’s a win win for everyone",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Ascles",
                                                            "body": "Wait, do the official remake rumors have any merit? At this point I can't for the life of me trust any gaming rumors. Every gaming news site is filled with AI written garbage headlines for clicks.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Chaialenor",
                                                                    "body": "Your guess is as good as mine.\n\nThere’s a lot of smoke, whether there’s fire or not remains to be seen",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "captainmarshmello",
                                    "body": "You must have ALL oblivion dlc to play skyblivion later this year.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "burritoman88",
                            "body": "Is that a fan mod slapping both regions together?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Chaialenor",
                                    "body": "No, it’s a fan reimagining of Oblivion in Skyrims engine. You need to own both games to be able to play it for the legal reasons, but it’s due out this year so, well worth getting hyped for. It looks amazing",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CarefulLavishness922",
                    "body": "Fly knight is great!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jollyjam1",
                    "body": "I just want to play Oblivion with some native controller settings without having to mess around with that mod that's supposed to bypass the problem. I've been struggling a lot with using Vortex and downloading mods off Nexus, while following the reliable guides, and I've given up several times. Enough of my complaining, I just want to Oblivion haha",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Parallax-Jack",
                    "body": "Hell yeah dude. Oblivion is so good",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AvatarIII",
            "body": "Walking dead complete edition is a steal for $5",
            "score": 10,
            "replies": [
                {
                    "author": "oligtrading",
                    "body": "Second this! Sent the rec to my friends as soon as I saw it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Didact67",
                    "body": "Infuriating that is doesn’t support cloud saves though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DROOPY1824",
            "body": "Just Inscryption for me this round.",
            "score": 8,
            "replies": []
        },
        {
            "author": "DudeManBroGuyski",
            "body": "State of Decay 2",
            "score": 8,
            "replies": []
        },
        {
            "author": "jenshen01",
            "body": "I am getting broke",
            "score": 8,
            "replies": []
        },
        {
            "author": "SpartanBelgian",
            "body": "Saw that Halo Master Chief collection is 9.99… does it play well on the Deck? Or should I wait for the rumoured but so far unannounced PS5 port? ☺️",
            "score": 7,
            "replies": [
                {
                    "author": "Jazzlike_Pride_9287",
                    "body": "Playing it right now and it’s Amazing! No issues.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "SpartanBelgian",
                            "body": "Awesome!\nBought it together with Portal (cause I got Portal 2 recently for a steal as well, gonna play this one first then), Alice Return to Madness and Immortals Fenyx Rising (had that on console already but for 4 bucks having it portable, sure 😇)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TRDoctor",
                    "body": "Easier to buy a DualSense with the game for the full experience haha! MCC runs smooth as hell, even docked.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dr_Kappa",
            "body": "Always the same games on sale at the same price they were during the last sale. I miss flash sales. The deep discounts section should be more than like 5 games",
            "score": 50,
            "replies": [
                {
                    "author": "Upbeat_Implement_663",
                    "body": "havent flash sales been gone for more than 5 years by now?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "K-Dave",
                    "body": "Yes, it feels like the library shrunk, while at the same time the crap from the very bottom seems to double each day.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Icedvelvet",
            "body": "I need some new automation or city builders. I’m almost done with Factorio.",
            "score": 6,
            "replies": [
                {
                    "author": "ShinyJangles",
                    "body": "Dyson Sphere Program & Timberborn are both great & along those lines.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "lynx17",
                    "body": "How difficult is Factorio in your opinion?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Icedvelvet",
                            "body": "Not to difficult. I did play the demo a few different times before it finally “clicked” and haven’t been able to stop playing. Once you get past the beginning part of doing shit by hand it’s great. If you mean controls it may take you a lilttle getting used to depending your experience.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "the_beyond77",
                    "body": "As someone with 400 hours in Factorio, Against the Storm—in a nutshell, you have to set up  many production lines in your little town, but with varying and (very) finite inputs. Plus, it’s 50% off right now!  It scratches the same part of my brain while being different enough to not burn myself out on production and base building stuff.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Icedvelvet",
                            "body": "Thanks! I’ve been eyeing that one also",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZAX2717",
                    "body": "Have you played Satisfactory? That one is awesome.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Icedvelvet",
                            "body": "Yep That’s the one that led me to factorio.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Papule",
                    "body": "Oddsparks is brilliant and launching out of EA soonish I think, but already a lot there",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Icedvelvet",
                            "body": "Hm I’ll check on that one.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The0tterguy",
                    "body": "yeah check out \"Microtopia\" - pretty fun so far, basically it's an ant colony you grow and automate",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "badluser",
                    "body": "How do I scale in factorio? Satisfactory was so easy",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "2F2uPXGqp7Maywu",
                    "body": "https://store.steampowered.com/app/799600/Cosmoteer_Starship_Architect__Commander/\nI bought it today and it’s  pretty fun",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RobotSpaceBear",
                    "body": "This could be a hit or miss, but if your brain is wired to enjoy Factorio, maybe Workers and Resources Soviet Republic could be up your alley. After years of Factorio and Rimworld, this is my new obsession. Incredibly indepth and intimidating, but i've never, in 30+ years of gaming, experienced such a satisfying city builder.\n\nWorth the steep learning curve.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Icedvelvet",
                            "body": "Mannnnn I’ve tried and tried and tried. That one I just can’t get into. It’s just something not clicking with me.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RobotSpaceBear",
                                    "body": "I get it, it took me three attempts for it to click and enjoy it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LowkeyNatek_11",
            "body": "My cart has 36 items in it lol my limit for myself this sale was $200...im currently at $455 lol time to make sacrifices",
            "score": 6,
            "replies": [
                {
                    "author": "chasehundreds",
                    "body": "I need a screenshot of everything you consider because Jesus Christ that’s a lot of money to save* during a sale 😂",
                    "score": 7,
                    "replies": [
                        {
                            "author": "LowkeyNatek_11",
                            "body": "Lol XD I neglected to say I'm deploying for basically the rest of the year so I'm loading up on games so I have plenty of entertainment between my steam deck and laptop",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Information_5036",
            "body": "Picked up Pyre and Tinykin. Considering Pine Hearts but that one’s not on sale.",
            "score": 5,
            "replies": [
                {
                    "author": "porgy_tirebiter",
                    "body": "Tinykin is the bee’s knees",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "DeadSpaceLover",
                    "body": "Pyre is legitimately awesome and the soundtrack is amazing. Best sports RPG ever made.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "No_Information_5036",
                            "body": "I’m not surprised. The Bastion soundtrack was fantastic and is still on rotation for me after all these years",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SnapplesOfIdun",
                    "body": "Pyre is still my favorite Supergiant game to date, love it to shreds",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "southstar1",
                    "body": "Never played Pyre, but Tinykin is a great game.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fuddlesworth",
            "body": "Picked up fallout 4 for the 3rd time. Also got oxygen not included. Might get a few more. ",
            "score": 5,
            "replies": [
                {
                    "author": "Formal-Barracuda-690",
                    "body": "Why fallout 4 for the 3rd time? I’ve had that game for years on steam. Matter of a fact, my last played shows 2018 with roughly 6 hours on it. Can’t bring myself to play it more. Yet you’ve purchased it for the 3rd time. What in the.. ?  Crazy world we live in heh?",
                    "score": -12,
                    "replies": [
                        {
                            "author": "fuddlesworth",
                            "body": "Bought it on playstation for myself. Bought it on Xbox for my wife. Now buying it on steam 😂 I haven't played it since original release and never finished it. ",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ripetikasupportetika",
                                    "body": "I did the same thing 😭",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Church5434",
            "body": "Grabbed space marine 1 and civ 6 platinum. Thinking about aliens dark descent and fireteam as well as the Jedi order games",
            "score": 6,
            "replies": []
        },
        {
            "author": "thinksInCode",
            "body": "I got Witcher 2. It’s 3 bucks and runs well!",
            "score": 5,
            "replies": []
        },
        {
            "author": "AnT-aingealDhorcha40",
            "body": "Just got 13 games for €100. \n\nI have an addiction 😫",
            "score": 10,
            "replies": [
                {
                    "author": "nilejones2022",
                    "body": "Welcome to the club",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Formal-Barracuda-690",
                    "body": "You better not only play them all, but also finish them all as well.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "AnT-aingealDhorcha40",
                            "body": "Sure what kind of Steam Decker would I be if I didn't leave most of my library as backlog lol",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional-Bid-575",
            "body": "For anyone interested in Resident Evil 2 or 3, note that the Racoon City edition has both plus RE Resistance for $14.99. Even if you never play Resistance that’s still a savings on both 2 and 3 beyond their current sale prices of $9.99 each. ",
            "score": 4,
            "replies": []
        },
        {
            "author": "Macabalony",
            "body": "My rule has always been complete the games I own and then buy more. \nBut I also have 6 games in the cart. \n\nBalatro. Detroit Become Human. Ratchet and Clank. Thank Goodness You're Here! All the Dredge DLC. Prince of Persia The Lost Crown.\n\nTell me to stop.",
            "score": 4,
            "replies": [
                {
                    "author": "DatDudefromWI",
                    "body": "Stop. JK. Keep 'em coming. I'm always looking for more games to add to the backlog I'll probably never get to.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "b00tch",
                    "body": "Thank goodness you’re here is such a joy, loved it, hope you enjoy it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lagosas",
            "body": "The Long Dark (a personal fav) is 12.99 CDN\n\nEscapists 2 is 5.49 CDN\n\nProject Zomboid is 14.29 CDN\n\nBanished is 7.47 CDN",
            "score": 10,
            "replies": [
                {
                    "author": "AnT-aingealDhorcha40",
                    "body": "Picked up TLD and the Expansion for base building really looking forward to it. Does it run well on the deck? Not too hard on the battery I mean?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Lagosas",
                            "body": "It runs well. Battery life is descent.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Boring_Isopod_3007",
                                    "body": "Unless they fixed it recently, it doesn't run well. There is some bug that makes the game drop the framerate when you give any input to the controller. When you don't touch anything the game keeps a stable 60fps, but as soon as you start moving the character, camera or just pressing any button it drops to 40 or below.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SunwindPC",
            "body": "Here are my picks for 10 Amazing games under €4.99 for the Steam Deck!\n\n1. **Beyond: Two Souls** – 75% off at **€4.99**\n2. **A Way Out** – 85% off at **€4.49**\n3. **Batman: Arkham Knight** – 80% off at **€3.99**\n4. **Dirt Rally 2.0** – 80% off at **€3.99**\n5. **Vampire Survivors** – 25% off at **€3.74**\n6. **Middle Earth: Shadow of War** – 80% off at **€3.99**\n7. **Rise of the Tomb Raider** – 85% off at **€4.49**\n8. **Star Wars Jedi: Fallen Order** – 90% off at **€3.99**\n9. **Bioshock Remastered** – 75% off at **€4.99**\n10. **Mortal Kombat 11** – 90% off at **€4.99**\n\nI've also made a [video](https://www.youtube.com/watch?v=uOxLVNFtTOg) talking over how they perform on the Deck and what battery life you can expect. All of these games are controller friendly!",
            "score": 8,
            "replies": []
        },
        {
            "author": "escordes_1",
            "body": "Gta IV, Dead Cells, Hotline Miami, Stick Fight and Totally Accurate Battle Simulator on the basket. But I did not check compatibility yet. \n\nAny suggestion besides that would be very helpful. Especially I love 2D Platform games",
            "score": 3,
            "replies": [
                {
                    "author": "KingesKonges",
                    "body": "Shovel knight?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "escordes_1",
                            "body": "Seems good I will give a chance",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bobbyphillipps",
                    "body": "Celeste, the two Ori games, Shovel Knight, Hades (top down isometric, but it scratches that itch for me), Axiom Verge 1&2 (pretty pure Metroidvanias), Mark of the Ninja (stealth platformer, criminally underrated), 10 Second Ninja, Katana Zero.\n\nDisclaimer: I haven't checked to see which of those are on sale. On my phone, and off the top of my head from my own collection",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WeirdFlexRich",
                    "body": "Risk of Rain (2013)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "moar-warpstone",
            "body": "Ace combat 7 and Detroit become human for me",
            "score": 3,
            "replies": []
        },
        {
            "author": "GruesomeJeans",
            "body": "I currently have a handful of assassins creed games in my basket(I'd like to relive my youth) and of course 3 copies of coconut simulator. I don't think those are on sale but priced at $.69 each, I can't pass up the opportunity to include some friends in some sweet coconut debauchery",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vox_R",
            "body": "Debating which level of degeneracy, this sale. I've got 5 bucks of Steam Credit, and debating between Atlyss or Pseudoregalia",
            "score": 3,
            "replies": []
        },
        {
            "author": "Russtuffer",
            "body": "I got enter the gungeon and spiritfarer",
            "score": 3,
            "replies": [
                {
                    "author": "waitforpasi",
                    "body": "great choice",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ALL666ES",
            "body": "Debating on getting Death Stranding ($20) or Elden Ring for the deck ($36). Leaning towards DS just because it's cheaper and maybe easier.",
            "score": 3,
            "replies": [
                {
                    "author": "Nosferatu-Rodin",
                    "body": "Both are great. Both have amazing worlds. But DS is soooo fucking heavy on the exposition dump",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Raidertck",
            "body": "How does armour core 6 run on steam deck?",
            "score": 3,
            "replies": [
                {
                    "author": "ptdave",
                    "body": "Runs great",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stock_up07",
            "body": "Sleeping Dogs, definitive edition ($3).",
            "score": 3,
            "replies": []
        },
        {
            "author": "yeaaahwehere",
            "body": "I picked up bugsnax I hope it’s worth it!",
            "score": 7,
            "replies": [
                {
                    "author": "DeadSpaceLover",
                    "body": "It is good, just make sure you get to the end. It's really something else.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "theragu40",
                    "body": "I unironically loved bugsnax. Embrace the weirdness, keep expectations for complexity of gameplay in check, and stick it out to the end. It's definitely worth it.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Sejanoz",
                    "body": "Played it on PS5 and I loved it. Enjoy!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "oligtrading",
                    "body": "Very good game!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SunwindPC",
            "body": "Hey everyone! These are my picks for some of the best games under 3€ for the Steam Deck!\n\n* **Don't Starve** – 2.04€ (75% off) Runs at 90 FPS locked, and if you cap it at 60 FPS, you’ll get around 9.5 hours of battery life. A brutal survival game with a fantastic art style.\n* **Spiritfarer: Farewell Edition** – 2.89€ (90% off) Runs at 90 FPS, and capping at 40 FPS gives you 5 hours of battery life. A beautifully emotional management game where you help spirits move on.\n* **Tomb Raider (2013)** – 2.24€ (85% off) Runs at 50-60 FPS on Medium settings, with 3 hours of battery life. The reboot that revitalized Lara Croft, featuring great combat and exploration.\n* **Bastion** – 2.95€ (80% off) Runs at 90 FPS locked, with 8 hours of battery life if capped at 60 FPS. A fantastic action RPG with an incredible soundtrack and dynamic narration.\n* **Mad Max** – 2.99€ (85% off) Runs at 45-60 FPS on Medium settings, with 3 hours of battery life. A massively underrated open-world action game with intense vehicular combat.\n* **Sleeping Dogs: Definitive Edition** – 2.99€ (85% off) Runs at 50-60 FPS with 3.5 hours of battery life. An open-world action game set in Hong Kong, offering martial arts combat and a gripping crime story.\n* **Titanfall 2** – 2.99€ (90% off) Runs at 60 FPS locked on Medium settings, with 3 hours of battery life. One of the best single-player FPS campaigns ever with incredible movement mechanics.\n* **Mirror's Edge** – 2.99€ (85% off) Runs at 60 FPS locked, with 3.5 hours of battery life. A classic first-person parkour game with a unique visual style.\n* **Race the Sun** – 2.92€ (70% off) Runs at 90 FPS locked, and if capped at 60 FPS, you get 8 hours of battery life. A fast-paced, addictive arcade game where you control a solar-powered ship.\n* **Just Cause 3** – 2.99€ (85% off) Runs at 40-50 FPS, with 2 hours and 45 minutes of battery life. A chaotic, explosion-filled open-world game full of ridiculous stunts.\n\nI also made a [video](https://www.youtube.com/watch?v=rH-kAuCSsHQ) about it if you want to watch instead of read!",
            "score": 4,
            "replies": []
        },
        {
            "author": "roju",
            "body": "Consider preferring Canadian made games. Mobile Syrup made a list: https://mobilesyrup.com/2025/03/13/canadian-games-to-support-the-us-trade-war/\n\nNote the list isn’t deck/ sale specific",
            "score": 12,
            "replies": [
                {
                    "author": "broderm_8",
                    "body": "Thank you for the link! ",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Cubbos_",
                    "body": "No\n\n![gif](giphy|STfLOU6iRBRunMciZv)",
                    "score": -20,
                    "replies": []
                }
            ]
        },
        {
            "author": "Daedra696",
            "body": "Hades 2, Littlewood, house clipper dlc with HGTV one, and not tonight 2! Gonna keep me busy for awhile",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ordinary-Cake8510",
            "body": "I played the heck out of Enter the Gungeon on Switch and have been wanting it on Steam. So got that, Doom 2016 and Hotline Miami. Never played or watched anything about Doom or Hotline Miami but, always hear amazing things about them. Cheers!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fishyblue11",
            "body": "I'm thinking of getting Batman Arkham Knight Premium and the Shadow of Mordor/Shadow of War Bundle which together would cost me something like... $6, are these good picks for a steam deck?",
            "score": 2,
            "replies": [
                {
                    "author": "Embarrassed-Pen-4365",
                    "body": "Yes. Dear god yes. Arkham knight and Arkham city runs like a dream. I can't get Arkham Asylum to run though. \n\nShadow of war was great. Finished it. Runs perfectly.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AbareSaruMk2",
                            "body": "Be wary of shadow of modor (or which ever the first one is. The servers go shut down so half the game is broken as it won’t load the nemesis system. Unless that has been addressed since the last time I played it)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EdsonSnow",
            "body": "Red Dead Redemption 1 was 40% off for just an hour, I saw it at the gym and told myself I was gonna buy it when I got home, got home and it was back to 20% off. Dammit!",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "I’m honestly shocked at my discipline and restraint. I’ve only purchased one game. \n\nWarhammer 40k: Rogue Trader",
            "score": 2,
            "replies": []
        },
        {
            "author": "MystJake",
            "body": "If I don't score a refurb before the summer sale, I'm hoping they get discounted then (they did last year). ",
            "score": 2,
            "replies": []
        },
        {
            "author": "NorthAd4368",
            "body": "God of war ragnorak time",
            "score": 2,
            "replies": []
        },
        {
            "author": "barklul",
            "body": "A little WARNING to ppl who have bought/considering buying god of war ragnarök. There seems to be a sound issue with the audio crackling from time to time. \nI have so far not been able to solve this with google or anything (seems to be a fairly ’common issue’) so be wary.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Theoderic8586",
            "body": "Dont forget to cross reference with Fanatical as some games are cheaper on there still",
            "score": 2,
            "replies": []
        },
        {
            "author": "RealPrinceJay",
            "body": "Want to spend $50(soft cap), and have picked up:\n\nNi no Kuni\n\nMass Effect Trilogy\n\nChrono Trigger\n\nPortal Bundle\n\nDoom\n\nHeavy Rain\n\nHades\n\nStill have $15 to spend and not sure what to choose. I've been thinking about NieR Automata, but wondering if that'll just be better on PS5. Also thought about Crusader Kings 3, but have heard major performance complaints on the Deck",
            "score": 2,
            "replies": [
                {
                    "author": "revzey",
                    "body": "I'm playing through NieR Automata and that game is a masterpiece in both gameplay and storytelling. I can highly recommend it :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RealPrinceJay",
                            "body": "Playing on the Deck?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "revzey",
                                    "body": "I switch between PC and the Deck. \n\nFun fact. Nier Automata helped make gaming on Linux to what is it capable of today. The creator of DXVK (makes windows games playable on Linux and the Deck) was a big fan of Nier and wanted it to work on linux so he developed DXVK :)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ttranpower",
            "body": "I got a Steam deck last week and it's gotten me back into gaming after several years.     \n\nI went a little crazy on the Steam sale and picked up: Cyberpunk 2077, Warhammer 40K Rogue Trader, Sea of Thieves, Chrono Trigger, Valheim, Dead Cells, Deep Rock Galactic, Disco Elysium, Doom, Dredge, Skyrim, Fields of Mistria, Stardew Valley, Unpacking, Hades, Half Life 1 & 2, Heavy Rain, Kingdom Come Deliverance, Pathfinder Wrath of the Righteous, Warhammer 40K Rogue Trader, Red Dead Redemption II, Sable, and Slay the Spire.    \n\nI've been playing Sea of Thieves and Aliens Fireteam Elite with my childhood friend and it's been so fun, because we haven't gamed together in over five years :)",
            "score": 2,
            "replies": [
                {
                    "author": "sart49",
                    "body": "40K Rogue Trader so good you had to buy it twice lol.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ttranpower",
                            "body": "LOL yeah exactly 😆",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TLW90",
            "body": "My family loves playing Zombieville 3D and Sea of Thieves. Any other coop cartoonish graphics game recommendations? Thanks!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SicaJR",
            "body": "I’ve bought 6 games this sale\n\n1) Enter the gungeon \n2) Deep rock galactica survivor\n3) Mass effect legendary edition\n4) Kingdom come deliverance\n5) RDR2\n6) Spiritfarer",
            "score": 2,
            "replies": [
                {
                    "author": "grlz",
                    "body": "I've been loving deep rock galactic survivor! It's gets a little laggy here and there, but it plays very well on the deck.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Select-Pitch1258",
            "body": "Graveyard Keeper is 80% off. Nice calming game. Similar to Stardew Valley, but instead of a farm, it's a graveyard!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Radio_Caligari",
            "body": "Got Judge Dredd: Dredd Vs. Death, Mass Effect LE, Prince of Persia, Alien Vs. Predator Classic 2000, and Hylics",
            "score": 2,
            "replies": []
        },
        {
            "author": "hardlinedreams",
            "body": "Super Drunken Guy only for less than 1.50 € - yay!   \nAlso got undertale 90% off.\n\nBtw. any good recomandations something really celeste like ?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Juxeso",
            "body": "Looking for mindless farming / grinding where I make some sort of permanent progress. But combat has to be fun, so no osrs :) something like wow with consoleport or d4",
            "score": 2,
            "replies": []
        },
        {
            "author": "mrdovi",
            "body": "# ℹ️ REMINDER\n\nSet the tags to exclude in the Store preferences helps to sort things out 😉\n\nhttps://preview.redd.it/1bx1et5ghmoe1.jpeg?width=1200&format=pjpg&auto=webp&s=0f9a75f69885b6d9bdd08c8a431bb34a1da73e2f",
            "score": 5,
            "replies": []
        },
        {
            "author": "xXlTADlXx",
            "body": "So far:\\\nJotunnslayer\\\nYet another zombie survivors\\\nRogue Genesis\\\nfor SD\n\nand Arma Reforger for PC. I already owned vampire survivors, death must die, artififact seeker and deep rock gs. Any other recommendations?",
            "score": 4,
            "replies": [
                {
                    "author": "oldkingcoles",
                    "body": "Halls of Torment , and  Soulstone Survivors are both great billet heavens or whatever we are calling them",
                    "score": 4,
                    "replies": [
                        {
                            "author": "xXlTADlXx",
                            "body": "damn hot looks like diablo definitely gonna check that thx.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Flyinx",
                                    "body": "Soulstone Survivors is the best in the genre imo. I’ve played the popular entries and some more obscure, but Soulstone is definitely my favorite. Devs are cool.\n\nHalls of Torment is also great.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "xXlTADlXx",
                                            "body": "Yeah ive tried the demo but i didnt like anything of it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "2F2uPXGqp7Maywu",
                    "body": "O nice YAZS has demo. I’m gonna try it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Away_Good8346",
            "body": "I would buy elden ring but my fears about the white screen of death are too big 🫠",
            "score": 3,
            "replies": [
                {
                    "author": "DarthEloper",
                    "body": "Elden ring works absolutely flawlessly on the deck",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Washington_Dad__",
                            "body": "Flawlessly is a bit misleading. It runs, but not perfectly.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "DarthEloper",
                                    "body": "Oh really? In my experience it has been great. All I do is fix the frame rate to 45 fps. I’ve had a very smooth experience, similar to my (albeit mid level) laptop.\n\nI’ve had stuttering in some other RPGs (Baldur’s Gate, Pathfinder WOTR, Kingdom Come) in busy areas, but never much in Elden Ring.\n\nI’m a little surprised to hear people having problems with it, for me it’s one of the consistently smooth performing games on my deck.\n\nThen again it’s just my experience that has been smooth and I don’t know anyone IRL with a steam deck.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "TheBoyJax",
                                    "body": "I'm also in the \"it works flawlessly\" camp. Replayed the entire game before the DLC dropped then the DLC all on the deck in a mixture of docked and handheld. Looked and ran perfectly. No issues at all.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Away_Good8346",
                            "body": "on mine a white screen appears and it crashes to the menu xd",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheCrazySteve31",
            "body": "I can’t stop buying games during sales and I won’t stop buying games during the sales.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mission-Twist354",
            "body": "Are there only 12 Games in sale? Or are they changing form day to day?",
            "score": 4,
            "replies": [
                {
                    "author": "tyranozord",
                    "body": "Sorry that you’re getting downvoted - it’s not always intuitive for everyone. You’ll find that a massive selection of known-titles are on some sort of discount. Personally, I had 63 items on sale on my wishlist. The discounts don’t rotate - they all stay for the full duration of the event.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "YearContent83",
                    "body": "Use steamDb, it's much better and intuitive to filter the sales",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dtorrance88",
            "body": "Maybe powerwash simulator and shadow of war",
            "score": 2,
            "replies": []
        },
        {
            "author": "WeazelZeazel",
            "body": "https://preview.redd.it/kryalcpijloe1.jpeg?width=1290&format=pjpg&auto=webp&s=136127a4a7799d35cf2fe1b405f697cb2f1266e6\n\nMy haul",
            "score": 2,
            "replies": []
        },
        {
            "author": "CrieMeAReaver",
            "body": "I got myself Cuberpunk 2077 and the Phantom Liberty DLC. The thing is, I'm still waiting on getting my steam deck 😅",
            "score": 2,
            "replies": []
        },
        {
            "author": "Xngears",
            "body": "Is there a particular updated resource, like a site or YouTube channel, that shows how the game performs and scales on the Deck?\n\nI had some interest in Pathfinder: Wrath of the Righteous, but I’m unsure how all those menus and text scale on the Deck screen.",
            "score": 2,
            "replies": [
                {
                    "author": "Breevieh",
                    "body": "ProtonDB\n\nhttps://www.protondb.com/app/1184370",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "DarthEloper",
                    "body": "I’ve been playing pathfinder mostly on the deck for the past month, it runs superbly! Is an amazing game",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "porgy_tirebiter",
            "body": "Honestly kind of disappointed",
            "score": 2,
            "replies": [
                {
                    "author": "fuddlesworth",
                    "body": "90% of my wish list is on sale and many of them match all time lows. What are you disappointed with? ",
                    "score": 19,
                    "replies": [
                        {
                            "author": "porgy_tirebiter",
                            "body": "Maybe it’s just me. The ones I really wanted are not discounted very much.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "perfectfate",
                                    "body": "wait for summa",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "spider_lily",
            "body": "Ironically enough, I bought four games (Dredge, Slay the Spire, Moonlighter, You and Me, and Her) on sale before the Spring sale began, lol\n\nI guess I'm just going to pick up Fuga: Melodies of Steel 2 now, since I'm finishing up the first one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medical_Bison_4682",
            "body": "Silent Hill 2 or god of war Ragnarok?",
            "score": 1,
            "replies": [
                {
                    "author": "Sowlid",
                    "body": "GoW",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Curious-Pilot-7650",
            "body": "Just bought **Narita Boy** for 5€ because I loved the demo of their new game Haneda Girl. Love the vibes of both games, art, music and the silly story.\n\nIf I finish it I will buy RE4. \n\nI would play something from the backlog until the next sale.",
            "score": 1,
            "replies": []
        },
        {
            "author": "airsign",
            "body": "I haven't seen anyone mention it yet but Steamworld Build is at it's lowest price right now at $7.49. Haven't played it but there's a few reviews on protondb that say it runs great on deck",
            "score": 1,
            "replies": []
        },
        {
            "author": "EverydayFunHotS",
            "body": "Brigador. \nTop down 2d isometric mech game. Tactical gameplay, fully destructible environments.\n\n\n68% off.\n\n\nPlays great on the deck. Just had to greatly increase thumbstick sensitivity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jazzlike_Pride_9287",
            "body": "Just purchased Yakuza 0 for the deck. Time to get sucked in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bmario17",
            "body": "Big pick up for me! Shovel Knight, Thronefall, Pizza Tower, Dorfromantik, Risk of Rain 2, and Nine Sols!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hopeful-Antelope-684",
            "body": "I really bought so many games from the sale today but I realized I played tf out of most of them already or just don’t want to do another lengthy playthrough :/ saving cash for once I guess!",
            "score": 1,
            "replies": []
        },
        {
            "author": "CtrlAltEvil",
            "body": "I just want Dark Souls 3 Deluxe Edition at a reasonable price for its age. Is that too much to ask?",
            "score": 1,
            "replies": []
        },
        {
            "author": "samponvojta",
            "body": "how is syberia: the world before on deck? and can i play it without having played previous games?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BaskB",
            "body": "Grabbed W40K: Boltgun, Dave the Diver and Bang Average Football (Sensible World of Soccer meets StarDew Valley vibe, chill as hell).\n\nLooking at Hades II..... But only 10% discount...still means it's over £20 and I need to think more on it (ask permission from the boss lady .....)",
            "score": 1,
            "replies": [
                {
                    "author": "illegalmaneuver_",
                    "body": "Thanks for that Bang Average Football reco!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crinlorite",
            "body": "Got like 700 games on backlog, no need to buy anything although I’m really tempted to buy some more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuintupleTheFun",
            "body": "RDR2, Skyrim, Kingdoms of Amalur, BG3, Diceomancer, Pillars of Eternity, Cyberpunk 2077. I'm gonna be busy for a while!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rumpeltasche666",
            "body": "https://preview.redd.it/t8ow1iweunoe1.jpeg?width=1179&format=pjpg&auto=webp&s=a63797bf02893e0c2586b1e56138ed17fc1f2b89\n\nso far… i fear i am going to buy more - don‘t judge me :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "unpopularperiwinkle",
                    "body": "Not on sale",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BlueberryAutomatic11",
            "body": "Added the elder scrolls series to my collection finally. \n\nFallout series\n\nHalo MCC, Wars, and the mobile games that are on steam. \n\nAll in all I think I bought about 20 games or so last night to add to my back log so I don’t run out of anything soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "phambidge",
            "body": "Has anyone here played master chief collection on the deck? How well does it perform?",
            "score": 1,
            "replies": [
                {
                    "author": "Camgarooooo",
                    "body": "Perfectly. There was a bug a while back though where it wouldn’t recognise the controller but I believe that got fixed",
                    "score": 2,
                    "replies": [
                        {
                            "author": "phambidge",
                            "body": "Thank you! 🫡",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Evilcon21",
            "body": "So far the only game in my cart is duke nukem 20th anniversary. Though I wished they did a 30th anniversary",
            "score": 1,
            "replies": []
        },
        {
            "author": "hotstickywaffle",
            "body": "Any good smaller, indie RPGs like Crosscode? I don't like playing big AAA games on the Deck, but I want something that gives the depth of that style of action RPG with quests.",
            "score": 1,
            "replies": [
                {
                    "author": "Parafex",
                    "body": "Check out Drova and Chained Echoes :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Juliomorales6969",
            "body": "question... never played skyrim.. worth grtting on this sale? how does it play on steam deck? are there other rpg games i can get in this sale for steam deck?",
            "score": 1,
            "replies": [
                {
                    "author": "GUCCIBUKKAKE",
                    "body": "Skyrim is totally worth it. Red Dead Redemption, Cyberpunk 2077, and Fallout 4 are other good rpg games for you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "brensterrr",
            "body": "About to pick up hogwarts and cyberpunk. But after i have played RE4, i wanted to play a game thats easy on my deck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Speedmaster3861",
            "body": "Just got my steamdeck oled yesterday and oh my how my library changed overnight. I play primarily on PC but the deck just brought a new kind of gaming experience.\n\nI recently got Dave the Diver, Day of the Tentacle Remastered, Disco Elysium, TMNT Shredder's Revenge, Cursed to Golf, Enter the Gungeon, Chrono Trigger, Ori and the Will of the Wisps, Supermeat Boy. All run fantastic on the Deck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "funk5555",
            "body": "Do anyone recommend a good race game for steam deck?",
            "score": 1,
            "replies": [
                {
                    "author": "Major-Programmer-894",
                    "body": "The Forza games run surprisingly well on my oled.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "reddit_sells_you",
                    "body": "Wreckfest is my favorite racing game.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "belson22",
            "body": "I just recently decided to buy a Steam Deck, and I was hoping the spring sale would make them cheaper. Do they ever go on sale?",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedSpook",
            "body": "Worki by through resident evil revelations 1 and 2 and then it’s on to the last of us and then uncharted AND THEN mass affect trilogy",
            "score": 1,
            "replies": [
                {
                    "author": "b00tch",
                    "body": "Does mass effect trilogy need the ea app installing? Seem to remember it was a pain but I might be wrong",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RedSpook",
                            "body": "Idk I haven’t tried it yet hopefully not",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jazzaaaaaaaa",
            "body": "How does Cyberpunk run on Steamdeck? Played it on Xbox before but wanna make a sniper run on steamdeck :(",
            "score": 1,
            "replies": [
                {
                    "author": "whiteravenxi",
                    "body": "Honestly very stable. I remember locking it to 30 fps and the steam deck preset looks good. Enjoy.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Jazzaaaaaaaa",
                            "body": "Sounds good, thanks !",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dadeac18",
            "body": "Scores Hogwarts, Doom eternal, katana zero, left 4 dead 2, Alan wake, and sonic / shadow.",
            "score": 1,
            "replies": []
        },
        {
            "author": "J-Shew",
            "body": "If you buy the Horizon Zero Dawn Complete Edition bundle that comes with the remaster upgrade, can you choose not to upgrade it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "UlquiorraVsIchigo",
            "body": "How does hogwarts legacy run on the deck?",
            "score": 1,
            "replies": [
                {
                    "author": "Select-Pitch1258",
                    "body": "Not too bad. I have the OLED and I get a pretty consistent 40fps on medium settings. Some drops here and there when moving to new areas.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CoolkidYTrealms",
            "body": "Was thinking of purchasing baldurs gate 3 cuz its on sale, is it a good buy for the lcd deck?",
            "score": 1,
            "replies": [
                {
                    "author": "fuddlesworth",
                    "body": "It runs decently at 30fps after tweaking the graphics. More if you use FSR.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SgtFluffyButt",
            "body": "Is anno 1800 worth getting for the deck?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Avelion2",
            "body": "Calisto protocol at 10$ hell yeah.",
            "score": 1,
            "replies": []
        },
        {
            "author": "knightengale_x",
            "body": "Picked up\n\nAlice Madness Returns\nAnomaly Agent\nSevered Steel\n\nHopefully all play nice on the Steamdeck",
            "score": 1,
            "replies": []
        },
        {
            "author": "dlo416",
            "body": "Deep Rock Galatic: Survivor is so freaking good. If you haven't got it this little gem yet, I highly recommend that you do. There's supposed to be another update according to their roadmap. It is in EA, but man is it ever polished for an EA game. I started playing it again and I haven't had this much fun with a roguelite in a while. \n\nI also get 40FPS no problems. You could boost it to 60 if you want, but I play my SD mostly unplugged which gives you roughly about 4 hours or so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZedErre",
            "body": "I can't spend a lot, I'm hesitating on Death's Door",
            "score": 1,
            "replies": [
                {
                    "author": "Mercurial_Synthesis",
                    "body": "Worth the price for the soundtrack alone. Very good game as well, though.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ZedErre",
                            "body": "Yeah I've been eyeing it ever since it released so I'll think about it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wahoo20",
                    "body": "I really really like that game",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "cheerstothefirstyear",
                    "body": "It’s fun",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Runyst",
                    "body": "Short 10-20 hour game. 7/10-8/10 depending on your taste. I enjoyed it",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Jackdunc",
                    "body": "Bro, things will get better don’t give up on life.. oh you mean a game. Never heard of it, will check it out.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ZedErre",
                            "body": "Lol now that you mention it....",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Double_Daikon2044",
            "body": "I’ve never had a steam account, decided to pull the trigger and get the deck. It’s being delivered, and I see this crazy sale. Almost all of the games on my wishlist for about 110, this is great. Any games that are must haves?",
            "score": 1,
            "replies": []
        },
        {
            "author": "K-Dave",
            "body": "I know the gems are out there but I'm running out on ideas how to filter quality from crap. No matter what criteria I use, It’s cluttered. It's almost like people gave up to care at some point, so you can't even use \"hot\", \"trending\" etc. to get quality results.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LorelaiEvonne",
            "body": "what is your alternative recommendation for diablo 4 aside from poe2?",
            "score": 1,
            "replies": [
                {
                    "author": "wackymctacky",
                    "body": "Last epoch, but it's not on sale",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Electronic_Train_417",
            "body": "Anyone play sackboy on their deck? Sold my ps4 and loved little big planet, would be playing coop with the wife",
            "score": 1,
            "replies": [
                {
                    "author": "ConceptFine7391",
                    "body": "Yep runs great. Good fun too",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "eggbunni",
            "body": "I’m so disappointed by the points shop items. 😭 I love sales because it’s always an excuse to get new cute frames and avatars etc. But this season’s is… weird AF.",
            "score": 1,
            "replies": []
        },
        {
            "author": "frig0bar",
            "body": "I’m looking forna neat roguelike/lite with bullet hell/heaven features. For reference, I recently Picayune Dreams which was very good and also had very nice visual/audio and I am looking for something similar",
            "score": 0,
            "replies": [
                {
                    "author": "AnotherMadeUpID",
                    "body": "Enter The Gungeon?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MayorOfAlmonds",
            "body": "I've never played The Last of Us, but really want to. I've been putting it off hoping the price would go down. Should I buy it for 30 USD or keep waiting?",
            "score": 0,
            "replies": [
                {
                    "author": "BrianBlandess",
                    "body": "How does it run on the deck?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MayorOfAlmonds",
                            "body": "It ran terrible at launch but after a few years of patches, it runs well from what I can tell. The 30 dollar price tag feels kinda steep though for such an old game. But I really want to play it, so not sure if I should wait a year for it to come down to 20 bucks or just get it now.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BrianBlandess",
                                    "body": "Good to know. I can’t decide if it will come down in price or go up in price once the new season of the show comes out. I’m tempted to just get it b",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MayorOfAlmonds",
                                            "body": "I was thinking that same thing - and also, the second game is coming to steam in a couple weeks. I went ahead and bought it. From what I read online, it really does run fine on steam deck, so I wouldn't worry too much about that. If you google it, you can find some guides on the best settings to make it as smooth as possible.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xmBQWugdxjaA",
            "body": "Azalea is a great short Zelda-esque action/puzzle game for only ~$1 !",
            "score": 0,
            "replies": []
        },
        {
            "author": "Readalie",
            "body": "Alright, got my cart together, now just have to check on what I already got for free from the EGS and just forgot about, lol.\n\nThat and make my decision on RDR2. If rumors are right and it'll be on Switch 2, I'll probably opt to get it there so that I can have it on cartridge. Still, that's a nice discount for it...",
            "score": -4,
            "replies": []
        },
        {
            "author": "SunwindPC",
            "body": "Made a list of my top 15 picks here: [Video](https://youtu.be/hL8LgPKvgdE?si=P-a4xFU9h9nGrVVV)",
            "score": -34,
            "replies": [
                {
                    "author": "johnnylawrwb",
                    "body": "Man just list them no one is watching that.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "SunwindPC",
                            "body": "Of course, here you go:\n\n* **No Man’s Sky** – **60% off**, €23.59\n* **Hogwarts Legacy** – **75% off**, €14.99\n* **Cyberpunk 2077** – **60% off**, €23.99\n* **Titanfall 2** – **90% off**, €2.99\n* **Animal Well** – **20% off**, €19.60\n* **Balatro** – **15% off**, €11.89\n* **Dave the Diver** – **33% off**, €13.39\n* **Stardew Valley** – **40% off**, €8.39\n* **Elden Ring** – **40% off**, €35.99\n* **Diablo 4** – **45% off**, €27.49\n* **Metaphor: ReFantazio** – **25% off**, €52.49\n* **Deep Rock Galactic: Survivor** – **25% off**, €9.74\n* **Final Fantasy 7 Rebirth** – **30% off**, €48.99\n* **Hades 2** – **10% off**, €26.09\n* **Halo: The Master Chief Collection** – **75% off**, €9.99",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "Imaginary-Hamster-74",
                                    "body": "Ihad to cop halo 😭",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sportdan30",
            "body": "How is two point museum not even on sale for five dollars off????",
            "score": -14,
            "replies": [
                {
                    "author": "Icedvelvet",
                    "body": "I mean it just came out a week or two ago.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "sportdan30",
                            "body": "I know I know… Out of the park baseball comes out tomorrow and it’s already going to be five dollars off.",
                            "score": -11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sokiyo",
                    "body": "It just came out and it's a quality game. It's still worth it full price imo. It's more in depth than the other titles and very fun",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "fuddlesworth",
                    "body": "More like why is hospital bundle never on sale",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pixelodo",
            "body": "https://store.steampowered.com/app/2957110/Fantasy_Online_2/",
            "score": -6,
            "replies": []
        }
    ]
}